[
  {
    "englishURN": "1800010",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "1",
    "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
    "babNumber": "1",
    "babName": "Chapter 01. The Noble Features Of Rasoolullah",
    "hadithNumber": "1",
    "hadithText": "Anas (Radiallahu Anhu) reports: \"Rasullullah (Sallallahu alaihe wasallam) was neither tall nor was he short (like a dwarf... He was of medium stature). In complexion, he was neither very white like lime, nor very dark, nor brown which results in darkness (he was illuminant, more luminous than even the full-moon on the 14th night).The hair of Rasullullah (Sallallahu alaihe wasallam) was neither very straight nor very curly (but slightly wavy). When he attained the age of forty, Allah the Almighty granted him nubuwwah (prophethood).He lived for ten years in Makkah (commentary) and in Madina for ten years. At that time there were not more than twenty white hair on his mubarak (blessed) head and beard.\" (This will be described in detail in the chapter on white hair of Rasulullah (Sallallahu alaihe wasallam).</b>",
    "bookID": "1.0",
    "grade1": "",
    "grade2": "",
    "comments": "Sayyidina Rasullullah (Sallallahu alaihe wasallam) was of a medium stature, but slightly taller. This has been reported in a narration from Sayyidina Hind bin Abi Haalah (Radiallahu Anhu) and others. An objection may arise concerning these two hadeeth, that it is stated in one hadeeth that when Sayyidina Rasullullah (Sallallahu alaihe wasallam) used to stand up in a group, he appeared to be the tallest among them. This was not due to his height, but was a result of a Mu'jizah (Miracle). In the manner that no one had reached a higher status than Sayyidina Rasullullah (Sallallahu alaihe wasallam) in `Kamalaate Ma'nawiyyah', (super intellectual status) likewise in the `Surah Zaahiri' (outward appearance) no one could excel him.It is stated in the hadeeth under discussion that Sayyidina Rasullullah (Sallallahu alaihe wasallam) lived for ten years in Makkah Mukarramah after nubuwwah (prophethood). For this reason it is stated that he attained the age of sixty years. This is contrary to what has been reported in the other ahaadith, where it is stated that Sayyidina Rasullullah (Sallallahu alaihe wasallam) lived there for thirteen years and attained the age of sixty three years. In some ahaadith it is stated that Sayyidina Rasullullah (Sallallahu alaihe wasallam) attained the age of sixty five years. At the end of this kitaab all three ahaadith will be quoted. Imaam Bukhari (R.A.) says:\"Most narrations show that Rasullullah (Sallallahu alaihe wasallam) lived for sixty three years.\" The ulama (scholars) have summed up these ahaadith in two ways. First, that Sayyidina Rasullullah (Sallallahu alaihe wasallam) received nubuwwah (prophethood) at the age of forty and risaalah three years thereafter, and after that he lived for ten years in Makkah Mukaraamah. According to this, the three years between nubuwwah and risaalah have been in the hadeeth under discussion.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900010",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800020",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "1",
    "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
    "babNumber": "1",
    "babName": "Chapter 01. The Noble Features Of Rasoolullah",
    "hadithNumber": "2",
    "hadithText": "Anas bin Malik (Radiallhu Anhu) reports, \"Rasullullah (Sallallahu alaihe wasallam) was of a medium stature, he was neither very tall nor very short. He was very handsome, of medium built and his hair was neither very curly nor very straight (but was slightly wavy). He had a wheat-coloured complexion. When he walked, he leaned forward slightly\".</b>",
    "bookID": "1.0",
    "grade1": "",
    "grade2": "",
    "comments": "In this hadeeth Sayyidina Anas (Radiallhu Anhu) states that the complexion of Rasullullah (Sallallahu alaihe wasallam) was wheat coloured. In the previous hadith, also narrated by Sayyidina Anas (Radiallahu Anhu), he states that Sayyidina Rasullullah (Sallallahu alaihe wasallam) did not have a wheat-coloured complexion. This has been mentioned in the translation of the hadeeth. Actually, what is derived from the two hadeeth is that Sayyidina Rasullullah (Sallallahu alaihe wasallam) was not of such a dark complexion that decrease the lightness and beauty of a person, but had a radiant and light colour, which slightly wheat-coloured.<br><br>In this hadeeth the word `Yata-kaf-fa-oo' is used regarding the walking of Sayyidina Rasullullah (Sallallahu alaihe wasallam). The scholars interpret this word in several ways. Some say it means to walk at a fast pace. Some are of the opinion that it means to lean a bit forward while walking. Some say it means to lift the leg with force. All three explanations are correct because the walk of Sayyidina Rasullullah (Sallallahu alaihe wasallam) fulfilled all three descriptions and the word also conveys these three meanings. Sayyidina Rasullullah (Sallallahu alaihe wasallam) walked quickly and not like the Romeos of this age who walk like women. It was also the noble habit of Sayyidina Rasullullah (Sallallahu alaihe wasallam) to walk with slight forward inclination of the head and shoulders. He did not walk with chest pushed out with pride. He lifted his legs as men do while walking and did not drag his legs on the ground.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900020",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800030",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "1",
    "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
    "babNumber": "1",
    "babName": "Chapter 01. The Noble Features Of Rasoolullah",
    "hadithNumber": "3",
    "hadithText": "Baraa bin Aazib (Radiallahu anhu) relates that: \"Rasullullah (Sallallahu alaihe wasallam) was a man of a medium build, (slightly tall, as explained before); he had broad shoulders (from which we may gather that he had a wide chest); he had dense hair which reached his ear-lobes; he wore a red striped lungi (a cloth worn around the legs) and shawl. I never saw anybody or anything more handsome than him\".</b>",
    "bookID": "1.0",
    "grade1": "",
    "grade2": "",
    "comments": ":<br>In this hadeeth the word `Rajulun Marbu'un' is used, which if the letter `Jeem' has a dammah (pesh), means a man. This could be correct. This type of word is used in the Arabic language for connecting words, but because no special quality or attribute is derived, some Muhadditheen (scholars of hadeeth) are of the opinion that if the letter `Jeem' has a fatah (zabar) on it, it means something that is between straight and bent. It may also be possible that in this case it refers to the description of the hair of Sayyidina Rasullullah (Sallallahu alaihe wasallam), and as described before, his mubarak (blessed) hair had a slight curl in it. From this hadeeth, some scholars are of the opinion that it is permissible for men to wear red coloured clothing. According to the Hanafis there is a detailed explanation on this subject. Before selecting red clothing, the scholars should be consulted regarding its permissibility.<br><br>The scholars have written that in this hadeeth the Sahabi did not see `anything' more handsome and beautiful than Sayyidina Rasullullah (Sallallahu alaihe wasallam). This is said because besides human beings, the moon, sun, etc. are also included.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900030",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800040",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "1",
    "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
    "babNumber": "1",
    "babName": "Chapter 01. The Noble Features Of Rasoolullah",
    "hadithNumber": "4",
    "hadithText": "Baraa bin Aazib (Radiallahu Anhu) reports: \"I never seen someone with long hair and red clothing more handsome than Rasullullah (Sallallahu alaihe wasallam). His hair reached his shoulders. The portion between his two shoulders was wide. He was neither very tall nor very short\".:</b>",
    "bookID": "1.0",
    "grade1": "",
    "grade2": "",
    "comments": "The description of the hair of Sayyidina Rasullullah (Sallallahu alaihe wasallam) in this hadeeth is different one mentioned before. There it is stated that his hair reached his ear-lobes. In reality there is no difference between the two hadeeth, as the hair does not remain the same length but grows. Sometimes the hair was shortened, sometimes longer hair was kept.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900040",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800050",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "1",
    "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
    "babNumber": "1",
    "babName": "Chapter 01. The Noble Features Of Rasoolullah",
    "hadithNumber": "5",
    "hadithText": "It is reported from Ali (Radiallahu Anhu): \"Rasullullah (Sallallahu alaihe wasallam was neither very tall nor very short. The soles of both feet were very fleshed. (This quality is praiseworthy in a man as it denotes strength and courage but is not praiseworthy for a woman). He had a large head. The joints of the bones was also large. The was a thin line of hair from the chest to the navel. When Rasulullah (Sallallahu alaihe wasallam) walked, it appeared that he was descending from a high place\". Ali (Radiallahu Anhu) says: \"I did not see anyone like him neither before him, nor after him\".</b>",
    "bookID": "1.0",
    "grade1": "",
    "grade2": "",
    "comments": ":<br>The use of a sentence like: \"I have not seen anyone like him\", is primarily for emphasis. By describing Sayyidina Rasulullah (Sallallahu alaihe wasallam) in this manner, there is however no exaggeration because the complete beauty of appearance of Sayyidina Rasulullah (Sallallahu alaihe wasallam) cannot be fully described. Munaawi wrote that every person is required to believe that with whatever physical qualities and attributes of Sayyidina Rasulullah (Sallallahu alaihe wasallam) is described, no other person can compare with it. This is not merely a belief. Books on Seerah (History of the Prophet peace be upon him) and ahadeeth are replete with descriptions of his beautiful qualities. Therein it is stated that Allah Ta'aala bestowed fully on the Prophet (peace be upon him) all the inner kamaalat (perfection) and Zaahiri (apparent) beauty. Two verses (couplets) are narrated from Sayyiditina Aa'ishah (Radiallahu Anha), the meaning of which is: \"that if the friends of Zulaikha could see the blessed face of Rasulullah (Sallallahu alaihe wasallam), they would have cut their hearts instead of their hands\". How true! If you wish to read more about the love of the Sahabah (Radiallahu Anhum... male and female... for Sayyidina Rasulullah (Sallallahu alaihe wasallam) read Chapter Eight of my book `Stories of the Sahabah' (Radiallahu Anhum).",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900050",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800060",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "1",
    "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
    "babNumber": "1",
    "babName": "Chapter 01. The Noble Features Of Rasoolullah",
    "hadithNumber": "6",
    "hadithText": "It is related from Ebrahim bin Muhammad (Radiallahu anhu) who is from the sons (grand sons of Ali radiallahu anhu, that whenever Ali radiallahu anhu described the noble features of Rasulullah (Sallallahu alaihe wasallam), he used to say: \"Rasulullah (Sallallahu alaihe wasallam) was neither very tall nor short, but of a medium stature among people. His hair was neither very curly nor very straight, but had a slight wave in it. He did not have a big body nor a round face, but his mubaarak face was slightly round (meaning he did not have a fully round face nor a fully elongated face, bur in between the two). The complexion of Rasulullah (Sallallahu alaihe wasallam) was white with redness in it. The mubaarak eyes of Rasulullah (Sallallahu alaihe wasallam) were extremely black. His eyelashes were long. The joints of the body (e.g. elbows and knees etc.) were large, likewise the portion between the two shoulders was broad and fully fleshed. There was no hair (more than normal) on his body. (Some people have profuse hair on their body. Sayyidina Rasulullah (Sallallahu alaihe wasallam) did not have hair on the parts of his body, besides places like the arms and legs etc.) He had a thin line of hair running from the chest to the navel. The hands and feet of Rasulullah (Sallallahu alaihe wasallam) were fully fleshed. When he walked, he lifted his legs with vigor, as if he were descending to a low-lying place. When he addressed a person he turned his whole body towards that person. (He did not only turn his face towards the person he addressed, as this is considered impolite, and sometimes, it even denotes pride. Sayyidina Rasulullah (Sallallahu alaihe wasallam) faced the person he spoke to, with his chest and body. Some scholars have translated this as, when Sayyidina Rasulullah (Sallallahu alaihe wasallam) addressed someone, he completely turned his face towards that person, and did not give a side glance. This is not a suitable translation). The seal of prophethood was situated between his shoulders. He was a last of all prophets. He was the most generous and the most truthful. He was the most kind-hearted and came from a most noble family. (It means his character, family back-ground and everything else was of the best). Any person who saw him suddenly would become awe-inspired. Sayyidina Rasulullah (Sallallahu alaihe wasallam) had such a great personality and dignity, that the person who saw him for the first time, because of his awe-inspiring personality, would be overcome with a feeling of profound respect. Firstly, there is a ro`b (awe) for physical beauty, with this when other Kamaalat are added what more could then be said of the ro'b (awe). Besides, the special attributes and qualities granted to Sayyidina Rasulullah (Sallallahu alaihe wasallam) ro'b (awe) is also one of the special qualities granted to him). Anyone who came in close contact with him, and knew his excellent character was smitten with the love of his excellent attributes. Anyone who described his noble features can only say: \"I have not seen anyone like Rasulullah (Sallallahu alaihe wasallam) neither before nor after him.\"</b>",
    "bookID": "1.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900070",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800070",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "1",
    "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
    "babNumber": "1",
    "babName": "Chapter 01. The Noble Features Of Rasoolullah",
    "hadithNumber": "7",
    "hadithText": "Hasan bin Ali (Radiallahu anhu) reported: \"I inquired from my maternal uncle (Sayyiditina Fatimah Radiallahu anha's step brother) Hind bin Abi Haalah (Radiallahu anhu) about the noble features of the Rasulullah (Sallallahu alaihe wasallam). He had often described the noble features of Rasulullah (Sallallahu alaihe wasallam) in detail. I felt that I should hear from him personally, some of the noble features of Raulullah (Sallallahu alalihe wasallam), so that I could make his description a proof and testimony for myself and also memorize them, and, if possible, try to emulate and adopt them. (The age of Sayyidna Hasan (Radiallahu anhu) at the time of Rasulullah (Sallallahu alaihe wasallam)'s death was seven years. In view of his age he did not have the opportunity to realize fully the features of Rasulullah (Sallallahu alaihe wasallam). The uncle described the noble features by saying: \"He had great qualities and attributes in him, others also held him in high esteem. His mubarak face shone like the full moon. He was slightly taller than a man of middle height, but shorter than a tall person. His mubarak head was moderately large. His mubarak hair was slightly twisted. If his hair became parted naturally in the middle he left it so, otherwise he did not habitually make an effort to part his hair in the middle. (This is a more respected translation).<br><br>A question may arise that Sayyidina Rasulullah (Sallallahu alaihe wasallam) habitually parted his hair as stated in Ahadith. The Ulama say that this was in the early periods where Rasulullah (Sallallahu alaihe wasallam) did not make an effort to do so. According to this humble servant, the answer to this is bit difficult, because it was the principal of Rasulullah (Sallallahu alaihe wasallam) to oppose the ways of the non-believers, and agree to the ways of Ahlul Kitab, he did not part his hair in the middle. For this reason, according to some Ulama, the best translation will be that he only parted his hair in the middle if it could be easily done, and when this could not be done easily, and a comb etc. was needed to do it, then he did not part his hair in the middle. Occasionally he used to part his hair in the middle with a comb etc. When the hair of Rasulullah (Sallallalhu alaihe wasallallam) was abundant, it used to pass over his ear-lobes). Rasulullah (Sallallahu alaihe wasallam) had a very luminous complexion (colour), and a wide forehead. He had dense and fine hair on his eye brows. Both eye brows were separate and did not meet each other in the middle. There was a vein between them that used to expand when he became angry. His nose was prominent and had a nur and lustre on it. When one first looked at him, it seemed as if he had a large nose, but looking at it carefully showed that the lustre and beauty made it look large, otherwise in itself the nose was not large.\"<br><br>His beard was full and dense. The pupil of his eye was black. His cheeks were full and full of flesh. The mouth of Rasulullah (Sallallahu alaihe wasallam) was moderately wide. (He did not have a small mouth). His teeth were thin and bright. The front teeth had a slight space between them. There was a thin line of hair from the chest to the navel. His neck was beautiful and thin, like the neck of a statue shaved clean, the colour of which was clear, shining and beautiful like silver. All the parts of his body were of moderate size, and fully fleshed. His body was proportionately jointed. His chest and stomach were in line, but his chest was broad and wide. The space between his shoulders was wide. The bones of his joints were strong and large (denoting strength). When he removed his clothing, his body looked bright and had a lustre (or rather those parts of the body that were not covered by his clothing were also bright and shining, compared with those parts of the body that were covered by his clothing. According to this humble servant the latter translation is more appropriate). Between the chest and navel there was a thin line of hair. Besides this line neither the chest nor the stomach had other hair on it. Both sides, the shoulders and the upper portion of the chest had hair. His forearm was long and palms were wide. The palms and both feet were fully fleshed. The fingers and toes were moderately long. The soles of his feet were a bit deep. His feet were smooth, because of their cleanliness and smoothness the water did not remain there but flowed away quickly. When he walked, he lifted his legs with vigor, leaned slightly forward and placed his feet softly on the ground. He walked at a quick pace and took rather a long step. He did not take small steps. When he walked it seemed as if he was descending to a lower place. When he looked at something he turned his whole body towards it. He always looked down. His sight was focused more to the ground than towards the sky (A question may arise here that it is reported in Abu Daawud that Rasulullah (Sallallahu alaihe wasallam) usually looked towards the sky. Both are reconciled thus: His habit was to look down towards the ground, but he also waited for the wahi (revelation), therefore while waiting he often looked towards the sky. Otherwise he usually looked down towards the ground.<br><br>His modest habit was to look at something with a light eye, i.e. he looked at a thing, with modesty and bashfulness, hence he did not stare at anything. While walking he asked the Sahabah (Radiallahu anhum) to walk in front, and he himself walked behind. He made salaam to whomsoever he met\"</b>",
    "bookID": "1.0",
    "grade1": "",
    "grade2": "",
    "comments": ":<br>The Ulama say that Sayyidina (Sallallahu alaihe wasallam) walked at the back because of his humbleness. According to this humble servant, if this is applied to his journeys it will be more appropriate. It was the noble habit of Sayyidina Rasulullah (Sallallahu alaihe wasallam) are described. Imam Tirmidi has mentioned this Hadith in many chapters where the speech and humility of Sayyidina Rasulullah (Sallallahu alaihe wasallam) are described.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900080",
    "last_updated": "2012-11-08 20:25:41"
  },
  {
    "englishURN": "1800080",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "1",
    "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
    "babNumber": "1",
    "babName": "Chapter 01. The Noble Features Of Rasoolullah",
    "hadithNumber": "8",
    "hadithText": "Jaabir bin Samurah (Radiallahu anhu) says: \"Rasulullah (Sallallahu alaihe wasallam) had a wide mouth. There were red lines in the whiteness of his eyes. He had little flesh on his heels.\"</b>",
    "bookID": "1.0",
    "grade1": "",
    "grade2": "",
    "comments": "It is desirable for Arab men to have wide mouths. According to some a wide mouth means eloquence (fluency of language). The translation adopted in the description of the eyes has been taken from accepted sayings. However in this Hadith, Imam Tirmidi has translated this to mean wide eyes, as a narrator of this hadith has done, which according to the linguists is not correct.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900090",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800090",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "1",
    "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
    "babNumber": "1",
    "babName": "Chapter 01. The Noble Features Of Rasoolullah",
    "hadithNumber": "9",
    "hadithText": "It is related from Jaabir (Radiallahu anhu) that he said: \"I once saw Rasulullah (Sallallahu alaihe wasallam) on the night of a full moon. On that night he wore red clothing. At times I looked at the full moon and at times at Rasulullah (Sallallahu alaihe wasallam). Ultimately I came to the conclusion that Rasulullah (Sallallahu alaihe wasallam) was more handsome, beautiful and more radiant than the full moon.\"</b>",
    "bookID": "1.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900100",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800100",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "1",
    "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
    "babNumber": "1",
    "babName": "Chapter 01. The Noble Features Of Rasoolullah",
    "hadithNumber": "10",
    "hadithText": "Abu-Ishaaq (Radiallahu anhu) says: \"A person once asked Baraa bin Aazib (Radiallahu anhu), \"Was the face of Rasulullah (Sallallahu alaihe wasallam) shining like a sword?\" He replied: \"No but like a full-moon with its roundness.\":</b>",
    "bookID": "1.0",
    "grade1": "",
    "grade2": "",
    "comments": "In making a comparison with a sword, it may have meant that Sayyidina Rasulullah (Sallallahu alaihe wasallam) had a long face. However the glitter of a sword has more whiteness than being luminous. For this reason Sayyidina Baraa (Radiallahu anhu) gave the similarity of the full moon, and not that of a sword. All these similarities are approximate descriptions, otherwise even a thousand moons cannot give the brightness of Sayyidina Rasulullah (Sallallahu alaihe wasallam). An Arab poet says: \"If you want to describe a shortcoming of a beloved, then give the beloved a similitude of a full moon. This is enough to insult him.\"",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900110",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800110",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "1",
    "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
    "babNumber": "1",
    "babName": "Chapter 01. The Noble Features Of Rasoolullah",
    "hadithNumber": "11",
    "hadithText": "Abu Hurayrah (Radiallahu anhu) says: \"Rasulullah (Sallallahu alaihe wasallam) was so clean, clear, beautiful and handsome, as though his body was covered and molded in silver. His hair was slightly curled.\":</b>",
    "bookID": "1.0",
    "grade1": "",
    "grade2": "",
    "comments": "In the first narration mentioned by Sayyidina Anas (Radiallahu anhu), it is denied that Sayyidina Rasulullah (Sallallahu alaihe wasallam) was very white. From the above hadith, it does not mean that he had white complexion like silver; rather he had a white and reddish complexion, in which the beauty and brightness was overwhelming.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900120",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800120",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "1",
    "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
    "babNumber": "1",
    "babName": "Chapter 01. The Noble Features Of Rasoolullah",
    "hadithNumber": "12",
    "hadithText": "Jaabir bin Abdullah (Radiallahu anhu) narrates from Rasulullah (Sallallahu alaihe wasallam) that he said: \"The Ambiyaa (Prophets) were shown to me. I saw Musa (Alaihis salaam), he had a thin body, like one from among the tribe of Shanu'ah. I saw Esa (Alaihis salaam). From among all those whom I have seen, he somewhat resembled Urwah bin Masud. I saw Ebrahim (Alaihis salaam). From among all those that I have seen, I, more or less, look like him. In the same manner I saw Jibra-eel (Alaihis salaam). From among all those I had seen, he more or less looked like Dihyah Kalbi.\"</b>",
    "bookID": "1.0",
    "grade1": "",
    "grade2": "",
    "comments": "This was on the night of mi'raaj or in a dream. Imaam Bukhaari (Rahmatullahi alaihe) has narrated both, on the night of mi'raaj and also in a dream. There is no confusion or difficulty in these differences, because he may have seen them on both occasions. The translation of the description of Sayyidina Musa (Alaihis salaam) as having a light body, in my opinion, is made from more accurate sayings. Some Ulama in the translation of this sentence, have expressed other opinions. These three Ambiyaa (Prophets) were described because Sayyidina Musa (Alaihis salaam) and Sayyidina Esa (Alaihis salaam) are the nabis of the Bani Israel and Sayyidina Ebrahim (Alaihis salaam), besides being the great grandfather of Sayyidina Rsulullah (Sallallahu alaihe wasallam), was also accepted by all Arabs.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900130",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800130",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "1",
    "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
    "babNumber": "1",
    "babName": "Chapter 01. The Noble Features Of Rasoolullah",
    "hadithNumber": "13",
    "hadithText": "Sa'eed Jariri (Radiallahu anhu) says: \"I heard Abu Tufayl (Radiallahu anhu) say: \"There is no one left on the face of this Earth, besides me who had seen Rasulullah (Sallallahu alaihe wasallam).\" I asked him to describe to me the noble features of Rasulullah (Sallallahu alaihe wasallam). He said: \"Rasulullah (Sallallahu alaihe wasallam) had a white complexion, which was slightly reddish, and had a medium sized body.\":</b>",
    "bookID": "1.0",
    "grade1": "",
    "grade2": "",
    "comments": "Sayyidina Abu Tufayl (Radiallahu anhu) was the last one among the Sahabah (Radiallahu anhum) to pass away. He died in the year 110 Hijri. That is why he said, that there was no one left besides him who had seen Rasulullah (Sallallahu alaihe wasallam). The ulama say that he used the phrase `face of the earth' because Sayyidina Esa (Alaihis salaam) is also from the ones who had seen Sayyidina Rasulullah (Sallallahu alaihe wasallam), and is present in the skies (heavens).",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900140",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800140",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "1",
    "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
    "babNumber": "1",
    "babName": "Chapter 01. The Noble Features Of Rasoolullah",
    "hadithNumber": "14",
    "hadithText": "Ibn Abbas (Radiallahu anhu) says: \"The front teeth of Rasulullah (Sallallahu alaihe wasallam) were a bit wide (spread out). They were spaced out and not close together. When Rasulullah (Sallallahu alaihe wasallam) talked, an illumination emitting from his teeth could be seen.\"</b>",
    "bookID": "1.0",
    "grade1": "",
    "grade2": "",
    "comments": "According to the Ulama, it is a well known fact that it was something similar to nur which emitted from his teeth. The opinions of Allaamah Munaawi is that it was something sensory, and not a similarity, which emitted miraculously from between the teeth of Rasulullah (Sallallahu alaihe wasallam).<br><br>Everything of his noble features was perfect and beautiful. In the manner that is real and intrinsic beauty had reached its last stage, in the same manner his zaahiri (apparent) beauty had also reached its fullest and proper stage. Allahumma sali 'alaa Sayyidina Muhammadiw wa 'alaa aalihi biqadri husnihi wa jamaalihi.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900150",
    "last_updated": "2012-04-26 07:00:00"
  }
]