[
  {
    "englishURN": "1800690",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "9",
    "bookName": "Chapter 09. The Khuff (Leather Socks) Of Rasoolullah",
    "babNumber": "9",
    "babName": "Chapter 09. The Khuff (Leather Socks) Of Rasoolullah",
    "hadithNumber": "69",
    "hadithText": "Buraydah (radiallahu anhu.) says, \"Najaashi sent two simple black coloured as a gift to Sayyidina Rasulullah sallallahu alaihe wasallam. He wore these and made mash over after performing wudu\".</b>",
    "bookID": "9.0",
    "grade1": "",
    "grade2": "",
    "comments": "Najaashi was the title of kings of Abyssinia, like sharif was the title of the rulers of Makkah. The name of this Najaashi was As-hamah, who later became a Muslim. The'ulama have deduced from this hadith that it is permissible to accept a gift of a non- believer. Najaashi had not yet accepted Islaam at the time of sending the gift. The 'ulama have therefore summed up these in different ways.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900730",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800700",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "9",
    "bookName": "Chapter 09. The Khuff (Leather Socks) Of Rasoolullah",
    "babNumber": "9",
    "babName": "Chapter 09. The Khuff (Leather Socks) Of Rasoolullah",
    "hadithNumber": "70",
    "hadithText": "Sayyidina Mughirah bin Shu'bah radiallahu anhu relates: \"Dihyah Kalbi sent to Rasulullah Sayyidina Rasulullah sallallahu alaihe wasallam as a gift to khuffs. In another narration it is stated that with the khuffs a jubbah (a long coat) was also sent. Rasulullah Sayyidina Rasulullah sallallahu alaihe wasallam did not inquire if the skin was from slaughtered animals or not\".</b>",
    "bookID": "9.0",
    "grade1": "",
    "grade2": "",
    "comments": "The last sentence of this hadith strengthens madh-hab of the Hanafis that it is permissible to use a tanned skin of an animal whether it is slaughtered according to shari'ah or not. Some of the 'ulama differ on this question. It has been discussed in the books of fiqh (jurisprudence).",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900740",
    "last_updated": "2012-04-26 07:00:00"
  }
]