[
  {
    "englishURN": "1800990",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "13",
    "bookName": "Chapter 13. The Sword Of Rasoolullah",
    "babNumber": "13",
    "babName": "Chapter 13. The Sword Of Rasoolullah",
    "hadithNumber": "99",
    "hadithText": "Hazrat Anas radiyallahu anhu reports that the handle of the sword of the Prophet of Allah sallallahu alaihe wasallam was made of silver.</b>",
    "bookID": "13.0",
    "grade1": "",
    "grade2": "",
    "comments": "Allamah Bayjuri writes, about the sword named 'Dhulfiqaar', \"At the time of conquering Makkah, the Prophet of Allah sallallahu alaihe wasallam had this sword.\"\r\n",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901050",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801000",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "13",
    "bookName": "Chapter 13. The Sword Of Rasoolullah",
    "babNumber": "13",
    "babName": "Chapter 13. The Sword Of Rasoolullah",
    "hadithNumber": "100",
    "hadithText": "Hazrat Saeed bin Abil Hasan Basri radiyallahu anhu has related the same hadith that the handle grip of the sword of the Prophet of Allah sallallahu alaihe wasallam was made of silver.</b>",
    "bookID": "13.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901060",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801010",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "13",
    "bookName": "Chapter 13. The Sword Of Rasoolullah",
    "babNumber": "13",
    "babName": "Chapter 13. The Sword Of Rasoolullah",
    "hadithNumber": "101",
    "hadithText": "Hazrat Mazeedah bin Malik, the (maternal) grandfather of Hud says that when the Prophet of Allah sallallahu alaihe wasallam entered Makkah on the day it was conquered, his sword had gold and silver on it.<br><br>Talib who is one of the narrators of this hadith says that he asked the ustaadh, \"On which part of the sword was the silver?\" He replied, \"The cap of the grip handle was made of silver.</b>",
    "bookID": "13.0",
    "grade1": "",
    "grade2": "",
    "comments": "According to the majority of the Ulama it is not permissible to use gold on a sword. This hadith cannot be used as proof, as it has been declared to be weak. Allamah Turpishti says, \"This hadith cannot be used as an argument because its sanad (chain of narrators) cannot be relied upon. The use of silver for the handle etc. is permissible according to the previous hadith.\"<br><br>It is said that since it is not permissible to use gold, the narrator did not care to investigate which portion of the sword was made of gold. He only investigated those portions that were made of silver.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901070",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801020",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "13",
    "bookName": "Chapter 13. The Sword Of Rasoolullah",
    "babNumber": "13",
    "babName": "Chapter 13. The Sword Of Rasoolullah",
    "hadithNumber": "102",
    "hadithText": "Ibn Seereen says, \"I made my sword like the sword of Samurah bin Jundub radiyallahu anhu. He said that he had his sword made in the same manner as the one the Prophet of Allah sallallahu alaihe wasallam had. The sword was the type used by the tribe of Banu Hanifah.</b>",
    "bookID": "13.0",
    "grade1": "",
    "grade2": "",
    "comments": "Banu Hanifah was a tribe in Arabia who were famous for manufacturing good quality swords. These people, one after another, in imitating the Prophet of Allah sallallahu alaihe wasallam, made a replica of his sword.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901080",
    "last_updated": "2012-04-26 07:00:00"
  }
]