[
  {
    "englishURN": "1801070",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Chapter 16. The Turban Of Rasoolullah",
    "babNumber": "16",
    "babName": "Chapter 16. The Turban Of Rasoolullah",
    "hadithNumber": "107",
    "hadithText": "Hazrat Jabir radiyallahu anhu reports that when Makkah was conquered, Rasoolullah sallallahu alaihe wasallam entered the city wearing a black turban</b>",
    "bookID": "16.0",
    "grade1": "",
    "grade2": "",
    "comments": "This hadith seems to contradict the previous ahaadith (mentioned in the previous chapter on the helmet of Sayyidina Rasoolullah sallallahu alaihe wasallam, wherein it is stated that Sayyidina Rasoolullah sallallahu alaihe wassallam wore a helmet and entered Makkah. In reality there is no difference. It is not impossible to wear a turban on a helmet. Both hadith can be summed up easily. Some Ulama say that when he entered Makkah he wore a helmet. As soon as he removed the helmet, he wore a turban. Therefore in that narration, the time of entry is mentioned since the time was appropriate. Some Ulama are of the opinion that because a metal head cover may have been troublesome, he may have worn a turban beneath it.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901140",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801080",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Chapter 16. The Turban Of Rasoolullah",
    "babNumber": "16",
    "babName": "Chapter 16. The Turban Of Rasoolullah",
    "hadithNumber": "108",
    "hadithText": "Hazrat Amr bin Huraith radiyallahu anhu says, \"I had seen Rasoolullah sallallahu alaihe wasallam wear a black turban.</b>",
    "bookID": "16.0",
    "grade1": "",
    "grade2": "",
    "comments": "In Muslim and Nasai, Hazrat Amr bin Huraith radiyallahu anhu says, \"That scene is still before my eyes, when Sayyidina Rasoolullah sallallahu alaihe wasallam was delivering the sermon on the mimbar. He wore a black turban on his auspicious head, and its shamlah (the end portion of the turban) was between his shoulders.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901150",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801090",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Chapter 16. The Turban Of Rasoolullah",
    "babNumber": "16",
    "babName": "Chapter 16. The Turban Of Rasoolullah",
    "hadithNumber": "109",
    "hadithText": "Hazrat Amr bin Huraith radiyallahu anhu relates that Sayyidina Rasoolullah sallallahu alaihe wasallam was once delivering the sermon, and there was a black turban on his auspicious head.</b>",
    "bookID": "16.0",
    "grade1": "",
    "grade2": "",
    "comments": "According to well known sayings, this sermon was at the time when Makkah Mukarramah was conquered. It was given from the threshold of the Ka'bah's door, as has been mentioned in the previous ahaadith by Hazrat Jabir radiyallahu anhu. In some ahaadith relating to this incident, it has been mentioned that the sermon was delivered from a mimbar (pulpit), whereas the sermon at the time when Makkah Mukarramah was conquered was not given from a mimbar. Some say that this incident did not take place in Makkah Mukarramah, but at Madinah Munawwarah on a Friday. In some ahaadith it is also mentioned that this was a Friday sermon. Mulla Ali Qari has written on the commentary of Mishkat from Meerak Shah that this sermon was delivered before Sayyidina Rasoolullah sallallahu alihe wasallam passed away, and Allah knows best.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901160",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801100",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Chapter 16. The Turban Of Rasoolullah",
    "babNumber": "16",
    "babName": "Chapter 16. The Turban Of Rasoolullah",
    "hadithNumber": "110",
    "hadithText": "Hazrat Ibn Umar radiyallahu anhuma reports, \"When Rasoolullah sallallahu alaihe wasallam fastened an amaamah (turban), he used to put the shamlah between his shoulers (i.e. he used to put it on the back).\"<br><br>Nafi says, \"I had seen Abdullah bin Umar radiyallahu anhuma do it in the same manner.\"<br><br>Ubaidullah, who is the student of Nafi, says, \"In my time the grandson of Abu Bakr radiyallahu anhu, Qasim bin Muhammad and the grandson of Umar radiyallah anhu, Saalim bin Abdullah did the same.</b>",
    "bookID": "16.0",
    "grade1": "",
    "grade2": "",
    "comments": "The practice of Sayyidina Rasoolullah sallallahu alaihe wasallam in putting the shamlah (back-end portion of the turban) varied. He usually left a shamlah on the turban. Some Ulama have gone so far as to say that he never wore a turban without a shamlah. The Muhaqqiqeen (research scholars) say that he sometimes did not leave a shamlah. When wearing a turban he observed different practices with the shamlah. He sometimes left it in front on the right shoulder; sometimes on the back between the shoulders. Sometimes the two ends of the turban were left as a shamlah. Allamah Munaawi says, \"Although all methods are mentioned, the best and most correct is to leave it between the shoulders on the back.\"",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901170",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801110",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Chapter 16. The Turban Of Rasoolullah",
    "babNumber": "16",
    "babName": "Chapter 16. The Turban Of Rasoolullah",
    "hadithNumber": "111",
    "hadithText": "Hazrat Ibn Abbas radiyallahu anhuma reports, \"Sayyidina Rasoolullah sallallahu alaihe wasallam was once delivering a sermon. He was wearing a black turban, or an oily strip of cloth.</b>",
    "bookID": "16.0",
    "grade1": "",
    "grade2": "",
    "comments": "This was before Sayyidina Rasoolullah sallallahu alaihe wasallam passed away. It was his last sermon. After this Sayyidina Rasoolullah sallallahu alaihe wasallam did not ascend the mimbar, nor deliver a sermon. In this sermon, Sayyidina Rasoolullah sallallahu alaihe wasallam especially stressed the privileges of and consideration for the Ansaar. He counted their virtues and kind favours and also requested that the one who was chosen as an amir should give special attention to the needs of the Ansaar. At that time Sayyidina Rasoolullah sallallahu alaihe wasallam had a severe headache, for which reason he might have fastened a strip of cloth. Also since the hair of Sayyidina Rasoolullah sallallahu alaihe wasallam used to be oiled regularly, which is mentioned in the ensuing chapters, the strip may have been oily for this reason.<br><br>His habit of wearing a black turban is well known. The Ulama have two meanings of a 'black turban'. Some have translated it as a black coloured turban and some say it is an oily strip of cloth. Both are correct as it can have both meanings.<br><br>One narrator of this hadith is Ibnul Gaseel, who is from the progeny of Hazrat Hanzalah radiyallahu anhu who was bathed by the malaaikah (angels). Hazrat Hanzalah radiyallahu anhu was nicknamed 'Gaseelul Malaaikah', which means the one bathed by the angels. There is a thought provoking incident regarding this. When the call for the Battle of Uhud was announced and the army was beginning to leave, he was having relations with his wife. In this state he heard the call for war, and heard the army leaving for the battlefield. He left everything at that moment and joined the army. He did not have a chance to do gusl (bath). He was martyred in the battlefield and because a 'shaheed' (martyr) is not given a gusl, he too was not given. Sayyidina Rasoolullah sallallahu alaihe wasallam saw the angels bathing him. He made inquiries and, on returning to Madinah Munawwarah, was informed by his wife of his condition. Truly, these people gave their lives for the sake of deen, as willingly as we would, today, fulfil our passions in which we are so heavily engrossed.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901180",
    "last_updated": "2012-04-26 07:00:00"
  }
]