[
  {
    "englishURN": "1801120",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "17",
    "bookName": "Chapter 17. The Lungi Of Rasoolullah",
    "babNumber": "17",
    "babName": "Chapter 17. The Lungi Of Rasoolullah",
    "hadithNumber": "112",
    "hadithText": "Hazrat Abu Burdah bin Musa Al-Ash'ari radiyallahu anhu reports, \"Aishah radyiallahu anha showed us a patched sheet, and the thick coarse lungi, then said, \"When Rasoolullah sallallahu alaihe wasallam passed away, he was wearing these clothes.</b>",
    "bookID": "17.0",
    "grade1": "",
    "grade2": "",
    "comments": "It was a habit of Sayyidina Rasoolullah sallallahu alaihe wasallam to wear simple clothing right up to the time of his demise, even though the standard of living had generally improved. After the conquest of Khaibar the economic situation of the Muslims became better. After the conquest of Makkah, the kings of other countries also began sending presents etc.. Despite this, Sayyidina Rasoolullah sallallahu alaihe wasallam did not change his standard of living. He lived simply and whatever was sent to him was distributed to others. A few examples have been mentioned in the book 'Stories of the Sahabah radiyallahu anhum'.<br><br>Imam Nawawi says that this hadith and other similar ones point to the fact that Sayyidina Rasoolullah sallallahu alaihe wasallam loved the Hereafter and stayed away from luxuries. Thick and coarse clothing makes one feel humble and simple, while the wearing of fine clothing makes one feel great and proud.<br><br>My saint, Maulana Hakim Jameelud-Deen Naginwi Ad-Dehlawi related an incident of Maulana Gangohi that when he went for Haj and while performing tawaaf, a blind saint was sitting on the outer side of the Mataaf. Whenever Maulana passed by him, he said softly, \"Wear the clothing of the pious.\"<br><br>When Maulana completed the tawaaf and went to the side where the blind saint was sitting, he heard him say, \"Khashin, khashin (coarse, coarse),\" by which it was meant that the clothing of the pious was made of coarse material.<br><br>Sayyidina Rasoolullah sallallahu alaihe wasallam generally wore coarse clothing. There is also evidence that he, sometimes, wore clothing made of fine material due to some religious benefit, if it was available. He normally did not wear clothing made of fine cloth.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901190",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801130",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "17",
    "bookName": "Chapter 17. The Lungi Of Rasoolullah",
    "babNumber": "17",
    "babName": "Chapter 17. The Lungi Of Rasoolullah",
    "hadithNumber": "113",
    "hadithText": "Hazrat Ubaid bin Khalid radiyallahu anhu says, \"I was once going to Madinah Munawwarah. I heard a person from behind me say, \"Wear the lungi higher because it avoids physical and spiratual najaasah (impurities).\" (The lungi will remain cleaner and will not become dirty by being dragged on the ground.)<br><br>When I turned to see who was talking, I saw that it was Rasoolullah sallallahu alaihe wasallam. I said, \"O' Rasoolullah, this is a simple lungi, how can one become proud, and it is necessary to look after it (keep it clean)?\"<br><br>Rasoolullah sallallahu alaihe wasallam replied, \"If you see no benefit in it, your following me has not ceased.\"<br><br>While Rasoolullah sallallahu alaihe wasallam was telling me this, I saw that his lungi reached till half his him.\"</b>",
    "bookID": "17.0",
    "grade1": "",
    "grade2": "",
    "comments": "We have been warned strictly in the ahaadith on the wearing of a lungi or trousers below the ankle. All those parts that droop below the ankles will be burnt in the fire. Abdur-Rahman says, \"I asked Abu Saeed Khudri radiyallahu anhu regarding the lungi. He replied, \"You have a very meaningful question. Rasoolullah sallallahu alaihe wasallam has said, \"The lungi of a Muslim should reach till the middle of the shin, and there is no harm if it reaches above his ankles. But those portions that droop below the ankles will burn in the fire of jahannam. The one that lets his clothes droop below his ankles in pride, Allah Most High will not look at him on the Day of Judgement.\" (Abu Dawud).<br><br>Warnings like these have been given in other ahaadith too. One should take strict care of this. In our time it has become a fashion to let the clothing droop below the ankles, so much so, that we treat it to be something petty and pay no heed to the warning of Sayyidina Rasoolullah sallallahu alaihe wasallam. To Allah is our complaint.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901200",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801140",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "17",
    "bookName": "Chapter 17. The Lungi Of Rasoolullah",
    "babNumber": "17",
    "babName": "Chapter 17. The Lungi Of Rasoolullah",
    "hadithNumber": "114",
    "hadithText": "Hazrat Salamah bin Akwa radiyallahu anhu says, \"Uthman radiyallahu anhu wore his lungi till the middle of his shin and said, \"This is how my master Rasoolullah sallallahu alaihe wasallam wore his lungi.\"</b>",
    "bookID": "17.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901210",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801150",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "17",
    "bookName": "Chapter 17. The Lungi Of Rasoolullah",
    "babNumber": "17",
    "babName": "Chapter 17. The Lungi Of Rasoolullah",
    "hadithNumber": "115",
    "hadithText": "Hazrat Hudhaifah bin Al-Yamaan radiyallahu anhu reports that Rasoolullah sallallahu alaihe wasallam caught the shin of my leg, or of his own leg and said, \"This is where the lungi should reach, and if not, then a little further down, and if not, then the lungi has no right on the ankle.\" (For this reason the lungi should not reach over the ankles.</b>",
    "bookID": "17.0",
    "grade1": "",
    "grade2": "",
    "comments": "It is haraam to cover the ankles when wearing a lungi or an izaar etc.. The Ulama say that only those people are exempted who have a boil or a sore on the ankle, which will cause flies etc. to sit on it. Only then shall it be permissible to cover it with a lungi or izaar etc., with the object of safeguarding it till it heals.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901220",
    "last_updated": "2012-04-26 07:00:00"
  }
]