[
  {
    "englishURN": "1800150",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Chapter 02. Seal Of Nubuwwah (Prophethood) Of Rasoolullah",
    "babNumber": "2",
    "babName": "Chapter 02. Seal Of Nubuwwah (Prophethood) Of Rasoolullah",
    "hadithNumber": "15",
    "hadithText": "Saa-ib bin Yazid (Radiallahu anhu) said: \"My (maternal) aunt took to me to the Holy Prophet (Sallallahu alaihe wasallam) and said to him, this nephew of mine is ill. Rasulullah (Sallallahu alaihe wasallam) wiped his holy hand over my head and made for barakah for me. (According to some Ulama, Rasulullah (Sallallahu alaihe wasallam) wiped his hand over his head, meant that he Sayyidina Saa-ib bin Yazid (Radiallahu anhu) had a pain in the head. The opinion of this weak and humble servant is that it is better if this is taken to mean that the Holy Prophet (Sallallahu alaihe wasallam) wiped his hands in kindness on the head of Sayyidina Saa-ib bin Yazid (Radiallahu anhu). Sayyidina Saa-ib bin Yazid (Radiallahu anhu) was born in the second year Hijri, and at the time of the Holy Prophet (Sallallahu alaihe wasallam)'s death, his age was not more than 8 or 9 years. That is why the Holy Prophet (Sallallahu alaihe wasallam) wiped his Holy hand in kindness, as is the customs of the great personalities. The Holy Prophet (Sallallahu alaihe wasallam) also gave him the water of wudu to drink as a cure, as will be stated further, or he may have prescribed another remedy, especially when we learn also in a narration in Bukhari thay he Sayyidina Saa-ib bin Yazid (Radiallahu anhu)was suffering from pain in his leg). When the Holy Prophet (Sallallahu alaihe wasallam) performed Wudu, I drank the water of that wudu. (The Holy Prophet (Sallallahu alaihe wasallam) may have performed wudu for some reason, but here it is clear that the Holy Prophet (Sallallahu alaihe wasallam) performed wudu so that the water could be used as a remedy and medicine). I saw the seal of Prophethood, which was like the knot on a mosquito net or bedstead.\" (Which is the size of a pigeon's egg in roundness). The Ulama differ in the translation of this word. Some have translated it in another manner. Imam Nawawi, the famous commentator of Sahih Muslim, preferred the translation I have chosen).</b>",
    "bookID": "2.0",
    "grade1": "",
    "grade2": "",
    "comments": "If in this Hadith the left over water of wudu is meant, then there is no difficulty or difference of opinion. If that water is meant which falls after washing the limbs etc., which in Arabic is known as 'Mae Musta'amal', then too there is no complication or difficulty, because even the excrements of Sayyidina Rasulullah (Sallallahu alaihe wasallam) is paak. So how can there be a complaint regarding the 'Mae Musta'amal'(Used water).",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900160",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800160",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Chapter 02. Seal Of Nubuwwah (Prophethood) Of Rasoolullah",
    "babNumber": "2",
    "babName": "Chapter 02. Seal Of Nubuwwah (Prophethood) Of Rasoolullah",
    "hadithNumber": "16",
    "hadithText": "Jaabir bin Samurah (Radhiallahu Anhu reports that: \"I saw the Seal of Prophethood of Rasullullah (Sallallahu alaihi wasallam) between his two shoulders, which was like a red tumor (protruding flesh), the size of which was like that of a pigeon's egg\"</b>",
    "bookID": "2.0",
    "grade1": "",
    "grade2": "",
    "comments": "There are various and different narrations regarding the size and colour of the Seal of Prophethood of Sayyidina Rasullullah (Sallallahu alaihi wasallam). Qurtubi has reconciled these by saying that the size changed from time to time, as did the colour. According to this humble servant, this reconciliation may also be possible, that in reality all these are similarities, and every similarity is according to a person's understanding, which is an approximate state. There is no disagreement in explaining approximates. This is a more appropriate explanation.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900170",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800170",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Chapter 02. Seal Of Nubuwwah (Prophethood) Of Rasoolullah",
    "babNumber": "2",
    "babName": "Chapter 02. Seal Of Nubuwwah (Prophethood) Of Rasoolullah",
    "hadithNumber": "17",
    "hadithText": "Rumaythah (Radhiallahu Anha) said: \"I heard this subject from Rasullullah (Sallallahu alaihi wasallam) and at that time I was so near him, that if I wanted to, I could have kissed the Seal of Prophethood. That subject is: `Rasullullah (Sallallahu alaihi wasallam) was talking about Sa's bin Mu'aadh (Radhiallahu anhu), that because of Sa'd's death, the `Arsh (Throne) of Allah shook'\".</b>",
    "bookID": "2.0",
    "grade1": "",
    "grade2": "",
    "comments": "There is a disagreement regarding the swinging of the Arsh. What is the reason and what does it mean? The above translation is in accordance with well-known sayings. Some are of the opinion that this refers to the People of the Arsh. Some are of the opinion that it is the Takht (Throne) of Sayyidina Sa'd (Radhiallahu Anhu), etc. Sayyidina Sa'd bin Mu'aadh is from among the great Sahabah. In the books of hadith many of the merits have been mentioned. Before the Hijra Sayyidina Rasullullah (Sallallahu alaihi wasallam) sent Sayyidina Mu'aadh bin Umayr (Radhiallahu Anhu) to Madina to teach and propagate Islaam. Sayyidina Sa'd (Radhiallahu anhu) accepted Islaam at his hands. He was leader of his community and as a result, his whole family accepted Islaam on the same day. This was the first family in Madinah accepted Islaam. He passed away at the age of 37 in the fifth year Hijri. 70,000 malaa'ikha (angels) attended his jnaazah salaah. With all this, it appears from hadith that he also went through hardship for a while in the grave. We should all take heed. A person should not be lax in this matter, and should always remember Allah, repent and fear the punishment of the grave. Whenever Sayyidina Uthmaan (Radhiallahu anhu) passed a grave, he used to weep till his beard became wet. Someone asked him, `Jannah and Jahanam are also discussed, but at that time you do not weep?' He replied: `I heard Rasullullah (Sallallahu alaihi wasallam) say: \"The grave is the first stage of the aakhirah (hereafter); whoever goes through this easily, all the other stages become easy. And for whom this stage is difficult, all the other stages become more difficult'\". He says I also heard Rasullullah (Sallallahu alaihi wasallam) say: \"Of all the scenes of the aakhirah that I have seen, the one of Qabr (grave) is the most difficult\".-Mishkaat. May Allah Ta'aala save us all from it. Imaam Tirmidhi did not intend to relate this incident here, but because the Seal of Prophethood is mentioned, therefore it is included here. Also Rumaythah (Radhiallahu Anha) by mentioning her experience of being near Rasullullah (Sallallahu alaihi wasallam) and seeing the Seal of Prophethood, and by hearing this subject conclusively proves that there remains no place for errors.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900180",
    "last_updated": "2013-03-13 10:03:41"
  },
  {
    "englishURN": "1800180",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Chapter 02. Seal Of Nubuwwah (Prophethood) Of Rasoolullah",
    "babNumber": "2",
    "babName": "Chapter 02. Seal Of Nubuwwah (Prophethood) Of Rasoolullah",
    "hadithNumber": "18",
    "hadithText": "Ebrahim bin Muhammad (Radhiallahu Anhu), who is the grandson of Ali (Radhiallahu anhu said: \"Whenever Ali (Radhiallahu Anhu) used to describe the noble attributes of Rasullullah (Sallallahu Alaihi wasallam), he used to mentioned the complete hadith. He also used to say that the Seal of Prophethood was between his shoulders, and Rasullullah (Sallallahu alaihi wasallam) was the seal of all prophets\".</b>",
    "bookID": "2.0",
    "grade1": "",
    "grade2": "",
    "comments": "This hadith has been explained in the first chapter (hadith number eight). Here it is referred to briefly. Because of the Seal of Prophethood, this hadith is mentioned specially here.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900190",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800190",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Chapter 02. Seal Of Nubuwwah (Prophethood) Of Rasoolullah",
    "babNumber": "2",
    "babName": "Chapter 02. Seal Of Nubuwwah (Prophethood) Of Rasoolullah",
    "hadithNumber": "19",
    "hadithText": "`Ilbaa bin Ahmar Al-yashkari says that the Sahaabi, Abu Zayd `Amr bin Akhtab Al-Ansaari Radhiallahu Anhu said to me: \"Rasullullah (Sallallahu alaihi wasallam) once asked me to massage his waist. When I began massaging the back, accidentally (by chance) my fingers touched the Seal of Prophethood. `Ilbaa (Radhiallahu anhu) says: `I asked Amr (Radhiallahu anhu), what is the Seal of Prophethood?' He replied: `It was a collection of few hair'\".</b>",
    "bookID": "2.0",
    "grade1": "",
    "grade2": "",
    "comments": "This is not contrary to the first hadith, because there was hair around the Seal of Prophethood. He only mentioned the hair.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900200",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800200",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Chapter 02. Seal Of Nubuwwah (Prophethood) Of Rasoolullah",
    "babNumber": "2",
    "babName": "Chapter 02. Seal Of Nubuwwah (Prophethood) Of Rasoolullah",
    "hadithNumber": "20",
    "hadithText": "Buraydah bin Radiyallahu 'Anhu reports: \"when Rasulalullah Sallallahu 'Alayhi Wasallam came to Medinah, Salmaan Faarisi Radiyallahu 'Anhu brought a tray which had fresh dates on it, and presented it to Rasulullah Sallallahu 'Alayhi Wasallam, who asked:<br><br>\"O Salmaan, what dates are these?\"<br><br>He replied:<br><br>\"This is sadaqah for you and your companions\"<br><br>Rasulullah Sallallahu 'Alayhi Wasallam replied:<br><br>\"We do not eat Sadaqah. Remove it from me.\"<br><br>(The 'ulama differ in their opinions as to the meaning of the word \"we\". Some say it is Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam himself, and the plural is used as a mark of respect. Others explain that it is the ambiyaa (prophets). According to some it is Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam and his relatives, for whom it is not permissible to accept zakaah. According to this humble servant the third ihtimaal (supposition) is superior and more acceptable. Allaamah Munaawi's criticism of the third explanation is not forceful and weighty). On the next day this happened again. Salmaan Radiyallahu 'Anhu brought a tray of fresh dates, and in reply to the question of Rasullullah Sallallahu 'Alayhi Wasallam, he replied: \"O messenger of Allah, it is a present for you\".<br><br>Rasullullah Sallallahu 'Alayhi Wasallam said to the Sahaabah Radiyallahu 'Anhum \"Help yourselves\". (Sayyidina Rasullullah Sallallahu 'Alayhi Wasallam himself ate from it. Bayjuri explains this thus: Sayyidina Salmaan Radiyallahu 'Anhu bringing the dates on both days in this manner was to investigate, and to make Sayyidina Rasullullah Sallallahu 'Alayhi Wasallam his master. Sayyidina Salmaan Radiyallahu 'Anhu was an 'Aalim (learned) of the old days. He lived for a hundred and fifty years and according to some, he lived three hundred years. He had seen the signs of Sayyidina Rasullullah Sallallahu 'Alayhi Wasallam in the kitaabs of previous prophets, that he will not accept sadaqah, but shall accept presents and gifts, and the seal of Prophethood will be between his two shoulders after witnessing the first two signs).<br><br>He then saw the seal of Prophethood on the back of Sayyidina Rasullullah Sallallahu 'Alayhi Wasallam and embraced Islam. (At that time Sayyidina Salmaan Radiyallahu 'Anhu was a slave of a Jew from the tribe of Banu Qurayzah.<br><br>Rasullullah Sallallahu 'Alayhi Wasallam purchased him(this is figuratively speaking. The fact is that Rasullullah Sallallahu 'Alayhi Wasallam made him a Mukaatab - One who buys One's freedom for any agreed sum.) and paid Dirhams for him to become a Mukaatab, and also agreed that he(Sayyidina Salmaan Radiyallahu 'Anhu should plant for the Jew date palms,(the amount of three hundred palms) and until these bore fruit to tend them. Rasullullah Sallallahu 'Alayhi Wasallam planted the palms with his mubaarak hands and it was his mu'jizah(miracle) that all the palms bore fruit in the same year. One tree among these did not bear fruit. Upon investigating it was found that Umar Radiyallahu 'Anhu had planted this tree, and that it was not planted by Rasullullah Sallallahu 'Alayhi Wasallam. Rasullullah Sallallahu 'Alayhi Wasallam removed this palm and replanted it. Another mu'jizah Rasullullah Sallallahu 'Alayhi Wasallam is that he planted the palms out of season and they bore fruit the same year.</b>",
    "bookID": "2.0",
    "grade1": "",
    "grade2": "",
    "comments": ".<br>The Ulama have made thorough research on this Hadith. For example Sayyidina Salmaan Radiyallahu 'Anhu was a slave, was his sadaqah and hadiyyah(gift) permissible or not? Also what was the difference between Hadiyyah and Sadaqah etcetera? Due to the discussion being lengthy, it has been omitted to keep the subject short.<br><br>From this hadith we learn some of the special habits Sayyidina Rasullullah Sallallahu 'Alayhi Wasallam, that he included the servants and those present, in the gifts he received. This was one of the special habits of Sayyidina Rasullullah Sallallahu 'Alayhi Wasallam. There are thousands of similar instances mentioned in the ahadith. In this hadith Sayyidina Rasullullah Sallallahu 'Alayhi Wasallam also enjoined us to share presents. Those who are present should also be included. According to the Muhadditheen there is a variation in the words of this hadith and that this hadith is weak, but according to the subject matter, the incidence strengthen it. What type of presents are meant and what is meant by those that are sitting together? (near).<br><br>These need an explanation. Mullah Ali Qaari writes that person brought a present to a pious Shaykh of that time. A person sitting in his assembly said: \"Presents are shared\". The Shaykh replied :\"We do not make shirk(ascribe partners onto Allah) and believe in one creator. All these(presents) are for you\". The presents were so many that that person could not carry all of them. The Shaykh instructed his servant to deliver it to that persons home. In the same manner, this happened in the assembly of Imam Abu Yusuf Rahmatullahi alayih. A person presented him a monetary gift. One from among those present said \"Presents are shared\". The Imam replied that those are special types of presents and instructed his servant to put away the present. The Ulama say that both instances are correct and well balanced. What the pious Suffi did was proper and befitting, and what the Fakih(Jurist) did was also proper and befitting, and this is true.<br><br>Imam Abu Yusuf Rahmatullahi alayih was a celebrated and famous Imam. If he did not do as he had done, it might have become Shar'Ee Mas-alah that presents should be shared, and this would have made it difficult for the Umma. Shah Waliyullah Dehlawy wrote in one of his kitabs \"Dreams and Glad Tiding\". Many admirable incidence, one of which is his Father. He wrote :\"In my young days I loved to fast. After seeing all the different opinions of the Ulama, I began hesitating to fast. I saw Sayyidina Rasullullah Sallallahu 'Alayhi Wasallam in my dream in which he gave me a loaf of bread. Sayyidina Abubaker Siddique Radiyallahu 'Anhu was also sitting there and said \"Presents are shared\". I presented thje bread to him and he ate a piece from it. There after Sayyidina Umar Radiyallahu 'Anhu said \"Presents are shared\" I presented the bread to him also, and he took a piece from it. Sayyidina Uthmaan Radiyallahu 'Anhu then also said : \"Presents are shared\".<br><br>I then said \"If all of you will devide this bread amongst yourselves only, what will be left for me?\". Sayyidina Salman Faarisi Radiyallahu 'Anhu is from among the great Sahaabah. It is stated in the Hadith that when this Aayah was revealed :\"If you turn away, He will substitute another people instead of you.\"<br><br>\"O Messenger of Allah, who are those people who will take our place ?\" Sayyidina Rasulullah (Sallallhu alaihe wasallam) then patted Sayyidina Salmaan (radiallahu anhu) on his back and said: \"I swear by the Name of the Being in Whose Hands lie my life, if Imaan was suspended on Thurayya (Pleiades),the people of Faaris would have taken it from there also.\"<br><br>The ulama have written that this was a glad tiding in favour of Imaam Abu Hanifa (rahmatullahi alaihe). Sayyidina Salaam (radiallahu anhu) stated in detail how he had accepted Islam (Imaan). This detail is given in the books of hadith. Therein are mentioned the signs which prompted Sayyidina Salmaan (radiallahu anhu) to investigate Islam. Sayyidina Salmaan (radiallahu anhu) says that he was a resident in the province of Asbahaan, at a place called Jay. Sayyidina Salmaan narrates: \"My father was a headman and a leader of the locality. He loved me very much. I tried very hard to become a success in my old religion of Zorastrianism (fire worship), and thus became a caretaker of the temple. Once my father sent me on an errand for him. On the way I passed a Christian church. I went inside, and saw the Christians praying there. I liked what I saw there. I was attracted to this religion and remained in the Church till the evening. I enquired from Christians them where their headquarters were? They replied that it was in Shaam (Syria).<br><br>When I returned home in the evening, my family asked where I had been the whole day. I related to them what had happened. My father said: \"That religion is not good. Your religion and the religion of your forefathers is the best.\" I replied : \"Never, that religion (Christianity) is the best.\" My father, fearing that I would leave home, fastened a chain to my leg and locked me up in the house. I sent a message to the Christians that when the merchants from Shaam, who often came to trade, arrived, I should be informed. When the merchants arrived, they sent a message to me. At the time of their departure I cut loose the chains, ran away and joined the caravan to Shaam.<br><br>When I reached Shaam I enquired who was the best and most learned in this religion of Christianity. The people directed me to bishop. I went to him and informed him that I would like to become a Christian and stay in his company. He agreed. I began living with him but found him to be dishonest. He persuaded the people to give charity (tithe) and whatever he collected, he put into his personal treasure. He did not give the poor anything. After his death, another bishop was appointed in his place. He was a pious man, and did not care for material things. I began living with him and started to love him. When his end came near I asked him, who should I go to after his death. He replied that there was only one person in this world following the same path, and there was no one else besides him. He said: He lives in Mosul and you must go to him. After the bishop's death I went to the person in Mosul and related my story to him. He allowed me to stay in his service. He was a very good person. When his end came near I asked him that after his death, who should I go to? He replied that I should go to a person in Naseebayn.<br><br>After his death I went to Naseebayn. Where I related my story to the resident bishop who agreed to keep me in his service. He was a good man. Again, when his end came near, I asked him the same question. He replied that I should go to a certain place in Ghamurya. I went to Ghamurya and began living with the bishop there. Here I worked and learned too. As a result I owned some cattle and sheep. When the Bishop of Ghamurya's end came near, I asked: \"Now what should I do?\" He took an oath and said: \"There is no learned person anymore who follows our path\". The time has come near when the last of all Prophets will appear, who will follow the religion of Ibrahim (Alaihis salaam). He will be born in `Arabia'. He will migrate to such a place where many dates grow and on both sides of this place the soil is stony. The Prophet will accept gifts, but will not eat from Sadaqah. The Seal of Prophethood will be between his two shoulders. (This is the sign of Prophethood and for this reason Sayyidina Salmaan radiallahu anhu looked for the seal). If you can go to this place, try to do so.\"<br><br>After the bishop's death a few traders from the tribe of Banu Kalb passed Ghamurya. I said to them:\"If you take me with you to Arabia, I will give you in return these cattle and sheep\". They accepted and brought me to Wadi al Qura (Mecca Mukarramah). I gave them the cattle and sheep but they oppressed me. They said I was a slave and sold me. A jew from the tribe of Banu Qurayzah bought me and took me to Madinah. I recognized the signs that the bishop of Ghamurya had explained to me. I said to myself, ` This is that place'. I lived there till Sayyidina Rasulullah (Sallallahu alaihe wasallam) migrated from Mecca Mukarramah to Madinah Munawwarah. Sayyidina Rasulullah (Sallallahu alaihe wasallam) was in Quba at that time. When I heard of of Sayyidina Rasulullah Sallallahu alaihe wasallam, whatever I owned I took with and presented it to him and said: \"This is from Sadaqah.\" Sayyidina Rasulullah (Sallallahu alaihe wasallam) did not partake any of it. I said to myself that one sign has been fulfilled and I returned to Madinah and collected a few things. In the meantime Sayyidina Rasulullah (Sallallahu alaihe wasallam) came to live in Madinah. I presented something’s (dates, food etc) and said: \"This a gift.\" Sayyidina Rasulullah (Sallallahu alaihe wasallam) accepted the gift, I said to myself that the second sign has also been fulfilled. Thereafter I attended his noble assembly. Sayyidina Rasulallah (Sallallahu alaihe wasallam) was at the Baqi (attending a Sahabi's funeral). I greeted him and made an attempt to look at his back. Sayyidina Rasulallah (Sallallahu alaihe wasallam) understood what I was doing and lifted his sheet. I saw the Seal of the Prophet and in zeal bowed towards it. I kissed it and cried. Sayyidina Rasulullah (Sallallahu alaihe wasallam) said: \"Come in front of me.\" I came before him and related the whole story. After that I continued serving my Jewish master in slavery. Once Sayyidina Rasulullah (Sallallahu alaihe wasallam) said: \"Make an agreement with your master to make you a mukaatab (one who purchases his own freedom).\" I made an agreement with my master he made two conditions. The first was that I should pay forty uqqiyyah cash in gold. (One uqqiyyah is forty dirhams and a dirham is 3 to 4 maashaa, 3g to 4g). The second condition was that I should plant 300 date palms and tend them till they bear fruit. Sayyidina Rasulullah (Sallallahu alaihe wasallam) planted the date palms with his own hands (as is mentioned above). It happened that some gold arrived from somewhere for Sayyidina Rasulullah (Sallallahu alaihe wasallam). He gave this to Sayyidina Salmaan (radiallahu anhu) and told him to go and pay it his master. Sayyidina Salmaan (radiallahu anhu) asked : \"Will this gold be enough as the amount is much more. \"Sayyidina Rasulullah (Sallallahu alaihe wasallam) replied: \"It will not be surprising if Allah Ta'aala fulfils the need with this gold.\" I took the gold and weighing it paid the amount of forty uqqiyyah. (Jamul Fawaaid)<br><br>From this incident it is evident that Sayyidina Rasulullah (Sallallahu alaihe wasallam) buying Sayyidina Salmaan (radiallahu anhu) over from slavery meant he had paid the money so that Sayyidina Salmaan (radiallahu anhu) could a makaatab. Sayyidina Rasulullah (Sallallhu alaihe wasallam) planted the palms with his own hands and gave the gold that was stipulated in the agreement. Sayyidina Salmaan (radiallahu anhu) says: \"I was a slave of ten different people.\" In the Battle of Khandaq, a trench was dug according to his advice, otherwise there was no knowledge of digging trenches.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900210",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800210",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Chapter 02. Seal Of Nubuwwah (Prophethood) Of Rasoolullah",
    "babNumber": "2",
    "babName": "Chapter 02. Seal Of Nubuwwah (Prophethood) Of Rasoolullah",
    "hadithNumber": "21",
    "hadithText": "Abi Nadrah AI-'Awfee RA. reports: \"I asked Abu Sa'eed Khudari Radiyallahu 'Anhu about the Seal of Prophethood of Rasulullah sallailahu 'Alayhi Wasallam. He said: 'It was a piece of raised flesh that was on Rasulullah Sallallahu 'Alayhi Wasallam's back\".</b>",
    "bookID": "2.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900220",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800220",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Chapter 02. Seal Of Nubuwwah (Prophethood) Of Rasoolullah",
    "babNumber": "2",
    "babName": "Chapter 02. Seal Of Nubuwwah (Prophethood) Of Rasoolullah",
    "hadithNumber": "22",
    "hadithText": "Abdullah bin Sarjas Radiyallahu 'Anhu says: \"I came to Rasulullah Sallallahu 'Alayhi Wasallam while there were people sitting in his company. I went around to the back of Rasulullah Sallallahu 'Alayhi Wasallam (The narrator may have done this physically). Rasulullah Sallallahu 'Alayhi Wasallam understood what I was trying to do. He removed the sheet (body wrap) from his back. I saw the place of the Seal of Prophethood between his two shoulders. It was like a cluster surrounded by til (moles) which appeared to be like a wart. I came before Rasulullah Sallallahu 'Alayhi Wasallam and said to him. May Allah forgive you (or Allah has forgiven you, as is mentioned in Surah Fath, 'That Allah may forgive you, your former and your latter sins'). Rasulullah Sallallahu 'Alayhi Wasallam replied: 'May Allah forgive you too'. The people said to me that Rasulullah Sallallahu'Alayhi Wasallam has made du'aa for your maghfirah (forgiveness). I replied: 'Yes, and for you too, because Allah Ta'aala has said: 'O Muhammad, seek forgiveness for yourself and the Mu'min males and females also\"'. (That is why Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam asked for the forgiveness of Muslims).</b>",
    "bookID": "2.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900230",
    "last_updated": "2012-04-26 07:00:00"
  }
]