[
  {
    "englishURN": "1801230",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Chapter 21. The Pillow Of Rasoolullah",
    "babNumber": "21",
    "babName": "Chapter 21. The Pillow Of Rasoolullah",
    "hadithNumber": "123",
    "hadithText": "Jaabir bin Samura radiyallahu anhu reports, \"I observed Rasoolullah sallallahu alaihe wasallam lean on a pillow which was on his left side\".</b>",
    "bookID": "21.0",
    "grade1": "",
    "grade2": "",
    "comments": "It is permissible to put a pillow on both the right and left as stated in the hadith. The left is mentioned but only incidentally according to the rules and regulations of the muhadditeen (hadith scholars) the left side is not mentioned in the well -known narrations. Imam tirmizi has for this reason commented on this at the end of the chapter.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901300",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801240",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Chapter 21. The Pillow Of Rasoolullah",
    "babNumber": "21",
    "babName": "Chapter 21. The Pillow Of Rasoolullah",
    "hadithNumber": "124",
    "hadithText": "Abu Bakrah radiyallahu anhu relates that, \"Rasoolullah sallallahu alaihe wasallam once said, :Must I show you a great sin, from among the greatest sins?\" The sahaabah replied, \"Yes O Rasoolullah sallallahu alaihe wasallam, do tell us.\" Rasoolullah sallallahu alaihe wasallam replied, \"To ascribe a partner unto Allah. To disobey one's parents. To bare false witness, (or tell a lie). (The narrator is not sure which of the two Sayyidina Rasoolullah sallallahu alaihe wasallam had said). At that time Rasoolullah sallallahu alaihe wasallam was leaning on something. When he mentioned lies, he sat up, and because of its importance began to repeat it many times, till we began hoping that he would stop, and not repeat it so many times\".</b>",
    "bookID": "21.0",
    "grade1": "",
    "grade2": "",
    "comments": "The reason for the sahaabah radiyallhu anhum wishing that Sayyidina Rasoolullah sallallahu alaihe wasallam should stop repeating it, is because of their love for Sayyidina Rasoolullah sallallhu alaihe wasallam, and there fear that he would become tired. It is enough to say a thing once. It could be possible that he might have become angry, or that in anger, Sayyidina Rasoolullah sallallahu aliahe wasallam might say something that would become a cause of loss to the ummah. Those who attend these type of religious or wordly assemblies are well aware of such situations. Sayyidina Rasoolullah sallallhu alaihe wasallam repeated it to show its importance. Lies and falsehood inevitably gets a person involved in adultery, murder and many other sins. Sayyidina Rasoolullah sallallahu alaihe wasallam also said, \"When a person lies, the angels stay a distance of a mile away from him because odour it causes in person's mouth\". He has also said, \"A believer cannot be a liar\". Sayyidina Abu Bakr Siddique radiyallahu Anhu says, \"Stay away from lies, because lies keep away Imaan.\" (Al-Itidaal)",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901310",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801250",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Chapter 21. The Pillow Of Rasoolullah",
    "babNumber": "21",
    "babName": "Chapter 21. The Pillow Of Rasoolullah",
    "hadithNumber": "125",
    "hadithText": "Abu Juhayafah radiyallahu anhu reports that: \"Rasulullah sallallahu alaihe wasallam said: 'I do not lean when I have meals.'\"</b>",
    "bookID": "21.0",
    "grade1": "",
    "grade2": "",
    "comments": "This manner of eating is against humility, and it drives one to eat more. Soem people are of the opinion that it results in creating a large tummy, and the food also does not digest quickly. Sayyidina Rasulullah sallallahu alaihe wasallam mentions himself so that he may be emulated. The Ulama write that there are four methods of leaning, and all four are included here. The first is to lean with either side of the body on a wall, pillow, etc. The second is to lean with the palms on the ground. The third is to sit cross legged on a pillow. The fourth method is to lean with the back on a large pillow or wall. All these postures are included in the above prohibition.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901320",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801260",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Chapter 21. The Pillow Of Rasoolullah",
    "babNumber": "21",
    "babName": "Chapter 21. The Pillow Of Rasoolullah",
    "hadithNumber": "126",
    "hadithText": "Jaabir bin Samurah radiyallahu anhu says: \"I had seen Rasulullah sallallahu alaihe wasallam lean on a pillow.\"</b>",
    "bookID": "21.0",
    "grade1": "",
    "grade2": "",
    "comments": "This is the same Hadith mentioned at the beginning of the chapter. The author wanted to comment on this Hadith, therefore it is mentioned here.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901340",
    "last_updated": "2012-04-26 07:00:00"
  }
]