[
  {
    "englishURN": "1801420",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "143",
    "hadithText": "'Aayeshah Radiyallahu 'Anha says: \"Rasulullah Sallallahu 'Alayhi Wasallam once said: 'What a nice condiment vinegar is'\".</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "The reason being there is not much trouble in it. Bread can easily be eaten with it. It is always easily available. It also keeps away formalities. Besides one lives in this world for a little while. Vinegar has many benefits in it. It is an antidote for poison. It stops phlegm and gall. It helps digest food, kills the worms of the stomach and creates a good appetite. Due to its cold effect, it may not be good for some people. But it surely is a good curry which is obtained easily. In whatever way it is praised, its full benefits cannot be emphasised. It is stated in a hadith that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam ate it and said: 'What a wonderful curry it is'. In another hadith it is stated that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam made du'aa for barakah in it and said: \"It was the curry of the previous Ambiyaa also'. In one hadith it is stated, 'The house that has vinegar in it, will not be in need' i.e. That house will not be in need of curry. These narrations have been mentioned in the Jam 'ule Wasaa-il from Ibn Maajah.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901510",
    "last_updated": "2013-03-13 09:53:30"
  },
  {
    "englishURN": "1801430",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "144",
    "hadithText": "Nu'maan bin Bashir Radiyallahu 'Anhu says: \"Are you not in the luxuries of eating and drinking. Whereas I have seen Rasulullah Sallallahu 'Alayhi Wasallam not having ordinary types of dates to full his stomach\".</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "The Sahaabi's intention is to persuade one to follow the simple life of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam and that one lives in this world for only a short period. When in the hadith it is denied that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not have ordinary dates to fill his stomach then what about bread and curry?",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901520",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801440",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "145",
    "hadithText": "Jaabir bin 'Abdullah Radiyallabu 'Anhu relates that Rasullullah Sallallahu 'Alayhi Wasallam said: \"What a wonderful curry vinegar is?\".</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "It is possible that when Sayyidina Rasulullah Sallallahu 'Alayihi Wasallam said this, both Sayyiditina'Aayishah Radiyallahu 'Anha and Sayyidina Jaabir Radiyallahu'Anhu were present. It is more correct that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam said this on different occasions.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901530",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801450",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "146",
    "hadithText": "Zahdam Al-Jarmi RA.says that we were present in the assembly of abu Musa Ash'ari Radiyallahu 'Anhu. Fowl meat was served for food. A, person from among those present, moved back. Abu Musa Radiyalahu 'Anhu asked him the reason (for doing so). He replied 'I had seen the fowl eat something (dirty) so I swore an oath that I will not eat it'. Abu Musa Radiyallahu 'Anhu said: 'In that case, I had seen Rasulullah Sallallahu 'Alayhi Wasallam eat the meat of a fowl' (come and partake of it without fear. If it was not permissible or disliked, how did Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam eat it).</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "The object is that something which is permissible in shari'ah must not be prohibited. Break the oath and give kaffaarah. Eating of the fowl is permissible according to all the Imaams. The 'ulama have only stated that it is makruh to eat the Jalalah type of fowl. (Because it eats dirt). The effect of the fowl is hot and moist (according to the physicians). It digests quickly, creates good humour (body fluids) in the body. It strengthens the brain and the main parts of the body, clears the voice, and gives the body a good complexion. It strengthens the senses too.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901540",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801460",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "147",
    "hadithText": "Safeena Radiyallahu 'Anhu says: \"I ate the meat of Hubaa-raa with Rasulullah Sallallahu 'Alayhi Wasallam\".</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "Hubaa-raa is a type of a bird. The 'ulama differ on its meaning. Some say it is Ta'dha-ri. Some say it is Batera (quail), others say it is Sarkhaab. Some translations say it is Chaka Chakoi. It is written in the 'Muheet Aa'zam' that Hubaa-raa is called Ho-barah, Shawaat and Sha-waal in Persian. In Turkish it is called Tau'adh-ri, and in Hindi Charz. It is a wild bird and has a greyish colour, a large neck and long legs, the beak is also slightly large, and it flies at a speed. It is also known as jarj. The Greeks call it Ghalofas. In size it is between a Heron and a water fowl. The author of 'Lughatus Sa-raah' has also translated Hubaa-raa as Shawaat. In Mazaahire Haq it is translated as Ta'dhari. Other authors have also translated it as Ta'dhari. For this reason Ta'dhari is more correct. The author of 'Ghayaath' has written both Ta'dhari and Charz. -The author of 'Babrul Jawaahir' has also translated it as Ta'dhari and Charz. He writes that it is also called Sarkhaab. But the author of 'Muheet' has written that Sarkhaab, which is also called Chakwa is another type of bird. The author of 'Nafaa'is' say the 'Arabic of Chakwa and Sarkhaab is Nahaam. Therefore it is more correct that Sarkhaab is another bird.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901550",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801470",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "148",
    "hadithText": "Zahdam Al-Jarmi RA. says: \"We were present in the company of Abu Musa Ash'ari. Food was presented to him in which there was fowl meat also. Among those present was a person from the tribe of Banu Taymillah who was reddish in colour and seemed a freed slave. He moved back and sat on one side. Abu Musa asked him to come near (and partake of the food) and related to him that Rasulullah Sallallahu 'Alayhi Wasallam also ate the meat of a fowl. He excused himself saying: 'I had seen it eating such a thing which makes me dislike eating it. For this reason I had sworn an oath that I shall not eat it'\".</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "This is the same hadith that has been mentioned previously. Because of the difference in the chain of narrators, there is also a difference in the describing of the narration. Both ahaadith are described in brief in the Shamaa-il. This incident is mentioned in detail in the Bukhaari, where it is stated that in the end Sayyidina Abu Musa Ash'ari Radiyallahu 'Anhu told him to partake of the fowl and give a kaffaarah for the oath. What does it mean, or what is derived by swearing an oath not to eat a thing which is halaal?",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901560",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801480",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "149",
    "hadithText": "Abu Usayd Radiyallahu 'Anhu says. \"Rasululah Sallallahu 'Alayhi Wasallam said: 'Use olive oil in eating and for rubbing (on the body), for it is from a mubaarak (blessed) tree\"'.</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "The blessedness of this tree has been mentioned in the Qur-aan in the aayah \"... from a blessed tree, an olive neither of the East nor of the West... \"- Suralt An Nur, 35. The 'ulama have mentioned different reasons for its blessedness. Some say it is mostly grown in Syria and the earth of Syria is blessed because seventy prophets were sent to it. Some say it is blessed because of its many benefits. Abu Nu'aym says: 'It has a cure for seventy diseases of which one is leprosy'. Sayyidina Ibn 'Abbaas Radiyallahu 'Anhu says: 'Every part of the olive is beneficial. The oil is used for burning and cooking. It is also used for tanning. Its wood is used for firewood. The ash of the olive is -especially good for washing silk'. It is said that the olive tree has a long life. It bears fruit after forty years and has a life span of a thousand years. It's numerous benefits are mentioned in the books of tibb.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901570",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801490",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "150",
    "hadithText": "It is related from 'Umar Radiyallahu 'Anhu that Rasulullah Sallallahu Aayhi Wasallam said: \"Use olive oil in cooking and rubbing (on the body) because it is from a mubaarak tree\".</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "The reason for mentioning this hadith in the practices of Sayyidina Rasulullah Sallallahu'Alayhi Wasallam is, that if he encouraged the use of olives, he must have used it himself.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901580",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801500",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "151",
    "hadithText": "Anas bin Maalik Radiyallahu 'Anhu says: \"Rasulullah Sallallahu 'Alayhi Wasallam loved gourd (dubbaa-dodhi-kadu). Once food - was presented to Rasulullah Sallallahu'Alayhi Wasallam or he attended an invitation. (The narrator doubts on which occasion this took place) where gourd was served. I knew Rasulullah Sallallahu'Alayhi Wasallam loved it. I searched for pieces from the curry and presented it to him\".</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "We gather from this that if there are many things in a plate, then it is permissible to take a thing which one likes from the other side of the plate, provided the next person does not feel offended. The reason for searching for pieces of gourd is because it was the custom to have more gravy in the curry. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam also advised us to have more gravy in the curry so that the neighbours may also benefit.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901600",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801510",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "152",
    "hadithText": "Jaabir bin Taariq Radiyallahu 'Anhu says: \"I attended the assembly of Rasulullah Sallallahu 'Alayhi Wasallam. I observed, they were busy cutting a gourd into pieces. I inquired: 'What shall be made of this'. He replied: 'It will add to our food'\".</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "The 'ulama have mentioned many benefits of gourd (dubba-dodhi- kadu). Its benefits are also mentioned in the books of tibb. It strengthens the brain and senses.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901610",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801520",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "153",
    "hadithText": "Anas bin. Maaik Radiyalahu 'Anhu says: \"A tailor once invited Rasululluh Sallallahu 'Alayhi Wasallam. I also attended the invitation with Rasululluh Sallallahu 'Alayhi Wasallam. He served Rasululluh Sallallahu 'Alayhi Wasallam bread made of barley, and gravy with meat and gourd (dubba-dodhi) in it. I saw Rasululluh Sallallahu 'Alayhi Wasallam look for pieces of gourd from all sides of the plate. From that time I also began loving gourd\".</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "Sayyidina Anas Radiyalahu 'Anhu may have also been invited or may have accompanied Sayyidina Rasululluh Sallallahu 'Alayhi Wasallam. There is no harm if one accompanies an invited guest to an invitation provided the host does not feel offended.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901620",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801530",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "154",
    "hadithText": "'Ayeshah Radiyallahu 'Anha says: \"Rasulullah SaIlallahu 'Alayhi Wasallam loved halwa and honey\".</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "Halva here apparently means anything sweet. Some are of the opinion that it is a special type of halva that is made of sweetmeats and ghee The first person to present halva to Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. was Sayyidina 'Uthman Radiyallahu. 'Anhu. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam liked it. This halva was made of flour, ghee and honey. Sugar was not commonly used in those times. Sweetening agents were derived from honey or dates.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901630",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801540",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "155",
    "hadithText": "Umm Salamah Radiyallahu 'Anha says \"I presented a roasted side portion of meat to Rasulullah Sallallahu 'Alayhi Wasallam. He ate it and (thereafter) performed salaah, without performing wudu\".</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "It is found in some ahaadith that things cooked on fire nullifies the wudhu. This was also the madh-hab of the 'ulama mutaqaddimeen. The madh-hab of the Khulafaa-rashideen, the four imaams and the majority of the Ulema is that those ahaadeeth wherein the necessity of Wudu is mentioned has been abrogated. This hadith of Sayyiditina Umm Salamah Radiyallahu 'Anha also supports the madh-hab of the majority that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not perform wudhu again (after eating the cooked meat) before salaah.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901640",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801550",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "156",
    "hadithText": "Abdullah bin Haarith Radiyallahu'Anhu says... \"We ate roasted meat with Rasulullah Sallallahu 'Alayhi Wasallam in the masjid\".</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "From this we find that it is permissible to eat and drink in the masjid, on condition that the masjid does not become untidy, otherwise it is makruh to do so. It is possible that this was at the time of i'tikaaf (in Ramadaan). It was the practice of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam to observe i'tikaaf every year, and at that time it is obvious that one eats in the masjid.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901650",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801560",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "157",
    "hadithText": "Mughirah bin Shu'bah Radiyallahu'Anhu says: \"One night I became a guest with Rasulullah Sallallahu 'Alayhi Wasallam. At the time of meals a roasted side portion of meat was served. Rasulullah Sallallahu 'Alayhi Wasallam cut pieces from it and gave me to eat. During this period Bilaal came and called out the adhaan. Rasulullah Sallallahu 'Alayhi Wasallam said: 'May his both hands be in dust. What made him call out the adhaan now'. He put down the knife and went for salaah\". Mughirah Radiyallahu 'Anhu says \"(Another thing that happened) that my moustache had grown long. Rasulullah Sallallahu 'Alayhi Wasallam said: 'Come let me put a miswaak on it and trim it', or said, 'Put a miswaak on it and trim it'. (One of the narrators are in doubt as to which of the two Rasulullah Sallallahu 'Alayhi Wasallam had said).</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "There are a few important matters to be discussed here. The first is that Sayyidina Mughirah Radiyallahu 'Anhu became a guest of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. The 'ulama give two meanings to this. This is also strengthened by other narrations. One is that the word 'together' (with) is extra. The object is that I became a guest of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. As a host he had a side portion roasted and cut pieces from the meat and gave me to eat. The narration in Tirmidhi is more appropriate to this subject. The narration in Abu Daawud on this is clear and the words mentioned are this: 'I became a guest of Rasulullah Sallallahu 'Alayhi Wasallam'. The, second meaning is that Sayyidina Rasulullah Sallailahu 'Alayhi Wasallam and I were the guests of a third person. The word 'together, in the narration supports this. In this case, for Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam to cut the meat and feed the guest was to create love and brotherhood.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901660",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801570",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "158",
    "hadithText": "Abu Hurayrah Radiyallahu 'Anhu says: \"Meat was sent to Rasulullah Sallallahu 'Alayhi Wasallam from someone. From it the forequarter was presented to Rasulullah Sallallahu 'Alayhi Wasallam. He loved this portion (of the meat too). Rasulullah Sallallahu 'Alayhi Wasallam tore the meat with his teeth and ate it\". (He did not use a knife to cut it).</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam has encouraged the use of the teeth to eat. It is related in the hadith, that it should be torn and eaten, because it digests properly and it is more suitable to the body.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901670",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801580",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "159",
    "hadithText": "Ibn Mas'ud Radiyallahu 'Anhu says: \"Rasulullah Sallallahu 'Alayhi Wasallam loved the meat of the forequarter. Rasulullah Sallallahu 'Alayhi Wasallam was-given poison in the dhiraa portion of the meat. It is suspected that the Jews poisoned him'.</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "Aafter -Khaybar was conquered, a Jewess living there, came to know that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam loved the dhiraa portion of the meat. She roasted the meat of a goat and mixed a poison in it, and especially put more in the dhiraa part. She invited Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam and served the meat. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam took a bite but did not swallow it, or may have swallowed a bit of it then spat it out and said. 'I have been informed by this meat that there is poison in it\", some of the poison affected him. The poisonous effect sometimes became severe, and at the time of his demise it began to take effect again and was the cause of his martyrdom. In this hadith it is mentioned that the meat itself informed Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam that there was poison in it. In other narrations it is stated that Jibra'eel 'Alayhis Salaam informed him of this. There is no contradiction, is both are possible, first the meat must have informed him as a mu'jizah (miracle), thereafter Jibra'eel 'Alayhis Salaam came and affirmed it After receiving the information, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam stopped eating it and prohibited the Sahaabah Radiyallahu 'Anhum from eating it too. Later the woman was called and asked if poison was mixed in the meat? She confessed that she had poisoned the meat. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not avenge himself and the woman was pardoned at that time. But later Sayyidina Bishr bin Baraa Radiyallahu 'Anhu was martyred due to eating the poisoned meat. We find in a few narrations that the woman was later killed as a punishment, or as an example to others. There are different narrations from which we gather that she was punished. In others that she was not punished. Both are correct, as is gathered from the original incident. According to the shari'ah for such a deed it is waajib to punish the murderer or blood money taken. This is a fiqhi question and the 'ulama hold different opinions, which needs an academic discussion, therefore, it is omitted here. Sayyidina Ibn Mas'ud Radiyallahu 'Anhu\" saying that it is suspected that the Jewess poisoned the meat, is according to his thoughts, it seems he did not investigate this incident, otherwise the original incident has been ascertained. The Jewess also confessed her crime as is mentioned in other narrations.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901680",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801590",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "160",
    "hadithText": "Abu 'Ubayd Radiyallahu 'Anhu says: \"I cooked a pot (food) for Rasulullah Sallallahu 'Alayhi Wasallam. Because Rasulullah Sallallahu 'Alayhi Wasallam loved the dhiraa (forequarter of a goat or sheep) a lot, I served him that portion. He then ordered another one, I served the ,second one. He then ordered one again. I replied: 'Ya Rasulullah (Sallallahu 'Alayhi Wasallam) the goat has only two dhiraa'. Rasulullah Sallallahu 'Alayhi Wasallam then said: 'I swear an oath by the Name of that Being in whose hands is my life, if you kept quiet, you could have served me every time I requested one'\".</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "This was a mu'jizah (miracle) of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. In Musnad Ahmad, a similar incident is narrated from Sayyidina Abu Raafi' Radiyallahu 'Anhu. This incident apparently happened to both of them. There is nothing surprising because there are many such incidents found in the life of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, which Qaadi 'Iyaad has mentioned in his book 'Shifaa'. Sayyidina Abu Ayyub Ansaari Radiyallahu 'Anhu once invited Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam and Sayyidina Abubakr Radiyallahu 'Anhu and prepared food that was enough for two people only. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam requested him to invite thirty respected people from among the Ansaar. He invited them and after they had eaten, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam said: 'Now invite sixty people'. After they had eaten, others were invited. In short, the food was enough for one hundred and eighty people.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901690",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801600",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "161",
    "hadithText": "'Aayeshah Radiyallahu 'Anha says: \"Rasulullah Sallallahu 'Alayhi Wasallam liked the dhiraa portion of meat not because of its tastiness, but because meat was only available occasionally, and this portion the meat cooked quickly. Rasulullah Sallallahu 'Alayhi Wasallam also liked it as it saved time and he could return quickly to his commitments\".</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "In the narration, it is stated that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam liked the dhiraa part of the meat. It is possible there were many reasons for him liking this portion. Among them is also the one related by Sayyiditina 'Aayeshah Radiyallahu 'Anha. Sayyiditina 'Aayeshah Radiyallahu 'Anha denies Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam liked the dhiraa portion and this denial apparently seems to be that it appears the liking of the dhiraa portion because of greed and desire, which is against the dignity of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, otherwise there is no denial of his liking only that portion of the meat.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901700",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801610",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "162",
    "hadithText": "Abdullah bin, Ja'far Radiyallahu 'Anhu says: \"Rasulullah Sallallahu 'Alayhi Wasallam said: \"The best meat is that of the back portion.\"</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "There is no contradiction between this and other narrations in which it is mentioned that he liked the meat of the dhiraa portion. Due to different reasons and the quality, both can be good. For example, strengthwise or it having less fibre, more fat etc. Therefore due to different aspects, both could be preferred and also be excellent.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901710",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801620",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "163",
    "hadithText": "'Aayeshah Radiyallahu 'Anha says that Rasulullah Sallallahu 'Alayhi Wasallam said. \"Vinegar is an excellent curry\".</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "This has been mentioned in a few hadith in this chapter.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901720",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801630",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "164",
    "hadithText": "Hazrat Umme Haani radiyallahu anha (a cousin of Sayyidina Rasoolullah sallallahu alaihe wasallam) says, Rasoolullah sallallahu alaihe wasallam came to me (to my house at the time when Makkah was conquered) and asked if there was something to eat. I replied, \"Nothing besides dry bread and vinegar.\" Rasoolullah sallallahu alaihe wasallam said, \"Bring it. That house is not without a curry which has vinegar in it.\"</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901730",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801640",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "165",
    "hadithText": "Hazrat Abu Musa Ash'ari radiyallahu anhu says that Rasoolullah sallallahu alaihe wasallam said, The virtues of Aishah (radiyallahu anha) over other women is the same as the virtue of thareed over other foods.</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "From this hadith we learn the excellence and superiority of Sayyidatina Aishah radiyallahu anha over the other women, and thareed over other foods. Thareed is a delicacy in which bread is mixed with gravy. Besides being tasty and nourishing, it digests quickly and easily, and has other benefits too. It is a custom in Arabia to eat this delicacy, and was counted amongst the best foods.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901740",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801650",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "166",
    "hadithText": "Hazrat Anas ibn Malik radiyallahu anhu says, Rasoolullah sallallahu alaihe wasallam said, \"The virtue and excellence of Aishah over all other women is like the excellence of thareed over other foods.\"</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "The object of Imam Tirmizi in mentioning this narration is to show that Sayyidina Rasoolullah sallallahu alaihe wasallam loved thareed. We gather from different narrations that Sayyidina Rasoolullah sallallahu alaihe wasallam ate thareed regularly.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901750",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801660",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "167",
    "hadithText": "Hazrat Abu Hurairah radiyallahu anha says that he once saw Rasoolullah sallallahu alaihe wasallam eat a piece of cheese then perform wudhu. Then he saw him at another time eat a shoulder of a goat, and perform salaah without performing wudhu.</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "In the early stages of Islam, wudhu would become nullified after taking food and drink cooked on fire. Later this law was abrogated. It is possible that Sayyidina Rasoolullah sallallahu alaihe wasallam performed wudhu after eating cheese in the days when wudhu became nullified after eating things that were cooked on fire, or he may have performed wudhu due to some other reason. For example, he may have performed wudhu again whilst still being in the state of wudhu, or due to some reason the wudhu may have become invalid. From the explanation given by Sayyidina Abu Hurairah radiyallahu anhu we gather that in the early stages of Islam, Sayyidina Rasoolullah sallallahu alaihe wasallam performed wudhu after eating things cooked on fire. Later this law was abrogated, that is why he did not perform wudhu after eating the mutton.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901760",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801670",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "168",
    "hadithText": "Hazrat Anas ibn Malik radiyallahu anhu reports, Rasoolullah sallallahu alaihe wasallam celebrated the waleemah of Safiyyah radiyallahu anha with dates and saweeq (sattu).</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "Saweeq (sattu) is a drink made of parched barley. Sayyidatina Safiyyah bint Huyay ibn Akhtab radiyallahu anha was from a Jewish family and from among the offsprings of Haroon alaihis salaam. In the year AH 7, after the Battle of Khaibar, she was taken as a slave.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901770",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801680",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "169",
    "hadithText": "Hazrat Salma radiyallahu anha says that Hazrat Hasan, Hazrat Abdullah ibn Abbas and Hazrat Abdullah ibn Ja'far Sadiq radiyallahu anhum came to her and said, Cook for us the food that Rasoolullah sallallahu alaihe wasallam liked and ate with pleasure. She replied, O my children, you will not like it now. (It was only liked in times of hardships.) They replied, Of course, we will surely like it. She got up and took a bit of barley, (crushed it) and put it in a pot, and poured a little olive oil over it, then crushed some chillies and spices and added it to the pot and served it, saying, This is what Rasoolullah sallallahu alaihe wasallam loved (and ate with pleasure).</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901780",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801690",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "170",
    "hadithText": "Hazrat Jabir ibn Abdullah radiyallahu anhu says, Rasoolullah sallallahu alaihe wasallam came to our house. We slaughtered a goat in his honour. Rasoolullah sallallahu alaihe wasallam said, \"It is as if they knew we adore meat.\" (Imam Tirmizi says, This hadith has a long incident, of which a portion is mentioned briefly here.)</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "It is said that this is a part of the incident which is mentioned in the books of hadith on the subject of the Battle of Khandaq, wherein a miracle of Rasoolullah sallallahu alaihe wasallam is also mentioned. Sayyidina Jabir radiyallahu anhu says, I saw the sign of hunger on Rasoolullah sallallahu alaihe wasallam. I went home and asked if there was some food. We had a lamb, and some barley in a bag. I slaughtered the lamb and my wife ground the barley into flour. The meat was put in a pot to cook and I went to Rasoolullah sallallahu alaihe wasallam and quietly said to him, â€˜Some food is ready.â€™ I invited Rasoolullah sallallahu alaihe wasallam and a few companions.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901790",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801700",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "171",
    "hadithText": "Hazrat Jabir radiyallahu anhu says, Rasoolullah sallallahu alaihe wasallam once went to the house of a woman from among the Ansaar. I also accompanied him. The hostess slaughtered a goat for Rasoolullah sallallahu alaihe wasallam. He ate some meat from it. She then served a tray of fresh dates. Rasoolullah sallallahu alaihe wasallam ate some from it also. He then performed wudhu for Zuhr and performed the Zuhr salaah. After returning from the salaah she served from the remaining meat. Rasoolullah sallallahu alaihe wasallam ate from it. He did not perform wudhu for the Asr salaah (and performed salaah with the previous wudhu).</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "It can be argued from this hadith that it is not necessary to perform wudhu after eating something that has been cooked on a fire. Proof may also be obtained from this hadith that Sayyidina Rasoolullah sallallahu alaihe wasallam ate twice in a day. For this reason it could be said that where it has been narrated that Sayyidina Rasoolullah sallallahu alaihe wasallam ate only once a day, it may have been said according to the knowledge of the narrator. It may also be said that in those narrations, the filling of the stomach twice has been denied, but eating twice has not been denied. A little may have been eaten the second time.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901800",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801710",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "172",
    "hadithText": "Hazrat Umme Munzir radiyallahu anha says, Rasoolullah sallallahu alaihe wasallam visited me. Hazrat Ali radiyallahu anhu was with him. We had some bunches of dates hanging. Rasoolullah sallallahu alaihe wasallam began eating from them. Hazrat Ali radiyallahu anhu also began eating with him. Rasoolullah sallallahu alaihe wasallam stopped him saying, \"You have just recovered from your illness and should not eat this.\" He (Ali radiyallahu anhu) stopped and Rasoolullah sallallahu alaihe wasallam continued eating. Hazrat Umme Munzir radiyallahu anha says, I then cooked some barley and beetroot. Rasoolullah sallallahu alaihe wasallam said to Hazrat Ali radiyallahu anhu, \"Eat this, it is suitable for you.\"</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "From this hadith we derive that to give consideration to the asbaab (causes) is not against tawakkul (complete faith and reliance in Allah). This has been discussed in detail in (Imam Ghazaliâ€™s) Ihyaa-ul-Uloom. Those who wish may refer to it there.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901810",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801720",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "173",
    "hadithText": "Ummul Mu'mineen Hazrat Aishah radiyallahu anha says, Rasoolullah sallallahu alaihe wasallam used to come to me and ask if there was any food available. When I would say, \"No,\" he would say, \"I have intended to fast.\"\nOnce when Rasoolullah sallallahu alaihe wasallam came and enquired, I replied, ‘We have received a present.’  \nRasoolullah sallallahu alaihe wasallam asked, ‘What is it?’  \nI replied, ‘Malidah (a type of cake made of dates, ghee, cheese or flour).’  \nHe said, ‘I had made an intention of fasting already.’ He then ate some from it.</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "Two mas’alahs are derived from this hadith. One is that the intention of a nafl fast could be made any time before half of the day has passed, on condition that nothing that nullifies the fast had been committed. Sayyidina Rasoolullah sallallahu alaihe wasallam made the intention (of fasting) after enquiring from Syyidatina Aishah radiyallahu anha. This is the Madh’hab of the Hanafis and Shafi’is. The Madh’hab of Imam Malik rahmatullahi alaihe is that intention of a nafl fast is necessary from night. In this mas’alah we gain support from the above hadith. But because it is against the Madh’hab of a reputed Imam, it is better if the intention of nafl fast is made during the night. If due to circumstances this could not be done, there is no harm if the intention is made a little before Zuhr on that day.  \r\nThe second mas’alah is, if one has observed a nafl fast, one has the option of breaking it. This is the Madh’hab of Imam Shafi’i. According to the Hanafisit is impermissible to break a fast or salaah, because of the verse, ‘Do not nullify your deeds.’ (47:32) But since we find from this hadith the breaking of the fast, we may act on both in the following manner. Due to an important factor or necessity we may regard it as a concession from this hadith, normally it is impermissible to break the fast without a reason. It is also clear from the hadith that this was the reason of Sayyidina Rasoolullah sallallahu alaihe wasallam breaking the fast. Some Ulama have explained that this sentance, “I made an intention of fasting,” was not a firm intention but just a thought that I shall fast today. According to this humble servant the first explanation is correct.  \r\nMas’alah: According to the Hanafis, because of some necessity, if a nafl fast is broken, then it will be wajib to observe a recompensation. It has been narrated in a hadith from Sayyidatina Aishah radiyallahu anha wherein Sayyidina Rasoolullah sallallahu alaihe wasallam told her to observe a recompensation on another day.  ",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901820",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801730",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "174",
    "hadithText": "Yusuf ibn Abdullah ibn Salaam says, I once observed Rasoolullah sallallahu alaihe wasallam take a piece of bread and put a date on it and say, \"This (date) is the curry for this (bread).\" He then ate it.</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "Because dates were not regarded as a curry, Sayyidina Rasoolullah sallallahu alaihe wasallam suggested that dates could be used in place of curry. The few days of oneâ€™s life could also be covered in this manner. One should spend oneâ€™s life in things that will benefit in the Hereafter and forever. It should be pondered upon, and all of oneâ€™s time should not be wasted in maintaining and nourishing the stomach. It is very foolish to do so, because the few days we are granted in this world will, in any way pass. Death brings an end to all difficulties. We should ponder on those things that even death cannot bring an end to.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901830",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801740",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "25",
    "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "babNumber": "25",
    "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
    "hadithNumber": "175",
    "hadithText": "Hazrat Anas radiyallahu anhu says, Rasoolullah sallallahu alaihe wasallam liked to eat the remains (known as \"powpra\" in Gujarati).</b>",
    "bookID": "25.0",
    "grade1": "",
    "grade2": "",
    "comments": "This is the sign of the complete humbleness of Sayyidina Rasoolullah sallallahu alaihe wasallam. He first fed others, then chose for himself what was left over. There are many instances in the ahaadith that inform us of this. Some Ulama state that the reason for this is because food at the bottom is less fatty and also digests quickly.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901840",
    "last_updated": "2012-04-26 07:00:00"
  }
]