[
  {
    "englishURN": "1801750",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "26",
    "bookName": "Chapter 26. Rasoolullah Performing Wudu At The Time Of Eating",
    "babNumber": "26",
    "babName": "Chapter 26. Rasoolullah Performing Wudu At The Time Of Eating",
    "hadithNumber": "176",
    "hadithText": "Ibn'Abbaas Radiyallahu'Anhu says: \"Once when Rasulullah Sallailahu 'Alayhi Wasallam came out of the toilet, after relieving himself from the call of nature, food was served to him. They asked if water for wudu should be brought? He replied: 'I have been commanded to perform wudu when 1 perform salaah'\".</b>",
    "bookID": "26.0",
    "grade1": "",
    "grade2": "",
    "comments": "Technical wudu is only waajib for salaah. It is not necessary to perform wudu before eating or immediately after relieving one's self. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not perform wudu for it must not be thought that wudu is compulsory after visiting the toilet.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901850",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801760",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "26",
    "bookName": "Chapter 26. Rasoolullah Performing Wudu At The Time Of Eating",
    "babNumber": "26",
    "babName": "Chapter 26. Rasoolullah Performing Wudu At The Time Of Eating",
    "hadithNumber": "177",
    "hadithText": "Ibn 'Abbaas Radiyallahu 'Anhu relates: \"Rasulullah Sallallahu 'Alayhi Wasallam once, after relieving himself in the toilet, came out, and was served food. The Sahaabah inquired: 'Will you not perform wudu?'. Rasulullah Saliallahu 'Alayhi Wasallam replied: 'Do I have to perform salaah, that wudu must be performed?'\"</b>",
    "bookID": "26.0",
    "grade1": "",
    "grade2": "",
    "comments": "It has been mentioned in the previous hadith, that it is not mustahab to perform wudu before eating. It is better to be in the state of wudu at all times. Physical cleanliness has an effect on spiritual cleanliness. It is therefore recommended that wudhu be performed after visiting the toilet.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901860",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801770",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "26",
    "bookName": "Chapter 26. Rasoolullah Performing Wudu At The Time Of Eating",
    "babNumber": "26",
    "babName": "Chapter 26. Rasoolullah Performing Wudu At The Time Of Eating",
    "hadithNumber": "178",
    "hadithText": "Salmaan Faarisi Radiyallahu 'Anhu says: \"I have read in-the Tauraah, that performing wudu (washing the hands) after eating increases blessings. I mentioned this to Rasulullah Sallailahu 'Alayhi Wasallam. Rasulullah Sallallahu 'Alayhi Wasallam said: \"Wudu before and after eating (washing the hands and mouth) increases blessings.\"</b>",
    "bookID": "26.0",
    "grade1": "",
    "grade2": "",
    "comments": "It may be possible that only the time (after eating) is mentioned in the Tauraah. In this manner the other time (before eating) was added to the shari'ah of Muhammad Sallailahu 'Alayhi Wasallam. Many laws have been revealed that were not in the shari'ah of the previous ambiyaa. It is possible that both times are mentioned in the Tauraah, and since changes have been made to it, the law of washing the hands before eating, may have been removed from it. The 'ulama have stated that by 'Barakah (blessings) in washing the hands before eating', means increase in the food, and filling of the stomach. The 'Barakah of washing the hands after eating', means that the benefits and intention of eating is fulfilled. i.e. It becomes part of the body, creates energy and stamina, assists in strengthening one to perform 'ibaadah, and to possess good manners.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901870",
    "last_updated": "2012-04-26 07:00:00"
  }
]