[
  {
    "englishURN": "1801870",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "29",
    "bookName": "Chapter 29. The Fruits Eaten By Rasoolullah",
    "babNumber": "29",
    "babName": "Chapter 29. The Fruits Eaten By Rasoolullah",
    "hadithNumber": "188",
    "hadithText": "Abdullah ibn Jaafar radiyallahu anhu says, Rasoolullah sallallahu alaihe wasallam ate Qith'thaa (cucumbers) with dates</b>",
    "bookID": "29.0",
    "grade1": "",
    "grade2": "",
    "comments": "Cucumber has a cold effect and dates have a hot one. By combining the two it becomes mild. From this hadith we gather that it is recommended that the effect (hot or cold) of things eaten should be taken into consideration. Cucumber is insipid and tasteless, and dates are sweet which results in the cucumber also tasting sweet.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901970",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801880",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "29",
    "bookName": "Chapter 29. The Fruits Eaten By Rasoolullah",
    "babNumber": "29",
    "babName": "Chapter 29. The Fruits Eaten By Rasoolullah",
    "hadithNumber": "189",
    "hadithText": "Aisha radiyallah anha reports that, Rasoolullah sallallahu alaihe wasallam ate watermelon with fresh dates.</b>",
    "bookID": "29.0",
    "grade1": "",
    "grade2": "",
    "comments": "In Tirmidhi and other narrations, in explaining this, Sayyidina Rasoolullah sallallahu alaihe wasallam also said, The cold effect of one removes the heat of the other, and the heat of one removes the cold effect of the other.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901980",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801890",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "29",
    "bookName": "Chapter 29. The Fruits Eaten By Rasoolullah",
    "babNumber": "29",
    "babName": "Chapter 29. The Fruits Eaten By Rasoolullah",
    "hadithNumber": "190",
    "hadithText": "Anas radiyallahu anhu says, I saw Rasoolullah sallallahu alaihe wasallam eat together musk-melon and dates.</b>",
    "bookID": "29.0",
    "grade1": "",
    "grade2": "",
    "comments": "Some ulama have translated this also as watermelon’ instead of musk-melon, the reason being, as in the first narration, here also the cold effect is intended. But it is clear that musk-melon is meant here. The reason for eating dates is also that it gives the melon a sweeter taste. It is not necessary that one’s benefit be gauged everywhere. It is possible that this is due to some other benefits. According to this humble servant the eating of watermelon with dates has its own benefit and that is to create evenness in the effect of both, so that it becomes mild. The eating of musk-melon with dates has its own benefit and that is that if the melon is insipid and tasteless, many a time, due to it being insipid sugar is mixed before it is eaten. Therefore it is not necessary to give the same reasons for both watermelon and musk-melon.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1901990",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801900",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "29",
    "bookName": "Chapter 29. The Fruits Eaten By Rasoolullah",
    "babNumber": "29",
    "babName": "Chapter 29. The Fruits Eaten By Rasoolullah",
    "hadithNumber": "191",
    "hadithText": "Aisha radiyallahu anha says, Rasoolullah sallallahu alaihe wasallam ate watermelon with fresh dates.</b>",
    "bookID": "29.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902000",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801910",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "29",
    "bookName": "Chapter 29. The Fruits Eaten By Rasoolullah",
    "babNumber": "29",
    "babName": "Chapter 29. The Fruits Eaten By Rasoolullah",
    "hadithNumber": "192",
    "hadithText": "Abu Hurairah radiyallahu anhu reports, When the people saw (picked their) new fruit, they used to come and present it to Rasoolullah sallallahu alaihe wasallam. Rasoolullah sallallahu alaihe wasallam then recited this du'a:<br><br><strong><u>Transliteration:</u></strong> Allahumma baarik lana fi thimaa-rina wa-baarik lanaa fi madinatinaa wa-baarik lanaa fi saa-'i-naa wa-fi muddinaa-Allahumma-inna Ebraahima 'ab-duka wa-kha-li-luka wa-nabiy-yuka wa-inna ab-duka wa-nabiy-yuka wa-in-nahu da'aa-ka li-makkata wa-inni ad'u-ka lil-madinati bi-mith-li maa da'aaka bihi li-makkata wa-mith-lahu ma'a-hu.<br><br><strong><u>Translation:</u></strong> O Allah! Bless us in our fruits. Bless us in our city. Bless us in our Saa', and bless us in our Mudd' (these are two measures used in Madinah to measure dates, etc.). O Allah verily Ibrahim alaihis salaam is Your servant, friend and Nabi (since it was an occasion for humbleness Sayyidina Rasoolullah sallallahu alaihe wasallam did not mention here his being the habib - beloved - of Alah.) And (whatever) he has supplicated to You for (colonising) Makkah. (Which is mentioned in the aayah, ...so incline some hearts of men that they may yearn towards them, and provide Thou them with fruits in order that they may be thankful. - Surah Ibrahim, 37) I supplicate the same to You for Madinah.\"<br><br>He then called a small child, to whom he gave that fruit.</b>",
    "bookID": "29.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902010",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801920",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "29",
    "bookName": "Chapter 29. The Fruits Eaten By Rasoolullah",
    "babNumber": "29",
    "babName": "Chapter 29. The Fruits Eaten By Rasoolullah",
    "hadithNumber": "193",
    "hadithText": "Rubayyi bint Mu'awwidh ibn Afraa radiyallahu anha says, My uncle Mu'aadh ibn Afraa sent me with a plate of fresh dates, which had small cucumbers on it, to Rasoolullah sallallahu alaihe wasallam. Rasoolullah sallallahu alaihe wasallam relished cucumbers. I took this to him. At that time some jewellery had been sent to Rasoolullah sallallahu alaihe wasallam from Bahrain. He took a handful from it and gave it to me</b>",
    "bookID": "29.0",
    "grade1": "",
    "grade2": "",
    "comments": "Besides the previously mentioned benefits of cucumbers and dates, it makes the body plump too. Sayyiditina Aisha radiyallahu anha relates that, After my marriage, when the time came for me to go and live with Rasoolulla sallallahu alaihe wasallam, my mother thought I be a bit plump and my build become better. She gave me cucumbers and dates to eat. As a result my body became nice and plump.<br><br>It is related in a weak hadith that Sayyiditina Aisha radiyallahu anha said that Sayyidina Rasoolullah sallallahu alaihe wasallam ate cucumber with salt. It is possible that he at times ate it with salt and at times with dates. Sometimes one prefers something that is sweet and at other times a thing that is salty.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902020",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801930",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "29",
    "bookName": "Chapter 29. The Fruits Eaten By Rasoolullah",
    "babNumber": "29",
    "babName": "Chapter 29. The Fruits Eaten By Rasoolullah",
    "hadithNumber": "194",
    "hadithText": "Rubayyi bint Mu'awwidh ibn Afraa radiyallahu anha said, I took a plate of fresh dates and small cucumbers to Rasoolullah sallallahu alaihe wasallam. He gave me a handful of jewellery, or a handful of gold</b>",
    "bookID": "29.0",
    "grade1": "",
    "grade2": "",
    "comments": "This is the same hadith mentioned above. Here it is mentioned briefly. The narrator doubts if it was jewellery or gold.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902030",
    "last_updated": "2012-04-26 07:00:00"
  }
]