[
  {
    "englishURN": "1801940",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Chapter 30. Description Of The Things Rasoolullah Drank",
    "babNumber": "30",
    "babName": "Chapter 30. Description Of The Things Rasoolullah Drank",
    "hadithNumber": "195",
    "hadithText": "Aisha radiyallahu anha says, The drink most liked by Rasoolullah sallallahu alaihe wasallam was that which was sweet and cold</b>",
    "bookID": "30.0",
    "grade1": "",
    "grade2": "",
    "comments": "Apparently cold and sweet water is mentioned here. In the narration mentioned by Abu Dawood and others it is clearly stated, and there also may be a probability that sharbat of honey or nabeedh of dates are meant, as has been mentioned in the chapter on the cup of Sayyidina Rasoolullah sallallahu alaihe wasallam. Sayyidina Rasoolullah sallallahu alaihe wasallam did not pay much attention to food. Whatever was available was eaten, but sweet and cold water was given importance. Sweet water was brought for Sayyidina Rasoolullah sallallahu alaihe wasallam from a place called Suqya, which is a few kilometres from Madinah. Sayyidina Rasoolullah sallallahu alaihe wasallam also added the following du’aa in the words of Dawood alaihis salaam, that O’ Allah grant me such love for You, which is more beloved to me than my life, wealth, wife, children, and cold water.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902040",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801950",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Chapter 30. Description Of The Things Rasoolullah Drank",
    "babNumber": "30",
    "babName": "Chapter 30. Description Of The Things Rasoolullah Drank",
    "hadithNumber": "196",
    "hadithText": "Ibn Abbas radiyallahu anhu reports, Khalid ibn Waleed and I both accompanied Rasoolullah sallallahu alaihe wasallam to the house of Maymunah. (Ummul Mu'mineen, Maymunah radiyallahu anha was the maternal aunt of both). She served milk in a vessel. Rasoolullah sallallahu alaihe wasallam drank from it. I was on his right and Khalid ibn Waleed on his left. Rasoolullah sallallahu alaihe wasallam said the right of drinking is now yours (as you are on the right). If you so wish you could give your right to Khalid. I replied that I would give no one preference from your left over. After that Rasoolullah sallallahu alaihe wasallam said, Whenever Allah feeds one something, this du'aa should be recited:<br><br>Allahumma baarik lanaa fihi wa-at'imanaa khayram minhu.<br><br>(<strong>Translation</strong>: O Allah grant us barakah in it, and feed us something better than it.)<br><br>Whenever Allah gives someone milk to drink one should read:<br><br>Allahumma baarik lanaa fihi wa-zidnaa minhu.<br><br>(<strong>Translation</strong>: O Allah grant us barakah in it and increase it for us.)<br><br>Sayyidinaa Ibn Abbas radiyallahu anhu says that after having something Rasoolullah sallallahu alaihe wasallam made du'aa for something better than it. And after drinking milk he taught to make du'aa for the increase of it, because Rasoolullah sallallahu alaihe wasallam said, There is nothing that serves both as food and water excepting milk.</b>",
    "bookID": "30.0",
    "grade1": "",
    "grade2": "",
    "comments": "Sayyidina Rasoolullah sallallahu alaihe wasallam chose to give the milk first to Sayyidina Ibn Abbas radiyallahu anhu because he was sitting on the right, and Sayyidina Khalid ibn Waleed radiyallahu anhu on the left. As is mentioned in many ahaadith that the cup etc. should be passed from right to left, Sayyidina Rasoollullah sallallahu alaihe wasallam requested the giving of preference to Sayyidina Khalid ibn Waleed radiyllahu anhu, as he was elder. It was also intended to educate Sayyidina Ibn Abbas radiyallahu anhu that, though it was his right, it is better to give an elder preference. But the love Sayyidina Ibn Abbas radiyallahu anhu had for Sayyidina Rasoolullah sallallahu alaihe wasallam naturally made him not give up this right for the left over milk of Sayyidina Rasoolullah sallallahu alaihe wasallam.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902050",
    "last_updated": "2012-04-26 07:00:00"
  }
]