[
  {
    "englishURN": "1801960",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "babNumber": "31",
    "babName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "hadithNumber": "197",
    "hadithText": "Ibn Abbas radiyallahu anhu says, Rasoolullah sallallahu alaihe wasallam drank Zam-zam water while he was standing</b>",
    "bookID": "31.0",
    "grade1": "",
    "grade2": "",
    "comments": "Sayyidina Rasoolullah sallallahu alaihe wasallam has prohibited the drinking of water whilst standing. This shall be discussed in the commentary of the next hadith. For this reason some ulama have prohibited the drinking of Zam-zam also whilst standing. They say that he drank it whilst standing because of the huge crowds and the rush, or as a concession. The well-known view of the ulama is that Zam-zam is not included in this prohibition. It is better to stand and drink it.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902060",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801970",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "babNumber": "31",
    "babName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "hadithNumber": "198",
    "hadithText": "Amr ibn Shu'aib radiyallahu anhu relates from his father, and he from his (Amr's) grandfather, that he said, I had seen Rasoolullah sallallahu alaihe wasallam drinking water whilst standing and also whilst sitting.</b>",
    "bookID": "31.0",
    "grade1": "",
    "grade2": "",
    "comments": "There are many narrations mentioned wherein Sayyidina Rasoolullah sallallahu alaihe wasallam prohibited the drinking of water whilst standing. A narration of Sayyidina Abu Hurairah radiyallahu anhu is mentioned in Sahih Muslim that Sayyidina Rasoolullah sallallahu alaihe wasallam said, No person should stand and drink water, and if one forgetfully stood and drank it, it should be vomited out. Some ulama have summed both the deed and the prohibition in a few ways. Some ulama are of the opinion that the prohibition came later and repeals the previous law. Some ulama hold the opposite view that the narrations where he stood and drank water repeals the one that prohibits it. According to a well-known saying, the prohibition is not that of a Shar’ee or unlawful nature, but as an etiquette. It is also a blessing and kindness. Ibn Qayyim and others have mentioned the harm that standing and drinking causes. In short, Sayyidina Rasoolullah sallallahu alaihe wasallam standing and drinking shows it being permissible to do so, and that it is not haraam to stand and drink water. It is best not do so, as this is against the recommended practice and one will be committing a makrooh act by doing so.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902070",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801980",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "babNumber": "31",
    "babName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "hadithNumber": "199",
    "hadithText": "Ibn Abbas radiyallahu anhu says, I gave Rasoolullah sallallahu alaihe wasallam Zam-zam water to drink. He stood and drank it</b>",
    "bookID": "31.0",
    "grade1": "",
    "grade2": "",
    "comments": "This has been discussed in the first hadith of this chapter.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902080",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1801990",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "babNumber": "31",
    "babName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "hadithNumber": "200",
    "hadithText": "Nazzaal ibn Sabrah rahmatullahi alaihe says that while he was with Sayyidina Ali in the courtyard (of the Masjid at Kufah), water was brought in a clay pot to him. He took some water in his palms, washed his hands, gargled his mouth, put water in his nose (cleaned it), then made masah of his face, hands and head. Thereafter he stood and drank from it. Then said, This is the wudhu of a person who is in a state of wudhu. I had observed Rasoolullah sallallahu alaihe wasallam perform (wudhu) in this manner.</b>",
    "bookID": "31.0",
    "grade1": "",
    "grade2": "",
    "comments": "This hadith is mentioned in brief. The full narration is mentioned in Mishkat from Bukhari. In this hadith it may be possible that in reality he only made masah of the face, hands, etc. And did not actually wash them. To call this wudhu will be metaphorical.<br><br>The feet are not mentioned here but presumably he did masah of them also.<br><br>Another elucidation may be that in this hadith the washing of the limbs lightly has been metaphorically explained as masah.<br><br>This explanation is supported by some narrations where, instead of masah, washing of the face and hands and also the washing of the feet is mentioned. In this case the renewal of wudhu is meant. This exposition is best according to this humble servant.<br><br>We also find from this hadith that it is permissible to stand and drink the left over water after wudhu. The permissibility of drinking this water and the water of Zam-zam while standing is mentioned in the kitaabs of fiqh (jurisprudence). Allaamah Shaami has mentioned the experience of some Ulama that it is a tested and proved antidote for diseases. Mulla Ali Qari has mentioned this act as meritorious in the commentary of the Shamaail.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902090",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802000",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "babNumber": "31",
    "babName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "hadithNumber": "201",
    "hadithText": "Sayyidina Anas ibn Malik radiyallahu anhu relates that Rasoolullah sallallahu alaihe wasallam drank water in three breaths (i.e. in three gulps/sips) and used to say, It is more pleasing and satisfying in this manner</b>",
    "bookID": "31.0",
    "grade1": "",
    "grade2": "",
    "comments": "It has been prohibited to drink water in one gulp. The Ulama have written many harmful effects in drinking water in one breath. It especially weakens the muscles and nerves. It is also detrimental for the liver and stomach.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902100",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802010",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "babNumber": "31",
    "babName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "hadithNumber": "202",
    "hadithText": "Sayyidina Ibn Abbas radiyallahu anhu says, Whenever Rasoolullah sallallahu alaihe wasallam drank water, he drank it in two breaths.</b>",
    "bookID": "31.0",
    "grade1": "",
    "grade2": "",
    "comments": "In this hadith drinking water in two breaths is intended which apparently seems correct. Sayyidina Ibn Abbas radiyallahu anhu has stated in a hadith of the Prophet sallallahu alaihe wasallam, Do not drink water only in one breath, but drink it in two or three breaths. The minimum number of sips one can take is mentioned in this hadith. Sayyidina Rasoolullah sallallahu alaihe wasallam at times drank water in two sips to show that this was the minimum amount of gulps one could take. Another explanation may be this that in the hadith it meant that two breaths should be taken whilst drinking water. If two breaths are taken whilst drinking water, then all the water will naturally be drunk in three gulps. By this explanation there remains no contradiction between this and the last hadith.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902110",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802020",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "babNumber": "31",
    "babName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "hadithNumber": "203",
    "hadithText": "Sayyidatina Kabshah bint Thabit radiyallahu anha narrates, Rasoolullah sallallahu alaihe wasallam visited my home. A leather water bag was hanging there, Rasoolullah sallallahu alaihe wasallam stood and drank water from the mouth of the water bag. I got up and cut out the mouth (portion) of the bag.</b>",
    "bookID": "31.0",
    "grade1": "",
    "grade2": "",
    "comments": "Imam Nawawi has mentioned two reasons from Imam Tirmizi for cutting the mouth portion of the water bag:<br><br>1. Tabarrukan (for barakah), because the mubaarak saliva of Sayyidina Rasoolullah sallallahu alaihe wasallam had come in contact with it and she wanted to keep it.<br><br>2. She did not want anybody else to drink from the same portion where Sayyidina Rasoolullah sallallahu alaihe wasallam had drank. The reason being respect and courtesy. It will be disrespectful if someone else drank from the same place. There are two things mentioned in this hadith. One is standing and drinking which has already been discussed in Hadith 4. The second is that it is reported in the Bukhari from Sayyidina Anas radiyallahu anhu that it has been prohibited to drink from the mouth of a water bag. Therefore we shall take this hadith to show the permissibility of doing so. It is related in a hadith that a person was drinking from a water bag and a snake came out from it. On hearing this Sayyidina Rasoolullah sallallahu alaihe wasallam forbade the drinking of water direct from a water bag.<br><br>According to this hadith, the drinking of water in this manner apparently seems to have taken place in the early period. A special note should be made here. One of the reasons of prohibiting the drinking of water in this manner is that every person’s mouth is not such that if it touches a water bag etc. it will not leave a smell. Certainly there are mouths whose saliva is a cure of diseases, and which is more tastier than everything in the world and creates more happiness than everything else. Therefore the drinking of Sayyidina Rasoolullah sallallahu alaihe wasallam from a water bag cannot be compared with others.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902120",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802030",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "babNumber": "31",
    "babName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "hadithNumber": "204",
    "hadithText": "Sayyidina Thumaamah ibn Abdullah radiyallahu anhu says, Sayyidina Anas ibn Malik drank water in three breaths, and claimed that Rasoolullah sallallahu alaihe wasallam also drank water in the same manner.</b>",
    "bookID": "31.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902130",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802040",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "babNumber": "31",
    "babName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "hadithNumber": "205",
    "hadithText": "Sayyidina Anas radiyallahu anhu reports, Rasoolullah sallallahu alaihe wasallam went to my mother, Umme Sulaim's house. A leather water bag was hanging there. Rasoolullah sallallahu alaihe wasallam stood and drank water from it. Umme Sulaim radiyallahu anha stood up and cut off that portion of the bag</b>",
    "bookID": "31.0",
    "grade1": "",
    "grade2": "",
    "comments": "The same type of incident of Sayyidatina Kabshah radiyallahu anha has been related in another hadith. It is however difficult to sit and drink from a water bag which is hanging. These are things that are done in times of necessity. A few ahaadith reported on the incident of Sayyidatina Umme Sulaim radiyallahu anha that she said, while cutting off the mouth piece of the water bag from which Sayyidina Rasoolullah sallallahu alaihe wasallam had drank, No one shall put their mouth on it and drink from it again. We understand from this that she did it out of love and respect for Sayyidina Rasoolullah sallallahu alaihe wasallam.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902140",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802050",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "babNumber": "31",
    "babName": "Chapter 31. Hadith Describing The Manner Rasoolullah Drank",
    "hadithNumber": "206",
    "hadithText": "Sayyidina Sa'd ibn Abi Waqqaas radiyallahu anhu says, Rasoolullah sallallahu alaihe wasallam drank water while standing.<br><br></b>",
    "bookID": "31.0",
    "grade1": "",
    "grade2": "",
    "comments": "<br>This was not a habit, he did it now and then due to some reason. This has been discussed already.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902150",
    "last_updated": "2012-04-26 07:00:00"
  }
]