[
  {
    "englishURN": "1802120",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "33",
    "bookName": "Chapter 33. The Speech Of rasoolullah",
    "babNumber": "33",
    "babName": "Chapter 33. The Speech Of rasoolullah",
    "hadithNumber": "213",
    "hadithText": "Aisha radiyallahu anha relates that the speech of Rasoolullah sallallahu alaihe wasallam was not quick and continuous as that of yours. He spoke clearly, word for word. A person sitting in his company remembered what he said.</b>",
    "bookID": "33.0",
    "grade1": "",
    "grade2": "",
    "comments": "The speech of Sayyidina Rasoolullah sallallahu alaihe wasallam was not of an abridged nature or was it fast, that nothing could be understood. He spoke calmly and clearly, word for word. A person sitting by him remembered what he said.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902230",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802130",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "33",
    "bookName": "Chapter 33. The Speech Of rasoolullah",
    "babNumber": "33",
    "babName": "Chapter 33. The Speech Of rasoolullah",
    "hadithNumber": "214",
    "hadithText": "Anas ibn Maalik radiyallahu anhu says, Rasoolullah sallallahu alaihe wasallam (sometimes) repeated a word (as was necessary) thrice, so that his listeners understood well what he was saying</b>",
    "bookID": "33.0",
    "grade1": "",
    "grade2": "",
    "comments": "If what he was explaining was difficult or it was something that had to be given a thought, or if there were many people, he faced all three sides and repeated it to every side, so that those present understood well what he was said. Repeating a thing thrice was maximum. If saying a thing twice only sufficed, he only said it twice.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902240",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802140",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "33",
    "bookName": "Chapter 33. The Speech Of rasoolullah",
    "babNumber": "33",
    "babName": "Chapter 33. The Speech Of rasoolullah",
    "hadithNumber": "215",
    "hadithText": "Imaam Hasan radiyallahu anhu says, I asked my (maternal) uncle Hind ibn Abi Haalah, who always described the noble features of Rasoolullah sallallahu alaihe wasallam to describe to me the manner in which Rasoolullah sallallahu alaihe wasallam spoke. He replied that Rasoolullah sallallahu alaihe wasallam was always worried (about the hereafter). And always busy thinking (about the attributes of Allah and the betterment of the Ummah). Because of these things he was never free from thought and never rested (or because of worldly affairs he did not gain rest, but gained rest and contentment from religious well being. It is mentioned in the hadith that the coolness of my eyes is in salaah). He always spoke clearly from beginning to end. (He did not speak in a manner where only half sentences are spoken and the other half remained in the mind of the speaker, as is prevalent among snobbish high-minded and proud people). He spoke concisely, where the words are less and meaning more. (Mulla Ali Qaari has collected forty such ahaadith in his commentary which are very short. Those who wish may refer to it and memorise it). Every word was clearer than the previous one. There was no nonsensical talk, nor was there half-talks where the meaning was not complete and could not be grasped. He was not short-tempered, nor did he disgrace anyone. He always greatly appreciated the blessings of Allah even though it might be very minute, he did not criticize it.<br><br>He did not criticize food, nor over-praised it (The reason for not criticizing food is clear, that it is a blessing from Allah. The reason for not praising it is because it might be felt that one is gluttonous. Nevertheless, he praised food if it was to make someone happy, and sometimes praised some special things). He was never angered for anything materialistic. (The reason being that he did not pay much attention, and did not care much about materialistic things).<br><br>If someone exceeded the limits in religious matters or against the truth, he became so angry that no one could endure it, nor could anybody stop it till he avenged it. If for some reason he made a gesture or pointed at something, he did it with a full hand. (The ulama say the reason being that it is against humbleness to point with one finger only. Some ulama say it was his noble habit to signal oneness of Allah with one finger, therefore he did not signal anyone in that manner). When he was surprised by something he turned his hands, and when he spoke sometimes while talking, he moved his hands, he sometimes hit the palm of his right hand with the inside part of his left thumb. When he became angry with someone, he turned his face away from that person, and did not pay attention to that person or he forgave that person. When he was happy due to humility it seemed as if he had closed his eyes. The laugh of Rasoolullah sallallahu alaihe wasallam was mostly a smile, at that moment his mubarak front teeth glittered like white shining hailstone</b>",
    "bookID": "33.0",
    "grade1": "",
    "grade2": "",
    "comments": "This hadith is the remaining portion of the seventh hadith mentioned in the first chapter. Every sentence of it should be read carefully and one should try to emulate them as much as possible. Every action of Sayyidina Rasoolullah sallallahu alaihe wasallam is complete in humbleness and etiquette. Sayyidina Hind ibn Abi Haalah radiyallahu anhu is a step brother of Sayyiditina Faatimah radiyallahu anha.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902250",
    "last_updated": "2012-04-26 07:00:00"
  }
]