[
  {
    "englishURN": "1802150",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "34",
    "bookName": "Chapter 34. The Laughing Of Rasoolullah",
    "babNumber": "34",
    "babName": "Chapter 34. The Laughing Of Rasoolullah",
    "hadithNumber": "216",
    "hadithText": "Jaabir ibn Samurah radiyallahu anhu says, The calf of the leg of Rasoolullah sallallahu alaihe wasallam was slightly thin. His laugh was only that of a smile. Whenever I visited Rasoolullah sallallahu alaihe wasallam, I thought he used kuhl on his eyes. Whereas he had not at that time used kuhl</b>",
    "bookID": "34.0",
    "grade1": "",
    "grade2": "",
    "comments": "Verily the eyes of Sayyidina Rasoolullah sallallahu alaihe wasallam was like that which had kuhl on it.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902260",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802160",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "34",
    "bookName": "Chapter 34. The Laughing Of Rasoolullah",
    "babNumber": "34",
    "babName": "Chapter 34. The Laughing Of Rasoolullah",
    "hadithNumber": "217",
    "hadithText": "Abdullah ibn Haarith radiyallahu anhu reports, I did not see anyone who smiled more than Rasoolullah sallallahu alaihe wasallam.</b>",
    "bookID": "34.0",
    "grade1": "",
    "grade2": "",
    "comments": "A question arises from this hadith, that in that last hadith of the previous chapter, it is stated that Sayyidina Rasoolullah sallallahu alaihe wasallam always remained in deep thought and sorrow. This seems to contradict that hadith. Two explanations are given to the hadith. The first is that the meaning of the hadith is that Sayyidina Rasoolullah sallallahu alaihe wasallam smiled more than he laughed. No other person was seen, whose smile was more than his laugh. In a further hadith which is reported from that same Sahaabi, this has been clearly elucidated. The second explanation is that Sayyidina Rasoolullah sallallahu alaihe wasallam besides being naturally worried, smiled and appeared cheerful so that the Sahaabah radiyallahu anhum might feel at ease and comfortable. This is the pinnacle of humbleness and good character. In the fifth and sixth hadith of this chapter, Sayyidina Jarir radiyallahu anhu says that whenever Sayyidina Rasoolullah sallallahu alaihe wasallam saw me, he met me with a cheerful smile. There now remains no contradiction with the first hadith. Many times it so happens that a person is sad and worried, but to keep others happy, or for some other reason one has the opportunity to meet them cheerfully. Those who have in their hearts a mark of love, experience this many times.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902270",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802170",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "34",
    "bookName": "Chapter 34. The Laughing Of Rasoolullah",
    "babNumber": "34",
    "babName": "Chapter 34. The Laughing Of Rasoolullah",
    "hadithNumber": "218",
    "hadithText": "Abdullah ibn Haarith radiyallahu anhu relates, The laugh of Sayyidina Rasoolullah sallallahu alaihe wasallam was but a smile</b>",
    "bookID": "34.0",
    "grade1": "",
    "grade2": "",
    "comments": "That means he smiled more often. There were fewer occasions where he laughed.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902280",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802180",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "34",
    "bookName": "Chapter 34. The Laughing Of Rasoolullah",
    "babNumber": "34",
    "babName": "Chapter 34. The Laughing Of Rasoolullah",
    "hadithNumber": "219",
    "hadithText": "Abu Dhar radiyallahu anhu says, Rasoolullah sallallahu alaihe wasallam said, I know that person well who will enter Jannah first and also that person who will be the last one to be taken out of Jahannam. On the Day of Qiyaamah a person will be brought forward to the court of Almighty Allah. It shall be commanded that all the minor sins of that person be put forward to him and the major sign be concealed. When the minor sins are disclosed to that person, he will accept that he had committed them, as there will be no room for refuting them. (He will begin to tremble and say in his heart that these are only the minor sins, what will happen when the major sins are exposed.) During this happening it shall be commanded that for every sin of that person he be given the ajr (thawaab-reward) of a good deed. Upon hearing this person himself will say I still have many sins left to account for, that are not seen here.<br><br>Abu Dhar radiyallahu anhu says, Rasoolullah sallallahu alaihe wasallam while narrating the words of that person began laughing until his mubarak teeth began to show. (The reason being that the person himself disclosed the very sins he was frightened of.)</b>",
    "bookID": "34.0",
    "grade1": "",
    "grade2": "",
    "comments": "This person whose case is being narrated in detail is the same person of whom it was first described in brief that he will be the last one to enter Jannah, or it may be another person. The person who will enter Jannah last is the one whose incident is mentioned in the seventh hadith of this chapter.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902290",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802190",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "34",
    "bookName": "Chapter 34. The Laughing Of Rasoolullah",
    "babNumber": "34",
    "babName": "Chapter 34. The Laughing Of Rasoolullah",
    "hadithNumber": "220",
    "hadithText": "Jabir ibn Abdullah radiyallahu anhu says, After I accepted Islam, Rasoolullah sallallahu alaihe wasallam never prohibited me from attending his assemblies. Whenever he saw me he laughed.<br><br>In the second narration it is stated that he smiled</b>",
    "bookID": "34.0",
    "grade1": "",
    "grade2": "",
    "comments": "The second narration is mentioned because it may be known that by laughing as mentioned in the first hadith, it is meant that Sayyidina Rasoolullah sallallahu alaihe wasallam smiled. This smile is to show happiness, as to meet one cheerfully makes one feel at ease. I have observed that my elders at times met visitors with such happiness and cheerfulness that the visitor may feel that happiness is being felt by our coming.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902300",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802200",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "34",
    "bookName": "Chapter 34. The Laughing Of Rasoolullah",
    "babNumber": "34",
    "babName": "Chapter 34. The Laughing Of Rasoolullah",
    "hadithNumber": "221",
    "hadithText": "Same as the above hadith.</b>",
    "bookID": "34.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902310",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802210",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "34",
    "bookName": "Chapter 34. The Laughing Of Rasoolullah",
    "babNumber": "34",
    "babName": "Chapter 34. The Laughing Of Rasoolullah",
    "hadithNumber": "222",
    "hadithText": "Abdullah ibn Mas'ood radiyallahu anhu said, I know the person who will come out last from the fire. He will be such a man who will crawl out (due to the severity of the punishment of Jahannam he will not be able to walk). He will then be ordered to enter Jannah. He will go there and find that all the places therein are occupied. He will return and say, \"O Allah the people have taken all the places.\" It will be said to him \"Do you remember the places in the world?\" (That when a place gets filled, there remains no place for a newcomer. And a person that arrives first occupies as much as one pleases, there remains no place for the ones that arrive later. The elders have translated it in this manner. According to this humble servant, if the meaning of it is taken as follows, it seems more appropriate, that do you remember the vastness and plentiness of the world and how big the world was. He is being reminded, because an announcement is going to be made that a place that is ten times greater than the world shall be given to him. After imagining the vastness of the world once, it may be assessed how great this gift is?). He will reply, \"O my creator, I remember well.\" It will be commanded to him \"Make your wish in whichever way your heart desires.\" He will put forward his desires. It shall be commanded. All your desires are fulfilled and in addition ten times the size of the world is granted to you. He will reply, \"Are you jesting with me O my Allah, and You are the King of the Kings?\" (There is no place in Jannah and You are granting me a place ten times greater than the world). Sayyidina Ibn Mas'ood radiyallahu anhu said, I saw Rasoolullah sallallahu alaihe wasallam laugh till his mubarak teeth showed, when he related this portion of the man's reply.</b>",
    "bookID": "34.0",
    "grade1": "",
    "grade2": "",
    "comments": "The laughing of Sayyidina Rasoolullah sallallahu alaihe wasallam was due to his happiness on granting His Mercies and Bounties on a person who is the last to be taken out of Jahannam. From this it is clear that the person was the most sinful (Muslim). Yet he was so greatly rewarded in this manner. What about the general Muslims, and especially the pious, what great Mercies and Bounties shall be showered on them? The more bounties the Ummah will receive, the more it becomes a reason for Sayyidina Rasoolullah sallallahu alaihe wasallam to become happy. It is possible that Sayyidina Rasoolullah sallallahu alaihe wasallam laughed, because that person, who after experiencing the great hardships and punishment, came out of Jahannam. Yet he had the audacity to express his desires and also say that Allah was joking.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902320",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802220",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "34",
    "bookName": "Chapter 34. The Laughing Of Rasoolullah",
    "babNumber": "34",
    "babName": "Chapter 34. The Laughing Of Rasoolullah",
    "hadithNumber": "223",
    "hadithText": "Ali ibn Rabiah radiyallahu anhu says, I was present when a conveyance (A horse or something) was brought to Hazrat Ali radiyallahu anhu (in the period of his khilafah). He recited Bismillah and put his leg in the stirrup. After he had mounted he said Alhamdulillah and recited this dua:<br><br><strong>Translation</strong>: Glorified be He Who hath sudued those unto us, and we were not capable (Of subduing them); And lo! Unto our Lord we are returning. (Surah Zukhruf 13-14)<br><br>(The ulama say that a conveyance could be a means of death. Therefore subjugation of a conveyance with gratitude towards Allah for His Mercy, and death are mentioned together. After all a person has to return to Allah after death). Ali radiyallahu anhu then said Alhamdulillah three times, Allahu Akbar three times, then recited:<br><br><strong>Translation</strong>: Glorified be Thou! Behold, I have wronged myself. So forgive thou me. Indeed, non forgiveth sins but Thou.<br><br>Then (Sayyidina Ali radiyallahu anhu) laughed (smiled). I said to him, \"What is the reason for laughing, O Ameerul Mumineen?\" He replied, \"Rasoolullah sallallahu alaihe wasallam also recited these duas in this manner and thereafter laughed (smiled). I also inquired from Rasoolullah sallallahu alaihe wasallam the reason for laughing (smiling) as you have asked me. Rasoolullah sallallahu alaihe wasallam said, \"Allah Ta'ala becomes happy when His servants say, 'No one can forgive me save You.' My servant knows that no one forgives sins besides me.</b>",
    "bookID": "34.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902330",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802230",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "34",
    "bookName": "Chapter 34. The Laughing Of Rasoolullah",
    "babNumber": "34",
    "babName": "Chapter 34. The Laughing Of Rasoolullah",
    "hadithNumber": "224",
    "hadithText": "Aamir bin Sa'd radiyallahu anhu says, My father Sa'd said, \"Rasoolullah sallallahu alaihe wasallam laughed on the day of the Battle of Khandaq till his teeth showed.\" Aamir radiyallahu anhu says, \"I asked why did he laugh?\" he replied, \"A Kaafir had a shield, and Sa'd was a great archer. The kaafir protected himself by swaying the shield from side to side covering his forehead. (Sayyidina Sa'd radiyallahu anhu was a famous marksman, but the kaafir did not let the arrows get him). Sa'd radiyallahu anhu took an arrow (and kept it ready in the bow). When the non believer removed the shield from his head, he quickly aimed at the kaafir and did not miss the target, i.e. the (enemy's) forehead. The enemy immediately fell down, his legs rising into the air. On that Rasoolullah sallallahu alaihe wasallam laughed till his mabaraak teeth showed.\" I asked, \"Why did Rasoolullah sallallahu alaihe wasallam laugh?\" He replied, \"Because of what Sa'd had done to the man.\"</b>",
    "bookID": "34.0",
    "grade1": "",
    "grade2": "",
    "comments": "It may be doubted that Sayyidina Rasoolullah sallallahu alaihe wasallam laughed because the man’s feet were raised in the air, hence the satr (private parts) was exposed. Therefore the reason for laughing had to be asked. Sayyidina Sa’d radiyallahu anhu replied, No, but because I, although a good marksman, the non believer protected himself. He was clever to move his shield from side to side. But Sa’d thought of a plan, and aimed at him in such a way that he did not have a chance to protect himself and fell down.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902340",
    "last_updated": "2012-04-26 07:00:00"
  }
]