[
  {
    "englishURN": "1802240",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "35",
    "bookName": "Chapter 35. Description Of The Joking Of Rtasoolullah",
    "babNumber": "35",
    "babName": "Chapter 35. Description Of The Joking Of Rtasoolullah",
    "hadithNumber": "225",
    "hadithText": "Anas ibn Maalik radiyallahu anhu relates, Rasoolullah sallallahu alaihe wasallam once told him jokingly, Ya dhal udhu-nayn (O two eared one)</b>",
    "bookID": "35.0",
    "grade1": "",
    "grade2": "",
    "comments": "Every person has two ears. It must have been for a special reason that he was called ‘Ya dhal udhu-nayn’. For example, he might have had large ears or a sharp hearing, that he could hear from a distance. The latter explanation seems more correct.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902350",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802250",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "35",
    "bookName": "Chapter 35. Description Of The Joking Of Rtasoolullah",
    "babNumber": "35",
    "babName": "Chapter 35. Description Of The Joking Of Rtasoolullah",
    "hadithNumber": "226",
    "hadithText": "Anas radiyallahu anhu says, Rasoolullah sallallahu alaihe wasallam used to associate with us and joke. I had a younger brother. Rasoolullah sallallahu alaihe wasallam said to him, \"Aba Umayr, what happened to the Nughayr?\"</b>",
    "bookID": "35.0",
    "grade1": "",
    "grade2": "",
    "comments": "Nughayr is a type of bird. The ulama have translated it as a white tailed, red Pigeon. The author of Hayatul Haywaan says that it is a Nightingale. Imaam Tirmizi says that the gist of this hadith is that Sayyidinah Rasoolullah sallallahu alaihe wasallam addressed this child by his kuniyyat (patronymic name). He had adopted an animal (bird) as a pet. The animal died and as a result, the child became grieved. In order to cheer him Sayyidina Rasoolullah sallallahu alaihe wasallam asked him, What happened to the Nughayr? Although Sayyidina Rasoolullah sallallahu alaihe wasallam knew that the animal had died. This hadith supports the madh’hab of the Hanafis in a masalah. According to the Shafi’ees, the same rule of hunting applies to the Haram of Madinah as that of Makkah. According to the Hanafis, there is a difference between the two. It is not prohibited to hunt in the Haram of Makkah, whereas it is jaa’iz (permissible) in the Haram of Madinah. Sayyidina Rasoolullah sallallahu alaihe wasallam not prohibiting this, is a proof from among many other proofs, the details of which are mentioned in the books of fiqh and hadith. There is a difference of opinion whether Sayyidina Abu Umayr radiyallahu anhu was known by this kuniyyat (patronymic name) previously or did Sayyidina Rasoolullah sallallahu alaihe wasallam address him first by this kuniyyat? Some ulama have extracted more than a hundred masaa-il and benifits from this hadith. May that soul be sacrificed that from a sentence of a joke, hundreds of masaa’il are solved. And may the Almighty Allah fill the graves of the great ulama with nur (light) who have given such great service to each and every hadith of Sayyidina Rasoolullaah sallallahu alaihe wasallam and extracted so many massa’il, kept it safe and spread it. A question arises here that it is also mentioned that the animal was kept in a cage and the child played with it. This is cruelty to an animal, which is prohibited in the hadith. An answer to this is, to cage an animal and to play with it to keep oneself happy, is not cruelty. To harm and to be cruel to an animal is a different thing. For this reason the ulama have written that it is only permissible for that person to keep an animal who will not mis-handle or be cruel to an animal, but care for it properly. It is not permissible for a hard-hearted child or one who does not understand animals to keep them.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902360",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802260",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "35",
    "bookName": "Chapter 35. Description Of The Joking Of Rtasoolullah",
    "babNumber": "35",
    "babName": "Chapter 35. Description Of The Joking Of Rtasoolullah",
    "hadithNumber": "227",
    "hadithText": "Abu Hurairah radiyallahu anhu reports, The Sahaabah asked, \"O Messenger of Allah, you joke with us?\" Rasoolullah sallallahu alaihe wasallam replied, \"Yes, I do not say but the truth.\"</b>",
    "bookID": "35.0",
    "grade1": "",
    "grade2": "",
    "comments": "The reason that the Sahaabah radiyallahu anhum asked is because it had been prohibited to joke. Likewise, it is also against the dignity of great people to do so. Sayyidina Rasoolullah sallallahu alaihe wasallam informed that it has nothing to do with my cheerfulness. This has been discussed at the beginning of the chapter.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902370",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802270",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "35",
    "bookName": "Chapter 35. Description Of The Joking Of Rtasoolullah",
    "babNumber": "35",
    "babName": "Chapter 35. Description Of The Joking Of Rtasoolullah",
    "hadithNumber": "228",
    "hadithText": "Anas ibn Malik radiyallahu anhu relates that a person requested Rasoolullah sallallahu alaihe wasallam that he be given a conveyance. Rasoolullah sallallahu alaihe wasallam replied, The baby of a camel shall be given to you.<br><br>The person said, What shall I do with the baby of a camel O Messenger of Allah? (I want one for a conveyance). Rasoolullah sallallahu alaihe wasallam replied, Every camel is the baby of a camel</b>",
    "bookID": "35.0",
    "grade1": "",
    "grade2": "",
    "comments": "The person thought that he would be given a small camel which is unfit for riding. In this hadith besides joking, it also points to the fact that a person should carefully listen and understand what the other person is saying.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902380",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802280",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "35",
    "bookName": "Chapter 35. Description Of The Joking Of Rtasoolullah",
    "babNumber": "35",
    "babName": "Chapter 35. Description Of The Joking Of Rtasoolullah",
    "hadithNumber": "229",
    "hadithText": "Anas ibn Malik radiyallahu anhu reports, A resident of the wilderness whose name was Zaahir (ibn Hiraam Al-Ashja'ee), whenever he visited Rasooluallah sallallahu alaihe wasallam he brought with him presents of the wilderness, vegetables etc., and presented it to Rasoolullah sallallahu alaihe wasallam. When he intended to leave Madinah, Rasoolullah sallallahu alaihe wasallam used to present him with provisions of the city. Once Rasoolullah sallallahu alaihe wasallam said, \"Zaahir is our wilderness, and we are his city.\" Rasoolullah sallallahu alaihe wasallam was attached to him. Zaahir radiyallahu anhu was not very handsome. Rasoolullah sallallahu alaihe wasallam once approached him while he was selling his merchandise. Rasoolullah sallallahu alaihe wasallam caught him in between the arms from the back in such a manner that he (Sayyidina Zaahir radiyallahu anhu) could not see him. Zaahir radiyallahu anhu said, \"Who is this?, leave me.\" But when he saw with the corner of his eye that it was Rasoolullah sallallahu alaihe wasallam, he straightened his back and began pressing it to the chest of Rasoolullah sallallahu alaihe wasallam (For as long as he gained this opportunity it was better than a thousand gifts). Rasoolullah sallallahu alaihe wasallam then said, \"Who will purchase this slave?\" Zaahir radiyallahu anhu replied, \"O Rasool of Allah, if you shall sell me, you will be selling a defective thing, and will earn a very little sum.\" Rasoolullah sallallahu alaihe wasallam said, \"No, you are not defective in the sight of Allah, but very valuable.\"</b>",
    "bookID": "35.0",
    "grade1": "",
    "grade2": "",
    "comments": "Sayyidina Rasoolullah sallallahu alaihe wasallam coming and embracing him from the back and covering the eyes of Sayyidina Zaahir radiyallahu anhu was being humorous to him. This saying that who shall purchase him was also in joking. Because Sayyidina Zaahir radiyallahu anhu was not a slave but a free man. Some of the commentators have written that this hadith is about joking, but in reality it is full of virtues and hidden benefits. When Sayyidina Rasoolullah sallallahu alaihe wasallam found him engrossed in selling his merchandise. Sayyidina Rasoolullah sallallahu alaihe wasallam feared that because he was too busy selling, it would keep him away from the remembrance of Allah. Therefore Sayyidina Rasoolullah sallallahu alaihe wasallam took hold of him from behind, and the embrace would be a means of returning him to the remembrance of Allah. As a reminder he said, ‘Is there anyone who will purchase this slave?’, it is because the person who is so engrossed in things other than the remembrance of Allah, is like a slave of his own desires. The embrace of Rasoolullah sallallahu alaihe wasallam totally awakened his faculties for the remembrance of Allah. This is why Sayyidina Rasoolullah sallallahu alaihe wasallam gave him the good news that his status in the eyes of Allah is not low but that of an elevated one.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902390",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802290",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "35",
    "bookName": "Chapter 35. Description Of The Joking Of Rtasoolullah",
    "babNumber": "35",
    "babName": "Chapter 35. Description Of The Joking Of Rtasoolullah",
    "hadithNumber": "230",
    "hadithText": "Hasan Basri radiyallahu anhu says that an old woman came to Rasoolullah sallallahu alaihe wasallam and made a request, O Messenger of Allah make Dua that Allah grants me entrance into Jannah.<br><br>Rasoolullah sallallahu alaihe wasallam replied, O Mother, an old woman cannot enter Jannah. That woman started crying and began to leave. Rasoolullah sallallahu alaihe wasallam said, Say to the woman that one will not enter in a state of old age, but Allah will make all the women of Jannah young virgins. Allah Ta'ala says, Lo! We have created them a (new) creation and made them virgins, lovers, equal in age. (Surah Waaqi'ah, 35-37).</b>",
    "bookID": "35.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902400",
    "last_updated": "2012-04-26 07:00:00"
  }
]