[
  {
    "englishURN": "1800310",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
    "babNumber": "4",
    "babName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
    "hadithNumber": "31",
    "hadithText": "Hazrat Aisha (Radiallahu anha) says, \"I used to comb the hair of Sayyidina Rasulullah (Sallallahu alaihe wasallam), even when I was in the state of menstruation.\"</b>",
    "bookID": "4.0",
    "grade1": "",
    "grade2": "",
    "comments": "The Ulama prove from this Hadith that it permissible for a woman in her periods to look after and serve her husband. Because of the menstruation the whole body of a woman does not become najis (naapak-unclean). It is forbidden to have intercourse with her during her menstruation.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900320",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800320",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
    "babNumber": "4",
    "babName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
    "hadithNumber": "32",
    "hadithText": "Hazrat Anas (Radiallahu anhu) reports, \"Sayyidina Rasulullah (Sallallahu alaihe wasallam) often rubbed oil in his head and also often combed his beard. He put a cloth over his head, which became like an oil cloth due to the frequent use of oil.\"</b>",
    "bookID": "4.0",
    "grade1": "",
    "grade2": "",
    "comments": "The clothing becomes oiled due to the use of oil, and this was against the noble habit of Sayyidina Rasulullah (Sallallahu alaihe wasallam), who liked cleanliness. He put a cloth over his head so that the amaamah (turban) etc. did not become stained.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900330",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800330",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
    "babNumber": "4",
    "babName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
    "hadithNumber": "33",
    "hadithText": "Hazrat Aisha (Radiallahu anha) says, \"Sayyidina Rasulullah (Sallallahu alaihe wasallam) liked to begin with the right while combing his hair; while performing ablution (wudhu) and when putting on his shoes.</b>",
    "bookID": "4.0",
    "grade1": "",
    "grade2": "",
    "comments": "(Also in every other deed, he first began with the right then the left).This (beginning from the right) is not confined to the three acts mentioned in this Hadith. Sayyidina Rasulullah (Sallallahu alaihe wasallam) began everything with the right, that is why every other deed' has been added in the translation of the Hadith. The basic rule is, that all those things that reflect dignity and elegance, while putting on these the right is preferred, and when removing them the left is begun with, as when putting on clothes, shoes etc. When one enters the Masjid, one enters with the right foot and leaves with the left foot first, as this is the place of dignity and greatness. Contrary to this, in those things that do not have elegance in them, for instance when entering the toilet.\r\n",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900340",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800340",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
    "babNumber": "4",
    "babName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
    "hadithNumber": "34",
    "hadithText": "Hazrat Abdullah Mughaffal (Radiallahu anhu) reports, \"Sayyidina Rasulullah (Sallallahu alaihe wasallam) prohibited the combing of hair, but allowed it to be does occasionally.\"</b>",
    "bookID": "4.0",
    "grade1": "",
    "grade2": "",
    "comments": "Qazi Iyaz says that occasionally means after every three days. In Abu Daud a Hadith has been reported, wherein Sayyidina Rasulullah (Sallallahu alaihe wasallam) prohibited the combing of hair daily. The Ulama have written that it is prohibited at such times when there is no necessity for it, otherwise there is no harm in it. The prohibition is karahate tanzihi. It is specially for the hair that has no dirt in it and does not need grooming. When the hair is dirty, there is no karaaha (i.e. not makruh) in combing the hair daily.\r\n",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900350",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800350",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
    "babNumber": "4",
    "babName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
    "hadithNumber": "35",
    "hadithText": "Hazrat Humayd bin Abdurrahman (Radiallahu anhu) relates form a Sahabi that Sayyidina Rasulullah (Sallallahu alaihe wasallam) combed his hair occasionally.</b>",
    "bookID": "4.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900360",
    "last_updated": "2012-04-26 07:00:00"
  }
]