[
  {
    "englishURN": "1802710",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
    "babNumber": "40",
    "babName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
    "hadithNumber": "272",
    "hadithText": "Mu'aadhah Radiyallahu 'Anha says: \"I asked 'Aayeshah, 'Did Rasulullah Sallallahu'Alayhi Wasallam perform the salaatut duha (chaast prayers) ?\" She replied: \"Yes, he performed four rak'ahs (the least), and added to it the amount Allah Ta'aala willed\".</b>",
    "bookID": "40.0",
    "grade1": "",
    "grade2": "",
    "comments": "Salaatut duha is a nafl devotion, therefore at least two rak'ahs could be performed. More could be added to it, if the heart wills, which has no end. It has been ascertained that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam performed up to twelve rakahs. Some are of the opinion, that it has been ascertained that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam only performed eight rak'ahs. But one has certainly been encouraged in a narration to perform up to twelve rak'ahs.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902880",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802720",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
    "babNumber": "40",
    "babName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
    "hadithNumber": "273",
    "hadithText": "Anas Radiyallahu 'Anhu reports: \"Rasulullah Sallallahu 'Alayhi Wasallam performed six rak'ahs of the salaatut duha\".</b>",
    "bookID": "40.0",
    "grade1": "",
    "grade2": "",
    "comments": "Due to different times, different number of rak'ahs have been narrated regarding the salaatut duha of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. Therefore there will be no contradiction between them. For this reason the 'ulama have written that at least two rak'ahs, and it is best that eight or twelve rak'ahs be performed. It has been narrated that Sayyidina Rasulullah Sallallahu 'Alahi Wasallam usually performed eight rak'ahs.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902890",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802730",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
    "babNumber": "40",
    "babName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
    "hadithNumber": "274",
    "hadithText": "'Abdurrahmaan bin Abi Layla RA. (a Taabi'ee) reports: \"None had given me the news that they had observed Rasulullah Sallallahu 'Alayhi Wasallam perform the salaatut duhah besides Ummi Haani. She said: Rasulullah Sallallahu 'Alayhi Wasallam came to her house, the day Makkah was conquered. He performed ghusl (bath), then performed eight rak'ahs. I did not observe Rasulullah Sallallahu 'Alayhi Wasallam perform any salaah shorter than these, despite him performing every ruku' and sajdah properly\"'. (He did not perform the ruku' and saidah haphazardly because the salaah was short).</b>",
    "bookID": "40.0",
    "grade1": "",
    "grade2": "",
    "comments": "'Abdurrahmaan RA. saying that none besides Sayyiditina Ummi Haani Radiyallahu 'Anha narrated this hadith, does not necessarily mean that no other Sahaabi knew about this. In this chapter the narration of a few Sahaabah Radiyallahu 'Anhum are mentioned. Ibn Jareer RA. says: 'So many ahaadith have been narrated on salaatut duha that it reached the stage of tawaatur (unbroken chain of authentic narrators). It has already been stated that nineteen Sahaabah Radiyallahu 'Anhum narrated about this salaah. It may be that those people did not have information that from whom did 'Abdurrahmaan RA. investigate about this salaah. There is no perplexity in this. Some 'ulama are of the opinion that the salaah mentioned in the hadith under discussion, was not the salaatut duha, but a prayer of thanks on the conquering of Makkah. It was the practice of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam when an event of happiness occurred, to perform salaatus shukr (prayer of thanks-giving). It may also be possible that these eight rak'ahs included both the Salaatut duha and salaatus shukr.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902900",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802740",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
    "babNumber": "40",
    "babName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
    "hadithNumber": "275",
    "hadithText": "'Abdullah bin Shaqeeq Radiyallahu 'Anhu relates: \"I enquired from 'Aayeshah, that did Rasulullah Sallallahu 'Alayhi Wasallam perform the salaatut duha?\". She replied: \"No he did not regularly perform it, but when he returned from a journey he performed it\".</b>",
    "bookID": "40.0",
    "grade1": "",
    "grade2": "",
    "comments": "It was the noble habit of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam that whenever he returned to Madinah Munawwarah, he entered the city in the morning. He first entered the masjid and performed nafl prayers. This reply of Sayyiditina 'Aayeshah Radiyallahu 'Anha is the opposite of what was given in reply to a question of Sayyiditina Mu'aadhah Radiyallahu 'Anha mentioned at the beginning of this chapter. The 'ulama-have therefore given different explanations to this. Imaam Bayhaqi has given this explanation, that in the hadith where it has been denied, the denial is of it not being performed regularly, which is not refuting that it was performed occasionally. Meaning he did not perform it regularly. In the hadith where the affirmative is mentioned, i.e. that he performed this salaah, it will be taken to be performed more often. Some of the 'ulama have summed it up thus, that he only performed this salaah in the masjid when he returned from a journey, otherwise at ordinary times he performed it in the home. In this hadith (under discussion) the object is the denial that this salaah was performed in the masjid. It was only performed in the masjid when he returned from a journey, as mentioned in the above hadith.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902910",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802750",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
    "babNumber": "40",
    "babName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
    "hadithNumber": "276",
    "hadithText": "'Abu Sa'eed Al-Khudari Radiyallahu 'Anhu relates: \"Rasulullah Sallallahu 'Alayhi Wasallam at times performed the salaatut duha with such regularity, that we thought, he would not leave it. At times he left it (fearing it might become fard or because of some advantage), till we thought he left it completely, and would not perform it again\".</b>",
    "bookID": "40.0",
    "grade1": "",
    "grade2": "",
    "comments": "\"Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam taking the ummah into consideration, discontinued many devotions, of which there are many examples. Sayyiditina 'Aayeshah Radiyallahu 'Anha says: 'Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam very much liked to do a few things, but did not do it, fearing it would become fard on the ummah'\".",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902920",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802760",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
    "babNumber": "40",
    "babName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
    "hadithNumber": "277",
    "hadithText": "Abu Ayyub Ansaari Radiyallahu'Anhu says. \"Rasulullah Sallallahu 'Alayhi Wasallam always performed four rak'ahs around the time of zawaal. I said: 'O Messenger of Allah. You give much importance to these four rak'ahs around the time of zawaal of the sun?' Rasulullah Sallallahu 'Alayhi Wasallam replied: 'The doors of the skies open from the zawaal of the sun till the zuhr salaah is performed. I desire that a good deed of mine reaches the skies at that time'. I asked: 'Is there a recital in every rak'ah?' He replied: 'Yes'. I enquired: 'Should salaam be made at the end of two rak'ahs?' Rasulullah Sallallahu 'Alayhi Wasallam replied 'No' (Salaam should be made only at the end of four rak'ahs)\".</b>",
    "bookID": "40.0",
    "grade1": "",
    "grade2": "",
    "comments": "The sufis name this salaah as salaatuz zawaal, and this is included in the mustahab prayers. According to the majority of the muhadditheen this is the four sunan of zuhr salaah. The reason being, besides the sunan of zuhr, there is no other nafl prayer after zawaal (midday) that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam performed regularly. In both cases according to both sayings this hadith and the ensuing one has no apparent relevance with the salaatut duha.<br><br>It is perplexing that Imaam Tirmidhi has mentioned this hadith in this chapter. The mashaa-ikh have given a few explanations regarding this. The first is that this was the ending time for chast, therefore it was naturally included here, and a separate chapter was not created. Some are of the opinion that this is due to an error committed by the copier (calligrapher), which resulted in this being mentioned here. Otherwise its original place was in the previous chapter. It is said that in a few copies of this kitaab, this hadith is mentioned under the previous chapter, and not in this chapter. Some have given other explanations too.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902930",
    "last_updated": "2014-03-22 17:01:31"
  },
  {
    "englishURN": "1802770",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
    "babNumber": "40",
    "babName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
    "hadithNumber": "278",
    "hadithText": "'Abdullah bin Saa-ib Radiyallahu'Anhu reports: \"Rasulullah Sallallahu 'Alayhi Wasallam performed four rak'ahs after zawaal before the zuhr salaah, and used to say: 'The doors of the heavens open at this moment. I like that a good deed of mine ascend there at this moment'\".</b>",
    "bookID": "40.0",
    "grade1": "",
    "grade2": "",
    "comments": "What deed can there be more pious and better than salaah, as this is the best among all devotions. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam has said: \"The coolness of my eye is in salaah\". In another hadith it is stated: \"The one that performs salaah, is like one having a private conversation with Allah\".",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902950",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1802780",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
    "babNumber": "40",
    "babName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
    "hadithNumber": "279",
    "hadithText": "'Ali Radiyallahu 'Anhu used to perform four rak'ahs before zuhr and used to say: \"Rasulullah Sallallahu 'Alayhi Wasallam also performed these four rak'ahs after zawaal, and recited long verses therein\".</b>",
    "bookID": "40.0",
    "grade1": "",
    "grade2": "",
    "comments": "Imaam Ghazaali has stated in his Ihya 'Ulumid Deen, that it is desirable to recite the Surah Baqarah in these four rak'ahs, or a similar surah which consists of more than a hundred aayaat, so that a sunnah of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam could be practised in reciting a lengthy portion.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1902960",
    "last_updated": "2012-04-26 07:00:00"
  }
]