[
  {
    "englishURN": "1803100",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "45",
    "bookName": "Chapter 45. Narrations Of The Bed Of Sayyidina Rasoolullah",
    "babNumber": "45",
    "babName": "Chapter 45. Narrations Of The Bed Of Sayyidina Rasoolullah",
    "hadithNumber": "311",
    "hadithText": "'Aayeshah Radiyallahu 'Anha reports that the bed on which Rasulullah Sallallahu 'Alayhi Wasallam slept was made of leather, in which was filled coir of the palm tree.</b>",
    "bookID": "45.0",
    "grade1": "",
    "grade2": "",
    "comments": "The bed Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam used, was at times the one made of leather as stated in the above hadith, or at times was one that was made of canvas, as will be mentioned in the following hadith. At times it was only a mat made of palm leaves. This subject has been narrated in many ahaadith that when the Sahaabah Radiyallahu 'Anhum asked the permission to make a soft bed, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam used to reply: 'What do I have in common with worldly comforts. My example is that of a traveller who after walking, stops under the shadow of a tree for a while to rest, and after sitting a while continues on his way'. Sayyiditina 'Aayeshah Radiyallahu 'Anha says: 'Once a woman from the Ansaar came and saw that an 'abaa (cloak) was spread on the bed of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. She returned home and made a bed in which she filled wool, and sent it to me for Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. When Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam returned and saw the bed, he inquired, 'What is this?' I replied: 'A certain woman from the Ansaar came and after seeing the bed of Rasulullah Sallallahu 'Alayhi Wasallam she made and sent this bed'. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam said; 'Return it'. It looked good to me, and I did not feel like sending it back. Rasulullah Sallallahu 'Alayhi Wasallam insisted that I send it back, and said: 'I swear an oath if I wish Allah Ta'aala will line up mountains of gold and silver for me'. On this saying of Rasulullah Sallallahu 'Alayhi Wasallam I returned the bed. Sayyidina 'Abdullah bin Mas'ud Radiyallahu 'Anhu says: 'I once came to Rasulullah Sallallahu 'Alayhi Wasallam. He was resting on a mat made of palm leaves, the marks of which could be seen on the mubaarak body of Rasulullah Sallallahu 'Alayhi Wasallam. After seeing this state I began to cry. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam asked: 'What is the matter, why are you crying?' I replied: 'O Messenger of Allah, these Qaysars and Kisras sleep on beds of silk and velvet, and you on this palm mat'. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam said.' 'It is not a thing to cry about. For them is the world and for us the hereafter'. A similar incident once took place with Sayyidina 'Umar Radiyallahu 'Anhu when he came to Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam and this same type of question and answer took place. The detailed incident is mentioned in the Sahih Bukhaari.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903280",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803110",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "45",
    "bookName": "Chapter 45. Narrations Of The Bed Of Sayyidina Rasoolullah",
    "babNumber": "45",
    "babName": "Chapter 45. Narrations Of The Bed Of Sayyidina Rasoolullah",
    "hadithNumber": "312",
    "hadithText": "Imaam Muhammad AI-Baaqir Radiyallahu 'Anhu says that someone asked Ummul Mu'mineen 'Aayeshah Radiyallahu 'Anha: 'How was the bed of Rasulullah Sallallahu 'Alayhi Wasallam in your house?' She replied: 'It was made of leather, in which was filled the coir of the date palm'. Hafsah Radiyallahu 'Anha was asked how was the bed of Rasulullah Sallallahu 'Alayhi Wasallam in your house? She replied: 'It was a canvas folded into two, which was spread for Rasulullah Sallallahu 'Alayhi Wasallam to sleep on. On one night I thought if I folded it into four and spread it, it would become softer. I folded it and spread it that way. In the morning Rasulullah Sallallahu 'Alayhi Wasallam asked: 'What did you spread for me last night? I replied: 'It was the same bed, I only folded it into four so that it may become softer'. Rasulullah Sallallahu 'Alayhi Wasallam said: 'Leave it in its original form. Its softness deprived me of my prayers (tahajjud) at night'.</b>",
    "bookID": "45.0",
    "grade1": "",
    "grade2": "",
    "comments": "It means that he could not wake up for tahajjud, or he may have awakened later than usual. One sleeps more soundly on a soft bed, and also for a longer period. If it is a rough and uneven bed, firstly, one will not sleep with ease; secondly, one will awaken quickly.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903290",
    "last_updated": "2012-04-26 07:00:00"
  }
]