[
  {
    "englishURN": "1803120",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "46",
    "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "babNumber": "46",
    "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "hadithNumber": "313",
    "hadithText": "'Umar Radiyallahu 'Anhu says: ''Rasulullah Sallallahu 'Alayhi Wasallam said: 'Do not exceed in praising me as the Christians over-praised 'Esa 'Alayhis Salaam. (That they made him the son of God.) I am a bondsman of Allah, therefore, call me the bondsman of Allah and His Rasul'\".</b>",
    "bookID": "46.0",
    "grade1": "",
    "grade2": "",
    "comments": "Do not praise me in such a manner which is contrary to the bonds-manship of Allah where shirk (partnership) is created with Allah. A bondsman is a bondsman. Do not praise in such a manner that does not befit, and is contrary to the mission of a Rasul and Messenger of Allah.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903300",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803130",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "46",
    "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "babNumber": "46",
    "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "hadithNumber": "314",
    "hadithText": "Anas Radiyallahu 'Anhu reports: A woman came to Rasulullah Sallallahu 'Alayhi Wasallam and said: I would like to speak to you in private'. Rasulullah Sallallahu 'Alayhi Wasallam replied: 'Sit on any street of Madinah and I will come there and listen to you'\".</b>",
    "bookID": "46.0",
    "grade1": "",
    "grade2": "",
    "comments": "In some narrations it is stated that this woman was a bit mentally retarded. Despite this, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam gave her a hearing. Some 'ulama say the reason for saying 'Sit in any street', is because he will not be alone with a strange woman. Some have written, because she was a bit mentally retarded, it is apparent that she may be walking around in the alleys, therefore Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam said, he would go into the street and listen to her. According to this humble servant, it is possible that if he had called her at the women's quarters of his house, the womenfolk would have been inconvenienced, as is witnessed many a time. For this reason, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam listened to her request on the street.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903310",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803140",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "46",
    "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "babNumber": "46",
    "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "hadithNumber": "315",
    "hadithText": "Anas Radiyallahu 'Anhu reports: \"Rasulullah Sallallahu 'Alayhi Wasallam visited the sick, attended funerals, rode on donkeys, accepted the invitations of slaves. On the day of the battle of Banu Qurayzah, he rode on a donkey, the reigns of which were made of date palm leaves. On it was also a saddle made of date palm leaves\".<br><br><u></b>",
    "bookID": "46.0",
    "grade1": "",
    "grade2": "",
    "comments": "</u><br>In Arabia, there is special type of donkey, which is bigger than the local (Indian) mules. They run faster than the ordinary ponies. Two or three people can easily ride them. They are better than the ordinary local (Indian) horses. It is possible that these' donkeys existed in the time of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. It is regarded as an inferior class of conveyance than that of horses. The object here is to show that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam despite being of such a high status, and who possessed the leadership of both worlds did not feel belittled by riding a donkey. In the same manner, he visited the sick, be that person a respectable or an ordinary person. He even visited the sick non-Muslims. A Jewish lad used to attend the assemblies of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. At times he assisted in some work too. When he became ill, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam went to visit him. It was his last moments. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam fulfilled his duties of kindness towards him, and presented to him the Message Islaam. The lad looked at his father, the father signalled his agreement. He accepted Islaam. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam thanked Allah, as only Allah is worthy of hamd, who had saved this lad from the punishment of hell through him. Not only this, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam also went to visit the leader of the hypocrites, 'Abdullah bin Ubay, when he became ill, whereas, he had troubled and harassed Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam many a time. In this manner we find in the ahaadith that he attended the funerals of many ordinary people.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903320",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803150",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "46",
    "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "babNumber": "46",
    "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "hadithNumber": "316",
    "hadithText": "Anas Radiyallahu 'Anhu reports: ''Rasulullah Sallallahu 'Alayhi Wasallam accepted and attended invitations where bread made of barley, and stale fat a few days old was served (Without hesitation he accepted these invitations). Rasulullah Sallallahu 'Alayhi Wasallam had pawned his armour to a Jew. Till the end of his life Rasulullah Sallallahu 'Alayhi Wasallam did not possess a sufficient amount to release that armour'\".</b>",
    "bookID": "46.0",
    "grade1": "",
    "grade2": "",
    "comments": "When fat becomes stale it begins to smell. The serving of bread made of barley and stale fat could be ascertained from the status of the person or from experience, or even by the host himself saying this. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam never made an excuse in accepting an invitation. The last sentence about the debt has been mentioned co-incidentally as it is part of the hadith. Some 'ulama state that this is also a sign of humility. This was the reason of his poverty. Allah Ta'aala had given him the option of two things, if he wanted to become a Rasul with humbleness or become a Rasul with kingdom. Sayyidina Rasulullah Sallallhu 'Alayhi Wasallam on his own accord chose the first one.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903330",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803160",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "46",
    "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "babNumber": "46",
    "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "hadithNumber": "317",
    "hadithText": "Anas Radiyallahu 'Anhu reports : ''Rasulullah Sallallahu 'Alayhi Wasallam performed haj on an old pack saddle. On it was a piece of cloth, the value of which was less than four Dirhams. (It may be possible that by 'on it' Sayyidina Rasulullah Sallallhu 'Alayhi Wasallam himself is meant here. i.e. He covered himself with an ordinary sheet. The value of which did not reach four Dirhams. This explanation is most accepted by the respected teachers. The eleventh hadith in this chapter strengthens this). Rasulullah Sallallahu 'Alayhi Wasallam was reciting this du'aa: 'Allah make this haj one that has no show or fame'\".</b>",
    "bookID": "46.0",
    "grade1": "",
    "grade2": "",
    "comments": "This was recited to educate the ummah, or shows the complete humbleness and utmost devotion of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. Although there can be no question of show and fame in any act of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, then too Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam made this d'uaa and beseeched Allah to keep this haj free from show and fame. The sheet that was on the mubaarak body or on the pack saddle of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was of such an ordinary quality that its value was less than a rupee (about twenty cents). This was the result of his complete humbleness, which was his usual habit. Although due to some considerations Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam at time's wore expensive clothing, but normally did not do so.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903340",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803170",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "46",
    "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "babNumber": "46",
    "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "hadithNumber": "318",
    "hadithText": "Anas bin Maalik Radiyallahu 'Anhu reports: \"No one was more beloved to the Sahaabah than Rasulullah Sallallahu 'Alayhi Wasallam. When they saw him they did not stand up, knowing that he did not approve of it\".</b>",
    "bookID": "46.0",
    "grade1": "",
    "grade2": "",
    "comments": "This was also the result of the complete humbleness of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. Despite his high status and being the leader of both worlds, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not approve this. For this reason the Sahaabah, although possessing a great love for him, and knowing that he disapproved of it, did not stand up for him as is the requirement from this hadith. Rarely, due to their intense love, they stood up. A hadith has been mentioned in the Abu Daawud that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was sitting with us in the masjid and talking. When he stood up, we all stood up till he went into the house. In this manner many ahaadith are narrated on this subject in the books of hadith, to the extent that in some ahaadith it has been strongly prohibited to stand up, and in some ahaadith it has been commanded to stand up for a few visitors. The 'ulama differ in the permissibility of standing or not standing. The majority of the researchers say there is no contradiction, as there are many reasons for standing up, therefore different commands are mentioned in the ahaadith. Abul Walid bin Rashid says there are four ways and reasons for standing up. (a). Not permissible: This is standing up for such a person who likes this due to pride, that when he enters, people should stand up. (b). Makruh: To stand up for a person who has no pride, but it is feared if one is treated in this manner, pride will enter in that person. (c). Permissible: This is for that person this fear does not exist. (d). Mustahab: To stand up for a person who returns from a journey. To stand in happiness on one's return. Imam Nawawi says: ''It is mustahab to stand for the Ahlul-Ilm, Ahlul-Fadl and Ahlul-Sharaf''. Qaadi 'Iyaad says the prohibition is for that standing, where a great person remains seated and the people continue standing in his presence. In the ahaadith where standing has been prohibited it is stated that: ''One should not stand in the manner that the 'ajami people stand for their leaders\". The research of Maulana Gangohi, which has been mentioned in the Badh-lul-Majhud through my late father, is that standing in itself is permissible, till such an obstacle does not appear which prohibits it. For example, a person will fall into mischief if one stands up for a certain person. Pride etc. will form in one, which will be detrimental to that person's religious well-being. In the same manner, to stand up hypocritically, where there does not exist in the heart any feeling or respect, but for the sake of show and hypocrisy one stands up. Both these are not permissible, but, if one fears that by doing so, one will have to bear financial and physical consequences, then in this case it will be permissible to stand up to deter oppression.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903350",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803180",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "46",
    "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "babNumber": "46",
    "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "hadithNumber": "319",
    "hadithText": "Imaam Hasan bin 'Ali Radiyallahu 'Anhu reports that I asked my (maternal) uncle Hind bin Abi Haalab, who usually described particulars and conditions of Rasulullah Sallallahu 'Alayhi Wasallam. I was longing to hear something about it. On my asking, he described the mubaarak features of Rasulullah Sallallahu 'Alayhi Wasallam. He said: 'Rasulullah Sallallahu 'Alayhi Wasallam had great qualities and attributes in him, others also held him in high esteem. His face glittered like the full moon'. He then described the complete features of Rasulullah Sallallahu 'Alayhi Wasallam (as has been mentioned in the first chapter under hadith number seven). Imaam Hasan Radiyallahu 'Anhu says. 'I did not mention this hadith (due to some reason) to Husayn (Radiyallahu 'Anhu) for some time. Then I once narrated it to him whereupon I found that he had heard it before me. He had asked him (our uncle) already what I had asked. I also found that he had asked our father ('Ali Radiyallahu 'Anhu) about Rasulullah Sallallahu 'Alayhi 'Wasallam entering and coming out of the house. He did not leave out anything about the ways and manners of Rasulullah Sallallahu 'Alayhi Wasallam. Imaam Husayn Radiyallahu 'Anhu said: 'I asked my father regarding the manner in which Rasulullah Sallallahu 'Alayhi Wasallam entered the house?' He replied: 'When Rasulullah Sallallahu 'Alayhi Wasallam entered the house he distributed his time into three portions; He spent a portion for Allah. (In devotion, performing salaah etc.); A portion towards his family (fulfilling their duties. i.e. laughing, speaking, enquiring about their welfare etc.); and a portion for himself (resting etc.). He distributed his personal portion in two, one for himself and one for the people, in such a manner that the near one's among the Sahaabah Radiyallahu 'Anhum came to visit him. Through these Sahaabah Radiyallahu 'Anhum he conveyed messages to the people. He did not conceal anything from them. From the portion of the unimah he adopted this method, that he gave preference to the Ahlul-Fadl (i.e. people of 'ilm and 'amal). He distributed this time according to their religious fadl. From among those who came, some had one requirement, some had two requirements, and some had many requirements. Rasulullah Sallallahu 'Alayhi Wasallam fulfilled all their requirements. He busied them in things that benefited them and the entire ummah. When they questioned Rasulullah Sallallahu 'Alayhi Wasallam on religious matters, he replied to them in a manner that benefited them. He used to say: 'Those that are present, should inform those that are not present regarding these beneficial and necessary matters'. He also used to say: 'Those people who for some reason (purdah, distance, shyness or awe) cannot put forward their requirements, you should inform me about their requirements, because, that person who informs a king of the need of another, who is unable to put forward that need, Allah Ta'aala will keep that person stead fast on the day of qiyaamah'. Only important and beneficial matters were discussed in his gathering. He happily listened to these matters from the Sahaabah Radiyallahu 'Anhum. Besides this there was no wasteful or non-beneficial talks in his assemblies. The Sahaabah Radiyallahu 'Anhum came to the assemblies of Rasulullah Sallallahu 'Alayhi Wasallam for their religious needs, they did not depart before tasting something (by tasting, may be meant the acquiring of religious knowledge. It could mean 'Hissi' tasting too. Whatever Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam possessed, he offered it in humbleness. Whenever close friends gather, whatever is available is presented to them). The Sahaabah Radiyallahu 'Anhum returned from his assemblies as torch bearers of hidayah and goodness. (They spread. these teachings amongst others). Imaam Husayn Radiyallahu 'Anhu says: 'I asked (my father) regarding the coming out of Rasulullah Sallallahu 'Alayhi Wasallam from the house'. He replied: 'Rasulullah Sallallahu 'Alayhi Wasallam controlled his tongue and only spoke that which was necessary. He did not waste his time in useless conversations. He made those who came to visit him feel at home he did not make them feel scared or ill at ease. (i.e. When advising them, he did not scold them in a manner that they become scared, or tell them such things that would keep them away from the deen). He respected and honoured the respected ones of every nation. He also chose a leader for them. He warned the people of Allah's punishment (or he emphasised that the people be cautious). He also protected himself from troubling or harming people. Besides being cautious and commanding others to be cautious, he never lacked in courtesy towards others. He was concerned for the affairs of his friends, made himself aware about the relationships between them and rectified their faults. He praised good deeds and encouraged them. He explained the harmful effects of bad things and removed and stopped these. He followed the middle path in all matters. (He did not at times say this and at other times that). He did not neglect the guiding of people, it is possible that they became unmindful of their religious duties, or exceeded in a matter resulting in them becoming disheartened. For everything there was a special arrangement. He did not fall back in the truth, nor did he exceed the limits in this.<br><br>Those who attended his gatherings were the best of people. The best person in the eyes of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was the one who wished everybody well. The one with the highest status in the eyes of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was that person who considered, comforted and helped the creation the most'. Sayyidina Imaam Husayn Radiyallahu 'Anhu says: 'I then enquired from him regarding the assemblies of Sayyidina Rasulullah Sallallahu Wasallam'. He replied: 'He began and ended all his sitting with the dhikr of Allah. When he went to a place, he sat where he found a place, and also instructed the people to do so. They should not leap over peoples heads and go ahead. It is a different matter, that where Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam sat, that place became the focal point of the gathering. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam fulfilled the rights of every person present. That means, whatever right was due in talking and showing happiness, was fulfilled by him, so much so, that every person present would think that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is honouring me the most. The person that came to sit by Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam or came to him for some purpose, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam would remain seated till that person began to stand up. Whenever one asked him for something, he kindly fulfilled that request, and did not refuse it, (if he did not possess the thing) he would give a soft and humble answer. His cheerfulness and pleasant manner were for everybody. He was like a father to them. The whole creation was equal before him as far as rights were concerned. His gatherings were the gatherings of knowledge, modesty, patience and honesty. (i.e. These four things were attained there or are a description of his gatherings). Voices were not raised therein, nor was anyone degraded or disgraced. If anyone committed a fault, it was not made known publicly. All were regarded as equals amongst themselves. (A person was not regarded according to his lineage or genealogy). The virtues of one over the other was according to the taqwa (piety) possessed. The small ones were loved. The needy were given preference. Strangers and travellers were cared for\"</b>",
    "bookID": "46.0",
    "grade1": "",
    "grade2": "",
    "comments": "In brief, in every matter his noble manners reached their pinnacle and even exceeded that, and why should it not be so when his divine mission was to fulfil and complete noble manners? Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam has said: 'I have been sent so that I may fulfil and complete the best of manners'. Even though being granted this, he always made this du'aa: 'O Allah, You have created me excellently. In the same manner make my character excellent'. Allah Ta'aala has mentioned the greatness of his noble character in the Qur-aan, and has also emphasised it in many ways. Rasulullah Sallallahu 'Alayhi Wasallam said: 'Allah Ta'aala likes those with gentle temperaments, and in reward for gentleness He grants something which He does not grant for other things'. In another hadith it has been stated: 'The person that is deprived of gentleness is deprived of great blessings'. It is stated in a hadith: 'The best amongst you is the one who has the best character'. In one hadith it has been stated: 'The most beloved amongst you by me is the one who possesses noble character'. A Sahaabi inquired from Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam 'What is the best thing granted to man? Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam replied: 'Good character'. In one hadith it has been stated: 'On the day of qiyyaamah the weightiest thing on the scale of deeds will be good character'. It has been stated in a hadith: 'A good-mannered person can through his character, reach the status of those pious people who stay awake at night, and fast during the day'. Sayyidina Mu'aadh Radiyallahu 'Anhu says that when I was sent to Yaman (Yeman), while mounting conveyance, when I put my leg in the stirrup, Rasulullah Sallallahu 'Alayhi Wasallam gave me this final advice: 'Treat the people with courtesy'. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam has said the ones that possess the most complete imaan among the Mu'mins are those whose characters are the best. In many other other ahaadith too it has been stressed that one should have good character. The above mentioned ahaadith are an example of these.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903360",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803190",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "46",
    "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "babNumber": "46",
    "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "hadithNumber": "320",
    "hadithText": "Anas Radiyallahu 'Anhu reports that Rasulullah Sallallahu 'Alayhi Wasallam said: \"Even if I am given a foot of a goat as a present, I will accept it, and if I am invited to partake of it, I will surely accept that invitation\".</b>",
    "bookID": "46.0",
    "grade1": "",
    "grade2": "",
    "comments": "It does not even come to mind that why should I accept such an ordinary small article, or accept an invitation to partake of it. I think of it as a blessing of Allah and accept it whole heartedly. The actual reason for accepting an invitation is not the food but to encourage the host and keep one happy.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903370",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803200",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "46",
    "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "babNumber": "46",
    "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "hadithNumber": "321",
    "hadithText": "Jaabir Radiyallahu 'Anhu says: \"Rasulullah Sallallahu 'Alayhi Wasallam came to visit me (while I was ill). He did not come on the back of a mule, or on a Turkish horse\". (i.e. He did not come on defective or an expensive conveyance, but came on foot).</b>",
    "bookID": "46.0",
    "grade1": "",
    "grade2": "",
    "comments": "The humbleness of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is intended here. He did not adopt the way of the kings and the rich in using conveyance, but mostly walked. This incident is mentioned in the Bukhaari Sharif with more detail, where Sayyidina Jaabir Radiyallahu 'Anhu says: 'Once I became ill. Rasulullah Sallallhu 'Alayhi Wasallam and Abubakar (Radiyallahu 'Anhu) both came to visit me on foot. When they reached my home they found me unconscious. Rasulullah Sallallahu 'Alayhi Wasallam performed wudu and sprinkled the water of the wudu on me, as a result I became conscious and saw Rasulullah Sallallahu 'Alayhi Wasallam sitting before me. I asked him a question on inheritance, whereupon an aayah on this was revealed'.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903380",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803210",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "46",
    "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "babNumber": "46",
    "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "hadithNumber": "322",
    "hadithText": "Yusuf bin 'Abdullah bin Salaam Radiyallahu 'Anhu reports: \"Rasulullah Sallallah 'Alayhi Wasallam chose for me the name Yusuf. He put me in his lap and passed his mibaarak hand on my head'\".</b>",
    "bookID": "46.0",
    "grade1": "",
    "grade2": "",
    "comments": "In this we find the high character of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam and his love for little children. The height of humbleness is that he did not avoid putting infants on his lap. In a hadith it is stated that he (Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam) also made dua of barakah for me. From this hadith it is evident that children were taken to the pious elders and were asked to choose a name for them. In other ahaadith it has also been related that the Sahaabah Radiyallahu 'Anhum took their new born infants to Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903390",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803220",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "46",
    "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "babNumber": "46",
    "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "hadithNumber": "323",
    "hadithText": "Anas Radiyallahu 'Anhu reports: \"Rasulullah Sallallahu 'Alayhi Wasallam performed haj on a saddled camel on which was a cloth, the value of which we think was four Dirhams. Rasulullah Sallallahu 'Alayhi Wasallam was reciting this du'aa: 'O Allah, keep this haj free from show and fame'\".</b>",
    "bookID": "46.0",
    "grade1": "",
    "grade2": "",
    "comments": "This hadith has been mentioned in hadith number five in this chapter.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903400",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803230",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "46",
    "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "babNumber": "46",
    "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "hadithNumber": "324",
    "hadithText": "Anas Radiyallahu 'Anhu reports that a tailor invited Rasulullah Sallallahu 'Alayhi Wasallam. Thareed was served, in which dubbaa (dodhi -gourd) was added. As Rasulullah Sallallahu 'Alayhi Wasallam loved dubbaa (dodhi-gourd) he began eating it. Anas Radiyallahu 'Anhu says: \"After that no food was prepared for me, wherein if gourd could be added, it was added\"</b>",
    "bookID": "46.0",
    "grade1": "",
    "grade2": "",
    "comments": "Thareed is a type of food wherein bread is mixed with gravy. This has already been mentioned in the eleventh hadith on the chapter of the curry of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. There instead of thareed, bread and gravy is mentioned. It is possible that both things were served, gravy and bread and thareed also. It is possible that thareed figuratively, or the ingredients of thareed were mentioned separately, as bread and gravy when mixed together become thareed.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903410",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803240",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "46",
    "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "babNumber": "46",
    "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
    "hadithNumber": "325",
    "hadithText": "'Amrah Radiyallahu 'Anha reports that someone asked 'Aayeshah Radiyallahu 'Anha. \"What was the usual practice of Rasulullah Sallallahu 'Alayhi Wasallam at home?\" She replied: \"He was a human from among other humans. He himself removed the lice from his clothing, milked his goats, and did all his work himself\".</b>",
    "bookID": "46.0",
    "grade1": "",
    "grade2": "",
    "comments": "He was a human from among other humans' means as the common people, he mostly did his household chores himself. He did not have pride or feel ashamed to do the household work or fulfil his needs. In a hadith it is stated that the work that was done by the common people in their homes, was also done by Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. In some ahaadith, examples of the chores are also given as in the hadith under discussion. In the ahaadith it is also stated that he sewed his clothing himself, he repaired his shoes, mended his clothing etc.<br><br>In the above hadith it is mentioned that he removed lice from his clothing. The research of the 'ulama is that lice was not found in the body and clothing of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. It is evident that lice appears from the dirt of the body and multiplies with the perspiration. The whole body of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was nur. There can be no questions of dirt, in the same manner his perspiration was like rose, that is used as a scent. How can it be possible for lice to live in the essence of rose. Therefore here it will mean that he looked for lice suspecting it from another person to have crept onto his clothing. The 'ulama say that this was done to teach the ummah, that when others see him doing this they will practise it more diligently.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903420",
    "last_updated": "2012-04-26 07:00:00"
  }
]