[
  {
    "englishURN": "1803250",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "47",
    "bookName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "babNumber": "47",
    "babName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "hadithNumber": "326",
    "hadithText": "Khaarijah bin Zayd bin Thaabit Radiyallahu 'Anhu says that a group came to Zayd bin Thaabit (his father) and requested him to describe to them some facts about Rasulullah Sallallahu 'Alayhi Wasallam. He replied. \"What can I describe to you of Rasulullah Sallallahu 'Alayhi 'Wasallam. (It is beyond my means to describe them). I was the neighbour of Rasulullah Sallallahu 'Alayhi Wasallam. (Therefore he was mostly present and knew many facts. He was also a writer of the wahi-revelation). When wahi was revealed to Rasulullah Sallallahu 'Alayhi Wasallam, he sent for me, I came and wrote it. (Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam always showed kindness, and made us feel at ease). Whatever we discussed, he discussed the same. If we discussed some worldly affairs, he also spoke of it. (It was not that he only spoke about the hereafter to us, and despised the talking of worldly affairs). When we spoke of the hereafter, he too spoke of the hereafter. When we began speaking of the hereafter, he described its events etc in detail). 'When we spoke of food, Rasulullah Sallallahu 'Alayhi Wasallam also spoke of it. (Its etiquette, benefits, tasty foods, foods that are harmful, etc. In the previous chapters many such commands of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam are mentioned. i.e. 'What a wonderful curry vinegar is'. 'Use olive oil, it is from a mubaarak tree'. etc.). All this I am saying are facts on Rasulullah Sallallahu 'Alayhi Wasallam'\".</b>",
    "bookID": "47.0",
    "grade1": "",
    "grade2": "",
    "comments": "Many things are mentioned in this hadith, of which many have been explained in the hadith (in brackets). The translation of the last sentence according to the mashaa-ikh of teaching is as mentioned above. According to this humble servant in the beginning of the hadith where it is mentioned 'What can I describe to you of Rasulullah Sallallahu 'Alayhi Wasallam' is connected to this last sentence, and the translation will be this that 'I can describe to you all the conditions of Rasulullah Sallallahu 'Alayhi Wasallam. Whatever type of question you may ask me about, I will explain it to you, as I was a neighbour of Rasulullah Sallallahu 'Alayhi Wasallam and also the writer of the wahi (revelation). Every religious and worldly activity, eating, drinking etc. was found among the practices of Rasulullah Sallallahu 'Alayhi Wasallam, therefore what should I describe to you and what can I say, as every memoir of his is wonderful, and every time and condition beautiful'. In this hadith Sayyidina Zayd Radiyallahu 'Anhu saying, when wahi was revealed, he was called. This was mostly done because he lived nearest to Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. There were other Sahaabah also who wrote the wahi, among them were Sayyidina 'Uthmaan Radiyallahu 'Anhu, Sayyidina 'Ali Radiyallahu 'Anhu, Sayyidina Ubay Radiyallahu 'Anhu, Sayyidina Mu'aawiyah Radiyallahu 'Anhu, Sayyidina Khaalid bin Sa'd Radiyallahu 'Anhu, Sayyidina Hanzalah Radiyallahu 'Anhu, Sayyidina 'Alaa Hadrami Radiyallahu 'Anhu, Sayyidina Abaan bin Sa'eed Radiyallahu 'Anhu. These nine Sahaabah wrote the wahi. In the above hadith a question may arise, that speaking of worldly -affairs such as eating, drinking etc. is a useless conversation, and it was the noble habit of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam not to waste time in useless things, as has been mentioned in many ahaadith. It has also been, mentioned in the seventh hadith of the previous chapter that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam controlled his tongue and spoke only that which was necessary. The reply to that is not every worldly discussion is useless, but many discussions about eating and drinking and other worldly affairs are necessary, and were waajib for Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. Among these, are what is permissible and not permissible, what is good or bad, etc. can only be known if Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam explained them, or when they were discussed before him he did not comment on them. It has also been mentioned in this hadith that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam inquired about the people and encouraged their good deeds and explained to them the detrimental effects of bad deeds. It is for this reason that worldly affairs were discussed in the gathering of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, and not for the sake of wasting time.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903430",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803260",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "47",
    "bookName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "babNumber": "47",
    "babName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "hadithNumber": "327",
    "hadithText": "'Amr ibnul 'Aas Radiyallahu 'Anhu reports: \"(Rasulullah Sallallahu 'Alayhi Wasallam gave attention, spoke and showed love to the worst person of a nation. So that, the person may feel he is being given special attention). He used to give attention, and spoke to me also in a manner, that I began to feel that I was the best among the community. (Therefore one day) I asked: 'O Messenger of Allah, am I better or is Abubakr better?' He replied: 'Abubakr'. I then asked: 'Am I better, or 'Umar?' He replied. \"Umar'. I asked: 'Am I better or 'Uthmaan?' He replied: 'Uthmaan'. When I asked him these questions, Rasulullah Sallallahu 'Alayhi Wasallam told me the truth. (He did not tell me I was better to keep me happy. Afterwards I felt ashamed of myself on this deed). I felt I should not have asked such a question\".</b>",
    "bookID": "47.0",
    "grade1": "",
    "grade2": "",
    "comments": "This Sahaabi in the beginning due to the special attention given to him by Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam felt he was the best among the community. We find from the first lengthy hadith already mentioned, that it was his noble habit to give preference to the best. But, at times, to make one's heart happy and in politeness he gave preference to that which was not the best. He even showed special love to the non-believers and the munafiqeen (hypocrites). In the hadith, the order in which the question were asked, is because in the time of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam the Sahaabah Radiyallahu 'Anhum regarded Abubakr Radiyallahu 'Anhu as the best amongst the people. It is also narrated in the ahaadith that in the time of Rasulullah Sallallahu 'Alayhi Wasallam we regarded Abubakr as the best, and after him 'Umar. Sayyidina Ibn 'Umar Radiyallahu 'Anhu relates that in the time of Rasulullah Sallallahu'Alayhi Wasallam we did not regard anyone equal to Abubakr, after him was 'Umar, and after him 'Uthrnaan. After that the other Sahaabah were not given preference. This means that the superiority of these three Sahaabah in this order was manifest. In the time of Rasulullah Sallallahu 'Alayhi Wasallam we the Sahaabah accepted this. Muhammad, the son of 'Ali (Radiyallahu'Anhu), once asked his father 'Ali Radiyallahu 'Anhu who was the best person after Rasulullah Sallallahu 'Alayhi Wasallam?. He replied: 'Abubakr Radiyallahu 'Anhu' I asked after him who? He replied: \"Umar'. There are many other ahaadith wherein during the time of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam this order is mentioned. Therefore 'Amr Radiyallahu 'Anhu asked the question in this order. He competed with the one who was regarded as the best then the second, then the third best. If I am not better than the first then surely I might be better then the second or third.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903440",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803270",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "47",
    "bookName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "babNumber": "47",
    "babName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "hadithNumber": "328",
    "hadithText": "Anas bin Maalik Radiyallahu 'Anhu says: \"I remained in the service (of Rasulullah Sallallahu 'Alayhi Wasallam for ten years. He never once told me 'Oof'. When I did something, he never asked me, why did you do so? When I did not do a certain task, he never asked me why I did not do it. Rasulullah Sallallahu 'Alayhi Wasallam had the best character among all people. (and also possessed the most excellent features, so much so,) that I never felt a silk cloth, nor pure silk, nor any other thing softer than the palm of Rasulullah Sallallahu 'Alayhi Wasallam. Nor did I smell any musk or any other fragrance, more sweet smelling than the sweat of Rasulullah Sallallahu 'Alayhi Wasallam\".</b>",
    "bookID": "47.0",
    "grade1": "",
    "grade2": "",
    "comments": "This is not an exaggeration, or something to do with faith. The perspiration of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was collected and used as a fragrance. The one with whom Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam shook hands, a fragrance emitted from that hand for a whole day. It is a proven fact that by committing excess evil the body gives off a disgraceful smell. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam not uttering even the word 'Oof' on anything is due to his high and noble character and humbleness. He did not regard Sayyidina Anas Radiyallahu 'Anhu fulfilling or not fulfilling a duty to be something from Sayyidina Anas Radyallahu 'Anhu's own side, but something that is from Allah, and was always contented with it. In another hadith this has also been stated that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam used to say.' 'Only that shall happen that Allah wills. If it is destined to happen it shall happen'. This is the uttermost pleasure from a beloved's deed. In the technical terms of the sufis the essence of 'Rida bil Qadaa' (contentment and acceptance of divine decree) has a different certificate. There is a famous saying of Raabi'ah Basriyyah, the translation of which is, 'O Allah, if you cut me into pieces, as a result, my love for You will surely increase'. The acts of all the accomplished sufis are taken from the many noble acts of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. The personality of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was perfect and most complete in all aspects. After him the state of 'All inclusive perfection' did not remain. Therefore among the sufis, a certain habit of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was evident and at another place another habit was evident. Here it is worth noting that this state of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was regarding his own person. Sayyiditina 'Aayeshah Radiyallahu 'Anha says 'Rasulullah Sallallahu 'Alayhi Wasallam never took revenge on his own behalf (or for any wrong done to him), but if a command of Allah was transgressed (i.e. haraam deed was committed) then he surely punished the evil doer'. A similar incident is also mentioned in hadith number three in the chapter on the speech of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam.<br><br>A pleasant incident: There is a surprising story regarding the last portion of the hadith under discussion, from which we find the complete love of the Sahaabah Radiyallahu 'Anhum for Sayyidina Rasulullah Sallallahu Alayhi Wasallam. That is, Sayyidina Anas Radiyallahu 'Anhu once began saying with complete love and happiness, that I shook the mubaarak hands of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam with these hands of mine. I did not feel any silken cloth or pure silk softer than the hands of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. The student before whom this hadith was mentioned, showed his desire, that I also wish to shake hands with those hands that shook the hands of Rasulullah Sallallahu 'Alayhi Wasallam. Thereafter, this chain continued in such a manner that today after more 1,350 years it is still continually practised. It is well known as the hadith of musafahah (hand shaking) as the hand shaking is continued. Shah Waliyullah Dehlavi has also mentioned this in his book 'Musalsalaat', through whom it had reached my respected ustaadh Maulana Khalil Ahmad Saahib (May Allah fill his resting place with nur).",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903450",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803280",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "47",
    "bookName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "babNumber": "47",
    "babName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "hadithNumber": "329",
    "hadithText": "Anas Radiyallahu 'Anhu says: \"A person who was wearing yellow coloured clothing was sitting by Rasulullah Sallallahu 'Alayhi Wasallam. It was the habit of Rasulullah Sallallahu 'Alayhi Wasallam not to bluntly express things he did not approve of. (Therefore he kept silent). When that person left, Rasulullah Sallallahu 'Alayhi Wasallam said to those present 'It would have been better if you had told him not to wear yellow clothing'\".</b>",
    "bookID": "47.0",
    "grade1": "",
    "grade2": "",
    "comments": "This was a great kindness of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam on the ummah. He did not usually prohibit anything to an individual, because it was possible that that person may reject it or may become a cause for one to raise an objection, which could lead to kufr. When Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam felt that it would not lead to this, he prohibited that which was undesirable. It is stated that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam prohibited Sayyidina 'Abdullah bin 'Amr ibnul 'Aas Radiyallahu 'Anhu from wearing such clothing. Many other such instances are mentioned in the books of hadith. Also this delaying and not openly prohibiting a thing were only in such circumstances where it was feared to be detrimental or where there was no fear of harm if it was delayed. This method was not adopted where a haraam thing was committed. It is therefore found in hadith number three in the chapter on the speech of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, where in a detailed narration of Sayyidina Imaam Hasan Radiyallahu 'Anhu it is related that when one transgressed the truth, at that time no one could endure his anger, nor could anybody stop him, till Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam avenged that deed. A similar incident will be mentioned in the ensuing pages.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903460",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803290",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "47",
    "bookName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "babNumber": "47",
    "babName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "hadithNumber": "330",
    "hadithText": "'Aayeshah Radiyallahu 'Anha reports, that: \"It was not the nature of Rasulullah Sallallahu 'Alayhi Wasallam to talk indecently, nor did he engage himself in the use of obscene language. Nor did he shout and talk in the bazaars (which is against dignity). He did not avenge a bad deed with a bad one, but forgave it, and thereafter did not even mention it\".</b>",
    "bookID": "47.0",
    "grade1": "",
    "grade2": "",
    "comments": "Some people are by nature indecent and habituated to telling obscene jokes, some, in order to keep a gathering happy, indulge in indecent conversations. For this reason Sayyiditina 'Aayeshah Radiyallahu'Anha refused both. There is no harm if one goes into the bazaar to fulfil one's needs, but to go there and shout about is against dignity. One should in a quiet manner, complete ones needs and return. This also does not mean that by not shouting in the bazaar, he made a noise at other places. The object is that it is generally found that people make noise in the bazaars (while dealing etc.). If one is calm in the bazaars, it is apparent that at other places too one will be calm. The whole history of Sayyidina Rasulullah Sallallahu'Alayhi Wasallam is filled with incidents where he did not avenge a bad deed with a bad one. What types of torments and suffering did he not suffer at the hands of the non-believers? What did he not confront in the Battle of Uhud? When the Sahaabah Radiyallahu 'Anhum could not bear these happenings, they requested' Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam to curse these non-believers. Instead Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam made this du'aa: 'O Allah, grant my nation hidayah, for they know not'. Zayd bin Sa'nah Radiyallahu'Anhu who was a Jew, once began saying: 'There was not a sign of prophethood in Rasulullah Sallallahu 'Alayhi Wasallam which I had not found in him, except for two signs, which I did not have the opportunity to test. The first is that his hilm (gentleness) will overcome his anger. The second is, the more one acts foolishly towards him the more he will tolerate it. I looked for a chance to test these two signs, and kept on coming and going to his gatherings. One day Rasulullah Sallallahu 'Alayhi Wasallam came out of his house. 'Ali was with him. just then a badawi type of person came and said: 'O Rasulullah, my community have accepted Islaam, and I had told them that, if they became Muslims, they shall receive abundant sustenance. And now such a time has come where drought has befallen us. I fear that they will leave Islaam. If the idea is suitable, it is suggested that you assist them. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam looked towards a person who may have been 'Ali. He replied, 'Ya Rasulullah, there is nothing available'. Sayyidina Zayd Radiyallahu 'Anhu who was of the Jewish faith at that time, was witnessing this incident, he said. 'O Muhammad, if you can do this, a certain amount of dates of a certain person's palm grove be given to me at a fixed time, then I shall pay now in advance and collect the dates at the appointed time. Rasulullah Sallallahu 'Alayhi Wasallam replied this was possible, but if you do not stipulate the palm grove I can make an agreement. I accepted it, and paid eighty mith-qaal of gold (according to well known sayings one mithaqaal equals 100 grains or four and half maa-shaas approx. four and half grams). Sayyidina Rasulullah Sallahu 'Alayhi Wasallam gave the gold to this badawi and said to him, do not forget to be just, and fulfil their needs with this. Zayd Radiyallahu 'Anhu further says, when two or three days were left for the time to collect the dates, Rasulullah was sitting near a well while returning from a funeral with the Sahaabah, among whom were Abubakr, 'Umar, and 'Uthmaan. I came and caught the hem of the kurtah and sheet of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam and cynically said: 'O Muhammad, you do not want to pay my debt. I swear by Allah, that I know all the children of 'Abdul Muttalib very well. You are very poor payers'. 'Umar looked at me in anger and said: 'O enemy of Allah! what are you mumbling? I swear by Allah, that if I did not fear (the presence of Rasulullah) I would have severed your head'. Rasulullah was looking at me very calmly, and said smilingly to 'Umar: ''Umar, This person and I are in need of something more. He should have told me to take care in fulfilling his rights and should have advised in a better manner when putting forward his claim. Go take him and fulfil his rights, and for having scolded him give him in lieu twenty saa' (approximately two mann approx 66,5 kg) dates extra in excess of his right'. Umar took me and fulfilled my rights and gave me the twenty extra saa'. I asked: 'For what are these twenty extra saa'? ''Umar replied: 'This is the command of Rasulullah'. Zayd Radiyallahu 'Anhu said: ''Umar do you know me? 'Umar replied: No' I said: I am Zayd bin Sa'nah. He asked: 'The Allaamah (great learned) of the Jews? 'I replied: 'I am that very person'. He said: 'Being a man of such calibre, why did you behave before Rasulullah in such a manner?'. I replied: 'Two signs from the signs of prophethood were left, which I was not able to test. The first is the hilm (gentleness) of Rasulullah Sallallahu 'Alayhi Wasallam supersedes his anger. The second is that, the more one acts foolishly towards him, the more he will tolerate it. Now I have tested these two also, therefore I make you witness to my acceptance of Islam.<br><br>I give half of my wealth in charity (sadqah) to the ummah of Muhammad Sallallahu 'Alayhi Wasallam''. Therefore he returned to the noble presence of Rasulullah Sallallahu 'Alayhi Wasallam and accepted Islaam. Later he took part in many battles and was martyred in the Battle of Tabuk (May Allah be pleased with him). - Jam'u; Fawaa-id and Jam'ul Wasaa-il.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903470",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803300",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "47",
    "bookName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "babNumber": "47",
    "babName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "hadithNumber": "331",
    "hadithText": "'Aayeshah Radiyallahu 'Anha reports: \"Rasulullah Sallallahu 'Alayhi Wasallam did not hit anything with his mubaarak hands, besides the time when he made jihaad in the Path of Allah. He did not hit a servant nor a women (wife, slave girl etc.)\".</b>",
    "bookID": "47.0",
    "grade1": "",
    "grade2": "",
    "comments": "Hudhud is included in the Path of Allah and also jihaad. By hitting, it is meant to hit in anger, this in general usage is called hitting. This is not against one hitting un-intentionally and playfully, as has been mentioned in some ahaadith.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903480",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803310",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "47",
    "bookName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "babNumber": "47",
    "babName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "hadithNumber": "332",
    "hadithText": "'Aayeshah Radiyallahu 'Anha says: \"I have never seen Rasulullah Sallallahu 'Alayhi Wasallam avenge himself for a personal affliction, but if one transgressed a prohibited thing from those prohibited by Allah, (To commit a haraam act. The commentators on hadith say the rights of man are also included) then there was no one more angry than Rasulullah Sallallahu 'Alayhi Wasallam. Whenever Rasulullah Sallallahu 'Alayhi Wasallam was given a choice between two things, he always chose the one that was simple, if it did not lead to any type of sin\".</b>",
    "bookID": "47.0",
    "grade1": "",
    "grade2": "",
    "comments": "It is written in the books of history that in the Battle of Uhud when 'Utbah threw a stone at Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam and his mubaarak teeth became shaheed, and his blessed face became full of blood. A few among those present said. 'Make du'aa for the curse of that wicked person'. Instead Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam made this du'aa: 'O Allah, grant my people hidayah, for they do not know'. Once a badawi came and pulled the sheet of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam so hard that it made a mark an his mubaarak neck, the badawi then said: 'Load grain on these camels of mine. You do not give from your or your father's wealth (He meant as if the wealth in the baytul maal (treasury) belongs to us and not to you). Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam said. 'Till you do not compensate for pulling the sheet, I shall not make grain available to you'. He said: 'I swear by Allah, that I will not compensate you'. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was smiling and had grain loaded onto his camels. We are among those who used his mubaarak name and claim to follow him. If anything is said or done against our dignity, or if one uses a harsh word then we feel it against our dignity. The meaning of the last sentence in this hadith is that when Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was given a choice by Allah between two things, especially that which was in the interests of the ummah, he always chose the easy and simple thing for the ummah. In the same manner in worldly matters where a choice between two things were given, he chose the simple one as long as it did not have a shar'ee shortcoming in it. In many ahaadith under different subjects, that to put oneself into unnecessary difficulties was not liked by Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903490",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803320",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "47",
    "bookName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "babNumber": "47",
    "babName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "hadithNumber": "333",
    "hadithText": "'Aayeshah Radiyallahu 'Anha reports. \"A person asked permission to present himself before Rasulullah Sallallahu 'Alayhi Wasallam while I was with him. Rasulullah Sallallahu 'Alayhi Wasallam said: 'What a bad person is he among his community'. After saying this, he gave him permission to enter. After the person entered, he spoke very softly to him. When the person left I said: 'O Rasulullah, you said what you said before he entered, then you spoke so softly to him,. Rasulullah Sallallahu 'Alayhi Wasallam said: 'O 'Aayeshah, the worst person is that who stops speaking to one because of his indecency'\".</b>",
    "bookID": "47.0",
    "grade1": "",
    "grade2": "",
    "comments": "Most of the 'ulama have written that this person's name was 'Uyaynah. It is said that till then he had not sincerely accepted Islaam, but hypocritically and outwardly. Upto that time Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam treated the hypocrites in the same manner as he had treated the Muslims. Therefore he treated him in the same manner. After the death of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam when some people began turning away from Islaam (irtidaad), he also became a murtad, and openly declared the kufr that was in his heart. When he was brought before Sayyidina Abubakr Radiyallahu 'Anhu, the children of Madinah began jeering him that this person has also become a murtad (turned apostate). He replied: 'Since when have I been a Muslim that it may be said that I have become a murtad. He later became a Muslim, and took part in jihaad in the time of Sayyidina 'Umar Radiyallahu 'Anhu.<br><br>It is for this reason that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam pointed out this fact before he entered. Since this was intended to rectify (islaah) and to save others from harm, therefore this saying of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam cannot be termed according to the shari'ah as ghibah (backbiting). To mention a bad deed of a person with the intention that others may not fall into it, or be tricked into it, is not classed as those prohibited in ghibah. Some of the 'ulama have stated that this person was an open faasiq. It is permissible to make ghibah of the one who openly indulges in fisq and fujur. When he arrived in the presence of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, to make him feel at ease and captivate his heart, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam spoke softly to him, as was his noble habit. It was also the noble habit of sayyidina Rasulullah Sallallahu 'Alayhi Wasallam to speak softly to everyone. It is for this reason that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam made this clear to Sayyiditina 'Aayeshah Radiyallahu 'Anha and others, so they may not feel that by the courtesy shown by Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam to this person, that this person is honest and a well wisher, and due to this one may be deceived and fall into some, calamity, or a secret may be said before him. It is the habit of hypocrites to discuss the secrets of others so that they obtain special status and one's inner secrets. In the last sentence of the hadith the words 'worst person' could have two meanings. This may be referring to the person that presented himself. In order to keep away from his rudeness, he was treated in this manner, or this may be referring to the noble personage of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam that, 'When did you find me to be a rude person, that you were waiting for such a thing. He is an indecent person, and due to his indecency people will refrain from coming to him, and if I also speak like this, people must also stop coming to me'. As a result of which only he shall be a loser, but how could Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam tolerate him being a loser.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903500",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803330",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "47",
    "bookName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "babNumber": "47",
    "babName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "hadithNumber": "334",
    "hadithText": "Imaam Hasan Radiyallahu 'Anhu says, (my younger brother) Husayn said: \"I asked my father (Sayyidina 'Ali Radiyallahu 'Anhu) about the conduct of Rasulullah Sallallahu 'Alayhi Wasallam in his assemblies' He replied.. 'Rasulullah Sallallahu 'Alayhi Wasallam was always happy and easy mannered. There was always a smile and a sign of happiness on his blessed face. He was soft-natured and when the people needed his approval, he easily gave consent. He did not speak in a harsh tone nor was he stone-hearted. He did not scream while speaking, nor was he rude or spoke indecently. He did not seek other's faults. He never over-praised anything nor exceeded in joking, nor was he a miser. He kept away from undesirable language and did not make as if he did not hear anything. If he did not agree with the next person's wish he did not make that person feel disheartened, nor did he promise anything to that person. He completely kept himself away from three things: from arguments, pride and senseless utterances. He prohibited people from three things. He did not disgrace or insult anyone, nor look for the faults of others, he only spoke that from which thawaab and reward was attained. When he spoke, those present bowed their heads in such a manner, as if birds were sitting on their heads. (They did not shift about, as birds will fly away on the slightest move). When he completed his talks, the others would begin speaking. (No one would speak while Sayyidina Rasulullah Sallallahu'Alayhi Wasallam spoke. Whatever one wanted to say, it would be said after he had completed speaking). They did not argue before him regarding anything. Whenever one spoke to him the other would keep quiet and listen till he would finish. The speech of every person was as if the first person was speaking. (They gave attention to what every person said. It was not as is generally found that in the beginning people pay full attention, and if the talk is lengthened they became bored, and begin to pay less attention). When all laughed for something, he would laugh too. The things that surprised the people, he would also show his surprise regarding that. (He would not sit quietly and keep himself aloof from everyone, but made himself part of the gathering). He exercised patience at the harshness and indecent questions of a traveller. (Villagers usually ask irrelevant questions. They do not show courtesy and ask all types of questions. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not reprimand them but exercised patience). The Sahaabah would bring travellers to his assemblies (so that they themselves could benefit from the various types of questions asked by these people, and also hear some questions regarding which they themselves, due to etiquette, would not ask). Rasulullah Sallallahu 'Alayhi Wasallam' would say: 'When you see a person in need, then always 'help that person'. (If someone praised him, he would detest it). If someone, by way of thanks praised him, he would remain silent, (because it is necessary that one 'thank a person for a good favour or good deed. It is like one fulfilling one's duty. Some of the 'ulama have translated this as: 'If one did not exceed in praising him, he would keep silent'. That means if he exceeded he would prohibit him). He did not interrupt someone talking and did not begin speaking when someone else was busy speaking. If one exceeded the limits he would stop him or would get up and leave (so that that person would stop)\"</b>",
    "bookID": "47.0",
    "grade1": "",
    "grade2": "",
    "comments": "This hadith is a portion of hadith number seven in the previous chapter. The complete hadith of Sayyidina Imaam Husayn Radiyallahu 'Anhu is mentioned in the Jam'ul Fawaa-id and the Shifa of Qaadi 'Iyaad. lmaam Tirmidhi has mentioned this hadith in portions according to the relevant chapters.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903510",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803340",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "47",
    "bookName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "babNumber": "47",
    "babName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "hadithNumber": "335",
    "hadithText": "Jaabir Radiyallahu 'Anhu says. \"Rasulullah Sallallahu 'Alayhi Wasallam never said 'No' to a request of a person\".</b>",
    "bookID": "47.0",
    "grade1": "",
    "grade2": "",
    "comments": "If he was in possession of the required article at that moment, he gave it, otherwise he would promise to give it at another time, or he would make du'aa for the person, that Allah fulfil the person's need by some other means.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903520",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803350",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "47",
    "bookName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "babNumber": "47",
    "babName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "hadithNumber": "336",
    "hadithText": "Ibn 'Abbaas Radiyallahu 'Anhu says: \"Rasulullah Sallallahu 'Alayhi Wasallam was the most generous among people in performing good deeds (No one could compare with him in generosity. He himself led a simple life, but in giving he would put a king to shame. At a time of great need a woman presented him a sheet, and he wore it as he was in need of it. A person came to him, and asked him for it, he presented the sheet to that person. Taking of loans and fulfilling the needs of others, when the creditors came, and if something had come from somewhere, he would pay the debts, and did not go home till everything was given to the needy. There exists many incidents of this nature, so much so that it is not possible to enumerate them). Particularly in the month of Ramadaan, he would be more generous till the month ended. (His generosity in this month exceeded all the other months). In this month when Jibra-eel 'Alayhis Salaam came and recited the Qur-aan to Rasulullah Sallallahu 'Alayhi Wasallam, at that time his generosity exceeded the wind that brings forth heavy rains\".</b>",
    "bookID": "47.0",
    "grade1": "",
    "grade2": "",
    "comments": "Here the wind is described with speed, that the wind did not blow as fast, as did the generosity of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, or it is his widespread benefits, the benefits of rain are not so widespread, as that of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. The example of rain is just to illustrate, otherwise what connection has the rain with the generosity of Sayyidina Rasulullah Sallallahu'Alayhi Wasallam, as the rain only benefits in the growing of material things. The shower of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam benefits materially, spiritually, worldly and religiously. Rain gives life to the earth, and he gave life to the hearts. It is narrated in Tirmidhi that once there came for Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam ninety thousand Dirhams, the equivalent of which is more than twenty thousand Rupees. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam had the amount spread onto a sack, and had it distributed there and then. After it was distributed a person came to ask, the incident of which is mentioned in the commentary of hadith number thirteen in this chapter. Sayyidina Rasulullah Sallallahu'Alayhi Wasallam said to him, I have nothing left by me. You may loan from someone on my behalf, when I have something I shall pay that debt. This was the noble habit of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam What can one ask regarding this in the month of Ramadaan. It was a time when from the Lord of all the heavens, the best words were revealed at the best time, to the best of the creation by the malaa-ikah (angels). Sayyidina Rasulullah Salallahu 'Alayhi Wasallam was blessed with the highest and complete rank; and the highest rank is to have the qualities of Allah the Almighty. If one wishes to see a sample of the great mercies and blessings of Allah that descends in this month, read the book of this humble servant, titled 'Virtues of Ramadaan'.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903530",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803360",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "47",
    "bookName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "babNumber": "47",
    "babName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "hadithNumber": "337",
    "hadithText": "Anas Radiyallahu 'Anhu says: \"Rasulullah. Sallallahu 'Alayhi Wasallam did not store anything for the next day\".</b>",
    "bookID": "47.0",
    "grade1": "",
    "grade2": "",
    "comments": "Whatever he possessed, he fed it to the people till nothing was left. He did not keep anything, thinking that he would need it the next day. This is an example of the complete reliance of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam on Allah Ta'aala, that what the Lord had given today, He will give it tomorrow too. All this is regarding himself. The wives were given their expenses so that they might spend it in the manner they wished. If they wished they could have kept it or distribute it, but they too, being the wives of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam had this spirit. Once two bags of Dirhams were presented to Sayyiditina 'Aayeshah Radiyallahu 'Anha as a gift, the total of which amounted to more than one hundred thousand Dirhams. She ordered a tray, filled it and distributed it till there was nothing left. At the time she was fasting and had only one roti and olive oil, with which she made iftaar. The slave girl said. 'If we had purchased meat for one Dirham today, we could have broken our fasts with it'. She replied: 'What is the use of complaining now; if you had reminded me at that time I would have purchased it for you'. In the Hikaayatus Sahaabah, a few such incidents of these truthful followers have been compiled. If the meaning of the hadith is, that he did not leave anything for himself nor for his family till the next day, then too it will not be out of place.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903540",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803370",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "47",
    "bookName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "babNumber": "47",
    "babName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "hadithNumber": "338",
    "hadithText": "'Umar Radiyallahu 'Anhu reports that once a needy person came to ask Rasulullah Sallallahu 'Alayhi Wasallam for his need. Rasulullah Sallallahu 'Alayhi Wasallam replied: \"I do not have anything at present. Go and purchase something on my behalf. When something arrives I will pay for it\". 'Umar Radiyallahu 'Anhu said: \"O Messenger of Allah, whatever you possessed you have already given away. Allah Ta'aala did not make you responsible for that which is not in your means\". Rasulullah Sallallahu 'Alayhi Wasallam felt annoyed at this saying of 'Umar Radiyallahu'Anhu. Thereupon a person from among, the Ansaar said: \"O Rasul, of Allah, spend whatever you wish, and do not fear any lessening from the Lord of the 'Arsh (Throne)\". (That Great Deity that is the Lord of the 'Arsh, nothing will decrease in His Bounties by giving you). Rasulullah Sallallahu 'Alayhi Wasallam smiled and the happiness could be seen on his mubaarak face due to the saying of the Ansaari. Rasulullah Sallallahu 'Alayhi Wasallam than said: \"Allah Ta'aala has commanded me to do this\".</b>",
    "bookID": "47.0",
    "grade1": "",
    "grade2": "",
    "comments": "Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam also commanded Sayyidina Bilaal Radiyallahu 'Anhu to do this. Sayyidina Abu Hurayrah Radiyallahu. 'Anhu says Sayyidina Rasulullah Sallallahu 'Alayhi wasallam once saw a heap of dates by Sayyidina Bilaal Radiyallahu 'Anhu. Sayyidina Rasulullah Sallallahu'Alayhi Wasallam asked what is this. He replied: 'I have kept it for my future needs'. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam said: 'Do you not fear that because of this, tomorrow on the day of qiyaamah, the smoke of jahannam will reach you'. After this he also said. 'Spend O Bilaal, and do not fear the Lord of the 'Arsh, that it will become less'. Who has the strength to cover all the incidents of the generosity of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. For his generosity it was not necessary that he possessed something. It was the general practice of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam to take a loan and spend on the needy, as is mentioned in the hadith under discussion. Sayyidina Bilaal Radiyallahu 'Anhu was once asked: 'What was the method of the expenditure of Rasulullah Sallallahu 'Alayhi Wasallam?'. He replied: 'Rasulullah Sallallahu 'Alayhi Wasallam did not keep anything. Till the end I was responsible for handling it. It was his noble habit that when a person accepted Islaam and came to him and if he saw this person unclothed, he commanded me to clothe that person. I would obtain a loan from somewhere and purchase clothing and food for that person. Once a person from the mushrikeen (polytheists) came to me, and began saying that I have a lot of wealth, whatever loan you may need take it from me, and it is not necessary to take a loan from anyone else. I began to obtain loans from him. One day I performed wudu and as I was preparing to call out the adhaan, I saw that mushrik (polytheist) coming with a few merchants. Upon seeing me he began to say 'O Habshi' I replied: 'I am present.'. He began to swear at me in a cynical manner, and asked: 'How many days are left till the end of this month?' I replied: 'The month is nearly ending'. He said: 'Four days are left. If you do not pay your loans by that time. I will make you a slave in lieu of my debt. The way you were grazing sheep before in slavery, your position will become the same'. Sayyidina Bilaal Radiyallahu 'Anhu says: 'Whatever becomes of a person as a result of such threats, the same overtook me.<br><br>After 'eshaa I came in the presence of Rasulullah Sallallahu 'Alayhi Wasallam and narrated the whole incident to him, then I said: 'There is no way to pay this debt so quickly, nor do you have anything nor do I have anything I will hide away. When you pay the debt I will come out, otherwise, that mushrik will disgrace me very much'. Before the morning prayers a person came running to me and said that Rasulullah Sallallahu 'Alayhi Wasallam is calling you. When I presented myself, Rasulullah Sallallahu'Alayhi Wasallam said: 'Allah Ta'aala has made a means to pay your debt. These four camels are standing, and are laden with gifts sent by the ruler of Fadak. I paid the full debt that morning, and informed Rasulullah Sallallahu 'Alayhi Wasallam that Allah Ta'aala has freed you from debts. Rasulullah Sallallahu 'Alayhi Wasallam asked: 'Is there anything left from the gifts or not?'. I replied: 'A little is left'. Rasulullah Sallallahu 'Alayhi Wasallam said: 'Distribute it, so that I may be at ease'. The evening fell and yet there was some left. After 'eshaa Rasulullah Sallallahu 'Alayhi Wasallam inquired again, upon which I replied: 'The needy ones did not arrive, there is still some left'. Thereupon Rasulullah Sallallahu'Alayhi Wasallarn spent the night in the masjid and did not go home. The next day after 'eshaa he inquired again, whereupon I replied: 'Allah Ta'aala has freed you from its responsibilities. Everything has been distributed'. Rasulullah Sallallahu'Alayhi Wasallam then thanked Allah, and went to his home. - Abu Dawud.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903550",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803380",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "47",
    "bookName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "babNumber": "47",
    "babName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "hadithNumber": "339",
    "hadithText": "Rubayyi' bint Mu'awwidh bin 'Af-raa Radiyallahu 'Anha says: \"I brought to Rasulullah Sallallahu 'Alayhi Wasallam a tray full of dates, and some small cucumbers. Rasulullah Sallallahu 'Alayhi Wasallam gave me a handful of jewellery\".</b>",
    "bookID": "47.0",
    "grade1": "",
    "grade2": "",
    "comments": "This hadith has been explained in hadith number six and seven, in the chapter of the fruits of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903560",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803390",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "47",
    "bookName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "babNumber": "47",
    "babName": "Chapter 47. Noble Character And Habits Of Sayyidina Rasoolullah",
    "hadithNumber": "340",
    "hadithText": "'Aayeshah Radiyallahu 'Anha reports that Rasulullah Sallallahu 'Alayhi Wasallam accepted gifts, and also gave presents in return.</b>",
    "bookID": "47.0",
    "grade1": "",
    "grade2": "",
    "comments": "It is a sign of complete etiquette, that the feeling of a person is taken into consideration in returning a present. There is no benefit for one in not re-compensating a gift. Many a time due to intense love one goes through hardships to give presents. In re-compensating a present one is also made happy. It does not result in a loss, but is of benefit. Therefore in some ahaadith instead of 'Wa yuthibu minha' (and he re-compensated it), 'Wa yuthibu khayram minha' (and he re-compensated something better than it) is mentioned. From other ahaadith too this noble habit of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is evident, that he gave more in return for a present received.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903570",
    "last_updated": "2012-04-26 07:00:00"
  }
]