[
  {
    "englishURN": "1803480",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "babNumber": "50",
    "babName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "hadithNumber": "349",
    "hadithText": "Ibn Seereen RA. says: \"We were once in the company of Abu Hurayrah Radiyallahu 'Anhu. He was wearing a lungi and a sheet, both of which were made of kataan (a fine type of cloth) and were dyed reddish in colour. He (Abu Hurayrah) cleaned his nose with one of these, and said in surprise: 'Allah! Allah!, Abu Hurayrah is cleaning his nose today with a cloth of kataan. There was a time when I was lying unconscious between the mimbar of Rasulullah Sallallahu'Alayhi Wasallam and the room of 'Aayeshah Radiyallahu 'Anha because of severe hunger. People trampled my neck thinking I had become mad, whereas I was not mad, but severe hunger was the cause of the condition'\".</b>",
    "bookID": "50.0",
    "grade1": "",
    "grade2": "",
    "comments": "Kataan is a fine type of cloth. The author of 'Lughaatus Saraah' writes that it is a fine type of cloth made of the skin of grass. The author of 'Muhit Aa'zam' writes that kataan is called 'alsi' in Hindi, and the cloth is woven from grass. Sayyidina Abu Hurayrah Radiyallahu 'Anhu's neck was trampled on because in those days a mad person's neck was pressed as a cure. This hadith is included here on the life of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam to show that if the condition of the near and beloved one's of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was this, then what must have been his own condition. These people of the Suffah were regarded as the guests of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, and whatever (food etc.) was received, was distributed among them. Sayyidina Abu Hurayrah Radiyallahu 'Anhu says: \"I once inquired from 'Umar Radiyallahu 'Anhu about an aayah. We were walking together and he was explaining the aayah to me. I could not walk much (due to hunger) and fell unconscious\". Today the Muslims are making an issue of their poverty. The question of food has become so important that because of it, people resort to all sorts of irreligious activities. Does our suffering constitute even one percent of this? Yet with these difficulties the Sahaabah Radiyallahu 'Anhum did not tolerate any disgrace of our deen.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "0",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803490",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "babNumber": "50",
    "babName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "hadithNumber": "350",
    "hadithText": "Maalik bin Dinaar RA. says: \"Rasulullah Sallallahu 'Alayhi Wasallam never filled his stomach with meat and bread, except at the time of dafaf. I asked a badawi. 'What does dafaf mean?' He replied: 'It is to eat together with people\".</b>",
    "bookID": "50.0",
    "grade1": "",
    "grade2": "",
    "comments": "The meaning of dafaf was 'khafi' or small. The linguists therefore still differ. For this reason Mailik bin Dinaar RA. asked a badawi the meaning. Some have said that 'to eat a stomachful in company means that if he was invited he ate a full meal, otherwise at ordinary times he did not have a chance to eat enough to fill his stomach. Some 'ulama have strongly rejected this by saying: \"To say this of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is a disgrace and a shameful act\". If this is attributed to someone in these times, it will be regarded as defamatory, for it is considered very rude for one to do so. According to this humble servant, there should be no objection to this, because in these times, if it is said of someone that he does not fill his stomach at home, it would mean that he is a miser, but as is well known, in those days poverty was widespread. It is also known that for many days Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam went without food. In spite of all this, whenever Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam received anything, he distributed it to the As-haab as-Suffab. In such circumstances when could he have ever filled his stomach? The commentators of this hadith misinterpreted it. Their instructions are a hujjah (testimony). Therefore if this explanation (of mine) is incorrect, may Allah Most High forgive me. I seek Allah's refuge from saying anything that does not befit His beloved Rasul, Sallallahu 'Alayhi Wasallam.<br><br>The majority of the 'ulama have disliked this interpretation. They state that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam ate a stomachful when invited so that guests would not get up with Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam while they still remained hungry. When Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam had guests, although not having anything available, he used to care for them, and find for them whatever could be made available. It is possible that his \"eating with company\" is meant in a general sense. It could either be at his own house or at some other person's place. In whichever gathering Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was, if he stopped eating, naturally all the others stopped eating.<br><br>Note: Wherever it is mentioned that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam ate a stomachful, it will mean he ate two-thirds of the stomach's capacity. This also applied at invitations. He never ate till his stomach was completely full at any gathering, nor while alone.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "0",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803500",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "babNumber": "50",
    "babName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "hadithNumber": "351",
    "hadithText": "Nu'maan ibn Bashir Radiyallahu 'Anhu says: \"Are you not in the luxuries of eating and drinking, whereas, I had observed that Rasulullah Sallallahu 'Alayhi Wasallam did not possess ordinary types of dates to fill his stomach\".</b>",
    "bookID": "50.0",
    "grade1": "",
    "grade2": "",
    "comments": "This hadith has already been discussed in hadith number two in the chapter of the curry of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903690",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803510",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "babNumber": "50",
    "babName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "hadithNumber": "352",
    "hadithText": "'Aayeshah Radiyallahu 'Anha reports: \"We the family of Muhammad Sallallahu 'Alayhi Wasallam did not light a fire for months in our homes. We sustained ourselves on dates and water\".</b>",
    "bookID": "50.0",
    "grade1": "",
    "grade2": "",
    "comments": "The reason of not lighting fires is, because there was nothing to cook. The 'ulama have written that water is mentioned because there were not enough dates, and without water the stomach could not be filled. First a few dates were eaten, thereafter an amount of water was drunk to fill the stomach. In another hadith it is stated 'Two full months would pass and the hilaal for the third month would be observed, and no circumstances warranted that a fire be lit in the houses of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam for cooking'. In a hadith it is stated: 'One month passed, then another month passed, there was no such occasion where a fire was lit in any of the houses of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam'. 'Urwah Radiyallahu 'Anhu asked his aunt Sayyiditina 'Aayeshah Radiyallahu 'Anha, 'O Aunt, on what did you sustain yourself? She replied: 'Dates and water. There were a few neighbours of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam from among the Ansaar who owned some animals that gave milk. If one of them sent some milk as a present, then we too would partake of it'. In a hadith it is stated: 'Once for one and half months continuously, no fire was lit in the house of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam for illumination or other purposes'. Fire for illumination means that a lamp or candle did not burn. Jam'ul Wasaa'il.<br><br>In a hadith it is narrated that Sayyidina Abubakr Radiyallahu 'Anbu once presented a leg of a goat. It was night time and Sayyiditina 'Aayeshah Radiyallahu 'Anha began cutting it into pieces in the dark. Someone said.. 'There is no lamp in the house'. She began to say: 'If there was oil for a lamp, would it not have been used for cooking?' The 'ulama have written that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam preferred this way for himself and his family, although the keys of treasures were presented to him. The ummah thereafter split into four groups. One is that group that did not take interest in the material aspects of the world, nor did the world go towards them, like Sayyidina Abubakr Siddiqe Radiyallahu 'Anhu. The second group are those who did not take interest in worldly things, but the world took interest in them, like Sayyidina 'Umar Faaruq Radiyallahu 'Anhu. The third group are those who took interest in the material world, and the world also took interest in them, like the Banu Umayyah kings excluding 'Umar bin 'Abdul 'aziz Radiyallahu 'Anhu. The fourth group are those who went seeking for the material world, but the world did not turn towards them, like the one's whom Allah Ta'aala has made poor, and the love for the world has settled in their hearts. - Munaawi.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903700",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803520",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "babNumber": "50",
    "babName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "hadithNumber": "353",
    "hadithText": "Abu Talhah Radiyallahu 'Anhu says: \"We complained to Rasulullah Sallallahu 'Alayhi Wasallam about the severe pangs of hunger, and showed him the stones fastened on our stomachs. A stone was fastened on the stomach of every one of us due to severe hunger. Rasulullah Sallallahu 'Alayhi Wasallam showed us two stones fastened onto his stomach\". (Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam experienced more hunger than we did, and he had spent a longer period than us since he had last eaten).</b>",
    "bookID": "50.0",
    "grade1": "",
    "grade2": "",
    "comments": "It was a custom among the people of Madinah that they fastened stones onto their stomachs when they experienced severe pangs of hunger. This was done so that they do not feel weak while walking and that wind might not build up in the stomach. Some of the 'ulama are of the opinion that this is a special type of stone of Madinah known as mishba'ah. Allah Ta'aala has put this peculiarity in this stone that if it is worn it will cool the pangs of hunger. The first explanation is clearer, because even today this is done, that when severe hunger is experienced a cloth is tightly fastened around the stomach, which is beneficial for weakness and soothes the pangs of hunger. Some 'ulama say it is possible that wind collects in an empty stomach, and by fastening a stone or a heavy object, it gives relief from hunger. Some of the 'ulama have written that when the stomach is altogether empty, it is feared that the intestines will come down, especially when walking, and by fastening the stomach this fear does not remain. Also when the stomach becomes altogether empty, the back also becomes bent. It is possible that worms may appear. An objection may occur that in many ahaadith it is stated Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam fasted for many days continuously, and when the Sahaabah intended to do so, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam forbade them to do so, and said: 'This is specially for me, that I can fast for many days without eating, because Allah Ta'aala feeds me and gives me to drink'. How is this eating and drinking? This is on its place, but we find that by outwardly not eating, hunger did not have an effect on Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. In this case the necessity to fasten a stone on the stomach does not remain. Since there are many ahaadith on the fasting of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, for this reason some of the 'ulama have according to the principles and rules of hadith regarded this as a da'eef (weak) hadith but the findings of the majority of the muhadditheen is that there are many narrations on this subject. The differences between this hadith and the ones on fasting are not of such a nature, that it cannot be said that these were on different occasions. Therefore, the necessity does not arise to judge these ahaadith as weak. Many sayings have been mentioned on these two hadith. (a.) The narration of fastening a stone was in the early periods. It is a fact that Sayyidina Rasulullah Sallallahu. 'Alayhi Wasallam progressed spiritually as time went by. Therefore the narration on fasting will be that of a later period. (b.) The eating and drinking are particular with fasting. This is witnessed by the general Muslims too, that while in the state of fasting one does not feel the effects of hunger and tiredness as much as when one is not fasting. In this case what could be said regarding Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam when his fasting was of a high calibre and reached completeness. (c.) According to the different times both conditions are of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, like it is with the mashaa-ikh of suluk (spiritual guides), that at different times they experience different conditions. In this manner it will not be necessary to regard this hadith as that of the early periods. It is possible that in later times both conditions were experienced. (d.) Surely the effect of hunger did not affect Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. The fastening of stones was in sympathy and joining the poor and needy by becoming part of them. It is a general rule, that when the great experience some hardships, the fortunate young ones do not pay much attention to their own difficulties. In this case, what could be said of the Sahaabah Radiyallahu 'Anhum? whose love for Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam knew no bounds. (e.) Allah Ta'aala feeding Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was surely in honouring him, and not something incumbent. At times when the Sahaabah experienced great poverty and hunger, and it reached such a stage where stones had to be fastened on the stomach, at such a time Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not take the benefit of such favours. When a child suffers hunger, food does not go down a mother's gullet. In such a manner what could be said about Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, when his love for the ummah exceeded the love of thousands of mothers.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903710",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803530",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "babNumber": "50",
    "babName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "hadithNumber": "354",
    "hadithText": "Abu Hurayrah Radiyallahu 'Anhu reports: \"Once Rasulullah Sallallahu 'Alayhi Wasallam came out of his house at such a time, that it was not his noble habit to do so at that time. Nor did anyone come to meet him at that time. At that moment Abubakr Radiyallahu 'Anhu came to Rasulullah Sallallahu 'Alayhi Wasallam. He asked: 'What brought you here, O Abubakr?' Abubakr Radiyallahu 'Anhu replied: 'I came out to meet the Rasul of Allah, and look at his noble face. (This was due to the complete relationship of Abubakr Siddiqe Radiyallahu 'Anhu, that when Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam unexpectedly came out of his house, it had an effect on Abubakr Radiyallahu 'Anhu. According to this humble servant, this is the best explanation, and this complete relationship is the reason for the continuity of the khilaafah of Abubakr Radiyallahu 'Anhu with the nabawi period after the death of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. If someone else had been elected as a khalifah, then due to the incomplete relationship, there would have been some changes in the laws of the time. It would have been an additional sorrow after the demise of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam for the Sahaabah, and would have been unacceptable to them, whereas, Abubakr Radiyallahu'Anhu had such a close and deep relationship with Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam that on many aspects Abubakr Siddiqe Radiyallahu 'Anhu had the same thoughts as that of Sayyidina Rasulullah Sallallahu'Alayhi Wasallam. The incident of Hudaybiyyah is a testimony to this, which has already been mentioned in the book: 'Stories of the Sahaabah'. The Muslims felt so much humilation in accepting the harsh conditions of the non-believers that many among the Sahaabah could not bear it. 'Umar Radiyallahu 'Anhu anxiously came to Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam and said: 'O Messenger of Allah, are you not the truthful Nabi of Allah?' Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam replied: 'Indeed, I am'. 'Umar Radiyallahu 'Anhu said: 'Are we not on The Haq (True Path) and the enemy on falsehood?' Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam replied: 'Truly indeed'. 'Umar Radiyallahu 'Anhu said: 'Why are we being degraded in this manner in our deen?' Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam replied: \"I am the Messenger of Allah, and I cannot disobey Him. Verily He is my protector'. 'Umar Radiyallahu 'Anhu said: 'Did you not say to us that we are going to Makkah, and are going to perform the tawaaf?' Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam said: 'Verily it is true, but did I say that we will go this year to Makkah?' 'Umar Radiyallahu 'Anhu replied: 'No, you did not say this'. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam then said: 'We will surely go to Makkah and perform tawaaf'. After this 'Umar Radiyallahu 'Anhu with the same zeal went to Abubakr Radiyallahu 'Anbu and said: 'O Abubakr, is this not the truthful Nabi of Allah?' Abubakr Radiyallahu 'Anhu replied: 'Verily, yes'. 'Umar Radiyallahu 'Anhu asked: 'Are we not on the truth and the non-believers on falsehood?' Abubakr Radiyallahu 'Anhu replied: 'Verily, true'. 'Umar Radiyallahu 'Anhu then said: 'Why are we being disgraced in this manner for our deen?' Abubakr Radiyallahu 'Anhu replied: 'O man, without doubt, he is the truthful nabi, and he does not disobey Allah in the least, and only Allah is his protector. Hold fast unto his reigns'. 'Umar Radiyallahu 'Anhu replied: 'Did he not say to us that we will be going to Makkah, and will be performing the tawaaf?' Abubakr Radiyallahu 'Anhu replied: 'Did he promise you this that we will go this year?' 'Umar Radiyallahu 'Anhu replied: 'No, he did not say this to us'. Abubakr Radiyallahu 'Anhu said. 'You will go to Makkah and will also perform tawaaf '. This incident has been mentioned in detail in the Bukhaari.' There are many other similar amazing incidents. Even when Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam committed an ijtihaadi slip up, Abubakr Radiyallahu 'Anhu would also in that instance have the same opinion, as was the case with the prisoners of the Battle of Badr, the incident of which is mentioned at the end of Suratul Anfaal.<br><br>In this case Abubakr Radiyallahu 'Anhu presenting himself at an unusual moment is the case of the soul of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam having an influence on the heart of Abubakr Radiyallahu 'Anhu, as if he was also feeling hungry.<br><br>I remember everything of the Sorrow of separation O (beloved) Zaalim But I forget everything after seeing your countenance.<br><br>Some of the 'ulama state the coming of Abubakr Radiyallahu 'Anhu was due to hunger, but after seeing Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam this feeling of hunger vanished. Therefore on the inquiry of Sayyidina Rasulullah Sallallahu'Alayhi Wasallam, he did not mention this.<br><br>Some of the 'ulama have written that Abubakr Radiyallahu 'Anhu came due to the hunger he experienced, but he did not mention this, because it may become difficult for Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, for the difficulties of a friend supersedes the difficulties of one's self). A little while passed, when 'Umar Radiyallahu 'Anhu presented himself. Rasulullah Sallallahu'Alayhi Wasallam asked him the reason of presenting himself at such an odd time. He replied: 'Because of hunger, O Messenger of Allah'. Rasulullah Sallallahu 'Alayhi Wasallam said: 'I am also experiencing a bit of that'. All then went to the house of Abul Haytham Ansaari Radiyallahu'Anhu. He was the owner of many date palms, trees and sheep, and he did not have any servants. (For this reason he did all the work himself). They did not find him there. They asked his wife, 'Where is your companion?' She replied: 'He has gone to bring sweet water for us'. A little while had not passed, when Abul Haytham Radiyallahu 'Anhu experiencing difficulty arrived carrying the water bag. He put it down. He then came and honoured Rasulullah Sallallahu 'Alayhi Wasallam, his noble guest, and was pleased by the honour of meeting Rasulullah Sallallahu 'Alayhi Wasallam, (and proud of his good fortune, reciting and embracing him).<br><br>O companion when my benevolent moments will come. Without invitation you will come away to my home.<br><br>and began to sacrifice on Rasulullah Sallallahu 'Alayhi Wasallam his father and mother. (i.e. He was saying, may my father and mother be sacrificed on you). After that he requested them to come to his palm grove. He spread out for them a mat, then went to a palm and brought a,whole bunch (which had ripe, half ripe etc. kinds of dates on it), and put it before them. Rasulullah Sallallahu 'Alayhi Wasallam said: 'Why did you not only pick the ripe ones'. (rather than bringing the whole bunch). He (the host) said. 'Eat what pleases you from it'. They ate from it, and drank water. Rasulullah Sallallahu 'Alayhi Wasallam said there after, (of which every moment of his life was a means of education for the ummah), I swear an oath by the Being in whose hands lies my life, this is also included among those blessings of which one will be asked on the day of qiyaamah, (which Allah Ta'aala has mentioned at the end of Surah Takathur. It will be asked regarding gratitude. He then counted the blessings of that moment), the cool shadow, good fresh dates, and cold water. Thereafter the host started going to prepare meals, whereupon Rasulullah Sallallahu'Alayhi Wasallam said to him, in happiness do not just slaughter any animal, but slaughter an animal that does not give milk. The host slaughtered for them a female or male young goat. (He quickly prepared the food), and presented it before them. They partook of it' (Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam noticed that he was doing all the work by himself, and at the beginning he had brought the sweet water himself too). Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam inquired: 'Have you not any servants?' He replied: 'No' Whereupon Rasulullah Sallallahu 'Alayhi Wasallam said: 'When slaves shall arrive, remind us. Incidentally only two slaves were brought to Rasulullah Sallallahu 'Alayhi Wasallam. Abul Haytham Radiyallahu 'Anhu came to remind Rasulullah Sallallahu 'Alayhi Wasallam of his promise. Rasulullah Sallallahu'Alayhi Wasallam said: 'Choose any one of them'. (Where will such a Sahaabi who has sacrificed himself for Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam put forward his own desire in the presence of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. Therefore,) He said: 'O Nabi of Allah, you choose one for me'. (Besides piety, there could have been no other reason for liking and choosing a slave) Rasulullah Sallallahu 'Alayhi Wasallam said: 'An adviser is trustworthy (and by me being the trustworthy person) I choose this slave for you, as I had seen him perform his salaah. Remember my one advice, and that is to treat him well'. (First Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam mentioned the rule an adviser must adopt. Then reminded that my choice will be a responsible and trustworthy one. He then chose one and gave his reason for it, that the slave is one that upkeeps the salaah, therefore this slave was given preference. In our times, for an employee to be punctual with the salaah is a fault,' as it hinders the work of the employer). Abul Haytham Radiyallahu 'Anhu went (happily home, that he had someone to help him in his chores) to his wife, and told her what Rasulullah Sallallahu'Alayhi Wasallam had said. His wife said: \"You will not be able to fulfil exactly that which Rasulullah Sallallahu 'Alayhi Wasallam had commanded. It is difficult for us to truly carry out that noble advice, therefore free him, for by this it will be possible to fulfil the commands of Rasulullah Sallallahu 'Alayhi Wasallam'. The husband then said,. 'He is free'. (He did not care the least for his troubles and difficulties. When Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam came to know about this honourable sacrifice) Rasulullah Sallallahu 'Alayhi Wasallam said: 'For every nabi and his successors Allah Ta'aala creates two concealed advisers. One of which induces to do good and saves from committing evil. The other advises not to care the least in ruining and destroying a person. The one that is saved from this persons wickedness, is being saved from all ruin and destruction\".</b>",
    "bookID": "50.0",
    "grade1": "",
    "grade2": "",
    "comments": "The wife of Abul Haytham Radiyallahu 'Anhu was among the best advisers, through whose advice a pious slave, who kept up, his salaah, was freed. And she did not care the least of one's own troubles and difficulties. He did not also think that after such a long struggle a slave was obtained, at least let the slave work for a few days, so that we might rest, then later the slave could be freed.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903720",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803540",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "babNumber": "50",
    "babName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "hadithNumber": "355",
    "hadithText": "Sa'd bin Abi Waqqias Radiyallahu 'Anhu reports that from the ummah of Muhammad Sallallahu 'Alayhi Wasallam I was the first to take the blood of a non-believer, and I was the first to shoot an arrow in the path of Allah.We (the group of Sahaabah in the early period of Islaam) went for jihaad in such a state, where we had nothing to eat. We ate the leaves of tree and pods of the acacia tree. As a result our jaw became ulcerous and wounded, and because of the leaves our excreta was like that of sheep and camel. After that too the people of Banu Asad threatened me. If the status of my ignorance in the deen is such as these people claim, then this world and the hereafter is lost. (The days in this world have been spent in poverty and difficulty, and the state of the deen is this that I do not have knowledge of salaah too).</b>",
    "bookID": "50.0",
    "grade1": "",
    "grade2": "",
    "comments": "In this hadith Imaam Tirmidhi only wishes to describe the poverty and difficulties. Therefore this hadith has been shortened to show that due to the poverty and hardship the mujahideen did not even get food. This Muslim army ate leaves from the tree and made jihaad. In this hadith Sa'ad Radiyallahu 'Anhu mentioned his good deeds, dedication, and his being from among those veteran Muslims who accepted Islaam in its early stages. The reason for this is that during the reign of 'Umar Radiyallahu 'Anhu, he was amir of Kufah. Some residents of Kufah made many complaints against him to 'Umar Radiyallahu 'Anhu. They even complained that he did not perform salaah properly. 'Umar Radiyallahu 'Anhu sent for him. After calling him he said to him: 'The people are lodging many complaints against you. They are even complaining of your salaah'. In reply to that while stating his innocence, he mentioned his being from among the old Muslims, his sufferings in the path of Islaam etc. He said: 'These people threaten me on my salaah. I perform salaah in the same manner I have seen Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam perform it, and I am not lax in the least'. Upon that 'Umar Radiyallahu 'Anhu sent two people with him to Kufah, that they go around and investigate the matter. They did not leave out a single masjid of Kufah wherein they did not go and interview the musallis (worshippers). All praised Sa'ad Radiyallahu 'Anhu, but one person said: 'When you are asking to swear an oath and speak the truth, I shall say the facts to you, that Sa'ad Radiyallhu 'Anhu does not participate in jihaad, as if he is in love with his life. The second is that he does not distribute the wealth equally, and is not just in his verdicts'. Sa'ad Radiyallahu 'Anhu said: He has made three complaints, therefore I shall make three curses upon him. 'O Allah, if this person is a liar, and he has lifted his head for the sake of fame and to show the world, that by criticising a leader, fame is gained, then suitable to every false criticism, lengthen his life, increase in his poverty, and entangle him in mischief’s'. Thereafter, an eye witness reports that, I saw that person, due to old age his eye lids drooped, he fell into poverty, and molested girls in the streets and alleys. When someone asked him, what had happened to you, he used to reply: 'The curse of Sa'd (Radiyallahu 'Anhu) has befallen me'. O Allah, we seek protection from Your anger, the anger of Your Rasul, and the anger of Your pious servants. Sa'd Radiyallahu 'Anhu has drawn attention to three things in this hadith. (a). That he was the first to shed the blood of a non-believer. This incident took place before the hijrah. The people were suffering hardships and were troubled in Makkah. They hid from the non-believers and performed their salaah and other devotions. Once, a few persons, among whom was also Sa'd Radiyallahu 'Anhu, were performing salaah in a valley. Suddenly a group of non-believers appeared there. They tormented the Muslims and began fighting with them. Sa'd Radiyallahu 'Anhu picked up a jawbone of a camel that was lying there and threw it onto one of the non-believers, as a result blood began to flow. This is what is meant by shedding the blood of the non-believers. (b). That he was the first to shoot an arrow in the path of Allah. This incident took place in the first year hijri. This was the first sariyyah (expedition) that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam sent to Raabigh under the command of 'Ubaydah bin Haarith Radiyallahu 'Anhu. A battle took place against the non-believers, and arrows were shot from both sides. From the side of the Muslims Sa'd Radiyallahu 'Anhu was the first to shoot an arrow. (c). The third is of eating leaves in jihaad. This incident was during the Sariyyah of Khabt,`which according to different sources took place in the fifth year hijri. This incident in brief is that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam sent a group of three hundred Muhaajireen and Ansaar under the command' of 'Ubaydah ibnul Jarraah Radiyallahu 'Anhu to a place on the coast, which was a distance of about five days journey from Madinah Munawwarah, against the tribe of Juhaynah. In the beginning three camels were slaughtered daily. When the amir forbade the slaughtering of camels fearing these would decrease, dates were distributed. These also decreased till everyone received only one date daily. They kept on sucking it and drank water. When this too became scarce, the time came when leaves had to be shaken off trees and eaten. The meaning of khabt is to shake off leaves, therefore this sariyyah became well known as the Sariyyah of Khabt. The beginning of this incident was difficult and full of obstacles, and the end that of pleasantness, which could be read in the books on the history of Islaam. It has been briefly mentioned by this humble servant in the third chapter of my book 'Stories of the Sahaabah'.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903730",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803550",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "babNumber": "50",
    "babName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "hadithNumber": "356",
    "hadithText": "Khaalid bin 'Umayr Radiyallahu 'Anhu and Shaweesa Radiyallahu 'Anhu Reported that 'Umar Radiyallahu 'Anhu instructed 'Utbah bin \"Anhu Ghazwaan Radiyallahu 'Anhu that he should go with his companions (who consisted of three hundred mujahideen) towards the 'Ajami lands. And said: When you reach the boundary of the 'Arabian country, set up camp there\". (The reason was that 'Umar Radiyallahu 'Anhu received 10 reports that the 'Ajamis intended attacking the 'Arab lands. In other narrations Yazdajard had asked the 'Ajamis for aid. This was on their path. For this reason 'Umar Radiyallahu 'Anhu sent an army to set up a blockade and seal the way) The army left, and when they reached Marbad Basrah, they saw strange white stones. The people first began asking one another, 'what is this?' The people said it was Basrah. (Basrah in the original language means whitish stones. Subsequently this became the name of the town. As if they had answered that this was also a type of stone). After that they went forward (according to the instructions of 'Umar Radiyallahu 'Anhu) till they reached the small bridge (of the Dajlah). The people said, this is the place (that 'Umar Radiyallahu 'Anhu had chosen), and set up camp there. The narrator narrated the full incident (i.e. the coming of the army from Khuraasaan and the victory of 'Utbah Radiyallahu 'Anhu). (As the intention of Imaam Tirmidhi is to describe the hardships and poverty, which will be mentioned at the end of the narration, he has shortened this narration. 'Utbah Radiyallahu 'Anhu recited a khutbah after the victory, which is mentioned in the 'Arabic commentary. In this khutbah, he mentioned the temporary nature of this world, and that the hereafter is everlasting and eternal etc. After the hamd and thana, he said: \"The world is going to come to an end, and it is turning its face and going away. Only so much of the world is left, as when water is used up from a dish, and in the end only a little drop is left in it. You are going towards such a world which is everlasting and which will never come to an end. Therefore it is necessary that you go to such a world with the best you can attain, because it has been shown to us that jahannam - which is the abode for those who disobey Allah is so deep that if a pebble is thrown into it from the upper portion, it will not reach the bottom after seventy years. This place will be packed with people. How important it is that we take heed at this place. We have also been shown that jannah-which is the abode for those who obey Allah is so vast that the width of its door from one side to the other is the distance of forty years. It will also be filled with people. Therefore adopt only such deeds that will save one from the first abode, and will gain for one entrance in the abode of Allah's Pleasure. After that he mentioned his past condition, \"I had witnessed with Rasulullah Sallallahu 'Alayhi Wasallam this conditions that I am from among those seven people who were with Rasulullah Sallallahu 'Alayhi Wasallam. We had nothing with us besides the leaves of trees for eating. Our mouths became bruised by eating it. Incidentally I obtained a sheet, which I shared in half with Sa'd. (Even in this world of distress and difficulty, Allah Ta'aal, blessed them with this reward). There is none among the seven of us who has not been appointed an amir of some place. (Because this group endured many hardships and made many sacrifices before they were appointed amirs, therefore the treatment of their groups was of the best which will be known from the experiences of the Amirs after this) You will in the near future experience the trials of those who will come after this\".</b>",
    "bookID": "50.0",
    "grade1": "",
    "grade2": "",
    "comments": "Apparently the reason for 'Utbah Radiyallahu 'Anhu mentioning his condition is to make known two things. The first is that the difficulties that are experienced and tolerated in the path of the deen, are also mostly rewarded in this world. For the difficulties that one will experience, In-sha-Allah one will reap the rewards. The second is that if one confronts anything from an amir which disturbs one, one should tolerate it, as this is a very great blessing, compared to the conditions one will face in the near future.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903740",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803560",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "babNumber": "50",
    "babName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "hadithNumber": "357",
    "hadithText": "Anas Radiyallahu 'Anhu says: \"Rasulullah Sallallahu 'Alayhi Wasallam said: 'I have been threatened in the path at a time when no one else was threatened, and I have been harassed so much that no other person had experienced such harassments. I experienced thirty such nights and days wherein I and Bilaal Radiyallahu 'Anhu did not possess a thing, which a living creature can eat, except for the little that was hidden under the armpit of Bilaal Radiyallahu 'Anhu'\".</b>",
    "bookID": "50.0",
    "grade1": "",
    "grade2": "",
    "comments": "This incident as the author has mentioned in his 'Jaami' took place once when going out of Makkah. This was not at the time of hijrah, as Bilaal Radiyallahu 'Anhu did not accompany Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam at the time of hijrah. It took place at another time. The meaning of 'I had been threatened' is that in the early period when Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not have many companions and followers, he was troubled and mocked at in the path of Allah. It is natural that when a person is alone, hardships are felt more than if one is part of a group.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903750",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803570",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "babNumber": "50",
    "babName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "hadithNumber": "358",
    "hadithText": "Anas bin Maalik Radiyallahu 'Anhu reports that: \"At lunch or supper bread and meat did not appear together at the same time on the dastarkhan of Rasulullah Sallallahu 'Alayhi Wasallam, besides at the time of dafaf.</b>",
    "bookID": "50.0",
    "grade1": "",
    "grade2": "",
    "comments": "The 'Ulama give various meanings for dafaf. This has been explained in detail in the commentary of hadith number two of this chapter. Although the subject of this hadith is not the same as in the hadith mentioned there. Apparently it means, that when Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was alone, he partook whatever was available for meals, even if it was only bread or meat. He certainly would make an effort to have both things available when visitors arrived.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903760",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803580",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "babNumber": "50",
    "babName": "Chapter 50. The Living Of Sayyidina Rasoolullah",
    "hadithNumber": "359",
    "hadithText": "Nofal bin lyaas Al Hadhali Radiyallahu 'Anhu says: \"'Abdurrahmaan bin'Awf Radiyallahu'Anhu (who is a Sahaabi from among the 'Ashrah Mubash-sharah) was an associate of ours, and verily he was the best associate. Once we were returning from a place with him. On returning we went with him to his house. When he went home he first took a bath. After he had taken a bath, bread and meat was brought in a big utensil. Upon seeing this 'Abdurrahmaan Radiyallahu 'Anhu began to cry. I asked: 'What happened, why are you crying?'. He began saying: 'Till the demise of Rasulullah Sallallahu 'Alayhi Wasallam, nor did he, nor his family members ever fill their stomachs even if it was only with bread that was made of barley. Now after Rasulullah Sallallahu'Alayhi Wasallam, as far as I can think, this wealthy status of ours is not for any good'.</b>",
    "bookID": "50.0",
    "grade1": "",
    "grade2": "",
    "comments": "The Sahaabah Radiyallahu 'Anhum feared that this well being may not be included among that prediction, which is mentioned in the Qur-aan:<br><br>\"...Ye squandered your good things in the life of the world and sought comfort therein. Now this day ye are rewarded with the doom of ignominy because ye were disdainful in the land without a right, and because ye used to transgress\". - Suratul Ahqaaf, 20.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903770",
    "last_updated": "2012-04-26 07:00:00"
  }
]