[
  {
    "englishURN": "1803610",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "52",
    "bookName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
    "babNumber": "52",
    "babName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
    "hadithNumber": "362",
    "hadithText": "Ibn 'Abbaas Radiyallahu 'Anhu reports: \"Rasulullah Sallallahu 'Alayhi Wasallam lived in Makkah for thirteen years. (In these thirteen years) Wahi was revealed (to Rasulullah Sallallahu 'Alayhi Wasallam. After this he made hijrah from Makkah), and lived for ten years in Madinah. He passed away at the age of sixty three.</b>",
    "bookID": "52.0",
    "grade1": "",
    "grade2": "",
    "comments": "Different narrations have been narrated regarding the age of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, which has been briefly explained at the beginning of this chapter. According to the muhadditheen and historians this is the most correct narration.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903780",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803620",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "52",
    "bookName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
    "babNumber": "52",
    "babName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
    "hadithNumber": "363",
    "hadithText": "Mu'aa-wiyah Radiyallahu 'Anhu once said this in the khutbah: \"Rasulullah Sallallahu 'Alayhi Wasallam passed away at the age of sixty three. (The Shaykhayn, i.e.) Abubakr Radiyallahu 'Anhu and 'Umar Radiyallahu 'Anhu also passed away at the age of sixty three years. My age (at the moment) is also sixty three\".</b>",
    "bookID": "52.0",
    "grade1": "",
    "grade2": "",
    "comments": "It means that it is not impossible for me to be blessed with the following of this natural age. The muhadditheen write that this wish of Sayyidina' Mu'aa-wiyah Radiyallahu 'Anhu was not fulfilled. He passed away at the age of eighty years. Sayyidina 'Uthmaan Radiyallahu'Anhu was not mentioned here, although he had close ties with him. The reason is apparent, that the age of 'Uthmaan Radiyallahu 'Anhu was more than eighty years old when he was martyred. The reason for Imaam Tirmidhi mentioning this narration is to strengthen the previous narration, where it is stated that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam passed away at the age of sixty three years. The Shaykhayn were blessed with the natural following of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam in this matter. ",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903790",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803630",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "52",
    "bookName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
    "babNumber": "52",
    "babName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
    "hadithNumber": "364",
    "hadithText": "'Aayeshah Radiyallahu 'Anha reports: \"Rasulullah Sallallahu 'Alayhi Wasallam passed away at the age of sixty three years.</b>",
    "bookID": "52.0",
    "grade1": "",
    "grade2": "",
    "comments": "This narration is also to strengthen the previous narrations. It is confirmed from many narrations that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam attained the age of sixty three years. Therefore the narration that are contrary to these are not correct, or are not correct in their apparent form.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903800",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803640",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "52",
    "bookName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
    "babNumber": "52",
    "babName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
    "hadithNumber": "365",
    "hadithText": "Ibn 'Abbaas Radiyallahu 'Anhu narrates: \"Rasulullah Sallallahu 'Alayhi Wasallam passed away at the age of sixty five years\".</b>",
    "bookID": "52.0",
    "grade1": "",
    "grade2": "",
    "comments": "This narration is contrary to the previous narration. It shall be briefly discussed at the end of the chapter, and a reference to it has already been made at the beginning of the chapter.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903810",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803650",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "52",
    "bookName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
    "babNumber": "52",
    "babName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
    "hadithNumber": "366",
    "hadithText": "Daghfal bin Hanzalah Sadusi Radiyallahu 'Anhu narrates: \"Rasulullah Sallallahu 'Alayhi Wasallam passed away at the age of sixty five years\".</b>",
    "bookID": "52.0",
    "grade1": "",
    "grade2": "",
    "comments": "After mentioning this hadith, Imaam Tirmidhi says that Daghfal Radiyallahu 'Anhu was present in the time of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, and was of an old age. It is not proven that he had met Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. It points he had heard this narration from another person.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903820",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803660",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "52",
    "bookName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
    "babNumber": "52",
    "babName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
    "hadithNumber": "367",
    "hadithText": "Anas Radiyallahu 'Anhu reports: \"Rasulullah Sallallahu 'Alayhi Wasallam was not of a tall height nor was he short. (According to colour) he was not very white, nor very wheat coloured (dark). His mubaarak hair was not very curly nor very straight (but was slightly curled). He was blessed with prophethood at the age of forty, after that he lived for ten years in Makkah Mukarramah, and ten years in Madinah Munawwarah. At the age of sixty years Rasulullah Sallallahu 'Alayhi Wasallam passed away. At that time he did not have more than twenty white hair in his mubaarak head and beard\".</b>",
    "bookID": "52.0",
    "grade1": "",
    "grade2": "",
    "comments": "This hadith of Sayyidina Anas Radiyallahu 'Anhu has been mentioned at the beginning of the kitaab. In its commentary the three narrations have also been mentioned, and the explanations of the three different narrations have also been given. The 'ulama are unanimous in that the narrations where in the age of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is narrated as sixty three years are the most correct. The other hadith can be referred to this, or it may be possible that the later narrators may have slipped up. Therefore in this hadith Sayyidina Anas Radiyallahu 'Anhu it could be explained that many a times, at the time of counting, only the units are mentioned, and the fractions omitted. Sayyidina 'Urwah bin Zubayr Radiyallhu 'Anhu, the nephew of Sayyidiyina 'Aayesha Radiyallahu 'Anha has stated that the narration of Sayyidina Ibn 'Ababas Radiyallahu 'Anhu where the age is mentioned as sixty five years is incorrect. Mulla Ali Qaari has explained this in detail.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1903830",
    "last_updated": "2012-04-26 07:00:00"
  }
]