[
  {
    "englishURN": "1803880",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "55",
    "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "babNumber": "55",
    "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "hadithNumber": "389",
    "hadithText": "'Abdullah bin Mas'ud Radiyallahu 'Anhu reports that Rasulullah Sallallahu 'Alayhi Wasallam said: \"The one that has seen me in one's dream, has really seen me, as the shaytaan cannot impersonate me\".</b>",
    "bookID": "55.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "1904060",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803890",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "55",
    "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "babNumber": "55",
    "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "hadithNumber": "390",
    "hadithText": "Abu Hurayrah Radiyallahu 'Anhu reports that Rasulullah Sallallahu 'Alayhi Wasallam said: \"The one who sees me in one's dream, has actually seen me, because the shaytaan cannot imitate my person\".</b>",
    "bookID": "55.0",
    "grade1": "",
    "grade2": "",
    "comments": "The manner in which Allah Ta'aala has protected Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam from the shaytaan during his life time, in the same manner, after his death the shaytaan has not been given the power to impersonate Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. This is a decided fact. Now the question may arise that is the original form of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam seen?, that is, does the one who sees him obtain such strength that one will see him in his actual form, or does one see only his image. For example, if a person is sitting a little away from a mirror, another person who is also at a distance can see the image of the person in the mirror, but due to some obstruction cannot see the actual person. The sufis opine that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is seen both ways. Some people actually see Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam and some see his image, like the one described of the mirror. For this reason at times Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is seen in the form of others, as if that person is a mirror of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam.",
    "ourHadithNumber": "2",
    "matchingArabicURN": "1904070",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803900",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "55",
    "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "babNumber": "55",
    "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "hadithNumber": "391",
    "hadithText": "It is narrated from Abi Maalik AI-Ashja'ee (Sa'eed bin Taariq bin Ash-yam) Radiyallahu 'Anhu that Rasulullah Sallallahu 'Alayhi Wasallam said: \"The one who sees me in ones dream, has seen me\"</b>",
    "bookID": "55.0",
    "grade1": "",
    "grade2": "",
    "comments": "A question may arise that different people in different towns, and different countries see Sayyidina Rasullullah Sallallahu'Alayhi Wasallam at the same moment in their dreams. How can Sayyidina Rasulullah Sallallahu'Alayhi Wasallam be present at different places at one moment. This view carries no weight because it is not necessary that if many people see him at one time or moment, he is present everywhere, but it is possible that different people can see him at one place. It is like the sun which is in no one place and many people see it from many towns which are a distance from one another. Also whatever colour of spectacles are worn, red, green, etc. to see the sun, the sun will appear in that colour, despite the sun having its original colour and form.",
    "ourHadithNumber": "3",
    "matchingArabicURN": "1904080",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803910",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "55",
    "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "babNumber": "55",
    "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "hadithNumber": "392",
    "hadithText": "Kulayb bin Shihaab Al-Kufi says that Abu Hurayrah Radiyallahu 'Anhu narrated to me the mubaarak saying of Rasulullah Sallallahu 'Alayhi Wasallam, that whomsoever sees me in a dream, has really seen me, because the shaytaan cannot impersonate me. Kulayb says, I mentioned this hadith to Ibn 'Abbaas Radiyallahu 'Anhu and also told him that I was blessed with the seeing of Rasulullah Sallallahu 'Alayhi Wasallam in my dream. At that moment I thought of Hasan bin 'Ali Radiyallahu 'Anhu. I said to Ibn 'Abbaas Radiyallahu 'Anhu that I found the image in my dream very similar to that of Hasan Radiyallahu 'Anhu. Ibn 'Abbaas Radiyallahu 'Anhu verified my statement, that truly Hasan Radiyallahu 'Anhu was very similar to Rasulullah Sallallahu 'Alayhi Wasallam in appearance.<br><br></b>",
    "bookID": "55.0",
    "grade1": "",
    "grade2": "",
    "comments": "<br>In some narrations it has been related that the chest and the portion above it, of the body of Sayyidina Hasan Radiyallahu'Anhu was similar to that of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, and the lower portion of Sayyidina Husayn Radiyallahu 'Anhu was similar in appearance to that of Sayyidina Rasulullah Sallallahu'Alayhi Wasallam.",
    "ourHadithNumber": "4",
    "matchingArabicURN": "1904090",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803920",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "55",
    "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "babNumber": "55",
    "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "hadithNumber": "393",
    "hadithText": "Yazeed Al Faarisi bin Hurmuz, who was a calligrapher of the Qur-aan, once saw Rasulullah Sallallahu 'Alayhi Wasallam in his dream during the time of Ibn 'Abbaas Radiyallahu 'Anhu. He related his dream to Ibn 'Abbaas. Ibn 'Abbaas said: \"Rasulullah Sallallahu 'Alayhi Wasallam used to say that the shaytaan cannot imitate him. That person who has seen him in a dream has really seen him'. After mentioning this he asked: 'Can you describe this person whom you have seen in your dream?'. I replied: 'Yes, I can, I will describe to you a man whose body and height were of a medium stature. He had a wheat-coloured complexion with a bit of whiteness in it. Eyes like those that had kuhl on them. A smiling face. Beautiful and round face. A compact beard which surrounded his mubaarak face, and spread on the fore-portion of the chest\". 'Awf ibn Abl Jamilah, a narrator of this hadith says: \"I do not remember what other feature besides these, my ustaadh Yazeed, who is a narrator of this hadith, described\". Ibn 'Abbaas Radiyallahu 'Anhu said: \"If you had seen him while being awake, you would not have been able to describe him any further\"</b>",
    "bookID": "55.0",
    "grade1": "",
    "grade2": "",
    "comments": "As this has been mentioned at the beginning of the book, here too the noble features of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam have been described in the same manner.",
    "ourHadithNumber": "5",
    "matchingArabicURN": "1904100",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803930",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "55",
    "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "babNumber": "55",
    "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "hadithNumber": "394",
    "hadithText": "Abu Qataadah Radiyallahu 'Anhu reports that Rasulullah Sallallahu 'Alayhi Wasallam said: \"Whomsoever sees me, that is, in a dream, has seen that which is a fact\".</b>",
    "bookID": "55.0",
    "grade1": "",
    "grade2": "",
    "comments": "Meaning one has really seen me. It cannot be so that the shaytaan shows something else and says that it is Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. Some of the 'ulama have written that it means, it is a true dream and not a collection of thoughts. ",
    "ourHadithNumber": "7",
    "matchingArabicURN": "1904120",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803940",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "55",
    "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "babNumber": "55",
    "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "hadithNumber": "395",
    "hadithText": "Anas Radiyallahu 'Anhu reports that Rasulullah Sallallahu 'Alayhi Wasallam said: \"The one who sees me in a dream has really seen me, because the shaytaan cannot impersonate me\". He also said: \"A dream of a Muslim (conveyed through an angel) is a portion from the forty six portions of nubuwwah\"</b>",
    "bookID": "55.0",
    "grade1": "",
    "grade2": "",
    "comments": "The 'ulama have adopted different headings to its meaning. Haafizul Hadith Ibn Hajar has written a very lengthy treatise in his commentary on Bukhaari, wherein he has mentioned the sayings of many 'ulama. The author of Tabreez has also written in detail on this subject. Mulla 'Ali Qaari and others have written that this is the best, because it is said to be part of the 'ilmi nubuwwah (knowledge of prophethood), and the 'ulum of nubuwwah is particular only to the ambiyaa, therefore, it should be regarded as something special only to them. In brief, it is sufficient to know that a good and blessed dream is a great glad tiding and a portion from the portions of nubuwwah. This is enough for his nobility, greatness and blessedness. Only a nabi can know correctly if it is a forty sixth part of nubuwwah, and he is the only one who can correctly understand how and what this forty sixth portion is.<br><br>The discussion of seeing Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam in a dream ends here. Imaam Tirmidhi ends his kitaab by including two athars, which in reality are advices and also an important warning. The first is that one should not guess and give a ruling. The basis of the deen should be in following Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, and therefore in every verdict, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam should be obeyed and followed. The second is that the verdict of any ordinary person should not be accepted, the irreligious are not worthy of being followed. In reality both advices are very important.",
    "ourHadithNumber": "8",
    "matchingArabicURN": "1904130",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803950",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "55",
    "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "babNumber": "55",
    "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "hadithNumber": "396",
    "hadithText": "'Abdullah bin Mubaarak (was a great muhaddith, who is also counted among the jurists and sufis; a great shaykh, 'aabid and a pious and cautious person. He is also among those who memorised the hadith (Hafiz of Hadith). Many of his virtues and capabilities have been mentioned in the book of history. He said: \"If every one becomes a judge or arbitrator, then always follow that which has been narrated\".</b>",
    "bookID": "55.0",
    "grade1": "",
    "grade2": "",
    "comments": "The object here is that one should not follow one's own view and completely rely on one's own way of thinking, but should follow the sayings of the pious predecessors and the Sahaabah Radiyallahu 'Anhum. This is the general advice of 'Abdullah bin Mubaarak. In respect of all verdicts, whether it refers to the verdicts of justice or otherwise, as has been mentioned. Imaam Tirmidhi has mentioned this as a general advice, this is the view of all the commentators of the Shamaa-il. According to this humble servant, this may have a special relation to this chapter, that the interpretation of a dream is also a verdict, therefore in this too one should not confuse others by giving one's own judgments, but should refer to the interpretation of the learned ones of the past. Many interpretations of dreams have been related from Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. The Sahaabah Radiyallahu 'Anhum and the Taabi'een. The 'ulama of the sciences of interpreting dreams have written, it is necessary for one who interprets dreams to be understanding, pious, cautious and have knowledge of the Qur-aan and Sunnah of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. One should also possess knowledge of the 'Arabic language and its related sciences. Many other conditions and aadaab have been stipulated in books on interpretations of dreams.",
    "ourHadithNumber": "9",
    "matchingArabicURN": "1904140",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1803960",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "55",
    "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "babNumber": "55",
    "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
    "hadithNumber": "397",
    "hadithText": "Ibn Seereen says: \"The knowledge of hadith (in the same manner all other religious subjects) are included in the deen. Therefore before acquiring knowledge, be aware from whom knowledge is acquired\".</b>",
    "bookID": "55.0",
    "grade1": "",
    "grade2": "",
    "comments": "Ibn Seereen was also an Imaam of his time and is a famous Taabi-ee. He acquired 'ilm from many of the Sahaabah Radiyallahu 'Anhum, and is regarded as the imaam in the art of interpreting dreams. His interpretations of dreams are a hujjah (testimony). The object of his advice is that prior to acquiring knowledge from a person, one should first thoroughly investigate the state of the person's piety, honesty religion and maslak (rule of conduct). One should not follow the sayings of every person, because the following of the sayings of an irreligious person has its effects. This has also been commanded by Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam in a few narrations. This is a general advice as mentioned in athar number one. This athar may also be relevant to the subject of interpreting dreams, as this subject is also important. When a good dream is a portion from the portions of nubuwwah, its importance can be understood. Therefore one should always be careful from whom one is seeking an interpretation of a dream. Is that person capable of interpreting a dream or not. It is for this reason that Imaam Tirmidhi has mentioned this athar here. This advice of Ibn Seereen is not particular or confined to the subject of dreams, but includes all other sciences. The more important the signs are, the more it becomes necessary to seek a competent and knowledgeable person. In our times which is close to the time of qiyaamah, a very dangerous and detrimental element has appeared. That every person, however unlearned or irreligious, after delivering a short inspiring lecture, or writing an article on a aspect of the deen, begins to be considered an 'allaamah or an 'aalim, and by donning coloured clothing begins to be regarded as a sufi, hence people ignorantly begin to follow such a person. In the beginning the general public due to some misunderstanding begin following such a person, and because of their ignorance they are caught in their web. This is because of a general misunderstanding, which has entered the hearts of the public, that 'See what is said and not who has said it'. Although this saying is true, it is for those who understand and differentiate, that which is being said, is it a fact or is it false? Those who cannot differentiate should not follow the sayings of every person they come across, as this will result in a bad and detrimental ending. It is for this reason that in these times, if one claims to be a saint, imaam, or prophet, and Allah forbid, also that of being a God, one group always immediately begins to follow that person. And to Allah is our complaint, and He is the One that grants assistance.",
    "ourHadithNumber": "10",
    "matchingArabicURN": "1904150",
    "last_updated": "2012-04-26 07:00:00"
  }
]