[
  {
    "englishURN": "1800480",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "7",
    "bookName": "Chapter 07. Kuhl Of Rasoolullah ",
    "babNumber": "7",
    "babName": "Chapter 07. Kuhl Of Rasoolullah ",
    "hadithNumber": "48",
    "hadithText": "Ibn 'Abbaas Radiyallahu 'Anhu says: \"Rasulullah Sallallahu 'Alayhi Wasallam said: 'Use kuhl made of ithmid on the eye; it brightens the eyesight, and strengthens and increases the growth of the eye lashes'. (Sayyidina Ibn'Abbaas Radiyallahu'Anhu also used to say) 'Rasulullah Sallallahu 'Alayhi Wasallarn had a small container for keeping kuhl, from which he applied kuhl in each eye three times every night\"'</b>",
    "bookID": "7.0",
    "grade1": "",
    "grade2": "",
    "comments": "Ithmid is a special type of kuhl which is reddish black in colour. It is obtained in the Eastern countries. Some of the learned say it is the Isfahaani kuhl, and other say it is the Totiya. Some 'ulama say, it means those who have good eyesight and it should be used by those with whose eyesight it agrees, otherwise a sick person's eyes will pain more by its use. It is more beneficial to apply kuhl at the time of sleeping as it will remain longer in the eyes, and will penetrate more into the pores. There are different narrations on the number of times it should be applied in each eye. In a few it is stated that it should be applied three times in each eye, as mentioned above. In other narrations it is stated that it should be put three times in the right eye and two times in the left eye. It is supposed that the variations are because of the different times of the narrations. At a certain time, Sayyidina Rasulullah Sallallahu alayhi Wasallam applied it in one manner and at another time in the other manner. Haafiz Ibn Hajar, Mulla 'Ali Qaari and other 'ulama have preferred the first method (as given in the hadith under discussion). the first method has been narrated many times from Sayyidina Rasulullah Sallallahu' Alayhi Wasallam, as will be seen in the narration that follow.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900490",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800490",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "7",
    "bookName": "Chapter 07. Kuhl Of Rasoolullah ",
    "babNumber": "7",
    "babName": "Chapter 07. Kuhl Of Rasoolullah ",
    "hadithNumber": "49",
    "hadithText": "Ibn 'Abbaas Radiyallahu 'Anhu reports: \"Rasulullah Sallallahu 'Alayhi Wasallam applied kuhl of ithmid three times in each eye before sleeping'. In a narration also from Ibn 'Abbaas Radiyallahu 'Anhu, it is reported: \"Rasuluilah Sallallahu'Alayhi Wasallam had a small container for keeping kuhl, from which he applied in each eye kuhl three times before sleeping'.</b>",
    "bookID": "7.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900500",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800500",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "7",
    "bookName": "Chapter 07. Kuhl Of Rasoolullah ",
    "babNumber": "7",
    "babName": "Chapter 07. Kuhl Of Rasoolullah ",
    "hadithNumber": "50",
    "hadithText": "Jaabir bin 'Abdullah Radiyallahu 'Anhu says: \"Rasulullah Sallallahu 'Alayhi Wasallam said: 'Use the kuhl made from ithmid for the eyes. It brightens the vision and strengthens the growth of the eye lashes'.</b>",
    "bookID": "7.0",
    "grade1": "",
    "grade2": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900510",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800510",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "7",
    "bookName": "Chapter 07. Kuhl Of Rasoolullah ",
    "babNumber": "7",
    "babName": "Chapter 07. Kuhl Of Rasoolullah ",
    "hadithNumber": "51",
    "hadithText": "Ibn 'Abbaas Radiyallahu 'Anhu says: \"Rasulullah Sallallah 'Alayhi Wasallam has said: 'The best from among all the kuhl used by you is the one made from ithmid. It brightens the eyesight and strengthens the growth of the eye lashes\"'</b>",
    "bookID": "7.0",
    "grade1": "",
    "grade2": "",
    "comments": "One of the narrators in the chain of this hadith is Bishr bin Mufaddal RA. The 'ulama wrote that he performed four hundred rak'ahs nafl daily, and it was his permanent practice to fast every alternate day.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900520",
    "last_updated": "2012-04-26 07:00:00"
  },
  {
    "englishURN": "1800520",
    "collection": "shamail",
    "volumeNumber": "1",
    "bookNumber": "7",
    "bookName": "Chapter 07. Kuhl Of Rasoolullah ",
    "babNumber": "7",
    "babName": "Chapter 07. Kuhl Of Rasoolullah ",
    "hadithNumber": "52",
    "hadithText": "'Abdullah bin 'Umar Radiyallahu 'Anhu related the same hadith from Rasulullah Sallallahu 'Alayhi Wasallarn that: \"Verily use the kuhl made from ithmid. It brightens the vision and strengthens the growth of the eye lashes\".</b>",
    "bookID": "7.0",
    "grade1": "",
    "grade2": "",
    "comments": "In all the above narrations the use of kuhl made from ithmid has be stressed. Only those eyes are meant, that agree with the use of it, otherwise, because of certain eye conditions kuhl does not agree with some people, as was mentioned previously. The 'ulama have written that due to these commands and practices it is sunnah to use kuhl, and it is better to use the one made from ithmid. If one uses kuhl made from any other substance it will be regarded as sunnah, but the virtue is obtained by using kuhl made of ithmid.",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1900530",
    "last_updated": "2012-04-26 07:00:00"
  }
]