[
  {
    "indonesianURN": "3114520",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1452",
    "hadithText": "Telah menceritakan kepada Kami Muhammad bin Rafi', dan Harun bin Abdullah secara makna, mereka berkata; telah menceritakan kepada Kami Ibnu Abu Fudaik dari Adh Dhahhak yaitu Ibnu Utsman dari Salim Abu An Nadhr dari Busr bin Sa'id dari Zaid bin Khalid Al Juhani bahwa Rasulullah shallAllahu wa'alaihi wa sallam ditanya mengenai barang temuan. Kemudian beliau berkata: \"Umumkan selama satu tahun, kemudian apabila orang yang mencarinya telah datang maka berikan kepadanya, jika tidak maka katahuilah kantongnya dan talinya kemudian makanlah, kemudian apabila orang yang mencarinya telah datang maka kembalikan kepadanya.\"</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "917090",
    "last_updated": null
  },
  {
    "indonesianURN": "3114540",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1454",
    "hadithText": "Telah menceritakan kepada Kami Musaddad, telah menceritakan kepada Kami Khalid yaitu Ath Thahhan, dan telah diriwayatkan dari jalu yang lain: Telah menceritakan kepada Kami Musa bin Isma'il, telah menceritakan kepada Kami Wuhaib secara makna, dari Khalid Al Hadzdza` dari Abu Al 'Ala` dari Mutharrif yaitu Ibnu Abdullah dari 'Iyadh bin Himar, ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barang siapa yang mendapatkan barang temuan, maka hendaknya ia memperlihatkan kepada orang yang adil dan tidak menyembunyikannya, kemudian apabila pemiliknya telah datang maka hendaknya ia mengembalikannya kepadanya. Jika tidak maka itu adalah harta Allah 'azza wajalla yang diberikan kepada orang yang Dia kehendaki.\"</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "917120",
    "last_updated": null
  },
  {
    "indonesianURN": "3114560",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1456",
    "hadithText": "Telah menceritakan kepada Kami Muhammad bin Al 'Ala`, telah menceritakan kepada Kami Abdullah bin Wahb dari 'Amr bin Al Harits dari Bukair bin Al Asyajj dari 'Ubaidullah bin Miqsam menceritakannya, dari seorang laki-laki dari Abu Sa'id Al Khudri radliallahu 'anhu bahwasanya Ali Bin Abu Thalib radliallahu 'anhu menemukan uang satu dinar, kemudian membawanya kepada Fathimah radliallahu 'anha, lalu ia menanyakannya kepada Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallla Allahu 'alaihi wa sallam berkata: itu adalah rizqi dari Allah 'azza wajalla, kemudian beliau memakannya dan begitu juga Ali serta Fathimah. Kemudian setelah itu seorang wanita datang kepada beliau mengumumkan kehilangan uang satu dinar, maka Rasulullah shallallahu 'alaihi wasallam mengatakan kepada Ali: wahai Ali, berikan uang satu dinar tersebut kepadanya.</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "917170",
    "last_updated": null
  },
  {
    "indonesianURN": "3114570",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1457",
    "hadithText": "Telah menceritakan kepada Kami Al Haitsam bin Khalid Al Juhani, telah menceritakan kepada Kami Waki' dari Sa'd bin Aus dari Bilal bin Yahya Al 'Absi dari Ali Bin Abu Thalib radliallahu 'anhu bahwa ia menemukan uang satu dinar lalu dia menggunakannya untuk membeli tepung, pedagang tepung mengetahuinya, kemudian ia mengembalikan uang dinar tersebut kepadanya dan Ali pun mengambilnya lalu dia memotongn sebagian darinya dua kirath lalu ia gunakan untuk membeli daging.</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "917180",
    "last_updated": null
  },
  {
    "indonesianURN": "3114580",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1458",
    "hadithText": "Telah menceritakan kepada Kami Ja'far bin Musafir At Tanusi, telah menceritakan kepada Kami Ibnu Abu Fudaik, telah menceritakan kepada Kami Musa bin Ya'qub Az Zama'i, dari Abu Hazim dari Sahl bin Sa'd, ia telah mengabarkan kepadanya bahwa Ali Bin Abu Thalib menemui Fathimah sementara Hasan dan Husain sedang menangis, dia bertanya; apa yang membuat mereka menangis? Fathimah menjawab; rasa lapar. Kemudian Ali keluar dan dipasar dia menemukan uang satu dinar, lalu ia kembali kepada fathimah memberitahukan kepadanya, lalu Fathimah berkata; pergilah kepada fulan seorang yahudi, dan belilah tepung untuk Kami, maka dia pun mendatangi orang yahudi tersebut untuk membeli tepung. Orang yahudi tersebut berkata: apakah engkau menantu orang yang disebut sebagai Rasulullah? Dia menjawab; ya! Orang yahudi tersebut berkata; ambillah uang dinarmu dan tepung ini untukmu! Maka Ali kembali kepada Fathimah dan memberitahukan kejadian tersebut, lalu Fathimah meminta Ali untuk pergi ketukang daging untuk membeli daging satu dirham. Maka Ali menggadaikan satu dinar dengan daging seharga satu dirham lalu ia membawanya kepada Fathimah dan Fatimah pun mengadon dan membuat roti, lalu dia mengirim utusan kepada bapaknya kemudian beliau datang. Lalu ia berkata; ya RasulAllah, aku akan bercerita kepadamu, apabila anda menganggapnya halal maka Kami akan memakannya dan anda pun memakannya bersama Kami. Kemudian beliau berkata: \"Makanlah dengan menyebut nama Allah.\" Tatkala mereka sedang pada kondisi seperti itu tiba-tiba terdapat seorang yang mengumumkan kehilangan uang satu dinar. Maka Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk memanggilnya dan menanyakannya. Orang tersebut menjawab; uang tersebut terjatuh dariku di pasar. Kemudian Nabi shalla Allahu 'alaihi wa sallam berkata: \"Wahai Ali, pergilah ke tukang daging dan katakan kepadanya bahwasanya Rasulullah shallla Allahu 'alaihi wa sallam mengatakan kepadamu: \"Kirimkan satu uang dinar tersebut sedangkan uang dirhammu menjadi tanggunganku.\" Maka tukang daging tersebut mengembalikan satu dinar dan Rasulullah shallla Allahu 'alaihi wa sallam menyerahkannya kepada orang tersebut.</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "917190",
    "last_updated": null
  },
  {
    "indonesianURN": "3114590",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1459",
    "hadithText": "Telah menceritakan kepada Kami Sulaiman bin Abdurrahman Ad Damasyqi, telah menceritakan kepada Kami Muhammad bin Syu'aib dari Al Mughirah bin Ziyad dari Abu Az Zubair Al Makki bahwa ia menceritakan kepadanya, dari Jabir bin Abdullah, ia berkata; Rasulullah shallallahu 'alaihi wasallam memberikan keringanan kepada Kami untuk menggunakan tongkat, pecut, tali dan yang semisalnya yang Kami temukan. Abu Daud berkata; hadits ini diriwayatkan An Nu'man bin Abdussalam dari Al Mughirah Abu Salamah dengan sanadnya. Dan diriwayatkan oleh Syababah dari Al Mughirah bin Muslim dari Abu Az Zubair dari Jabir, ia berkata; mereka tidak menyebutkan Nabi Shalla Allahu 'alaihi wa sallam.</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "17",
    "matchingArabicURN": "917200",
    "last_updated": null
  },
  {
    "indonesianURN": "3114600",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1460",
    "hadithText": "Telah menceritakan kepada Kami Makhlad bin Khalid, telah menceritakan kepada Kami Abdurrazzaq, telah mengabarkan kepada Kami Ma'mar dari 'Amr bin Muslim dari Ikrimah, aku mengira dari Abu Hurairah radliallahu 'anhu bahwa Nabi shalla Allahu 'alaihi wa sallam bersabda: \"Unta yang terlepas yang disembunyikan maka dendanya adalah seperti onta tersebut dan ditambah dengan yang semisalnya.</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "18",
    "matchingArabicURN": "917210",
    "last_updated": null
  },
  {
    "indonesianURN": "3114610",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1461",
    "hadithText": "Telah menceritakan kepada Kami Yazid bin Khalid bin Mauhib serta Ahmad bin Shalih, mereka berkata; telah menceritakan kepada Kami Ibnu Wahb, telah mengabarkan kepadaku 'Amr dari Bukair dari Yahya bin Abdurrahman bin Hathib dari Abdurrahman bin Utsman At Taimi bahwa Rasulullah shallAllahu wa'alaihi wa sallam melarang dari barang temuan dari orang yang melakukan haji. Ahmad berkata; Ibnu Wahb berkata mengenai barang temuan dari orang yang melakukan haji; ia tinggalkan hingga ditemukan pemiliknya. Ibnu Mauhib berkata; dari 'Amr.</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "19",
    "matchingArabicURN": "917220",
    "last_updated": null
  },
  {
    "indonesianURN": "3114620",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1462",
    "hadithText": "Telah menceritakan kepada Kami 'Amr bin 'Aun, telah mengabarkan kepada Kami Khalid dari Abu Hayyan At Taimi dari Al Mundzir bin Jarir, ia berkata; aku bersama Jarir di Al Bawazij, kemudian terdapat seorang penggembala sapi yang datang, dan padanya terdapat seekor sapi yang bukan dari sapi-sapi tersebut, kemudian Jarir berkata; apakah ini? Ia berkata; sapi tersebut mengikuti sapi-sapi tersebut. Kami tidak mengerti milik siapakah sapi tersebut? Kemudian Jarir berkata; keluarkan sapi tersebut! Sungguh aku telah mendengar Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Tidak ada yang melindungi sesuatu yang hilang kecuali orang yang hilang.\"</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "20",
    "matchingArabicURN": "917230",
    "last_updated": null
  },
  {
    "indonesianURN": "3114501",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1450",
    "hadithText": "Telah menceritakan kepada Kami Muhammad bin Katsir, telah mengabarkan kepada Kami Syu'bah dari Salamah bin Kuhail dari Suwaid bin Ghafalah, ia berkata; aku pernah berperang bersama Zaid bin Shuhan, serta Salman bin Rabi'ah, kemudian aku mendapatkan sebuah cambuk. Kemudian mereka berkata kepadaku; letakkan cambuk itu! Maka aku katakan; tidak, akan tetapi apabila aku mendapatkan pemiliknya maka akan aku berikan kepadanya, jika tidak maka aku akan menikmatinya. Kemudian aku melakukan haji dan melewati Madinah, kemudian aku bertanya kepada Ubai bin Ka'b, kemudian ia berkata; aku pernah mendapatkan sebuah kantong yang berisi uang seratus dinar. Kemudian aku datang kepada Nabi shallallahu 'alaihi wasallam dan beliau berkata: \"Umumkan selama satu tahun.\" Lalu aku mengumumkannya selama satu tahun, kemudian aku datang kepada beliau, dan beliau berkata: \"Umumkan selama satu tahun.\" Lalu aku umumkan selama satu tahun. Kemudian aku datang kepada beliau dan beliau bersabda: \"Umumkan selama satu tahun.\" Lalu aku mengumumkannya selama satu tahun. Kemudian aku berkata; aku tidak mendapatkan orang yang mengakuinya. Lalu beliau bersabda: \"Simpanlah jumlahnya isinya dan kantong dan talinya. Jika datang pemiliknya maka serahkan dan jika tidak maka manfaatkanlah.\" Dia berkata; saya tidak tahu apakah mengatakannya tiga kali atau umumkanlah sekali saja.</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "917040",
    "last_updated": null
  },
  {
    "indonesianURN": "3114503",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1450",
    "hadithText": "Telah menceritakan kepada Kami Musaddad, telah menceritakan kepada Kami Yahya, dari Syu'bah semakna. Yaitu; \"Umumkanlah satu tahun\" dan dikatakan tiga kali, dan saya tidak mengetahuinya apakah itu dikatakan dalam satu tahun atau dalam tiga tahun.</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "917050",
    "last_updated": null
  },
  {
    "indonesianURN": "3114504",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1450",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Hammad telah menceritakan kepada kami Salamah bin Kuhail dengan sanadnya. Hammad menambahkan: \"Apabila pemiliknya telah datang dan mengetahui jumlahnya, serta talinya maka serahkan kepadanya.\" Abu Daud berkata; tidak ada yang mengatakan kalimat ini kecuali Hammad dalam hadits ini, yaitu kata \"dan mengetahui jumlahnya.\"</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "917060",
    "last_updated": null
  },
  {
    "indonesianURN": "3114511",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1451",
    "hadithText": "Telah menceritakan kepada Kami Qutaibah bin Sa'id, telah menceritakan kepada Kami Isma'il bin Ja'far, dari Rabi'ah bin Abu Abdurrahman, dari Yazid mantan budak Al Munba'its, dari Zaid bin Khalid Al Juhani, bahwa seorang laki-laki bertanya kepada Rasulullah shallAllahu wa'alaihi wa sallam mengenai barang temuan, beliau berkata: \"Umumkan satu tahun, kemudian ketahuilah talinya dan kantongnya kemudian nafkahkan kepada dirimu. Apabila pemiliknya datang maka berikan kepadanya.\" Lalu orang tersebut berkata; wahai Rasulullah, bagaimana dengan kambing yang tersesat? Beliau bersabda: \"Ambillah kambing tersebut, sesungguhnya kambing tersebut adalah milikmu atau saudaramu atau milik serigala.\" Ia berkata; wahai Rasulullah, bagaiamana dengan unta yang tersesat? Kemudian Rasulullah shallAllahu wa'alaihi wa sallam marah hingga kedua pipinya atau wajahnya memerah. Beliau berkata: \"Apa urusanmu dengannya? Ia memiliki sepatu, dan kantong air minum hingga pemiliknya mendapatkannya.\"</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "917070",
    "last_updated": null
  },
  {
    "indonesianURN": "3114512",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1451",
    "hadithText": "Telah menceritakan kepada Kami Ibnu As Sarh, telah menceritakan kepada Kami Ibnu Wahb, telah mengabarkan kepadaku Malik dengan sanad dan maknanya. Ibnu Wahb menambahkan; kantong air minum, unta tersebut minum air dan memakan pohon. Dan beliau tidak mengatakan: \"Ambillah kambing yang hilang.\" Dan beliau berkata mengenai barang temuan: \"Umumkan selama satu tahun, apabila pemiliknya telah datang maka berikan kepadanya, jika tidak maka urusanmu dengannya.\" Dan beliau tidak menyebutkan nafkahkan kepada dirimu. Abu Daud berkata; Ats Tsauri dan Sulaiman bin Bilal serta Hammad bin Salamah dari Rabi'ah seperti itu seperti itu, mereka tidak menyebutkan; \"ambillah barang temuan tersebut.\"</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "917080",
    "last_updated": null
  },
  {
    "indonesianURN": "3114531",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1453",
    "hadithText": "Telah menceritakan kepada Kami Ahmad bin Hafsh, telah menceritakan kepadaku ayahku, telah menceritakan kepadaku Ibrahim bin Thahman, dari 'Abbad bin Ishaq dari Abdullah bin Yazid dari ayahnya yaitu Yazid mantan budak Al Munba'its dari Zaid bin Khalid Al Juhani bahwa ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam ditanya ….. kemudian ia menyebutkan seperti hadits Rabi'ah. Ia berkata; dan beliau ditanya mengenai barang temuan, lalu beliau mengatakan: \"Engkau umumkan selama satu tahun, kemudian apabila pemiliknya telah datang maka engkau serahkan kepadanya, jika tidak engkau ketahui talinya dan kantongnya, kemudian masukkan ke dalam hartamu, kemudian apabila pemiliknya datang maka serahkan kepadanya.\"</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "917100",
    "last_updated": null
  },
  {
    "indonesianURN": "3114532",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1453",
    "hadithText": "Telah menceritakan kepada Kami Musa bin Isma'il dari Hammad bin Salamah dari Yahya bin Sa'id serta Rabi'ah dengan sanad Qutaibah, dan maknanya. Dan ia tambahkan dalam hadits tersebut: \"Kemudian apabila orang yang mencarinya telah datang dan mengetahui isinya dan jumlahnya maka serahkan kepadanya.\" Hammad juga mengatakan dari 'Ubaidullah bin Umar dari 'Amr bin Syuiab dari ayahnya dari kakeknya dari Nabi shallallahu 'alaihi wasallam seperti itu. Abu Daud berkata; dan tambahan yang disebutkan Hammad bin Salamah dalam hadits Salamah Kuhail, Yahya bin Sa'id serta 'Ubaidullah bin Umar dan Rabi'ah: \"Apabila pemiliknya telah datang dan mengetahui kantong serta talinya maka serahkan kepadanya\" bukanlah kalimat yang mahfuzh yaitu: \"dan mengetahui kandong dan talinya…\", sedangkan hadits Uqbah bin Suwaid dari ayahnya dari Nabi juga beliau bersabda: \"Umumkan selama satu tahun.\" Sedangkan hadits Umar bin Al Khathab juga dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Umumkan selama satu tahun.\"</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "917110",
    "last_updated": null
  },
  {
    "indonesianURN": "3114551",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1455",
    "hadithText": "Telah menceritakan kepada Kami Qutaibah bin Sa'id, telah menceritakan kepada Kami Al Laits dari Ibnu 'Ajlan dari 'Amr bin Syu'aib dari ayahnya dari kakeknya yaitu Abdullah bin 'Amr bin Al 'Ash, dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau ditanya mengenai buah kurma yang masih menggantung dipohon? Beliau menjawab: \"Orang yang sangat membutuhkan yang mengambilnya dan tidak mengambilnya didalam baju, maka tidak ada hukuman atasnya. Dan barang siapa yang keluar membawa sebagian darinya maka ia wajib membayar denda dua kalinya, serta mendapat hukuman. Dan barang siapa yang mencuri sebagian darinya setelah terkumpul dalam tempat pengeringan dan mencapai harga tameng maka tangannya dipotong, dan barang siapa yang mencuri kurang dari itu maka ia berkewajiban membayar denda dua kalinya, dan mendapatkan hukuman.\" Dan ia menyebutkan mengenai unta dan domba yang hilang sebagaimana yang disebukan selainnya. Ia berkata; dan beliau ditanya mengenai barang temuan lalu beliau menjawab: \"Apa yang ditemukan di jalan yang dilalui orang atau jalan sebuah kampung maka umumkan selama setahun, apabila orang yang mencarinya telah datang maka harus serahkan kepadanya, apabila tidak datang maka barang tersebut adalah milikmu, adapun yang terdapat di lahan yang tak bertuan, maka padanya dan juga pada barang terpendam zakatnya seperlima.\"</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "917130",
    "last_updated": null
  },
  {
    "indonesianURN": "3114553",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1455",
    "hadithText": "Telah menceritakan kepada Kami Muhammad bin Al 'Ala`, telah menceritakan kepada Kami Abu Usamah dari Al Walid bin Katsir, telah menceritakan kepadaku 'Amr bin Syu'aib dengan sanadnya dengan hadits ini ia mengatakan mengenai domba yang hilang Beliau menjawab: \"Kumpulkanlah\".</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "917140",
    "last_updated": null
  },
  {
    "indonesianURN": "3114555",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1455",
    "hadithText": "Telah menceritakan kepada Kami Musaddad, telah menceritakan kepada Kami Abu 'Awanah dari 'Ubaidullah bin Al Akhnasy dari 'Amr bin Syu'aib dengan hadits tersebut dengan sanadnya, ia berkata mengenai domba yang hilang: \"Domba tersebut adalah milikmu, saudaramu atau serigala. Ambillah domba tersebut\". Begitu juga yang diriwayatkan oleh Ayyub dan Ya'kub bin 'Atho` dari 'Amr bin Syuaib dari Nabi shalla Allahu 'alaihi wa sallam, beliau berkata: \"Ambillah.\"</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "917150",
    "last_updated": null
  },
  {
    "indonesianURN": "3114556",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "4",
    "bookName": "Barang Temuan",
    "babNumber": "556",
    "babName": "Mengumumkan barang temuan",
    "hadithNumber": "1455",
    "hadithText": "Telah menceritakan kepada Kami Musa bin Isma'il, telah menceritakan kepada Kami Hammad, dan telah diriwayatkan melalui jalur yang lain: Telah telah menceritakan kepada Kami Ibnu Al 'Ala`, telah menceritakan kepada Kami Ibnu Idris dari Ibnu Ishaq dari 'Amr bin Syu'aib dari ayahnya dari kakeknya dari Nabi shalla Allahu 'alaihi wa sallam dengan hadits ini, beliau berkata mengenai domba yang hilang: \"Kumpulkanlah hingga datang orang yang mencarinya.\"</b>",
    "bookID": "4.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "917160",
    "last_updated": null
  }
]