[
  {
    "indonesianURN": "3111930",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Shalat",
    "babNumber": "470",
    "babName": "Bab",
    "hadithNumber": "1193",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Abdurrahim bin Al Buraqi telah menceritakan kepada kami Ibnu Abu Maryam telah mengabarkan kepada kami Nafi' bin Yazid dari Al Harits bin Sa'id Al 'Utaqi dari Abdullah bin Munain dari Bani Abdul Kulal, dari 'Amru bin Al 'Ash bahwa Rasulullah shallallahu 'alaihi wasallam pernah membacakan untuknya lima belas ayat sajadah dalam Al Qur'an, di antaranya tiga ayat terdapat dalam surat Al Mufashal (dari surat Qaaf atau Al Hujurat sampai an naas), dan dalam surat Al Hajj dua ayat sajadah.\" Abu Daud berkata; \"di riwayatkan dari Abu Darda` dari Nabi shallallahu 'alaihi wasallam terdapat sebelas ayat sajadah, sedangkan sanadnya lemah.\"</b>",
    "bookID": "2.6",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "914040",
    "last_updated": null
  },
  {
    "indonesianURN": "3111940",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Shalat",
    "babNumber": "470",
    "babName": "Bab",
    "hadithNumber": "1194",
    "hadithText": "Telah menceritakan kepada kami Ahmad bin 'Amru bin As Sarh telah mengabarkan kepada kami Ibnu Wahb telah menceritakan kepadaku Ibnu Lahi'ah bahwa Misrah bin Ha'an Abu Al Mush'ab telah bercerita kepadanya bahwa 'Ubah bin 'Amir telah menceritakan kepadanya, dia berkata; aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam; \"Apakah dalam surat Al Haj terdapat dua ayat sajadah?\" beliau menjawab: \"ya, benar. Barangsiapa tidak sujud ketika membacanya, maka janganlah ia membaca kedua ayat sajadah tersebut.\"</b>",
    "bookID": "2.6",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "914050",
    "last_updated": null
  },
  {
    "indonesianURN": "3111950",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Shalat",
    "babNumber": "471",
    "babName": "Pendapat yang mengatakan \"Tidak ada sujud (tilawah) dalam al Mufashal\"",
    "hadithNumber": "1195",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Rafi' telah menceritakan kepada kami Azhar bin Al Qasim -Muhammad mengatakan; \"aku mengetahuinya ketika dia berada di Makkah- telah menceritakan kepada kami Abu Qudamah dari Mathar Al Waraq dari Ikrimah dari Ibnu Abbas bahwa Rasulullah shallallahu 'alaihi wasallam tidak pernah sujud sama sekali ketika membaca surat Al Mufashal (dari surat Qaaf atau Al Hujurat sampai An Naas) hingga beliau pindah ke Madinah.\"</b>",
    "bookID": "2.6",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "914060",
    "last_updated": null
  },
  {
    "indonesianURN": "3111970",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Shalat",
    "babNumber": "472",
    "babName": "Pendapat yang mengatakan \"Di dalamnya ada sujud (tilwah)\"",
    "hadithNumber": "1197",
    "hadithText": "Telah menceritakan kepada kami Hafsh bin Umar telah menceritakan kepada kami Syu'bah dari Abu Ishaq dari Al Aswad dari Abdullah bahwa Rasulullah shallallahu 'alaihi wasallam pernah membaca surat An Najm, lalu beliau sujud, dan tidak seorang pun dari kaum tersebut yang tidak turut sujud. Setelah itu seorang laki-laki dari kaum tersebut mengambil segenggam kerikil atau tanah, lalu di angkat ke wajahnya sambil berkata; \"Sujud bagiku cukuplah sekali ini saja.\" Abdullah berkata; \"Sungguh, setelah peristiwa tersebut, aku melihat laki-laki tersebut mati terbunuh dalam keadaan kafir.\"</b>",
    "bookID": "2.6",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "914090",
    "last_updated": null
  },
  {
    "indonesianURN": "3111980",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Shalat",
    "babNumber": "473",
    "babName": "Sujud pada \"Idzas samaa`un syaqqat\"",
    "hadithNumber": "1198",
    "hadithText": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Sufyan dari Ayyub bin Musa dari 'Atha` bin Mina` dari Abu Hurairah dia berkata; \"Kami pernah bersujud (tilawah) bersama Rasulullah shallallahu 'alaihi wasallam pada surat \"idzaas samaa'un syaqqat\" dan \"iqra` bismirabbikal ladzii khalaq\" Abu Daud berkata; \"Abu Hurairah masuk Islam pada tahun ke enam (hijriyah) yaitu ketika hari penaklukan Khaibar, sedangkan sujud ini adalah yang terakhir kali di kerjakan oleh Rasulullah shallallahu 'alaihi wasallam.\"</b>",
    "bookID": "2.6",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "914100",
    "last_updated": null
  },
  {
    "indonesianURN": "3111990",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Shalat",
    "babNumber": "473",
    "babName": "Sujud pada \"Idzas samaa`un syaqqat\"",
    "hadithNumber": "1199",
    "hadithText": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Al Mu'tamir dia berkata; saya mendengar ayahku, telah menceritakan kepada kami Bakr dari Abu Rafi' dia berkata; \"Aku pernah shalat Isya' bersama Abu Hurairah, lalu dia membaca; \"Idzas samaa'un syaqqat\" kemudian dia sujud.\" Aku pun bertanya; \"Sujud apakah ini?\" dia menjawab; \"Aku juga pernah sujud seperti ini di belakang Abu Qasim shallallahu 'alaihi wasallam, dan aku akan senantiasa sujud pada bacaan ini sehingga aku bertemu dengan-Nya (meninggal dunia).\"</b>",
    "bookID": "2.6",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "914110",
    "last_updated": null
  },
  {
    "indonesianURN": "3112000",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Shalat",
    "babNumber": "474",
    "babName": "Sujud pada surat \"Shaad\"",
    "hadithNumber": "1200",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Wuhaib telah menceritakan kepada kami Ayyub dari Ikrimah dari Ibnu Abbas dia berkata; Surat Shaad sebenarnya bukan termasuk surat yang di haruskan untuk sujud, akan tetapi aku pernah melihat Rasulullah shallallahu 'alaihi wasallam sujud pada surat tersebut.\"</b>",
    "bookID": "2.6",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "914120",
    "last_updated": null
  },
  {
    "indonesianURN": "3112010",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Shalat",
    "babNumber": "474",
    "babName": "Sujud pada surat \"Shaad\"",
    "hadithNumber": "1201",
    "hadithText": "Telah menceritakan kepada Kami Ahmad bin Shalih telah menceritakan kepada Kami Ibnu Wahb, telah mengkhabarkan kepadaku 'Amr yaitu Ibnu Al Harits dari Ibnu Abu Hilal dari 'Iyadh bin Abdullah bin Sa'd bin Abu Sarh dari Abu Sa'id Al Khudri bahwa ia berkata; Rasulullah shallallahu 'alaihi wasallam di atas mimbar membaca Surat Shaad. Kemudian tatkala beliau telah sampai pada ayat as sajdah beliau turun kemudian sujud, dan orang-orang pun bersujud bersamanya. Kemudian tatkala pada hari yang lainnya beliau membacanya, lalu tatkala telah sampai pada ayat as sajdah orang-orang bersiap-siap untuk bersujud. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya ayat tersebut adalah taubat seorang nabi, akan tetapiaku melihat kalian telah bersiap-siap untuk bersujud, lalu beliau bersujud dan mereka pun bersujud.\"</b>",
    "bookID": "2.6",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "914130",
    "last_updated": null
  },
  {
    "indonesianURN": "3112020",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Shalat",
    "babNumber": "475",
    "babName": "Mendengar ayat sajdah saat di atas kendaraan dan tidak dalam keadaan shalat",
    "hadithNumber": "1202",
    "hadithText": "Telah menceritakan kepada Kami Muhammad bin Utsman Ad Dimasyqi Abu Al Jamahir, telah menceritakan kepada Kami Abdul Aziz yaitu Ibnu Muhammad dari Mush'ab bin Tsabit bin Abdullah bin Az Zubair dari Nafi' dari Ibnu Umar bahwa Rasulullah shallallahu 'alaihi wasallam pada saat penaklukan Mekkah membaca ayat Sajdah, kemudian seluruh manusia bersujud, diantara mereka ada yang berkendaraan dan ada yang bersujud di tanah hingga orang yang berkendaraan bersujud di atas tangannya.</b>",
    "bookID": "2.6",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "914140",
    "last_updated": null
  },
  {
    "indonesianURN": "3112030",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Shalat",
    "babNumber": "475",
    "babName": "Mendengar ayat sajdah saat di atas kendaraan dan tidak dalam keadaan shalat",
    "hadithNumber": "1203",
    "hadithText": "Telah menceritakan kepada Kami Ahmad bin Hanbal, telah menceritakan kepada Kami Yahya bin Sa'id, dan diriwayatkan dari jalur yang lain: Telah menceritakan kepada Kami Ahmad bin Abu Syu'aib Al Harrani telah menceritakan kepada Kami Ibnu Numair secara makna dari 'Ubaidullah dari Nafi' dari Ibnu Umar ia berkata; \"Rasulullah shallallahu 'alaihi wasallam membacakan kepada Kami sebuah surat. Ibnu Numair berkata; tidak ketika melakukan shalat. Kemudian keduanya sama lafazh mereka yaitu, \"Kemudian beliau bersujud dan Kamipun bersujud bersamanya hingga salah seorangpun diantara Kami yang tidak mendapatkan tempat untuk meletakkan keningnya.</b>",
    "bookID": "2.6",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "914150",
    "last_updated": null
  },
  {
    "indonesianURN": "3112040",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Shalat",
    "babNumber": "475",
    "babName": "Mendengar ayat sajdah saat di atas kendaraan dan tidak dalam keadaan shalat",
    "hadithNumber": "1204",
    "hadithText": "Telah menceritakan kepada Kami Ahmad bin Al Furat Abu Mas'ud Ar Razi telah mengabarkan kepada Kami Abdurrazzaq, telah mengabarkan kepada Kami Abdullah bin Umar dari Nafi' dari Ibnu Umar, ia berkata; Rasulullah shallallahu 'alaihi wasallam membacakan Al Qur'an kepada Kami, dan apabila melewati ayat sajdah beliau bertakbir dan bersujud dan Kami bersujud bersamanya. Abdurrazzaq berkata; Ats Tsauri kagum dengan hadits ini. Abu Daud berkata; ia kagum kepada hadits tersebut karena disebutkan bahwa Rasulullah shallallahu 'alaihi wasallam bertakbir.</b>",
    "bookID": "2.6",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "914160",
    "last_updated": null
  },
  {
    "indonesianURN": "3112050",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Shalat",
    "babNumber": "476",
    "babName": "Apa yang dibaca saat sujud tilawah",
    "hadithNumber": "1205",
    "hadithText": "Telah menceritakan kepada Kami Musaddad telah menceritakan kepada Kami Isma'il, telah menceritakan kepada Kami Khalid Al Hadzdza` dari seorang laki-laki dari Abu Al 'Aliyah dari Aisyah radliallahu 'anha ia berkata; \" Rasulullah shallallahu 'alaihi wasallam ketika melakukan sujud Al Qur'an (sajdah) pada malam hari beliau mengucapkan beberapa kali: \" SAJADA WAJHIYA LILLADZII KHALAQAHU WA SYAQQA SAM'AHU WA BASHARAHU BIHAULIHI WA QUWWATIHI\" (Wajahku bersujud kepada Dzat yang telah menciptakannya dan telah membuka pendengaran serta penglihatannya dengan daya dan kekuatanNya).</b>",
    "bookID": "2.6",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "914170",
    "last_updated": null
  },
  {
    "indonesianURN": "3112060",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Shalat",
    "babNumber": "477",
    "babName": "Membaca (ayat) sajdah setelah subuh",
    "hadithNumber": "1206",
    "hadithText": "Telah menceritakan kepada Kami Abdullah bin Ash Shabah Al 'Aththar, telah menceritakan kepada Kami Abu Bahr, telah menceritakan kepada Kami Tsabit bin 'Umarah, telah menceritakan kepada Kami Abu Tamimah Al Hujaimi, ia berkata; tatkala Kami mengutus seorang penunggang kuda... Abu Daud berkata; yaitu ia menuju ke Madinah ia berkata; saya membaca (ayat As Sajdah) setelah sholat Subuh, kemudian aku bersujud, lalu Ibnu Umar melarangku dan aku tidak berhenti hingga tiga kali. Kemudian ia kembali dan berkata; sesungguhnya aku pernah melakukan shalat di belakang Rasulullah shallAllahu wa'alaihi wa sallam bersama Abu Bakr, Umar dan Utsman radliallahu 'anhum dan mereka tidak bersujud hingga matahari terbit.</b>",
    "bookID": "2.6",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "914180",
    "last_updated": null
  },
  {
    "indonesianURN": "3111961",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Shalat",
    "babNumber": "471",
    "babName": "Pendapat yang mengatakan ",
    "hadithNumber": "1196",
    "hadithText": "Telah menceritakan kepada kami Hannad bin As Sarri telah menceritakan kepada kami Waki' dari Abu Ad Dzi`b dari Yazid bin Abdullah bin Qusaith dari 'Atha` bin Yasar dari Zaid bin Tsabit dia berkata; \"Aku pernah membaca surat An Najm di hadapan Rasulullah shallallahu 'alaihi wasallam, namun beliau tidak sujud.\"</b>",
    "bookID": "2.6",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "914070",
    "last_updated": null
  },
  {
    "indonesianURN": "3111962",
    "collection": "abudawud",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Shalat",
    "babNumber": "471",
    "babName": "Pendapat yang mengatakan ",
    "hadithNumber": "1196",
    "hadithText": "Telah menceritakan kepada kami Ibnu As Sarh telah mengabarkan kepada kami Ibnu Wahb telah menceritakan kepada kami Abu Shakhr dari Ibnu Qusaith dari Kharijah bin Zaid bin Tsabit dari ayahnya dari Nabi shallallahu 'alaihi wasallam semakna dengan hadits di atas. Abu Daud berkata; \"Zaid adalah seorang Imam, namun dia tidak sujud ketika membaca surat tersebut.\"</b>",
    "bookID": "2.6",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "914080",
    "last_updated": null
  }
]