[
  {
    "indonesianURN": "3214420",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "765",
    "babName": "Gerhana matahari dan bulan",
    "hadithNumber": "1442",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Hammad dari Yunus dari Al Hasan dari Abu Bakrah dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Matahari dan Bulan adalah dua tanda dari tanda-tanda kebesaran Allah Ta'ala. Keduanya tidak mengalami gerhana karena kematian atau kelahiran seseorang, tetapi Allah Azza wa Jalla menakut-nakuti hamba-Nya dengan keduanya'.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "1114670",
    "last_updated": null
  },
  {
    "indonesianURN": "3214430",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "766",
    "babName": "Tasbih, takbir, dan doa ketika gerhana matahari",
    "hadithNumber": "1443",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin Al Mubarak dia berkata; telah menceritakan kepada kami Abu Hasyim Al Mughirah bin Salamah dia berkata; telah menceritakan kepada kami Wuhaib dia berkata; telah menceritakan kepada kami Abu Mas'ud Al Jurairi dari Hayyan bin 'Umari dia berkata; telah menceritakan kepada kami 'Abdurrahman bin Samurah dia berkata; \"Ketika aku melemparkan anak panahku di Madinah, tiba-tiba terjadi gerhana Matahari, maka aku mengumpulkan anak panah tersebut lalu berkata; 'Aku akan memperhatikan apa yang diperbuat oleh Rasulullah shallallahu 'alaihi wasallam saat terjadi gerhana Matahari'. Aku mendatangi beliau dari belakangnya ketika beliau di Masjid. Beliau bertasbih, bertakbir, dan berdo'a hingga selesai gerhana.\" Ia berkata; \"kemudian beliau berdiri dan Shalat dua rakaat dengan empat kali sujud.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "1114680",
    "last_updated": null
  },
  {
    "indonesianURN": "3214440",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "767",
    "babName": "Perintah shalat ketika gerhana matahari",
    "hadithNumber": "1444",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dia berkata; telah memberitakan kepada kami Ibnu Wahb dari 'Umar bin Al Harits bahwasanya 'Abdurrahman bin Al Qasim menceritakan kepadanya dari bapaknya dari 'Abdullah bin 'Umar dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Matahari dan bulan tidak akan terjadi karena kelahiran atau kematian seseorang, tetapi keduanya adalah dua tanda dari tanda-tanda kebesaran Allah Ta'ala. Jika kalian melihat kedua gerhana tersebut maka Shalatlah.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "1114690",
    "last_updated": null
  },
  {
    "indonesianURN": "3214450",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "768",
    "babName": "Perintah shalat ketika gerhana bulan",
    "hadithNumber": "1445",
    "hadithText": "Telah mengabarkan kepada kami Ya'qub bin Ibrahim dia berkata; telah menceritakan kepada kami Yahya dari Isma'il dia berkata; telah menceritakan kepadaku Qais dari Abu Mas'ud dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Matahari dan bulan tidak akan terjadi karena kelahiran atau kematian seseorang, tetapi keduanya adalah dua tanda diantara tanda-tanda kebesaran Allah Azza wa Jalla. Jika kalian melihat kedua gerhana tersebut, maka Shalatlah.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "1114700",
    "last_updated": null
  },
  {
    "indonesianURN": "3214460",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "769",
    "babName": "Perintah shalat ketika gerhana hingga muncul kembali",
    "hadithNumber": "1446",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Kamil Al Marwazi dari Husyaim dari Yunus dari Al Hasan dari Abu Bakrah dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Matahari dan bulan tidak akan terjadi karena kelahiran atau kematian seseorang, tetapi keduanya adalah dua tanda diantara tanda-tanda kebesaran Allah Azza wa Jalla. Jika kalian melihat kedua gerhana tersebut, maka Shalatlah hingga terang lagi'.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "1114710",
    "last_updated": null
  },
  {
    "indonesianURN": "3214470",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "769",
    "babName": "Perintah shalat ketika gerhana hingga muncul kembali",
    "hadithNumber": "1447",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin 'Ali dan Muhammad bin 'Abdul A'la mereka berdua berkata; telah menceritakan kepada kami Khalid dia berkata; telah menceritakan kepada kami Asy'ats dari Al Hasan dari Abu Bakrah dia berkata; \"ketika kami duduk bersama Nabi shallallahu 'alaihi wasallam, tiba-tiba terjadi gerhana Matahari. Beliau lalu beranjak sambil menarik bajunya, kemudian mengerjakan Shalat hingga terang kembali.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "1114720",
    "last_updated": null
  },
  {
    "indonesianURN": "3214480",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "770",
    "babName": "Perintah untuk mengumumkan shalat gerhana",
    "hadithNumber": "1448",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin 'Utsman bin Sa'id dia berkata; telah menceritakan kepada kami Al Walid dari Al Auza'i dari Az Zuhri dari 'Urwah dari 'Aisyah dia berkata; \" Telah terjadi gerhana matahari pada masa Rasulullah shallallahu 'alaihi wasallam, lalu Nabi shallallahu 'alaihi wasallam memerintahkan mu'adzin untuk menyeru 'Ash Shalatu Jami'ah' (marilah kita bersama tegakkan shalat), maka orang-orang berkumpul dan menyusun barisan, kemudian beliau shalat dua rakaat bersama mereka, dengan empat kali ruku' dan empat kali sujud.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "1114730",
    "last_updated": null
  },
  {
    "indonesianURN": "3214490",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "771",
    "babName": "Barisan shalat gerhana",
    "hadithNumber": "1449",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Khalid bin Khali dia berkata; telah menceritakan kepada kami Bisyr bin Syu'aib dari bapaknya dari Az Zuhri dia berkata; telah mengabarkan kepadaku 'Urwah bin Az Zubair bahwasanya 'Aisyah -istri Nabi shallallahu 'alaihi wasallam- berkata; \"-Ketika- terjadi gerhana pada masa Rasulullah shallallahu 'alaihi wasallam, beliau keluar menuju Masjid, kemudian berdiri dan bertakbir, maka orang-orang membuat shaf di belakang beliau. Beliau shalat empat kali ruku' dan empat kali sujud, sementara gerhana telah terang (usai) sebelum beliau selesai shalat.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "1114740",
    "last_updated": null
  },
  {
    "indonesianURN": "3214500",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "772",
    "babName": "Bagaimana shalat gerhana",
    "hadithNumber": "1450",
    "hadithText": "Telah mengabarkan kepada kami Ya'qub bin Ibrahim dari Isma'il bin 'Ulayyah dia berkata; telah menceritakan kepada kami Sufyan Ats-Tsauri dari Habib bin Abu Tsabit dari Thawus dari Ibnu 'Abbas bahwa ketika terjadi gerhana Matahari Rasulullah Shalallahu 'Alaihi Wa sallam shalat dengan delapan kali ruku dan empat kali sujud. Dari Atha juga demikian.</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "1114750",
    "last_updated": null
  },
  {
    "indonesianURN": "3214510",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "772",
    "babName": "Bagaimana shalat gerhana",
    "hadithNumber": "1451",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dari Yahya dari Sufyan dia berkata; telah menceritakan kepada kami Habib bin Abu Tsabit dari Thawus dari Ibnu 'Abbas dari Nabi Shalallahu 'Alaihi Wa Sallam, bahwa ketika terjadi gerhana beliau shalat. Beliau membaca ayat kemudian ruku, lalu membaca lagi kemudian ruku, lalu membaca lagi kemudian ruku, lalu membaca lagi kemudian ruku, setelah itu beliau sujud. Pada raka'at selanjutnya beliau melakukan seperti itu juga.</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "1114760",
    "last_updated": null
  },
  {
    "indonesianURN": "3214520",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "773",
    "babName": "Tekhnik lain shalat gerhana versi Ibn Abbas",
    "hadithNumber": "1452",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin 'Utsman bin Sa'id dia berkata; telah menceritakan kepada kami Al Walid dari Ibnu Namir 'Abdurrahman bin Namir dari Az Zuhri dari Katsir bin 'Abbas. Demikian juga diriwayatkan dari jalur lain, telah mengabarkan kepadaku 'Amru bin 'Utsman dia berkata; telah menceritakan kepada kami Al Walid dari Al Auza'i dari Az Zuhri dia berkata; telah mengabarkan kepadaku Katsir bin 'Abbas dari 'Abdullah bin 'Abbas bahwa Rasulullah shallallahu 'alaihi wasallam pernah shalat pada hari terjadinya gerhana Matahari dengan empat kali ruku' dan empat kali sujud dalam dua rakaat.</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "1114770",
    "last_updated": null
  },
  {
    "indonesianURN": "3214530",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1453",
    "hadithText": "Telah mengabarkan kepada kami Ya'qub bin Ibrahim dia berkata; Telah menceritakan kepada kami Ibnu 'Ulayyah dia berkata; Telah mengabarkan kepadaku Ibnu Juraij dari 'Atha dia berkata; Aku mendengar 'Ubaid bin 'Umair bercerita, dia berkata; Telah menceritakan kepadaku orang yang aku percayai, -aku mengira dia adalah Aisyah - dia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam pernah terjadi gerhana matahari. Maka Nabi shallallahu 'alaihi wasallam shalat bersama orang-orang dengan berdiri yang lama sekali, lalu beliau ruku', berdiri lagi, ruku lagi, berdiri lagi lalu ruku lagi. Beliau mengerjakan shalat dua raka'at dimana setiap rakaat tiga kali ruku'. Beliau ruku pada ketiga kalinya, lalu sujud. Beberapa orang ketika itu jatuh tidak sadarkan diri, karena lamanya beliau berdiri bersama mereka, sehingga dituangkan air seember keatas tubuh mereka. Apabila beliau ruku' maka beliau mengucapkan Allahu Akbar, dan apabila beliau bangkit dari ruku beliau mengucapkan: 'Sami'allah huliman hamidah'. Beliau tidak bangkit sampai matahari terang kembali. Lalu beliau berdiri, bertahmid dan memuji Allah kemudian bersabda: 'Matahari dan bulan tidak terjadi gerhana karena kematian atau kelahiran seseorang akan tetapi keduanya adalah dua tanda dari tanda-tanda kebesaran Allah Ta'ala, yang dengannya Allah memberi peringatan kepada kalian. Apabila keduanya mengalami gerhana maka segeralah kalian mengingat Allah Azza Wa Jalla (Shalat) hingga terang kembali.'</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "1114780",
    "last_updated": null
  },
  {
    "indonesianURN": "3214540",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1454",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; Telah menceritakan kepada kami Mu'adz bin Hisyam dia berkata; Bapakku telah menceritakan kepadaku dari Qatadah -mengenai shalat gerhana- dari 'Atha dari 'Ubaid bin 'Umair dari 'Aisyah bahwasanya Nabi shallallahu 'alaihi wasallam shalat dengan enam kali ruku' dan empat kali sujud. Aku berkata kepada Mua'adz, Apakah ini dari Nabi shallallahu 'alaihi wasallam? Dia menjawab; 'Tidak diragukan lagi.'</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "1114790",
    "last_updated": null
  },
  {
    "indonesianURN": "3214550",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1455",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dari Ibnu Wahb dari Yunus dari Ibnu Syihab dia berkata; telah mengabarkan kepadaku 'Urwah bin Az Zubair dari 'Aisyah dia berkata; \"Pada masa hidup Rasulullah shallallahu 'alaihi wasallam, terjadi gerhana matahari. Beliau berdiri dan bertakbir, lalu orang-orang menyusun barisan di belakangnya. Beliau membaca bacaan yang panjang. Kemudian beliau bertakbir lalu ruku' dengan ruku' yang lama pula, lalu mengangkat kepalanya sambil mengucapkan; 'Sami' Allahu Liman Hamidah, Rabbana Wa Lakal Hamdu'. Kemudian beliau bangun lalu membaca bacaan yang panjang, namun lebih pendek dari yang pertama. Kemudian bertakbir dan ruku' dengan ruku' yang lama, namun lebih pendek dari yang pertama. Lalu beliau mengucapkan; 'Sami' Allahu Liman Hamidah, Rabbana Wa Lakal Hamdu', kemudian sujud. Selanjutnya Rasulullah shallallahu 'alaihi wasallam juga melakukan hal yang seperti itu pada rakaat berikutnya, maka lengkaplah menjadi empat kali ruku dan empat kali sujud. Dan matahari pun telah terang kembali sebelum beliau bangkit. Kemudian beliau berdiri dan menyampaikan khutbah kepada orang-orang. Beliau memuji Allah Azza Wa Jalla dengan sesuatu yang telah menjadi hak-Nya, lalu bersabda: 'Matahari dan bulan adalah dua tanda dari kebesaran Allah Ta'ala. Keduanya tidak terjadi gerhana karena kematian atau kelahiran seseorang. Jika kalian melihat gerhana tersebut, maka shalatlah hingga disingkapkan (diperlihatkan) kembali'. Lalu Rasulullah shallallahu 'alaihi wasallam melanjutkan sabdanya: 'Pada tempatku ini aku melihat semua yang dijanjikan kepada kalian. Kalian telah melihat bahwa aku ingin memetik sesuatu dari surga ketika kalian melihat aku maju. Sungguh aku telah melihat neraka Jahannam bertumpang tindih sebagiannya pada sebagian lagi ketika kalian melihatku mundur, dan aku melihat Abu Luhaiy bersada disana, dan dia adalah orang yang membiarkan unta Saibah'.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "1114800",
    "last_updated": null
  },
  {
    "indonesianURN": "3214560",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1456",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; Telah menceritakan kepada kami Al Walid bin Muslim dari Al Auza'i dari Az Zuhri dari 'Urwah dari 'Aisyah dia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam pernah terjadi gerhana matahari, lalu diserukan; 'Ash-Shalatu Jami'ah' (mari kita dirikan shalat bersama), maka manusia berkumpul. Lalu beliau shalat bersama mereka empat ruku' dan empat sujud dalam dua rakaat.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "1114810",
    "last_updated": null
  },
  {
    "indonesianURN": "3214570",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1457",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Hisyam bin 'Urwah dari bapaknya dari 'Aisyah dia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam pernah terjadi gerhana matahari, maka Rasulullah shallallahu 'alaihi wasallam shalat bersama orang-orang. Beliau berdiri dan memperlama berdirinya, kemudian ruku' dan memperlama ruku'nya. Kemudian bangkit lagi dan memperlama berdirinya, namun lebih pendek daripada yang pertama. Lalu ruku' dan memperlama ruku'nya, namun lebih pendek dari ruku' yang pertama. Kemudian mengangkat (kepalanya dari ruku'), lalu sujud. Beliau juga melakukan hal tersebut pada raka'at berikutnya. Beliau lalu beranjak, dan matahari telah terang kembali. Kemudian beliau berkhutbah di hadapan orang-orang. Beliau memuji dan menyanjung-Nya, lalu bersabda: 'Matahari dan bulan adalah dua tanda diantara tanda-tanda kebesaran Allah Ta'ala. Keduanya tidak mengalami gerhana karena kematian atau kelahiran seseorang. Jika kalian melihat dua gerhana tersebut, maka berdoalah kepada Allah Azza wa Jalla, bertakbir, lalu bersedekahlah'. Kemudian ia melanjutkan sabdanya: 'Wahai umat Muhammad! Tidak ada seorangpun yang melebihi cemburu dari Allah Azza wa Jalla bila ada hambanya yang berzina. Wahai umat Muhammad! Demi Allah, kalau kalian mengetahui apa yang aku ketahui, pasti kalian akan sedikit tertawa dan sering menangis.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "1114820",
    "last_updated": null
  },
  {
    "indonesianURN": "3214580",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1458",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dari Ibnu Wahab dari 'Amru bin Al Harits dari Yahya bin Sa'id bahwasanya 'Amrah menceritakan kepadanya bahwasanya 'Aisyah menceritakan kepadanya bahwa ada orang Yahudi datang kepadanya, lalu ia berkata kepadanya; \"Semoga Allah melindungimu dari siksa kubur!\" Kemudian Aisyah berkata kepada Rasulullah shallallahu 'alaihi wasallam: \"Wahai Rasulullah shallallahu 'alaihi wasallam menjawab: 'Wahai Rasulullah shallallahu 'alaihi wasallam, apakah pada saat didalam kubur manusia akan disiksa? ' Rasulullah shallallahu 'alaihi wasallam menjawab: 'Berlindunglah kepada Allah! ' Aisyah berkata; 'Lalu Nabi shallallahu 'alaihi wasallam keluar, -ternyata- terjadi gerhana matahari, maka kami masuk ke kamar, dan para wanita berkumpul kepada kami. Rasulullah shallallahu 'alaihi wasallam muncul dengan menghadap kepada kami, dan hal itu saat waktu Dluha.' Lalu beliau berdiri lama, kemudian ruku' dengan ruku' yang lama juga. Lalu mengangkat kepalanya dan berdiri tapi lebih singkat dari berdiri yang pertama. Kemudian ruku' lebih singkat dari ruku' yang pertama, lalu sujud. Kemudian berdiri yang kedua dan melakukan hal yang sama, kecuali ruku' dan berdirinya lebih singkat dari yang pertama, kemudian sujud, dan matahari telah terang kembali. Setelah selesai beliau duduk di atas mimbar, lalu bersabda: 'Manusia diuji dalam kubur mereka, seperti fitnah Dajjal'.\"Lalu Aisyah berkata; 'Kami mendengar beliau meminta perlindungan dari siksa kubur setelah itu.'</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "17",
    "matchingArabicURN": "1114830",
    "last_updated": null
  },
  {
    "indonesianURN": "3214590",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1459",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin 'Ali dia berkata; Telah menceritakan kepada kami Yahya bin Sa'id dia berkata; Telah menceritakan kepada kami Yahya bin Sa'id Al Anshari dia berkata; Aku mendengar 'Amrah berkata; Aku mendengar 'Aisyah berkata; Ada seorang Yahudi datang kepadaku, lalu berkata; \"Semoga Allah melindungimu dari siksa kubur\". Setelah Rasulullah shallallahu 'alaihi wasallam datang, aku berkata kepadanya'Wahai Rasulullah shallallahu 'alaihi wasallam, apakah pada saat di dalam kubur manusia akan disiksa? ' Rasulullah shallallahu 'alaihi wasallam menjawab: \"Berlindunglah kepada Allah!\" Lalu beliau naik kendaraannya, kemudian terjadi gerhana matahari. Aku sedang di kamar bersama para wanita, lalu Rasulullah shallallahu 'alaihi wasallam datang dari kendaraannya dan masuk ke tempat shalatnya, kemudian shalat bersama orang-orang. Lantas beliau berdiri, kemudian ruku' dalam waktu yang lama. Lalu mengangkat kepalanya dan berdiri dalam waktu yang lama. Kemudian beliau ruku' dalam waktu yang lama, lalu beliau mengangkat kepalanya dan berdiri dalam waktu yang lama. Kemudian sujud dalam waktu yang lama, dan berdiri lagi tetapi lebih singkat dari berdirinya yang pertama. Lalu ruku' dengan ruku' yang lebih singkat dari ruku' yang pertama, kemudian mengangkat kepalanya dan berdiri lagi tapi lebih singkat dari berdiri yang pertama. Kemudian ruku' lagi yang lebih singkat dari ruku' yang pertama, kemudian mengangkat kepalanya dan berdiri tapi lebih ringan dari yang pertama. Shalatnya empat kali ruku' dan empat kali sujud, dan matahari telah terang. Setelah itu beliau bersabda: ' kalian akan diuji dalam kubur, seperti fitnah Dajjal. Lalu Aisyah berkata; 'Kami mendengar beliau memohon perlindungan dari siksa kubur setelah itu.'</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "18",
    "matchingArabicURN": "1114840",
    "last_updated": null
  },
  {
    "indonesianURN": "3214600",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1460",
    "hadithText": "Telah mengabarkan kepada kami 'Abdah bin 'Abdurrahim dia berkata; Telah memberitakan kepada kami Ibnu 'Uyainah dari Yahya bin Sa'id dari 'Amrah dari 'Aisyah bahwa Rasulullah shallallahu 'alaihi wasallam Shalat gerhana di beranda sumur Zamzam dengan empat kali ruku' dan empat kali sujud.</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "19",
    "matchingArabicURN": "1114850",
    "last_updated": null
  },
  {
    "indonesianURN": "3214610",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1461",
    "hadithText": "Telah mengabarkan kepada kami Abu Dawud dia berkata; Telah menceritakan kepada kami Abu 'Ali Al Hanafi dia berkata; Telah menceritakan kepada kami Hisyam sahabat Ad-Dastawa'i- dari Abu Az Zubair dari Jabir bin 'Abdullah dia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam, terjadi gerhana matahari pada hari yang sangat panas, maka beliau mengerjakan shalat bersama para sahabatnya. Beliau berdiri lama, hingga membuat para sahabat merunduk. Kemudian ruku' dan memperlama ruku'nya. Lalu mengangkat kepalanya dengan lama, kemudian ruku dengan lama, lalu beliau berdiri dari ruku dengan waktu yang lama, kemudian beliau sujud dua kali, lalu berdiri, dan berbuat seperti itu juga. Lalu ia maju kemudian mundur. Shalatnya empat kali ruku' dan empat kali sujud. Mereka berkata; 'Matahari dan bulan tidak terjadi karena kematian salah satu tokoh pembesar mereka! ' Namun sebenarnya gerhana tersebut merupakan dua tanda diantara tanda-tanda kebesaran Allah yang diperlihatkan kepada kalian. Jika terjadi gerhana maka shalatlah hingga terang kembali.</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "20",
    "matchingArabicURN": "1114860",
    "last_updated": null
  },
  {
    "indonesianURN": "3214620",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1462",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Khalid dari Marwan dia berkata; Telah menceritakan kepadaku Mu'awiyah bin Sallam dia berkata; Telah menceritakan kepada kami Yahya bin Abu Katsir dari Abu Salamah bin 'Abdurrahman dari 'Abdullah bin 'Amru dia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam pernah terjadi gerhana matahari. Beliau memerintahkan untuk menyeru dengan kalimat; 'Ash Shalatul Jami'ah (mari kita tegakkan shalat bersama-sama). Lalu Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat dua kali ruku' dan dua kali sujud dengan orang-orang. Kemudian beliau berdiri dan shalat dengan satu kali sujud. Lalu Aisyah berkata; 'Aku belum pernah melakukan ruku' dan sujud yang lebih lama darinya'.\" Muhammad bin Humair menyelisihinya.</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "21",
    "matchingArabicURN": "1114870",
    "last_updated": null
  },
  {
    "indonesianURN": "3214630",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1463",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin 'Utsman dia berkata; Telah menceritakan kepada kami Ibnu Hamir dari Mu'awiyah bin Sallam dari Yahya bin Abu Katsir dari Abu Thu'mah dari 'Abdullah bin 'Amru dia berkata; \"Saat matahari mengalami gerhana, Rasulullah shallallahu 'alaihi wasallam shalat dua kali ruku' dan dua kali sujud, kemudian bangun lagi dan ruku' lagi dua kali serta sujud dua kali. Setelah itu matahari terang.\" Saat itu Aisyah berkata; 'Rasulullah shallallahu 'alaihi wasallam belum pernah sujud dan ruku' yang lebih lama darinya.' Ali bin Al Mubarak menyelisihinya.</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "22",
    "matchingArabicURN": "1114880",
    "last_updated": null
  },
  {
    "indonesianURN": "3214640",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1464",
    "hadithText": "Telah mengabarkan kepada kami Abu Bakr bin Ishaq dia berkata; Telah menceritakan kepada kami Abu Zaid Sa'id bin Ar-Rabi' dia berkata; Telah menceritakan kepada kami 'Ali bin Al Mubarak dari Yahya bin Abu Katsir dia berkata; Telah menceritakan kepadaku Abu Hafshah -budak 'Aisyah- bahwasanya 'Aisyah mengabarkan kepadanya bahwa pada masa Rasulullah shallallahu 'alaihi wasallam terjadi gerhana matahari, maka beliau berwudlu lalu memerintahkan untuk menyeru, 'Ash-Shalatul Jami'ah'. Lalu beliau berdiri dan memperlama berdirinya saat shalat.\" Kemudian Aisyah berkata; 'Aku memperkirakan beliau membaca surah Al-Baqarah, kemudian beliau ruku' dengan ruku' yang lama, lalu mengucapakan Sami' Allahu Liman Hamidah. Kemudian beliau berdiri seperti berdirinya semula tanpa sujud, lalu ruku' lagi dan sujud lagi. Kemudian berdiri dan berbuat seperti yang diperbuat pada dua ruku' dan satu kali sujud yang pertama. Lantas beliau duduk, sedangkan matahari telah terang.'</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "23",
    "matchingArabicURN": "1114890",
    "last_updated": null
  },
  {
    "indonesianURN": "3214650",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1465",
    "hadithText": "Telah mengabarkan kepada kami Hilal bin Bisyr dia berkata; Telah menceritakan kepada kami 'Abdul 'Aziz bin 'Abdul Shamad dari 'Atha bin As Saib dia berkata; Telah menceritakan kepadaku Abu As-Saib bahwasanya 'Abdullah bin 'Amru menceritakan kepadanya, dia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam terjadi gerhana matahari, maka beliau berdiri untuk shalat dan orang-orangpun shalat bersamanya. Rasulullah berdiri lama, kemudian ruku, dengan ruku' yang lama. Lalu mengangkat kepalanya dan sujud dengan sujud yang lama, kemudian mengangkat kepalanya dan duduk dengan duduk yang lama. Lalu sujud lagi dengan sujud yang lama, dan mengangkat kepalanya serta berdiri. Pada rakaat kedua beliau melakukannya seperti pada rakaat pertama dalam berdirinya, ruku'nya, sujudnya, dan duduknya. Beliau meniup pada akhir sujudnya saat rakaat kedua dan menangis. Setelah itu beliau bersabda: 'Ini tidak terjadi saat aku masih di tengah-tengah mereka! Ini tidak terjadi dan kami masih memohon ampun kepada-Mu'.Kemudian beliau mengangkat kepalanya, sedangkan matahari sudah terang. Rasulullah shallallahu 'alaihi wasallam lalu bangkit dan berkhutbah kepada manusia dengan memuji-Nya. Kemudian beliau berkata: 'Matahari dan bulan adalah dua tanda diantara tanda-tanda kebesaran Allah Azza wa Jalla. Jika kalian melihat salah satu gerhana tersebut, maka segeralah berdzikir kepada Allah Azza wa Jalla. Demi Dzat yang jiwa Muhammad berada ditangan-Nya, sungguh surga telah didekatkan kepadaku, hingga kalau aku mengulurkan tanganku maka aku pasti bisa menggapai sesuatu darinya. Sungguh, neraka telah didekatkan kepadaku hingga aku. menjadikannya tameng untuk menjaga darinya karena khawatir neraka itu akan menimpa kalian hingga aku melihat seorang perempuan dari Himyar sedang disiksa karena seekor kucing yang diikatnya, tanpa membiarkannya mencari makan sendiri dari serangga-serangga bumi. Tidak memberinya makan dan minum sampai mati. Aku melihat kucing itu menggigitnya jika ia menghadap ke depan, dan jika berpaling maka kucing itu menggigit pantatnya. Aku juga melihat seseorang yang mempunyai dua sandal Sibtiyah saudara Bani Du'du'- yang didorong dengan tongkat bercabang di dalam neraka. Aku juga melihat Shahibu Mihjan (pemilik tongkat) -dulu dia mencuri tongkat dari orang yang haji- sedang bertelekan tongkatnya di dalam neraka, sambil berkata; 'Aku pencuri tongkat'.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "24",
    "matchingArabicURN": "1114900",
    "last_updated": null
  },
  {
    "indonesianURN": "3214660",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1466",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Ubaidullah bin 'Abdul 'Azhim dia berkata; Telah menceritakan kepadaku Ibrahim Sabalan dia berkata; Telah menceritakan kepada kami 'Abbad bin 'Abbad Al Muhallabi dari Muhammad bin 'Amru dari Abu Salamah dari Abu Hurairah dia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam pernah terjadi gerhana matahari, lalu Rasulullah shalat bersama orang orang. Beliau berdiri dan memperlama berdirinya, kemudian ruku' dan memperlama ruku'nya. Kemudian bangkit lagi dan memperlama berdirinya, namun lebih singkat dari berdiri yang pertama. Kemudian ruku' dan memperlama ruku'nya, namun lebih singkat dari ruku' yang pertama. Kemudian sujud dan memperlama sujudnya, lalu mengangkat (kepalanya dari ruku'), lalu sujud namun lebih singkat dari sujud yang pertama. Kemudian berdiri shalat dua rakaat. Beliau melakukan hal yang lama pada rakaat berikutnya, sampai selesai shalatnya. Setelah itu Beliau bersabda: 'Matahari dan bulan adalah dua tanda diantara tanda-tanda kebesaran Allah Ta'ala. Keduanya tidak mengalami gerhana karena kematian atau kelahiran seseorang. Jika kalian melihat kedua gerhana tersebut, maka segeralah berdzikir kepada Allah Azza wa Jalla dan kerjakanlah shalat '.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "25",
    "matchingArabicURN": "1114910",
    "last_updated": null
  },
  {
    "indonesianURN": "3214670",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1467",
    "hadithText": "Telah mengabarkan kepada kami Hilal bin Al 'Ala bin Hilal dia berkata; Telah menceritakan kepada kami Al Husain bin 'Ayyasy dia berkata; Telah menceritakan kepada kami Zuhair dia berkata; Telah menceritakan kepada kami Al Aswad bin Qais dia berkata; Telah menceritakan kepadaku Tsa'labah bin 'Abbad Al 'Abdi -dari penduduk Bashrah- bahwasanya suatu hari ia menyaksikan khutbah Samurah bin Jundub, didalam khutbahnya dia menyebutkan sebuah Hadits dari Rasulullah shallallahu 'alaihi wasallam, dia berkata; \"Tatkala kami dan seorang anak kecil melemparkan tombak kami pada dua sasaran di masa Rasulullah, tiba-tiba matahari -yang kelihatannya berada seukuran dua tombak atau tiga tombak- diatas kami berwarna hitam. Lalu salah seorang diantara kami berkata; 'Mari kita pergi ke masjid bersama kami, demi Allah kita akan melihat Rasulullah shallallahu 'alaihi wasallam dalam menyikapi keadaan seperti ini. Samurah berkata; 'Maka kami pun ingin pergi ke masjid'. Dia berkata lagi; 'Kami mendapatkan Rasulullah shallallahu 'alaihi wasallam sedang keluar menuju sekumpulan manusia. Kemudian beliau maju, lalu shalat dengan memperlama berdirinya, sepertinya shalat ini yang paling paling panjang beliau lakukan bersama kami, dan kami tidak mendengar suara dari beliau. Kemudian beliau ruku' dengan ruku' yang panjang dan kami tidak mendengar suara dari beliau, kemudian beliau sujud dengan sujud yang panjang yang belum pernah beliau lakukan sebelumnya bersama kami, dan kamipun tidak mendengar suara dari beliau. Dan beliau melakukan hal yang sama pada raka'at kedua. Dia berkata; 'Duduk beliau pada raka'at kedua bersamaan dengan terangnya matahari.' Kemudian beliau mengucapkan salam dan memuji Allah, bersaksi bahwa tiada ilah yang berhak disembah selainNya dan bersaksi bahwa beliau utusanNya. (secara ringkas).</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "26",
    "matchingArabicURN": "1114920",
    "last_updated": null
  },
  {
    "indonesianURN": "3214680",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1468",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dia berkata; Telah menceritakan kepada kami 'Abdul Wahhab dia berkata; Telah menceritakan kepada kami Khalid dari Abu Qilabah dari An Nu'man bin Basyir dia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam telah terjadi gerhana matahari, maka beliau shallallahu 'alaihi wasallam keluar dengan menarik bajunya dalam keadaan takut hingga beliau sampai di masjid. Beliau terus melakukan shalat bersama kami hingga matahari terang kembali. Beliau bersabda: 'Manusia beranggapan bahwa matahari dan bulan tidaklah mengalami gerhana kecuali karena kematian seorang pembesar, padahal bukanlah seperti itu. Matahari dan bulan tidak akan mengalami gerhana karena kematian seseorang atau kelahiran seseorang, tapi keduanya adalah dua tanda dari tanda-tanda kebesaran Allah Azza Wa Jalla. Allah Azza Wa Jalla apabila menampakkan sesuatu dari ciptaannya maka akan membuat takut kepada-NYA. Apabila kalian melihat yang demikian, maka shalatlah seperti shalat wajib yang kalian lakukan.'</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "27",
    "matchingArabicURN": "1114930",
    "last_updated": null
  },
  {
    "indonesianURN": "3214690",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1469",
    "hadithText": "Dan telah mengabarkan kepada kami Ibrahim bin Ya'qub dia berkata; Telah menceritakan kepada kami 'Amru bin 'Ashim bahwasanya kakeknya 'Ubaidullah bin Al Wazi' menceritakan kepadanya, dia berkata; Telah menceritakan kepada kami Ayyub As Sakhtiyani dari Abu Qilabah dari Qabishah bin Mukhariq Al Hilali dia berkata; Telah terjadi gerhana matahari dan pada waktu itu kami berada di Madinah bersama Rasulullah shallallahu 'alaihi wasallam. Maka beliau keluar dengan rasa takut sambil menarik bajunya, lalu shalat dua raka'at dengan memanjangkan keduanya. Beliau selesai shalat bersamaan dengan terangnya matahari kembali. Lalu beliau memuji Allah kemudian berkata: \"Matahari dan bulan adalah dua tanda dari tanda-tanda kebesaran Allah keduanya tidak mengalami gerhana karena kematian seseorang atau kelahiran seseorang, apabila kalian melihat yang demikian, maka shalatlah seperti shalat wajib yang kalian lakukan.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "28",
    "matchingArabicURN": "1114940",
    "last_updated": null
  },
  {
    "indonesianURN": "3214700",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1470",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dia berkata; Telah menceritakan kepada kami Mu'adz bin Hisyam dia berkata; Bapakku telah menceritakan kepadaku dari Qatadah dari Abu Qilabah dari Qabishah Al Hilali, matahari mengalami gerhana maka Nabi Shallalahu 'Alaihi Wa Sallam shalat dua raka'at dua raka'at hingga matahari terang kembali. Kemudian beliau bersabda: \" Matahari dan bulan tidak mengalami gerhana karena kematian seseorang akan tetapi keduanya adalah dua tanda dari tanda-tanda kebesaran Allah. Allah Azza Wa Jalla berbuat sesuatu terhadap ciptaan-Nya sesuai dengan kehendak-NYA. Dan Dia apabila menampakkan sebagian dari ciptaan-NYA maka akan membuat takut kepada-NYA, mana saja di antara keduanya mengalami gerhana maka shalatlah kalian hingga terang kembali atau Allah memutuskan perkara.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "29",
    "matchingArabicURN": "1114950",
    "last_updated": null
  },
  {
    "indonesianURN": "3214710",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1471",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dari Mu'adz bin Hisyam dia berkata; Bapakku telah menceritakan kepadaku dari Qatadah dari Abu Qilabah dari An Nu'man bin Basyir bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila matahari dan bulan mengalami gerhana maka shalatlah kalian sebagaimana shalat wajib yang kalian lakukan.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "30",
    "matchingArabicURN": "1114960",
    "last_updated": null
  },
  {
    "indonesianURN": "3214720",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1472",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin 'Utsman bin Hakim dia berkata; Telah menceritakan kepada kami Abu Nu'aim dari Al Hasan bin Shalih dari 'Ashim Al Ahwash dari Abu Qilabah dari An Nu'man bin Basyir bahwa Rasulullah shallallahu 'alaihi wasallam ketika terjadi gerhana matahari beliau shalat seperti shalat kami dengan ruku' dan sujud.</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "31",
    "matchingArabicURN": "1114970",
    "last_updated": null
  },
  {
    "indonesianURN": "3214730",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1473",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dia berkata; Telah menceritakan kepada kami Mu'adz bin Hisyam dia berkata; Bapakku telah menceritakan kepadaku dari Qatadah dari Al Hasan dari An Nu'man bin Basyir dari Nabi shallallahu 'alaihi wasallam bahwa beliau pada suatu hari keluar dengan tergesa-gesa menuju masjid dan matahari pada waktu itu telah mengalami gerhana, maka beliau shalat hingga matahari terang kembali. Kemudian beliau bersabda: \" Dahulu orang-orang jahiliyah mengatakan bahwa matahari dan bulan tidaklah mengalami gerhana kecuali karena kematian seorang pembesar dari penduduk bumi. Matahari dan bulan keduanya tidak mengalami gerhana karena kematian dan kelahiran seseorang akan tetapi keduanya adalah dua ciptaan-NYA dari beberapa ciptaan-NYA, Allah berbuat sesuatu terhadap ciptaan-NYA sesuai dengan kehendak-NYA. Mana saja di antara keduanya mengalami gerhana maka shalatlah kalian hingga terang kembali atau Allah memutuskan perkara.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "32",
    "matchingArabicURN": "1114980",
    "last_updated": null
  },
  {
    "indonesianURN": "3214740",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1474",
    "hadithText": "Telah mengabarkan kepada kami 'Imran bin Musa dia berkata; Telah menceritakan kepada kami 'Abdul Warits dia berkata; Telah menceritakan kepada kami Yunus dari Al Hasan dari Abu Bakrah dia berkata; \"Kami berada di sisi Rasulullah shallallahu 'alaihi wasallam ketika terjadi gerhana matahari, lalu Rasulullah keluar dengan menarik serbannya menuju masjid, dan orang-orang mengikutinya. Beliau lalu shalat dua rakaat. Setelah matahari bersinar kembali beliau bersabda: 'Matahari dan bulan adalah dua tanda diantara tanda-tanda kebesaran Allah Ta'ala, yang dengan keduanya Allah memberikan rasa takut kepada hamba-hambaNya, Keduanya tidak mengalami gerhana karena kematian atau kelahiran seseorang. Jika kalian melihatnya, maka shalatlah hingga matahari nampak kembali olehmu'.\" Hal itu dijelaskan oleh Rasulullah, karena waktu itu putra beliau yang bernama Ibrahim meninggal dunia dan orang-orang mengatakan demikian kepada beliau.</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "33",
    "matchingArabicURN": "1114990",
    "last_updated": null
  },
  {
    "indonesianURN": "3214750",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "774",
    "babName": "Versi lain",
    "hadithNumber": "1475",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud dia berkata; Telah menceritakan kepada kami Khalid dari Asy'ats dari Al Hasan dari Abu Bakrah \"Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat dua rakaat seperti shalat kalian ini...\" la juga menyebutkan gerhana matahari.</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "34",
    "matchingArabicURN": "1115000",
    "last_updated": null
  },
  {
    "indonesianURN": "3214760",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "775",
    "babName": "Kisaran bacaan shalat gerhana",
    "hadithNumber": "1476",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dia berkata; Telah menceritakan kepada kami Ibnul Qasim dari Malik dia berkata; Telah menceritakan kepadaku Zaid bin Aslam dari 'Atha bin Yasar dari 'Abdullah bin 'Abbas dia berkata; \"Telah terjadi gerhana matahari, maka Rasulullah shallallahu 'alaihi wasallam shalat bersama orang-orang. Beliau berdiri lama dengan membaca surat yang sepadan dengan surah Al Baqarah.\" Kemudian Abdullah berkata lagi; 'Kemudian beliau ruku' dengan ruku' yang lama, lalu mengangkat kepalanya dan berdiri (lagi), tapi lebih singkat dari yang pertama. Kemudian ruku' dengan ruku' yang lama tapi lebih singkat dari ruku' yang pertama. Lalu beliau mengangkat (kepalanya) dan berdiri lagi dengan lama, namun lebih singkat dari yang pertama. Kemudian beliau ruku' dengan ruku' yang lama, namun lebih singkat dari ruku' yang pertama. Lalu beliau sujud dan pergi sedangkan matahari telah terang. Setelah itu beliau shallallahu 'alaihi wasallam bersabda: 'Matahari dan Bulan adalah dua tanda diantara tanda-tanda kebesaran Allah Ta'ala. Keduanya tidak mengalami gerhana karena kematian atau kelahiran seseorang. Jika kalian melihat gerhana tersebut, maka berdzikirlah kepada Allah Azza Wa Jalla.' Para sahabat berkata; 'Wahai Rasulullah shallallahu 'alaihi wasallam, kami melihat engkau menggapai sesuatu pada posisimu ini, kemudian kami melihatmu juga mundur? ' Beliau bersabda: 'Aku melihat surga -atau diperlihatkan kepadaku surga. Seandainya aku mengambil sesuatu dari surga, maka kamu pasti akan memakannya, lalu tak akan tersisa lagi dunia ini. Aku juga melihat neraka. Aku belum melihat pandangan yang lebih menakutkan dari ini dan aku melihat kebanyakan penghuninya adalah wanita.' Para sahabat berkata; 'Wahai Rasulullah shallallahu 'alaihi wasallam, kenapa bisa begitu? ' Beliau menjawab: 'Karena kekufuran mereka'. -Dalam riwayat lain: Karena mereka kufur kepada Allah? - Beliau meneruskan lagi: 'Mereka juga kufur terhadap kebaikan suami dan kufur terhadap kebaikan. Seandainya kamu berbuat baik kepada salah seorang dari mereka (wanita) sepanjang masa, Lalu dia melihat suatu (keburukan) pada dirimu', Maka dia akan berkata: 'Aku tidak melihat suatu kebaikanpun pada dirimu! '</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "35",
    "matchingArabicURN": "1115010",
    "last_updated": null
  },
  {
    "indonesianURN": "3214770",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "776",
    "babName": "Menyaringkan bacana ketika shalat gerhana",
    "hadithNumber": "1477",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; Telah memberitakan kepada kami Al Walid dia berkata; Telah menceritakan kepada kami 'Abdurrahman bin Namir bahwasanya ia mendengar Az Zuhri bercerita dari 'Urwah dari 'Aisyah Rasulullah shallallahu 'alaihi wasallam, bahwa beliau pernah shalat (gerhana) dengan empat kali ruku' dan empat kali sujud. Beliau juga mengeraskan bacaannya. Tiap kali beliau mengangkat kepalanya, beliau mengucapkan: 'Sami'allahu Liman Hamidah, Rabbana Wa Lakal Hamdu (Allah mendengar siapa yang memuji-Nya, wahai Tuhan kami, segala puji untuk-Mu) '.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "36",
    "matchingArabicURN": "1115020",
    "last_updated": null
  },
  {
    "indonesianURN": "3214780",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "777",
    "babName": "Tidak menyaringkan bacaan",
    "hadithNumber": "1478",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Manshur dia berkata; Telah menceritakan kepada kami Abu Nu'aim dia berkata; Telah menceritakan kepada kami Sufyan dari Al Aswad bin Qais dari Ibnu 'Abbad -seorang laki-laki dari Bani 'Abdul Qais- dari Samurah bahwa Nabi Shalallahu 'Alaihi Wa Sallam shalat bersama mereka ketika terjadi gerhana matahari dan kami tidak mendengar suaranya.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "37",
    "matchingArabicURN": "1115030",
    "last_updated": null
  },
  {
    "indonesianURN": "3214790",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "778",
    "babName": "Bacaan sujud ketika shalat gerhana",
    "hadithNumber": "1479",
    "hadithText": "Telah mengabarkan kepada kami 'Abdullah bin Muhammad bin 'Abdurrahman bin Al Miswar Az Zuhri dia berkata; telah menceritakan kepada kami Ghundar dari Syu'bah dari 'Atha bin As Saib dari bapaknya dari 'Abdullah bin 'Amru dia berkata; \"Saat terjadi gerhana matahari pada masa Rasulullah shallallahu 'alaihi wasallam, beliau mengerjakan shalat. Beliau memperlama berdirinya, kemudian ruku' dan memperlama ruku'nya, kemudian berdiri lagi dan memperlama berdirinya.\" Syu'bah (perawi) berkata; \"Aku mengira bahwa dia mengatakan tentang sujud Rasulullah shallallahu 'alaihi wasallam juga demikian. Beliau menangis saat sujud dan meniup sambil mengucapkan, 'Wahai Rabbku, ini jangan terjadi sedangkan kami masih memohon ampun kepada-Mu! Janganlah hal ini terjadi di saat aku masih berada di tengah-tengah mereka! ' Setelah selesai shalat beliau bersabda: 'Surga diperlihatkan kepadaku, hingga kalau tanganku dijulurkan maka aku pasti bisa memetik sesuatu darinya. Neraka juga telah diperlihatkan kepadaku, maka aku meniupnya karena khawatir panasnya akan menimpa kalian. Di dalamnya aku melihat seorang pencuri dua unta betina Rasulullah shallallahu 'alaihi wasallam dan melihat saudaranya Bani Du'du', orang yang mencuri orang yang haji, dan jika ia ditanya tentang curiannya maka ia berkata; \"Ini perbuatan tongkat \". Aku juga melihat seorang perempuan yang tinggi dan hitam, yang disiksa karena seekor kucing yang diikatnya, tanpa memberinya makan dan minum, serta tidak membiarkannya mencari makan sendiri dari serangga-serangga bumi, sehingga akhirnya kucing itu mati'. Beliau bersabda: `Matahari dan bulan tidak mengalami gerhana karena kematian atau kelahiran seseorang. Jika kalian melihat salah satunya - atau beliau berkata: Salah satunya mengalami gerhana maka segeralah berdzikir kepada Allah Azza wa Jalla '.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "38",
    "matchingArabicURN": "1115040",
    "last_updated": null
  },
  {
    "indonesianURN": "3214800",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "779",
    "babName": "Tasyahhud dan salam dalam shalat gerhana",
    "hadithNumber": "1480",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin 'Utsman bin Sa'id bin Katsir dari Al Walid dari 'Abdurrahman bin Namir bahwasanya ia bertanya kepada Az Zuhri mengenai sunnah shalat Kusuf, maka dia berkata; telah mengabarkan kepadaku 'Urwah bin Az Zubair dari 'Aisyah dia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam pernah terjadi gerhana matahari, beliau berwudlu lalu memerintahkan untuk menyeru, \"Ash-shalaatu Jami'ah.\"Orang-orang pun segera berkumpul, dan Rasulullah shalat bersama mereka. Beliau takbir, kemudian membaca bacaan yang lama. Beliau takbir lagi, kemudian ruku' dengan ruku' yang lama, seperti lamanya berdiri atau lebih. Kemudian beliau mengangkat kepalanya dari ruku' sambil mengucapkan: \"Sami'allahu liman hamidah.\" Kemudian beliau membaca bacaan yang lama, namun lebih pendek dari yang pertama. Lalu takbir lagi, kemudian ruku' dengan ruku' yang lama, namun lebih pendek dari yang pertama. Kemudian mengangkat kepalanya dari ruku' sambil mengucapkan, \"Sami'allahu liman hamidah.\" Kemudian takbir lagi dan sujud dengan sujud yang lama, seperti lamanya ruku' atau lebih. Kemudian takbir dan mengangkat kepalanya, lalu takbir dan sujud lagi, kemudian takbir lagi dan berdiri dengan membaca bacaan yang panjang, namun lebih pendek dari yang pertama. Kemudian takbir lagi dan ruku' dengan ruku' yang lama, namun lebih pendek dari yang pertama. Kemudian mengangkat kepalanya dari ruku' sambil mengucapkan, \"Sami'allahu liman hamidah.\" Kemudian beliau membaca bacaan yang panjang, namun lebih pendek dari yang pertama saat berdiri yang kedua. Kemudian beliau takbir lalu ruku' dengan ruku' yang panjang, namun masih lebih pendek dari ruku' yang pertama. Kemudian takbir lagi dan mengangkat kepalanya sambil mengucapkan, \"Sami'allahu liman hamidah.\" Lalu takbir lagi dan sujud lagi dengan sujud yang lebih pendek dari yang pertama, kemudian tasyahhud (membaca dua kalimat syahadat) dan mengucapkan salam. Setelah itu beliau bangkit ketengah-tengah mereka dan memuji Allah. lalu bersabda: \"Matahari dan bulan tidak mengalami gerhana karena kematian atau kelahiran seseorang, tetapi keduanya adalah tanda diantara tanda-tanda kebesaran Allah. Jadi mana saja dari keduanya mengalami gerhana, maka segeralah mengingat Allah Azza wa Jalla dengan shalat.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "39",
    "matchingArabicURN": "1115050",
    "last_updated": null
  },
  {
    "indonesianURN": "3214810",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "779",
    "babName": "Tasyahhud dan salam dalam shalat gerhana",
    "hadithNumber": "1481",
    "hadithText": "Telah mengabarkan kepadaku Ibrahim bin Ya'qub dia berkata; telah menceritakan kepada kami Musa bin Dawud dia berkata; telah menceritakan kepada kami Nafi' bin 'Umar dari Ibnu Abu Mulaikah dari Asma binti Abu Bakr dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam pernah shalat saat terjadi gerhana. Beliau berdiri dan memperlama berdirinya kemudian ruku' dan memperlama ruku'nya. Kemudian bangkit lagi dan memperlama berdirinya. Kemudian ruku' dan memperlama ruku'nya. lalu mengangkat (kepalanya dari ruku') dan sujud dalam waktu yang lama, kemudian mengangkat kepalanya dari sujud, dan sujud lagi dengan sujud yang lama juga. Kemudian beliau berdiri dan memperlama berdirinya, kemudian ruku' dan memperlama ruku'nya. Lalu bangkit lagi dan memperlama berdirinya. Kemudian ruku' dan memperlama ruku'nya, lalu mengangkat (kepalanya dari ruku') dan sujud dalam waktu yang lama, kemudian mengangkat kepalanya dari sujud. Kemudian sujud lagi dengan sujud yang lama juga, lalu mengangkatnya, kemudian selesai (salam).\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "40",
    "matchingArabicURN": "1115060",
    "last_updated": null
  },
  {
    "indonesianURN": "3214820",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "780",
    "babName": "Duduk diatas minbar setelah shalat gerhana",
    "hadithNumber": "1482",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dari Ibnu Wahb dari 'Amru bin Al Harits dari Yahya bin Sa'id bahwasanya 'Amrah menceritakan kepadanya bahwasanya 'Aisyah berkata; \"Nabi shallallahu 'alaihi wasallam pernah keluar tiba-tiba terjadi gerhana matahari. Kami lalu keluar menuju kamar, dan para wanita berkumpul di sekitar kami. Rasulullah shallallahu 'alaihi wasallam datang kepada kami, dan saat itu pada waktu Dluha. Lalu beliau berdiri lama, kemudian ruku' dengan ruku' yang lama, lalu mengangkat kepalanya dan berdiri lagi tapi lebih singkat dari berdiri yang pertama. Kemudian ruku' dengan ruku' yang lebih singkat dari ruku' yang pertama, lalu sujud. Kemudian berdiri yang kedua, dan melakukan hal yang sama, namun ruku' dan berdirinya lebih pendek dari rakaat pertama. Kemudian sujud, dan matahari telah terang kembali. Setelah selesai beliau duduk di atas mimbar lalu bersabda: 'Manusia diuji dalam kubur mereka, seperti fitnah Dajjal '.\" (secara ringkas).</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "41",
    "matchingArabicURN": "1115070",
    "last_updated": null
  },
  {
    "indonesianURN": "3214830",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "781",
    "babName": "Bagaimana khutbah shalat gerhana",
    "hadithNumber": "1483",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; telah menceritakan kepada kami 'Abdah dia berkata; telah menceritakan kepada kami Hisyam bin 'Urwah dari bapaknya dari 'Aisyah dia berkata; \"Pada masa Rasulullah Shalallahu 'Alaihi Wa Sallam pernah terjadi gerhana matahari, lalu Rasulullah berdiri dan shalat. Beliau berdiri lama sekali. kemudian ruku' dan ruku'nya lama sekali. Lalu bangkit lagi dan memperlama berdirinya, namun lebih singkat dari berdiri yang pertama, kemudian ruku' dan memperlama ruku'nya, namun lebih singkat dari ruku' yang pertama. Kemudian ia mengangkat (kepalanya dari ruku') dan sujud. Lalu beliau melakukan hal tersebut pada rakaat berikutnya. Kemudian beliau beranjak dan matahari telah terang kembali. Setelah itu beliau berkhutbah kepada manusia; Beliau memuji Allah dan menyanjung-Nya; lalu bersabda: 'Matahari dan bulan tidak mengalami gerhana karena kematian atau kelahiran seseorang. Jika kalian melihat kedua gerhana tersebut, maka shalatlah, bersedakahlah dan berdzikirlah kepada Allah'. Kemudian beliau melanjutkan sabdanya: `Wahai umat Muhammad! Tidak ada seorangpun yang lebih cemburu dari Allah Azza wa Jalla bila ada hamba-Nya yang berzina atau ada hamba perempuan-Nya yang berzina. Wahai umat Muhammad! Demi Allah, seandainya kalian mengetahui apa yang aku ketahui, maka kalian pasti akan sedikit tertawa dan banyak menangis '.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "42",
    "matchingArabicURN": "1115080",
    "last_updated": null
  },
  {
    "indonesianURN": "3214840",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "781",
    "babName": "Bagaimana khutbah shalat gerhana",
    "hadithNumber": "1484",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman dia berkata; telah menceritakan kepada kami Abu Dawud Al Ja'fari dari Sufyan dari Al Aswad bin Qais dari Tsa'labah bin 'Abbad dari Samurah; \"Nabi Shalallahu 'Alaihi Wa Sallam berkhutbah ketika terjadi gerhana matahari dengan mengucapkan: 'Amma Ba'du'.</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "43",
    "matchingArabicURN": "1115090",
    "last_updated": null
  },
  {
    "indonesianURN": "3214850",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "782",
    "babName": "Perintah berdoa ketika gerhana",
    "hadithNumber": "1485",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin 'Ali dia berkata; telah menceritakan kepada kami Yazid bin Zurai' dia berkata; telah menceritakan kepada kami Yunus dari Al Hasan dari Abu Bakrah dia berkata; \"Kami berada di samping Rasulullah shallallahu 'alaihi wasallam, tiba-tiba terjadi gerhana matahari, maka beliau segera berdiri menuju masjid, dan menarik selendangnya karena tergesa-gesa. Lalu orang-orang pun segera berdiri di sisinya dan beliau mengerjakan shalat dua rakaat sebagaimana mereka juga melakukannya. Setelah matahari terang, beliau berkhutbah di hadapan kami seraya bersabda: \"Matahari dan bulan tidak mengalami gerhana karena kematian atau kelahiran seseorang, tetapi keduanya merupakan tanda diantara tanda-tanda kebesaran Allah untuk menakut-nakuti hamba-Nya. Jika kalian melihat kedua gerhana tersebut, maka shalatlah dan berdoalah hingga gerhana tersingkap dari kalian (nampak kembali).\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "44",
    "matchingArabicURN": "1115100",
    "last_updated": null
  },
  {
    "indonesianURN": "3214860",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "16",
    "bookName": "Shalat kusuf (Gerhana)",
    "babNumber": "783",
    "babName": "Perintah banyak istighfar ketika gerhana",
    "hadithNumber": "1486",
    "hadithText": "Telah mengabarkan kepada kami Musa bin 'Abdurrahman Al Masruqi dari Abu Usamah dari Buraid dari Abu Burdah dari Abu Musa dia berkata; \"Saat terjadi gerhana matahari Nabi shallallahu 'alaihi wasallam berdiri dengan rasa takut, beliau khawatir akan terjadi kiamat. Beliau mendatangi masjid, lalu berdiri, ruku', dan sujud dengan waktu yang lama. Aku belum pernah melihat beliau melakukan hal itu dalam shalatnya. Kemudian beliau bersabda: \"Ini adalah tanda-tanda kebesaran Allah yang Dia kirimkan bukan karena kematian ataupun kelahiran seseorang, telapi Allah mengirimnya untuk menakut-nakuti hamba-Nya. Jika kalian melihatnya, maka segeralah berdzikir dan berdoa serta meminta ampunan kepada-Nya.\"</b>",
    "bookID": "16.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "45",
    "matchingArabicURN": "1115110",
    "last_updated": null
  }
]