[
  {
    "indonesianURN": "3215380",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "802",
    "babName": "BAB",
    "hadithNumber": "1538",
    "hadithText": "Telah mengabarkan kepada kami 'Ali bin Hujr dia berkata; telah memberitakan kepada kami Isma'il dia berkata; telah menceritakan kepada kami Humaid dari Anas bin Malik dia berkata; \"Orang-orang Jahiliyah mempunyai dua hari dalam setiap tahun untuk bermain-main. Setelah Rasulullah Shalallahu 'Alaihi Wa Sallam datang ke Madinah, beliau Shalallahu 'Alaihi Wa Sallam bersabda: 'Kalian dahulu mempunyai dua hari untuk bermain-main, sungguh Allah telah menggantinya dengan yang lebih baik dari keduanya, yakni hari (raya) Fitri dan hari (raya) Adha (Kurban) '.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "1115640",
    "last_updated": null
  },
  {
    "indonesianURN": "3215390",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "803",
    "babName": "Berangkat idul fithri-idul adha",
    "hadithNumber": "1539",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin 'Ali dia berkata; telah menceritakan kepada kami Yahya dia berkata; telah menceritakan kepada kami Syu'bah dia berkata; telah menceritakan kepada kami Abu Bisyr dari Abu 'Umair bin Anas dari bibinya, bahwa ada suatu kaum yang melihat hilal (bulan Sabit, masuknya bulan Syawal), lalu mereka datang kepada Rasulullah Shalallahu 'Alaihi Wa Sallam. Kemudian beliau Shalallahu 'Alaihi Wa Sallam memerintahkan mereka untuk berbuka puasa setelah hari agak siang dan keluar ke tempat shalat Id (hari raya) besoknya.</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "1115650",
    "last_updated": null
  },
  {
    "indonesianURN": "3215400",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "804",
    "babName": "Hamba sahaya dan wanita yang berhalangan ikut berangkat pada idul fitri-adha",
    "hadithNumber": "1540",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Zurarah dia berkata; telah menceritakan kepada kami Isma'il dari Ayyub dari Hafshah dia berkata; \"Tidaklah Ummu Athiyyah menyebut Rasulullah Shalallahu 'Alaihi Wa Sallam melainkan dia berkata; 'Biaba (bapakku jadi jaminan) '. Maka aku bertanya kepadanya; 'Apakah engkau pernah mendengar Rasulullah Shalallahu 'Alaihi Wa Sallam menyebutkan hal ini dan itu? ' Dia menjawab, 'Ya, bapakku jadi jaminan. Beliau pernah bersabda; \"Hendaknya perempuan yang tidak dipingit dan perempuan yang dipingit, serta perempuan yang sedang haid keluar untuk menyaksikan hari raya dan seruan kaum muslim, dan perempuan yang sedang haid hendaknya menjauh dari tempat shalat.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "1115660",
    "last_updated": null
  },
  {
    "indonesianURN": "3215410",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "805",
    "babName": "Wanita haidh menghindari tempat shalat",
    "hadithNumber": "1541",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Sufyan dari Ayyub dari Muhammad dia berkata; \"Aku pernah berjumpa Ummu Athiyyah, lalu aku bertanya kepadanya; 'Apakah engkau pernah mendengarnya dari Rasulullah Shalallahu 'Alaihi Wa Sallam yang mana Ummu Athiyah bila mengingatnya dia berkata; \"Bapakku jadi jaminannya\" Beliau bersabda: 'Hendaknya perempuan yang tidak dipingit dan perempuan yang dipingit keluar untuk menyaksikan hari raya dan seruan kaum muslim, dan perempuan yang sedang haid hendaknya menjauh dari tempat shalat.'</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "1115670",
    "last_updated": null
  },
  {
    "indonesianURN": "3215420",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "806",
    "babName": "Berhias untuk idul fithri-adha",
    "hadithNumber": "1542",
    "hadithText": "Telah mengabarkan kepada kami Sulaiman bin Dawud dari Ibnu Wahb dia berkata; telah mengabarkan kepadaku Yunus bin Yazid dan 'Amr bin Al Harits dari Ibnu Syihab dari Salim dari bapaknya dia berkata; \"Umar bin Khaththab Radliallahu? nhu pernah mendapatkan jubah dari sutra di pasar, lalu ia mengambilnya dan membawanya kepada Rasulullah Shalallahu 'Alaihi Wa Sallam. Kemudian Umar berkata; `Wahai Rasulullah Shalallahu 'Alaihi Wa Sallam, belilah ini lalu berhiaslah dengannya untuk hari raya atau untuk menyambut tamu yang datang'. Beliau menjawab, Ini pakaian orang yang tidak mempunyai bagian di akhirat atau ini adalah pakaian yang dikenakan kepada orang yang tidak mempunyai bagian di akhirat '. Lalu Umar berdiam diri selama waktu yang dikehendaki oleh Allah. Kemudian Rasulullah shallallahu 'alaihi wasallam mengirimkan baju sutra halus, maka ia menghadap beliau. Ketika sampai kepada beliau shallallahu 'alaihi wasallam, ia berkata; `Wahai Rasulullah, engkau mengatakan bahwa ini adalah pakaian orang yang tidak mempunyai bagian, tetapi mengapa engkau mengirimkan baju sutra ini kepadaku? Rasulullah Shalallahu 'Alaihi Wa Sallam lalu berkata: `Juallah. Kamu bisa memenuhi kebutuhanmu dari hasil menjual pakaian tersebut'.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "1115680",
    "last_updated": null
  },
  {
    "indonesianURN": "3215430",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "807",
    "babName": "Shalat sebelum imam hari raya ied",
    "hadithNumber": "1543",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Manshur dia berkata; telah memberitakan kepada kami 'Abdurrahman dari Sufyan dari Al Asy'ats dari Al Aswad bin Hilal dari Tsa'labah bin Zahdam bahwa Ali mengangkat Abu Mas'ud sebagai wakilnya, lalu ia keluar pada hari raya, kemudian berkata; \"Wahai manusia, bukan termasuk Sunnah seseorang mengerjakan shalat sebelum imam.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "1115690",
    "last_updated": null
  },
  {
    "indonesianURN": "3215440",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "808",
    "babName": "Tidak adzan ketika idul fithri-idul adha",
    "hadithNumber": "1544",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Abu 'Awanah dari 'Abdul Malik bin Abu Sulaiman dari 'Atha dari Jabir dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam shalat hari raya bersama kami sebelum khutbah, tanpa adzan dan iqamah.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "1115700",
    "last_updated": null
  },
  {
    "indonesianURN": "3215450",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "809",
    "babName": "Khutbah pada hari 'ied",
    "hadithNumber": "1545",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Utsman dia berkata; telah menceritakan kepada kami Bahz dia berkata; telah menceritakan kepada kami Syu'bah dia berkata; telah mengabarkan kepadaku Zubaid dia berkata; aku mendengar Asy Sya'bi berkata; telah menceritakan kepada kami Al Barra' bin 'Azib saat berada (bersandar) di salah satu tiang masjid dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam pernah khutbah saat hari raya Kurban dengan bersabda: 'Yang pertama kali kita lakukan pada hari ini adalah mengerjakan shalat, kemudian menyembelih. Barangsiapa melakukan hal itu, maka ia sesuai dengan Sunnah kami, dan barangsiapa menyembelih sebelum Shalat, maka itu hanya daging biasa yang disuguhkan untuk keluarganya'. Abu Burdah bin Dinar pun menyembelih, lalu ia berkata; 'Wahai Rasulullah Shalallahu 'Alaihi Wa Sallam, aku mempunyai Jadza'ah yang lebih baik dari musinnah! Rasulullah Shalallahu 'Alaihi Wa Sallam menjawab: `Sembelihlah, dan hal itu tidak mencukupi salah seorang setelah kamu (tidak boleh dilakukan) '.</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "1115710",
    "last_updated": null
  },
  {
    "indonesianURN": "3215460",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "810",
    "babName": "Shalat idul fithri-idul adha sebelum khutbah",
    "hadithNumber": "1546",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; telah memberitakan kepada kami 'Abdah bin Sulaiman dia berkata; telah menceritakan kepada kami 'Ubaidullah dari Nafi' dari Ibnu 'Umar bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam, Abu Bakar, dan Umar Radliallahu? nhum mengerjakan shalat dua hari raya sebelum khutbah.</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "1115720",
    "last_updated": null
  },
  {
    "indonesianURN": "3215470",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "811",
    "babName": "Shalat idul fithri-idul adha  menghadap tongkat",
    "hadithNumber": "1547",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; telah memberitakan kepada kami 'Abdurrazzaq dia berkata; telah memberitakan kepada kami Ma'mar dari Ayyub dari Nafi' dari Ibnu 'Umar bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam keluar pada hari Idul Fitri dan Idul Adha dengan membawa tombak, lalu beliau menancapkannya, kemudian shalat menghadap ke arahnya.</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "1115730",
    "last_updated": null
  },
  {
    "indonesianURN": "3215480",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "812",
    "babName": "Jumlah shalat idul fithri-adha",
    "hadithNumber": "1548",
    "hadithText": "Telah mengabarkan kepada kami 'Imran bin Musa dia berkata; telah menceritakan kepada kami Yazid bin Zurai' dia berkata; telah menceritakan kepada kami Sufyan bin Sa'id dari Zubaid Al Ayami dari 'Abdurrahman bin Abu Laila menyebutkannya dari 'Umar bin Al Khaththab radliallahu 'anhu dia berkata; \"Shalat Idul Adha dua rakaat, shalat Idul Fitri dua rakaat, shalat musafir dua rakaat, dan shalat Jum'at dua rakaat. Semua itu sempurna, bukan qashar (diringkas) menurut sabda Rasulullah shallallahu 'alaihi wasallam.</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "1115740",
    "last_updated": null
  },
  {
    "indonesianURN": "3215490",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "813",
    "babName": "Bacaan idul fithri-adha dengan surat Qaaf dan alqamar",
    "hadithNumber": "1549",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur dia berkata; telah memberitakan kepada kami Sufyan dia berkata; telah menceritakan kepadaku Dhamrah bin Sa'id dari 'Ubaidullah bin 'Abdullah dia berkata; \"Umar radliallahu 'anhu keluar pada hari raya, lalu ia bertanya kepada Abu Waqid AI Laitsi, 'Surat apakah yang dibaca Rasulullah shallallahu 'alaihi wasallam pada hari seperti ini'? ' la menjawab; `Surah Qaaf dan Iqtarobat (Al Qamar) '.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "1115750",
    "last_updated": null
  },
  {
    "indonesianURN": "3215500",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "814",
    "babName": "Bacaan idul fithri-adha dengan al-a'la dan alghasyiyah",
    "hadithNumber": "1550",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Abu 'Awanah dari Ibrahim bin Muhammad bin Al Muntasyir dari bapaknya dari Habib bin Salim dari An Nu'man bin Basyir dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam membaca surat Al A'laa dan Al Ghaasyiyah ketika shalat Jum'at. Kadang hari raya dan Jum'at berkumpul dalam satu hari, maka beliau membaca keduanya.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "1115760",
    "last_updated": null
  },
  {
    "indonesianURN": "3215510",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "815",
    "babName": "Khutbah idul fihtri-adha setelah shalat",
    "hadithNumber": "1551",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur dia berkata; telah menceritakan kepada kami Sufyan dia berkata; Aku mendengar Ayyub mengabarkan dari 'Atha dia berkata; Aku mendengar Ibnu 'Abbas berkata; \"Aku bersaksi bahwa aku pernah ikut shalat hari raya bersama Rasulullah Shalallahu 'Alaihi Wa Sallam. Beliau memulai shalat sebelum khutbah, kemudian berkhutbah.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "1115770",
    "last_updated": null
  },
  {
    "indonesianURN": "3215520",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "815",
    "babName": "Khutbah idul fihtri-adha setelah shalat",
    "hadithNumber": "1552",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Abul Ahwash dari Manshur dari Asy Sya'bi dari Al Barra' bin 'Azib dia berkata; \"Rasulullah Shallallahu'alaihiwasallam berkhutbah kepada kami pada hari raya Kurban setelah shalat.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "1115780",
    "last_updated": null
  },
  {
    "indonesianURN": "3215530",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "816",
    "babName": "Hak pilih antara tetap duduk atau pulang pada khutbah kedua",
    "hadithNumber": "1553",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Yahya bin Ayyub dia berkata; telah menceritakan kepada kami Al Fadhl bin Musa dia berkata; telah menceritakan kepada kami Ibnu Juraij dari 'Atha dari 'Abdullah bin As Saib bahwa Nabi Shalallahu 'Alaihi Wa Sallam pernah shalat Id, dan beliau bersabda: \"Barangsiapa ingin pulang, maka hendaklah ia pulang, dan barangsiapa ingin tetap tinggal untuk mendengar khutbah maka hendaklah ia tetap tinggal mendengarkannya.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "1115790",
    "last_updated": null
  },
  {
    "indonesianURN": "3215540",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "817",
    "babName": "Berhias untuk khutbah pada khutbah idul fithri-adha",
    "hadithNumber": "1554",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dia berkata; telah menceritakan kepada kami 'Abdurrahman dia berkata; telah menceritakan kepada kami 'Ubaidullah bin Iyad dari bapaknya dari Abu Rimtsah dia berkata; \"Aku melihat Rasulullah Shalallahu 'Alaihi Wa Sallam berkhutbah dengan memakai dua selendang yang berwarna hijau.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "17",
    "matchingArabicURN": "1115800",
    "last_updated": null
  },
  {
    "indonesianURN": "3215550",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "818",
    "babName": "Khutbah diatas unta",
    "hadithNumber": "1555",
    "hadithText": "Telah mengabarkan kepada kami Ya'qub bin Ibrahim dia berkata; telah menceritakan kepada kami Ibnu Abu Zaidah dia berkata; telah mengabarkan kepadaku Isma'il bin Abu Khalid dari saudaranya dari Abu Kahil Al Ahmasi dia berkata; \"Aku pernah melihat Nabi Shalallahu 'Alaihi Wa Sallam menyampaikan khutbah di atas untanya, dan seorang Habsyi yang memegangi tali kekang untanya.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "18",
    "matchingArabicURN": "1115810",
    "last_updated": null
  },
  {
    "indonesianURN": "3215560",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "819",
    "babName": "Imam berdiri ketika khutbah",
    "hadithNumber": "1556",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud dia berkata; telah menceritakan kepada kami Khalid dia berkata; telah menceritakan kepada kami Syu'bah dari Simak dia berkata; \"Aku pernah bertanya kepada Jabir, 'Apakah Rasulullah Shalallahu 'Alaihi Wa Sallam khutbah sambil berdiri? ' la menjawab; \"Rasulullah Shalallahu 'Alaihi Wa Sallam berkhutbah sambil berdiri, kemudian duduk sebentar, lalu berdiri lagi'.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "19",
    "matchingArabicURN": "1115820",
    "last_updated": null
  },
  {
    "indonesianURN": "3215570",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "820",
    "babName": "Imam berdiri dan bersandar kepada manusia",
    "hadithNumber": "1557",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin 'Ali dia berkata; telah menceritakan kepada kami Yahya bin Sa'id dia berkata; telah menceritakan kepada kami 'Abdul Malik bin Abu Sulaiman dia berkata; telah menceritakan kepada kami 'Atha dari Jabir dia berkata; \"Aku pernah shalat Id bersama Rasulullah Shalallahu 'Alaihi Wa Sallam. Beliau memulainya dengan shalat, sebelum khutbah tanpa adzan dan iqamah Setelah selesai shalat beliau berdiri dengan bersandar kepada Bilal, lalu beliau memuji Allah dan menyanjung-Nya, kemudian menasihati, memperingatkan, dan menganjurkan mereka untuk menaatinya. Selanjutnya beliau dan bilal bergeser dan beralih ke arah para perempuan, lalu memerintahkan mereka untuk bertakwa kepada Allah, dan menasihati serta memperingatkannya. kemudian beliau memuji dan menyanjung-Nya, serta menganjurkan mereka untuk menaatinya. Setelah itu beliau bersabda: \"Bersedekahlah kalian, karena sebagian besar kalian adalah bahan bakar api neraka.\" Lalu ada seorang perempuan biasa bangkit berdiri -dengan pipi yang memerah- berkata; \"Apa penyebabnya wahai Rasulullah shallallahu 'alaihi wasallam?\" Beliau bersabda: \"Kalian banyak mengeluh dan mengingkari kebaikan suami.\" Lalu mereka segera melepaskan kalung, anting, serta cincin mereka dan melemparkannya ke kain (yang dibentangkan) Bilal sebagai sedekah.</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "20",
    "matchingArabicURN": "1115830",
    "last_updated": null
  },
  {
    "indonesianURN": "3215580",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "821",
    "babName": "Imam menghadap hadirin ketika khutbah",
    "hadithNumber": "1558",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami 'Abdul 'Aziz dari Dawud dari 'Iyadh bin 'Abdullah dari Abu Sa'id Al Khudri bahwa Rasulullah shallallahu 'alaihi wasallam pada hari Idul Fitri dan Idul Adha ke Mushalla (lapangan tempat shalat) lalu Beliau shalat bersama manusia. Bila beliau telah duduk pada rakaat kedua maka beliau mengucapkan salam, kemudian menghadap kepada manusia dengan wajahnya, sedangkan manusia duduk. Bila beliau mempunyai suatu keperluan, yakni hendak mengutus pasukan, maka beliau menyebutkannya, dan jika tidak ada keperluan maka beliau memerintahkan manusia untuk sedekah dengan bersabda \"Bersedekahlah.\" Beliau mengucapkannya sebanyak tiga kali. Sebagian besar yang bersedekah adalah wanita.</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "21",
    "matchingArabicURN": "1115840",
    "last_updated": null
  },
  {
    "indonesianURN": "3215590",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "822",
    "babName": "Menyuruh diam ketika khutbah",
    "hadithNumber": "1559",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dan Al Harits bin Miskin secara baca dan aku mendengarnya lafazh ini darinya dari Ibnul Qasim dia berkata; telah menceritakan kepadaku Malik dari Ibnu Syihab dari Ibnul Musayyab dari Abu Hurairah Bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Jika kamu berkata kepada temanmu, 'Diamlah' ketika imam sedang khutbah, maka kamu telah berbuat sia-sia.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "22",
    "matchingArabicURN": "1115850",
    "last_updated": null
  },
  {
    "indonesianURN": "3215600",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "823",
    "babName": "Cara khutbah",
    "hadithNumber": "1560",
    "hadithText": "Telah mengabarkan kepada kami 'Utbah bin 'Abdullah dia berkata; telah memberitakan kepada kami Ibnul Mubarak dari Sufyan dari Ja'far bin Muhammad dari bapaknya dari Jabir bin 'Abdullah dia berkata; \"Apabila Rasulullah Shalallahu 'Alaihi Wa Sallam berkhutbah, maka beliau memuji dan menyanjung Allah dengan hal-hal yang menjadi hak-Nya, kemudian bersabda: 'Barangsiapa telah diberi petunjuk oleh Allah, maka tidak ada yang bisa menyesatkannya. Barangsiapa telah disesatkan oleh Allah, maka tidak ada yang bisa memberikan petunjuk kepadanya. Sebenar-benar perkataan adalah kitabullah (Al Qur'an), sebaik-baik petunjuk adalah petunjuk Muhammad shallallahu 'alaihi wasallam, dan sejelek jelek perkara adalah hal-hal yang baru, setiap hal yang baru adalah bid'ah dan setiap bid'ah adalah sesat, dan setiap kesesatan di dalam neraka'. Kemudian beliau bersabda lagi, 'Ketika aku diutus, jarak antara aku dan hari Kiamat seperti jarak dua jari ini'. Bila beliau menyebutkan hari Kiamat maka kedua pipinya memerah, suaranya meninggi, dan amarahnya bertambah, seolah-olah beliau memperingatkan pasukan. Beliau bersabda: 'Hati-hati pada pagi kalian dan sorenya'. Barangsiapa meninggalkan harta, maka itu buat keluarganya dan barangsiapa meninggalkan utang atau sesuatu yang hilang maka itu tanggunganku. Aku adalah wali bagi orang-orang yang beriman '.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "23",
    "matchingArabicURN": "1115860",
    "last_updated": null
  },
  {
    "indonesianURN": "3215610",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "824",
    "babName": "Imam menganjurkan sedekah ketika khutbah",
    "hadithNumber": "1561",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin 'Ali dia berkata; telah menceritakan kepada kami Yahya dia berkata; telah menceritakan kepada kami Dawud bin Qais dia berkata; telah menceritakan kepada kami 'Iyadh dari Abu Sa'id bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam keluar pada hari raya, lalu shalat dua rakaat. Kemudian beliau berkhutbah, memerintahkan manusia untuk sedekah, maka sebagian besar yang bersedekah adalah wanita. Jika beliau mempunyai pasukan atau hendak mengutus seseorang maka beliau berbicara, dan jika tidak ada maka beliau pulang.</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "24",
    "matchingArabicURN": "1115870",
    "last_updated": null
  },
  {
    "indonesianURN": "3215620",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "824",
    "babName": "Imam menganjurkan sedekah ketika khutbah",
    "hadithNumber": "1562",
    "hadithText": "Telah mengabarkan kepada kami 'Ali bin Hujr dia berkata; telah menceritakan kepada kami Yazid bin Harun dia berkata; telah memberitakan kepada kami Humaid dari Al Hasan bahwasanya Ibnu 'Abbas pernah khutbah di Bashrah, dia berkata; \"Tunaikanlah zakat puasa kalian.\" Orang-orangpun saling melihat satu sama lain. Lalu ia pun berkata; \"Siapakah orang Madinah yang bersama kalian di sini? Bangkitlah kepada saudara kalian lalu ajarilah, karena mereka tidak mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam telah mewajibkan zakat fitri atas anak kecil dan orang dewasa, yang merdeka dan hamba sahaya, lelaki dan perempuan, sebanyak setengah Sha' gandum atau satu Sha' kurma atau sya'ir (jenis gandum).\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "25",
    "matchingArabicURN": "1115880",
    "last_updated": null
  },
  {
    "indonesianURN": "3215630",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "824",
    "babName": "Imam menganjurkan sedekah ketika khutbah",
    "hadithNumber": "1563",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Abul Ahwash dari Manshur dari Asy Sya'bi dari Al Barra' dia berkata; \"Rasulullah shallallahu 'alaihi wasallam khutbah pada hari raya Kurban setelah shalat, lalu bersabda: 'Barangsiapa shalat (seperti) shalat kami, dan berkurban (seperti) kurban kami, maka ia telah berkurban dengan benar, dan barangsiapa berkurban sebelum shalat, maka itu hanya daging kambing (bukan kurban) '. Abu Burdah bin Niyar berkata, 'Wahai Rasulullah demi Allah, aku telah menyembelih (kurban) sebelum keluar untuk shalat (id), karena aku mengetahui bahwa hari ini adalah hari (untuk) makan dan minum, maka aku menyegerakan menyembelih (kurban) lalu aku makan dan aku berikan kepada keluarga dan tetanggaku, \" maka Rasulullah bersabda: \"Itu adalah daging kambing (bukan kurban) '.\" Abu Burdah berkata; \"Sesungguhnya aku mempunyai jadza'ah yang lebih baik dari dua kambing daging, maka apakah itu mencukupi bagiku (sebagai gantinya)? Nabi menjawab: \"Ya, \" tetapi ia tidak mencukupi bagi seorang setelahmu.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "26",
    "matchingArabicURN": "1115890",
    "last_updated": null
  },
  {
    "indonesianURN": "3215640",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "825",
    "babName": "Khutbah secara wajar",
    "hadithNumber": "1564",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Abul Ahwash dari Simak dari Jabir bin Samurah dia berkata; \"Aku pernah shalat bersama Rasulullah Shalallahu 'Alaihi Wa Sallam. Shalat beliau sederhana dan khutbahnya juga sederhana.\" (Tidak terlalu cepat dan tidak terlalu panjang).</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "27",
    "matchingArabicURN": "1115900",
    "last_updated": null
  },
  {
    "indonesianURN": "3215650",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "826",
    "babName": "Duduk antara dua khutbah dengan diam",
    "hadithNumber": "1565",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Abu 'Awanah dari Simak dari Jabir bin Samurah dia berkata; \"Aku pernah melihat Rasulullah Shalallahu 'Alaihi Wa Sallam khutbah pada hari Jum'at sambil berdiri, kemudian duduk sejenak tanpa berbicara. Kemudian berdiri lagi untuk menyampaikan khutbah yang kedua. Barangsiapa menceritakan kepadamu bahwa Nabi shallallahu 'alaihi wasallam menyampaikan khutbah sambil duduk maka janganlah kamu mempercayainya.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "28",
    "matchingArabicURN": "1115910",
    "last_updated": null
  },
  {
    "indonesianURN": "3215660",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "827",
    "babName": "Bacaan pada khutbah kedua disertai mengingat Allah",
    "hadithNumber": "1566",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dia berkata; telah menceritakan kepada kami 'Abdurrahman dia berkata; telah menceritakan kepada kami Sufyan dari Simak dari Jabir bin Samurah dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam menyampaikan khutbah sambil berdiri, kemudian duduk, lalu berdiri dan membaca beberapa ayat serta berdzikir kepada Allah. Khutbah beliau sederhana (tidak lama dan tidak sebentar), dan shalatnya juga sederhana (tidak lama dan tidak sebentar).\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "29",
    "matchingArabicURN": "1115920",
    "last_updated": null
  },
  {
    "indonesianURN": "3215670",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "828",
    "babName": "Imam turun dari minbar sebelum selesai khutbah",
    "hadithNumber": "1567",
    "hadithText": "Telah mengabarkan kepada kami Ya'qub bin Ibrahim dia berkata; telah menceritakan kepada kami Abu Tumailah dari Al Husain bin Waqid dari Ibnu Buraidah dari bapaknya dia berkata; \"Pada saat Rasulullah Shalallahu 'Alaihi Wa Sallam khutbah di atas mimbar, tiba-tiba Hasan dan Husain Radliallahu? nhuma datang dengan memakai baju merah. Keduanya berjalan, lalu terjatuh. Maka Rasulullah Shalallahu 'Alaihi Wa Sallam turun dari mimbar, lalu menggendong keduanya, kemudian bersabda: `Allah Maha Benar (firman-Nya), 'Sesungguhnya hartamu dan anak-anakmu adalah fitnah'. (Qs. Al Anfaal (8): 28). Aku melihat dua anak ini terjatuh dalam kedua bajunya, maka aku tidak sabar hingga aku turun lalu kugendong keduanya'.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "30",
    "matchingArabicURN": "1115930",
    "last_updated": null
  },
  {
    "indonesianURN": "3215680",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "829",
    "babName": "Imam menasehati wanita setelah selesai khutbah dan memberi motivasi",
    "hadithNumber": "1568",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin 'Ali dia berkata; telah menceritakan kepada kami Yahya dia berkata; telah menceritakan kepada kami Sufyan dia berkata; telah menceritakan kepada kami 'Abdurrahman bin 'Abis dia berkata; \"Aku pernah mendengar seseorang berkata kepada lbnu Abbas, 'Apakah engkau pernah ikut keluar bersama Rasulullah Shalallahu 'Alaihi Wa Sallam? ' la menjawab, `Ya pernah, kalaulah bukan karena posisiku (yang masih kerabat) dan usiaku yang masih kecil, maka aku tidak bisa ikut. Beliau mendatangi bendera yang berada di rumah Katsir bin Ash-Shalt, lalu beliau mengerjakan shalat kemudian menyampaikan khutbah. -Beliau- lalu mendatangi, menasihati, mengingatkan, dan memerintahkan para wanita untuk bersedekah. Maka para wanita pun melepaskan kalung-kalungnya dan melemparkannya ke baju (kain) Bilal'.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "31",
    "matchingArabicURN": "1115940",
    "last_updated": null
  },
  {
    "indonesianURN": "3215690",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "830",
    "babName": "Shalat sebelum dan sesudah ied",
    "hadithNumber": "1569",
    "hadithText": "Telah mengabarkan kepada kami 'Abdullah bin Sa'id Al Asyaj dia berkata; telah menceritakan kepada kami Ibnu Idris dia berkata; telah memberitakan kepada kami Syu'bah dari 'Adi dari Sa'id bin Jubair dari Ibnu 'Abbas, bahwa Nabi Shalallahu 'Alaihi Wa Sallam keluar pada hari raya, lalu beliau shalat dua rakaat tanpa mengerjakan shalat apapun sebelum maupun sesudahnya.</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "32",
    "matchingArabicURN": "1115950",
    "last_updated": null
  },
  {
    "indonesianURN": "3215700",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "831",
    "babName": "Imam menyembelih pada hari ied dan jumlah yang disembelih",
    "hadithNumber": "1570",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud dia berkata; telah menceritakan kepada kami Hatim bin Wardan dari Ayyub dari Muhammad bin Sirin dari Anas bin Malik, dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam menyampaikan khutbah kepada kami pada hari raya Kurban, lalu beliau menuju kepada dua kambing yang putih, kemudian menyembelihnya.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "33",
    "matchingArabicURN": "1115960",
    "last_updated": null
  },
  {
    "indonesianURN": "3215710",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "831",
    "babName": "Imam menyembelih pada hari ied dan jumlah yang disembelih",
    "hadithNumber": "1571",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin 'Abdul Hakim dari Syu'aib dari Al Laits dari Katsir bin Farqad dari Nafi', 'Abdullah bin 'Umar mengabarkan kepadanya, bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam menyembelih di tempat shalat hari raya.</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "34",
    "matchingArabicURN": "1115970",
    "last_updated": null
  },
  {
    "indonesianURN": "3215720",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "832",
    "babName": "Dua ied bertemu dalam sehari dan menghadiri keduanya",
    "hadithNumber": "1572",
    "hadithText": "Telah mengabarkan kepadaku Muhammad bin Qudamah dari Jarir dari Ibrahim bin Muhammad bin Al Muntasyir, -aku berkata-; 'Dari bapaknya? ' dia berkata; 'Benar'- dari Habib bin Salim dari An Nu'man bin Basyir dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam pada shalat Jum'at dan shalat 'Id membaca surah Al A'laa dan Al Ghaasyiyah. Bila terjadi hari raya dan Jum'at dalam satu hari, maka beliau membaca keduanya.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "35",
    "matchingArabicURN": "1115980",
    "last_updated": null
  },
  {
    "indonesianURN": "3215730",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "833",
    "babName": "Dirukhsahkan tidak menghadiri jumatan bagi yang menyertai ied",
    "hadithNumber": "1573",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin 'Ali dia berkata; telah menceritakan kepada kami 'Abdurrahman bin Mahdi dia berkata; telah menceritakan kepada kami Israil dari 'Utsman bin Al Mughirah dari Iyas bin Abu Ramlah dia berkata; aku mendengar Mu'awiyah bertanya kepada Zaid bin Arqam, 'Apakah engkau pernah mengerjakan shalat dua hari raya bersama Rasulullah shallallahu 'alaihi wasallam? ' la menjawab, `Ya, beliau shallallahu 'alaihi wasallam mengerjakan shalat hari raya pada permulaan slang (pagi hari), lalu beliau memberi rukhsah kewajiban jumat (boleh melakukannya, boleh juga tidak) '.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "36",
    "matchingArabicURN": "1115990",
    "last_updated": null
  },
  {
    "indonesianURN": "3215740",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "833",
    "babName": "Dirukhsahkan tidak menghadiri jumatan bagi yang menyertai ied",
    "hadithNumber": "1574",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dia berkata; telah menceritakan kepada kami Yahya dia berkata; telah menceritakan kepada kami 'Abdul Hamid bin Ja'far dia berkata; telah menceritakan kepadaku Wahb bin Kaisan dia berkata; \"Pada masa Ibnu Zubair, pernah terjadi dua hari raya (hari raya & Jum'at) dalam satu hari. Ibnu Zubair mengakhirkan keluar untuk shalat 'Id agak siang, lalu ia keluar dan menyampaikan khutbah dengan khutbah yang lama. Kemudian ia turun dan mengerjakan shalat. Pada hari itu ia tidak mengerjakan shalat Jum'at bersama manusia. Hal tersebut diceritakan kepada Ibnu Abbas, dan dia mengatakan bahwa Ibnu Zubair sudah melakukan sesuai dengan Sunnah.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "37",
    "matchingArabicURN": "1116000",
    "last_updated": null
  },
  {
    "indonesianURN": "3215750",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "834",
    "babName": "Memukul rebana ketika ied",
    "hadithNumber": "1575",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id dia berkata; telah menceritakan kepada kami Muhammad Ja'far dari Ma'mar dari Az Zuhri dari 'Urwah dari 'Aisyah dia berkata; \"Bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam masuk ke tempatnya dan di sisinya ada dua anak perempuan yang sedang menabuh dua rebana, maka Abu Bakar membentak kedua budak tadi'. Lalu Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: 'Biarkan saja mereka, sesungguhnya bagi tiap-tiap kaum mempunyai hari raya.'</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "38",
    "matchingArabicURN": "1116010",
    "last_updated": null
  },
  {
    "indonesianURN": "3215760",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "835",
    "babName": "Bermain di  hadapan imam ketka hari ied",
    "hadithNumber": "1576",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Adam dari 'Abdah dari Hisyam dari bapaknya dari 'Aisyah dia berkata; \"Beberapa orang hitam datang lalu bermain di depan Rasulullah Shalallahu 'Alaihi Wa Sallam pada hari raya. Beliau lalu memanggilku, dan saat itu aku melihat dari atas pundak beliau. Aku terus melihat mereka sampai akhirnya aku pergi meninggalkan mereka.</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "39",
    "matchingArabicURN": "1116020",
    "last_updated": null
  },
  {
    "indonesianURN": "3215770",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "836",
    "babName": "Bermain di masjid pada hari ied dan wanita menonton",
    "hadithNumber": "1577",
    "hadithText": "Telah mengabarkan kepada kami 'Ali bin Khasyram dia berkata; telah menceritakan kepada kami Al Walid dia berkata; telah menceritakan kepada kami Al Auza'i dari Az Zuhri dari 'Urwah dari 'Aisyah dia berkata; \"Aku pernah melihat Rasulullah Shalallahu 'Alaihi Wa Sallam menutupiku dengan serbannya, dan aku melihat orang-orang Habasyah bermain di masjid, hingga aku merasa bosan. Maka, lihatlah dan jagalah dua anak perempuan kecil yang senang bermain.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "40",
    "matchingArabicURN": "1116030",
    "last_updated": null
  },
  {
    "indonesianURN": "3215780",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "836",
    "babName": "Bermain di masjid pada hari ied dan wanita menonton",
    "hadithNumber": "1578",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Musa dia berkata; telah menceritakan kepada kami Al Walid bin Muslim dia berkata; telah menceritakan kepada kami Al Auza'i dia berkata; telah menceritakan kepadaku Az Zuhri dari Sa'id bin Al Musayyab dari Abu Hurairah dia berkata; \"Umar masuk dan orang-orang Habasyah sedang bermain-main di masjid, maka Umar Radliallahu? nhum menghardiknya. Rasulullah Shalallahu 'Alaihi Wa Sallam kemudian bersabda: 'Biarkanlah mereka wahai Umar! Mereka hanyalah Bani Arfidah'.\"</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "41",
    "matchingArabicURN": "1116040",
    "last_updated": null
  },
  {
    "indonesianURN": "3215790",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "19",
    "bookName": "Shalat idul adha-Idul Fithri",
    "babNumber": "837",
    "babName": "Dirukhsahkan mendengar nyanyian dan memukul rebana hari ied",
    "hadithNumber": "1579",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Hafsh bin 'Abdullah dia berkata; bapakku telah menceritakan kepadaku, dia berkata; telah menceritakan kepada kami Ibrahim bin Thahman dari Malik bin Anas dari Az Zuhri dari 'Urwah bahwa ia menceritakan kepadanya, 'Aisyah telah menceritakan kepadanya, Abu Bakr Ash Shiddiq masuk kepadanya dan di sisinya ada dua anak perempuan kecil yang sedang menabuh rebana sambil bernyanyi, sedangkan Rasulullah Shalallahu 'Alaihi Wa Sallam dalam keadaan berselimut dengan bajunya -dalam lafazh lain; menutup diri dengan bajunya-lalu beliau menyingkap wajahnya dan bersabda; 'Biarkanlah mereka wahai Abu Bakr! Sesungguhnya ini adalah hari raya yang juga merupakan hari-hari Mina.' Saat itu Rasulullah Shalallahu 'Alaihi Wa Sallam berada di Madinah.</b>",
    "bookID": "19.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "42",
    "matchingArabicURN": "1116050",
    "last_updated": null
  }
]