[
  {
    "indonesianURN": "3203230",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "121",
    "babName": "Bab",
    "hadithNumber": "323",
    "hadithText": "Telah mengabarkan kepada kami Suwaid bin Nashr dia berkata; telah menceritakan kepada kami Abdullah bin Al Mubarak dari Sufyan dari Simak dari Ikrimah dari Ibnu Abbas bahwa sebagian istri Nabi shallallahu 'alaihi wasallam mandi junub, lalu Rasulullah shallallahu 'alaihi wasallam berwudlu dari air sisanya, maka mereka (para istri Nabi) menceritakan hal tersebut kepada beliau, kemudian beliau bersabda, \"Air itu tidak dapat dinajisi oleh sesuatupun.\"</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "1103270",
    "last_updated": null
  },
  {
    "indonesianURN": "3203240",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "122",
    "babName": "Sumur bidho'ah",
    "hadithNumber": "324",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Abdullah dia berkata; telah menceritakan kepada kami Abu Usamah dia berkata; telah menceritakan kepada kami Al Walid bin Katsir dia berkata; telah menceritakan kepada kami Muhammad bin Ka'ab Al Quradli dari Ubaidullah bin Abdurrahman bin Rafi' dari Abu Sa'id Al Khudri, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah ditanya, 'Wahai Rasulullah shallallahu 'alaihi wasallam! Apakah kita boleh wudlu dari sumur Budla'ah, yaitu sumur yang dijadikan sebagai pembuangan daging-daging anjing dan kotoran haidl serta barang-barang yang busuk'. Rasulullah shallallahu 'alaihi wasallam bersabda, \"Air itu suci, tidak ada sesuatu pun yang membuatnya najis.\"</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "1103280",
    "last_updated": null
  },
  {
    "indonesianURN": "3203250",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "122",
    "babName": "Sumur bidho'ah",
    "hadithNumber": "325",
    "hadithText": "Telah mengabarkan kepada kami Al 'Abbas bin Abdul 'Azhim dia berkata; telah menceritakan kepada kami Abdul Malik bin Amr dia berkata; telah menceritakan kepada kami Abdul Aziz bin Muslim -salah seorang ahli ibadah- dari Mutharrif bin Tharif dari Khalid bin Abu Nauf dari Salith dari Ibnu Abu Sa'id Al Khudri dari bapaknya, dia berkata; \"Aku pernah melewati Rasulullah shallallahu 'alaihi wasallam dan beliau sedang wudlu dari sumur Budha'ah. Aku bertanya, 'Apakah engkau berwudlu dari sumur Budha'ah, yaitu sumur yang dijadikan pembuangan barang-barang busuk? ' Beliau bersabda; \"Tidak ada sesuatupun yang membuat airnya najis.\"</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "1103290",
    "last_updated": null
  },
  {
    "indonesianURN": "3203260",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "123",
    "babName": "Batasan jumlah air",
    "hadithNumber": "326",
    "hadithText": "Telah mengabarkan kepada kami Al Husain bin Huraits Al Marwazi dia berkata; Telah menceritakan kepada kami Abu Usamah dari Al Walid bin Katsir dari Muhammad bin Ja'far bin Jubair dari Ubaidullah bin Abdullah bin Umar dari Bapaknya dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah ditanya tentang air dan sesuatu yang telah menimpanya dari hewan ternak dan binatang buas, beliau shallallahu 'alaihi wasallam berkata, 'Bila air itu lebih dari dua qullah, maka tidak mengandung najis'.</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "1103300",
    "last_updated": null
  },
  {
    "indonesianURN": "3203270",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "123",
    "babName": "Batasan jumlah air",
    "hadithNumber": "327",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; Telah menceritakan kepada kami Hammad dari Tsabit dari Anas bin Malik bahwa ada seorang Arab Badui kencing di masjid, maka sebagian orang bangkit untuk menghentikannya, tetapi Rasulullah shallallahu 'alaihi wasallam menegurnya, \"Jangan hentikan dia (dari hajatnya) \". Setelah ia selesai dari hajatnya, beliau meminta seember air. Kemudian menyiraminya.</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "1103310",
    "last_updated": null
  },
  {
    "indonesianURN": "3203280",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "123",
    "babName": "Batasan jumlah air",
    "hadithNumber": "328",
    "hadithText": "Telah mengabarkan kepada kami Abdurrahman bin Ibrahim dari Umar bin Abdul Wahid dari Al Auza'i dari Muhammad bin Al Walid dari Az-Zuhri dari Ubaidullah bin Abdullah dari Abu Hurairah dia berkata; bahwa ada Arab Badui kencing di masjid, maka sebagian orang mencelanya, tetapi Rasulullah shallallahu 'alaihi wasallam menegurnya, \"Biarkan dia. Siramkan seember air ke kencingnya. Kalian diutus untuk memberi kemudahan, bukan untuk kesulitan.\"</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "1103320",
    "last_updated": null
  },
  {
    "indonesianURN": "3203290",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "124",
    "babName": "Larangan mandi junub di air menggenang",
    "hadithNumber": "329",
    "hadithText": "Telah mengabarkan kepada kami Al Harits bin Miskin telah dibacakan kepadanya dan saya mendengarnya dari Ibnu Wahab dari Amr yaitu Ibnu Al Harits dari Bukair bahwa Abu Sa'ib berkata kepadanya, dia telah mendengar Abu Hurairah berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian mandi junub pada air yang tergenang (tidak mengalir).\"</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "1103330",
    "last_updated": null
  },
  {
    "indonesianURN": "3203300",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "125",
    "babName": "Wudhu dengan air lautan",
    "hadithNumber": "330",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Shafwan bin Sulaim dari Said bin Abu Salamah bahwa Al Mughirah bin Abu Burdah Telah mengabarkan kepadanya, sesungguhnya dia mendengar Abu Hurairah berkata, \"Seseorang bertanya kepada Rasulullah shallallahu 'alaihi wasallam, 'Wahai Rasulullah shallallahu 'alaihi wasallam, kami mengarungi lautan dengan kapal dan kami hanya membawa air sedikit. Bila kami berwudlu dengannya, maka kami akan kehausan. Jadi apakah kami boleh berwudlu dengan air laut?\" Rasulullah shallallahu 'alaihi wasallam bersabda, \"Laut itu suci airnya dan halal bangkainya.\"</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "1103340",
    "last_updated": null
  },
  {
    "indonesianURN": "3203310",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "126",
    "babName": "Berwudhu\" den+I375gan air es dan embun",
    "hadithNumber": "331",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; Telah memberitakan kepada kami Jarir dari Hisyam bin Urwah dari Bapaknya dari Aisyah dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya Allah bersihkanlah kesalahanku dengan air salju dan air embun dan sucikan hatiku dari kesalahan sebagaimana engkau mensucikan kain putih dari kotoran.\"</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "1103350",
    "last_updated": null
  },
  {
    "indonesianURN": "3203320",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "126",
    "babName": "Berwudhu\" den+I375gan air es dan embun",
    "hadithNumber": "332",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr dia berkata; Telah memberitakan kepada kami Jarir dari Umarah bin Al Qa'qa' dari Abu Zur'ah bin Amr bin Jarir dari Abu Hurairah dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya Allah, bersihkanlah kesalahanku dengan salju, air dan embun.\"</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "1103360",
    "last_updated": null
  },
  {
    "indonesianURN": "3203330",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "127",
    "babName": "Jilatan anjing",
    "hadithNumber": "333",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr dia berkata; Telah memberitakan kepada kami Ali bin Mushir dari Al A'masy dari Abu Razin dan Abu Shalih dari Abu Hurairah dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Apabila anjing menjilat bejana milik salah satu dari kalian maka tumpahkanlah (apa yang ada di dalamnya), kemudian basuhlah (cucilah sebanyak) tujuh kali.\"</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "1103370",
    "last_updated": null
  },
  {
    "indonesianURN": "3203340",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "128",
    "babName": "Menggosok bejana dengan  tanah karena jilatan anjing",
    "hadithNumber": "334",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la dia berkata; Telah menceritakan kepada kami Khalid yaitu Ibnu Al Harits dari Syu'bah dari Abu Tayyah dia berkata; saya mendengar Mutharrif dari Abdullah bin Mughaffal bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk membunuh anjing dan memberi keringanan pada anjing yang digunakan untuk berburu dan menjaga kambing. Beliau lalu bersabda, \" Apabila ada anjing yang menjilat bejana, maka basuhlah (cucilah) tujuh kali dan gosoklah yang ke delapan dengan tanah.\"</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "1103380",
    "last_updated": null
  },
  {
    "indonesianURN": "3203350",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "128",
    "babName": "Menggosok bejana dengan  tanah karena jilatan anjing",
    "hadithNumber": "335",
    "hadithText": "Telah mengabarkan kepada kami Amr bin Yazid dia berkata; Telah menceritakan kepada kami Bahaz bin Asad dia berkata; Telah menceritakan kepada kami Syu'bah dari Abu Tayyah Yazid bin Humaid dia berkata; Saya mendengar Mutharraf berkata; dari Abdullah bin Mughaffal dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk membunuh anjing.\" Abdullah bin Mughaffal berkata, \" Apa urusan mereka dan apa urusan anjing itu? Rasulullah shallallahu 'alaihi wasallam memberi rukhsah (keringanan) untuk anjing yang digunakan untuk berburu dan menjaga kambing. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda, \"Apabila anjing menjilat bejana, maka cucilah tujuh kali dan gosoklah yang ke delapan dengan tanah'. Abu Hurairah menyelisihinya dan berkata, \"salah satunya dengan tanah.\"</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "1103390",
    "last_updated": null
  },
  {
    "indonesianURN": "3203360",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "128",
    "babName": "Menggosok bejana dengan  tanah karena jilatan anjing",
    "hadithNumber": "336",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; Telah memberitakan kepada kami Mu'adz bin Hisyam dia berkata; Telah menceritakan kepadaku Bapakku dari Qatadah dari Khilas dari Abu Rafi' dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila ada anjing yang menjilat bejana milik salah seorang kalian, basuhlah tujuh kali, dan salah satunya dengan tanah.\"</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "1103400",
    "last_updated": null
  },
  {
    "indonesianURN": "3203370",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "128",
    "babName": "Menggosok bejana dengan  tanah karena jilatan anjing",
    "hadithNumber": "337",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; Telah menceritakan kepada kami Abdah bin Sulaiman dari Ibnu Abu 'Arubah dari Qatadah dari Ibnu Sirin dari Abu Hurairah dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila ada anjing yang menjilat bejana milik salah seorang kalian, maka basuhlah (cucilah) tujuh kali, dan salah satunya dengan tanah.\"</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "1103410",
    "last_updated": null
  },
  {
    "indonesianURN": "3203380",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "129",
    "babName": "Jilatan kucing",
    "hadithNumber": "338",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Ishaq bin Abdullah bin Abu Thalhah dari Humaidah binti 'Ubaid bin Rifa'ah dari Kabsyah binti Ka'ab bin Malik bahwa Abu Qatadah menemuinya -kemudian menyebutkan suatu kalimat yang maknanya- aku menuangkan air wudlu kepada beliau, lalu datang seekor kucing yang meminum air wudlu tadi. Beliau lalu mendekatkan bejana tadi kepada kucing tersebut hingga ia meminumnya. Kabsyah berkata, \"Dia melihatku sedang memperhatikannya, maka ia berkata, 'Apakah kamu takjub wahai anak perempuan saudaraku? ' Aku menjawab, 'Ya'. Kabsyah berkata; Rasulullah shallallahu 'alaihi wasallam bersabda; Kucing itu tidak najis, ia adalah hewan yang ada di sekeliling kalian.</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "1103420",
    "last_updated": null
  },
  {
    "indonesianURN": "3203390",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "130",
    "babName": "Bekas wanita haidh",
    "hadithNumber": "339",
    "hadithText": "Telah mengabarkan kepada kami Amr bin Ali dia berkata; Telah menceritakan kepada kami Abdurrahman dari Sufyan dari Al Miqdam bin Syuraih dari Bapaknya dari Aisyah Radliyallahu'anha dia berkata: \"Aku pernah menggigit sepotong daging satu gigitan, lalu Rasulullah shallallahu 'alaihi wasallam meletakkan mulutnya di tempat tadi aku meletakkan mulutku, padahal aku sedang haidl. Aku juga pernah minum dengan suatu bejana, kemudian Rasulullah shallallahu 'alaihi wasallam meletakkan mulutnya ditempat aku meletakkan mulutku sedangkan aku dalam keadaan haidl.\"</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "17",
    "matchingArabicURN": "1103430",
    "last_updated": null
  },
  {
    "indonesianURN": "3203400",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "131",
    "babName": "Rukhsah menggunakan sisa air wanita",
    "hadithNumber": "340",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Abdullah dia berkata; Telah menceritakan kepada kami Ma'an dia berkata; Telah menceritakan kepada kami Malik dari Nafi' dari Ibnu Umar dia berkata; \"Pada zaman Rasulullah shallallahu 'alaihi wasallam, laki-laki dan perempuan wudlu bersama-sama.\"</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "18",
    "matchingArabicURN": "1103440",
    "last_updated": null
  },
  {
    "indonesianURN": "3203410",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "132",
    "babName": "Larangan menggunakan sisa wudhu\" wanita",
    "hadithNumber": "341",
    "hadithText": "Telah mengabarkan kepada kami Amr bin Ali dia berkata; Telah menceritakan kepada kami Abu Daud dia berkata; Telah menceritakan kepada kami Syu'bah dari 'Ashim Al Ahwal dia berkata; Saya mendengar Abu Hajib -menurut Abu Abdurrahman namanya adalah Sawadah bin 'Ashim- dari Al Hakam bin Amr, bahwa Rasulullah shallallahu 'alaihi wasallam melarang seorang laki-laki berwudlu dengan sisa air wudlu wanita.\"</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "19",
    "matchingArabicURN": "1103450",
    "last_updated": null
  },
  {
    "indonesianURN": "3203420",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "133",
    "babName": "Rukhsah sisa air orang yang junub",
    "hadithNumber": "342",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; Telah menceritakan kepada kami Al-Laits dari Ibnu Syihab dari 'Urwah dari Aisyah bahwa ia pernah mandi bersama Rasulullah shallallahu 'alaihi wasallam dalam satu bejana.</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "20",
    "matchingArabicURN": "1103460",
    "last_updated": null
  },
  {
    "indonesianURN": "3203430",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "134",
    "babName": "Ukuran cukup air untuk wudhu\" dan mandi",
    "hadithNumber": "343",
    "hadithText": "Telah mengabarkan kepada kami Amr bin Ali dia berkata; Telah menceritakan kepada kami Yahya bin Sa'id dia berkata; Telah menceritakan kepada kami Syu'bah dia berkata; Telah menceritakan kepadaku Abdullah bin Abdullah bin Jabr dia berkata; \"Saya mendengar Anas bin Malik berkata; bahwa Rasulullah shallallahu 'alaihi wasallam bila berwudlu menggunakan satu makkuk (air) sedangkan bila mandi menggunakan lima makkuk.</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "21",
    "matchingArabicURN": "1103470",
    "last_updated": null
  },
  {
    "indonesianURN": "3203440",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "134",
    "babName": "Ukuran cukup air untuk wudhu\" dan mandi",
    "hadithNumber": "344",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Ishaq Al Kufii dia berkata; Telah menceritakan kepada kami 'Abdah yaitu Ibnu Sulaiman dari Sa'id dari Qatadah dari Shafiyyah binti Syaibah dari Aisyah Radliyallahu'anha bahwa Rasulullah shallallahu 'alaihi wasallam pernah berwudlu dengan satu mud dan mandi dengan kurang lebih satu sha'.</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "22",
    "matchingArabicURN": "1103480",
    "last_updated": null
  },
  {
    "indonesianURN": "3203450",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "2",
    "bookName": "Air",
    "babNumber": "134",
    "babName": "Ukuran cukup air untuk wudhu\" dan mandi",
    "hadithNumber": "345",
    "hadithText": "Telah mengabarkan kepada kami Abu Bakar bin Ishaq dia berkata; Telah menceritakan kepada kami Al Hasan bin Musa dia berkata; Telah menceritakan kepada kami Syaiban dari Qatadah dari Al Hasan dari Ibunya dari Aisyah Radliyallahu'anha dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah berwudlu dengan satu mud dan mandi dengan satu sha'.\"</b>",
    "bookID": "2.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "23",
    "matchingArabicURN": "1103490",
    "last_updated": null
  }
]