[
  {
    "indonesianURN": "3215800",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "838",
    "babName": "Mendorong shalat di rumah dan keutamaannya",
    "hadithNumber": "1580",
    "hadithText": "Telah mengabarkan kepada kami Al 'Abbas bin 'Abdul 'Azhim dia berkata; telah menceritakan kepada kami 'Abdullah bin Muhammad bin Asma' dia berkata; telah menceritakan kepada kami Juwairiyah bin Asma' dari Al Walid bin Abu Hisyam dari Nafi' bahwasanya 'Abdullah bin 'Umar berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: `Shalatlah kalian (shalat sunah) di rumah-rumah kalian dan janganlah kalian menjadikan rumah-rumah kalian seperti kuburan'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "1116060",
    "last_updated": null
  },
  {
    "indonesianURN": "3215810",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "838",
    "babName": "Mendorong shalat di rumah dan keutamaannya",
    "hadithNumber": "1581",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman dia berkata; telah menceritakan kepada kami 'Affan bin Muslim dia berkata; telah menceritakan kepada kami Wuhaib dia berkata; Aku mendengar Musa bin 'Uqbah berkata; aku mendengar Abu An Nadhr menceritakan dari Busr bin Sa'id dari Zaid bin Tsabit bahwa Nabi Shalallahu 'Alaihi Wa Sallam membuat ruangan khusus dari tikar di dalam masjid. Beliau shalat malam di dalamnya hingga orang-orang berkumpul kepadanya, kemudian suaranya tak terdengar selama semalam, maka orang-orang pun mengira bahwa beliau tertidur, maka sebagian mereka berdehem-dehem supaya beliau keluar. Kemudian Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Aku senantiasa melihat perbuatan kalian hingga aku khawatir hal itu akan diwajibkan kepada kalian. Kalau sampai diwajibkan kepada kalian, maka kalian tidak mampu melakukannya. Wahai manusia, shalatlah di rumah-rumah kalian. Sesungguhnva shalat seseorang yang paling utama adalah di rumahnya, kecuali shalat wajib.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "1116070",
    "last_updated": null
  },
  {
    "indonesianURN": "3215820",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "838",
    "babName": "Mendorong shalat di rumah dan keutamaannya",
    "hadithNumber": "1582",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dia berkata; telah memberitakan kepada kami Ibrahim bin Abul Wazir dia berkata; telah menceritakan kepada kami Muhammad bin Musa Al Fithri dari Sa'd bin Ishaq bin Ka'b bin 'Ujrah dari bapaknya dari kakeknya, dia berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam melaksanakan shalat maghrib di masjid Bani Abdul Asyhal, ketika beliau selesai shalat, para sahabat mulai shalat sunnah, kemudian Nabi Shalallahu 'Alaihi Wa Sallam bersabda: \"Hendaknya kalian melaksanakan shalat ini dirumah.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "1116080",
    "last_updated": null
  },
  {
    "indonesianURN": "3215830",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "839",
    "babName": "Shalat malam",
    "hadithNumber": "1583",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dia berkata; telah menceritakan kepada kami Yahya bin Sa'id dari Sa'id dari Qatadah dari Zurarah dari Sa'ad bin Hisyam bahwa dia pernah berjumpa dengan lbnu Abbas, dia bertanya kepadanya tentang shalat witir. Lalu ia menjawab; \"Maukah kamu aku beri tahu penghuni bumi yang paling mengetahui tentang shalat witir Rasulullah Shalallahu 'Alaihi Wa Sallam?\" Dia menjawab; \"Ya, mau.\" lbnu Abbas berkata; \"Dia adalah Aisyah. Datangi dan tanyakanlah hal itu kepadanya, dan kembalilah kepadaku untuk memberitahukan jawabannya kepadaku.\" Kemudian dia (Hisyam) datang kepada Hakim bin Aflah untuk meminta menemaninya datang kepada Aisyah. Lalu ia menjawab, 'Aku bukan tak mau mendekatinya. Aku pernah melarangnya untuk berbicara sesuatu tentang dua kelompok yang bertengkar, namun ia menolaknya, ia terus saja melakukan!\" Lalu ia (Hisyam) bersumpah kepadanya, dan akhirnya dia mau datang kepada Aisyah bersamanya. Lalu ia masuk ke tempat Aisyah. Kemudian Aisyah bertanya kepada Hakim, \"Siapa yang bersamamu?\" la menjawab; \"Sa'ad bin Hisyam.\" la bertanya lagi, \" Hisyam yang mana?\" la menjawab; \"Anaknya Amir.\" Lalu ia mendoakan baginya dan berkata, \"Sebaik-baik lelaki adalah`Amir!\" Hakim bertanya, \"Wahai Ummul Mukminin, kabarkanlah kepadaku tentang akhlak Rasulullah Shalallahu 'Alaihi Wa Sallam?\" Aisyah menjawab, \"Bukankah kamu membaca Al Qur'an?\" Hakim menjawab, \"Ya.\" Aisyah lalu berkata, \"Akhlak Nabi Allah Shalallahu 'Alaihi Wa Sallam adalah Al Qur'an.\" Aku ingin berdiri (pamit pulang), namun timbul keinginan untuk mengetahui cara Rasulullah Shalallahu 'Alaihi Wa Sallam melakukan shalat malam, maka ia bertanya lagi, \"Wahai Ummul Mukminin! Kabarkanlah kepadaku tentang shalat malam Rasulullah Shalallahu 'Alaihi Wa Sallam?\" Aisyah menjawab; \"Bukankah kamu membaca surah Al Muzammil?\" Hakim menjawab, \"Ya.\" Aisyah berkata; \"Allah Azza wa Jalla mewajibkan shalat malam pada permulaan surah ini, lalu Rasulullah bersama para sahabatnya menegakkan shalat malam dengan sekuat tenaga sampai telapak kaki mereka membengkak. Kemudian Allah Azza wa Jalla menahannya -yang ujungnya dua belas bulan- lalu menurunkan keringanannya pada akhir surah ini (Al Muzammil), sehingga shalat malam yang semula hukumnya wajib menjadi sunnah.\" Aku ingin berdiri, namun aku juga ingin mengetahui shalat witir Rasulullah Shalallahu 'Alaihi Wa Sallam, maka aku bertanya; \"Wahai Ummul Mukminin! Kabarkanlah kepadaku tentang shalat witir Rasulullah Shalallahu 'Alaihi Wa Sallam?\" Aisyah menerangkan, \"Kami mempersiapkan siwak dan air wudlunya, lalu Allah Azza wa Jalla membangunkannya sekehendakNya pada malam hari, kemudian beliau bersiwak dan berwudlu lalu mengerjakan shalat delapan rakaat tanpa ada duduk, kecuali pada rakaat kedelapan. Beliau berdzikir kepada Allah Azza wa Jalla dan berdoa kepada-Nya, lalu mengucapkan salam dengan salam yang terdengar oleh kami. Kemudian beliau shalat dua rakaat sambil duduk- setelah salam, dan shalat lagi satu rakaat, sehingga berjumlah sebelas rakaat. Wahai anakku, setelah Rasulullah Shalallahu 'Alaihi Wa Sallam mencapai umur senja dan mulai gemuk, beliau mengerjakan witir tujuh rakaat, lalu shalat dua rakaat sambil duduk setelah salam, sehingga semuanya menjadi sembilan rakaat. Wahai anakku, bila Rasulullah Shalallahu 'Alaihi Wa Sallam mengerjakan suatu shalat, maka beliau senang untuk melakukannya secara terus-menerus. Bila beliau berhalangan untuk shalat malam karena ketiduran atau sakit, maka beliau mengerjakan shalat dua belas rakaat pada siang harinya. Aku tidak mengetahui bahwa Nabi Allah pernah membaca Al Qur'an seluruhnya dalam satu malam. Aku juga tidak mengetahui bahwa beliau shalat malam secara sempurna hingga pagi, dan aku pun tidak mengetahui bahwa beliau berpuasa satu bulan penuh selain pada bulan Ramadlan.\" Lalu ia (Hisyam) datang kepada Ibnu Abbas dan menceritakan hal tersebut kepadanya. Dia mengomentarinya dengan berkata; \"Beliau (Aisyah) benar. Seandainya aku yang masuk (datang) kepadanya pasti aku akan menemuinya sehingga dia (Aisyah) berbicara langsung kepadaku.\" Abu Abdurrahman berkata, \"Begitulah yang tertera dalam kitabku! Aku tidak mengetahui ini kesalahan siapa, dalam posisi witir beliau shallallahu 'alaihi wasallam.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "1116090",
    "last_updated": null
  },
  {
    "indonesianURN": "3215840",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "840",
    "babName": "Ganjaran yang shalat malam pada bulan Ramadhan karena dorongan iman dan memburu pahala",
    "hadithNumber": "1584",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Ibnu Syihab dari Humaid bin 'Abdurrahman dari Abu Hurairah, bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Barangsiapa shalat (malam) pada bulan Ramadhan karena iman dan mengharap pahala, maka dosa-dosanya yang telah lalu akan diampuni.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "1116100",
    "last_updated": null
  },
  {
    "indonesianURN": "3215850",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "840",
    "babName": "Ganjaran yang shalat malam pada bulan Ramadhan karena dorongan iman dan memburu pahala",
    "hadithNumber": "1585",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Isma'il Abu Bakr dia berkata; telah menceritakan kepada kami 'Abdullah bin Muhammad bin Asma' dia berkata; telah menceritakan kepada kami Juwairiyah dari Malik dia berkata; berkata Az Zuhri; telah mengabarkan kepadaku Abu Salamah bin 'Abdurrahman dan Humaid bin 'Abdurrahman dari Abu Hurairah, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa shalat (malam) pada bulan Ramadhan karena iman dan mengharap pahala, maka dosa-dosanya yang telah lalu akan diampuni.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "1116110",
    "last_updated": null
  },
  {
    "indonesianURN": "3215860",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "841",
    "babName": "Shalat malam Ramadhan",
    "hadithNumber": "1586",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Ibnu Syihab dari 'Urwah dari 'Aisyah, bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam pada suatu malam mengerjakan shalat di masjid, dan orang-orang pun ikut shalat dengan beliau. Kemudian besoknya Rasulullah shalat lagi dan orang-orang yang ikut pun bertambah banyak. Lalu orang-orang berkumpul pada malam yang ketiga -atau keempat- namun beliau tidak keluar kepada mereka. Pada pagi harinya beliau bersabda: \"Aku telah mengetahui apa yang kalian perbuat. Tidak ada yang menghalangiku untuk keluar kepada kalian melainkan aku khawatir hal tersebut akan diwajibkan kepada kalian.\" Dan hal itu terjadi pada bulan Ramadhan.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "1116120",
    "last_updated": null
  },
  {
    "indonesianURN": "3215870",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "841",
    "babName": "Shalat malam Ramadhan",
    "hadithNumber": "1587",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id dia berkata; telah menceritakan kepada kami Muhammad bin Al Fudhail dari Dawud bin Abu Hind dari Al Walid bin 'Abdurrahman dari Jubair bin Nufair dari Abu Dzarr dia berkata; \"Kami puasa Ramadlan bersama Rasulullah Shalallahu 'Alaihi Wa Sallam, dan beliau tidak bangun (shalat malam) bersama kami hingga tinggal tujuh hari dari bulan Ramadlan. Lalu beliau bangun bersama kami hingga lewat sepertiga malam, kemudian pada malam keenam menjelang akhir Ramadhan beliau tidak bangun (malam)! Maka setelah malam kelima, beliau bangun bersama kami hingga hampir lewat separuh malam. Kami berkata kepada beliau, 'Wahai Rasulullah, bagaimana jika engkau shalat sunnah bersama kami malam ini? ' Beliau menjawab: 'Jika seseorang shalat bersama imam hingga usai, maka Allah menuliskan baginya pahala menegakkan shalat malam'. Kemudian beliau tidak bangun (guna shalat malam) bersama kami. Ketika bulan (Ramadhan) tinggal tiga hari lagi, beliau bangun untuk shalat malam bersama kami, lalu mengumpulkan keluarga dan para istrinya hingga kami khawatir kehilangan Al Falah ini.\" Aku lalu bertanya; \"Apakah (Al Falah) itu?\" Ia menjawab; \"Waktu sahur\".</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "1116130",
    "last_updated": null
  },
  {
    "indonesianURN": "3215880",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "841",
    "babName": "Shalat malam Ramadhan",
    "hadithNumber": "1588",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman dia berkata; telah menceritakan kepada kami Zaid bin Al Hubab dia berkata; telah mengabarkan kepadaku Mu'awiyah bin Shalih dia berkata; telah menceritakan kepadaku Nu'aim bin Ziyad Abu Thalhah dia berkata; \"Aku mendengar Nu'man bin Basyir berkata di atas mimbar di daerah Himsh, 'Kami bangun untuk shalat malam bersama Rasulullah Shalallahu 'Alaihi Wa Sallam di bulan Ramadlan pada malam dua puluh tiga sampai sepertiga malam pertama. Kemudian kami bangun (shalat malam) lagi bersama beliau pada malam kedua puluh lima sampai pertengahan malam. Kemudian kami bangun (shalat malam) lagi bersama beliau pada malam kedua puluh tujuh hingga kami mengira bahwa kami tidak mendapatkan kemenangan itu'. Mereka menamakan kemenangan (Al Falah) itu dengan sahur.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "1116140",
    "last_updated": null
  },
  {
    "indonesianURN": "3215890",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "842",
    "babName": "Motivasi shalat malam",
    "hadithNumber": "1589",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin Yazid dia berkata; telah menceritakan kepada kami Sufyan dari Abu Az Zinad dari Al A'raj dari Abu Hurairah dia berkata; bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Apabila salah seorang dari kalian tidur, maka syethan mengikat tiga ikatan di atas kepalanya; tiap ikatan (buhul) diikat dengan kata, 'Malam masih panjang' yakni tidurlah. Jika ia bangun lalu berdzikir kepada Allah, maka lepaslah satu ikatan. Jika ia berwudhu, maka lepaslah ikatan lainnya, dan jika ia mengerjakan shalat maka lepaslah semua ikatannya, sehingga pada pagi harinya ia berjiwa lapang dan bersemangat. Sedangkan jika ia tidak melakukan hal tersebut (bangun, berwudhu, dan shalat malam), maka pada pagi harinya jiwanya akan buruk dan malas.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "1116150",
    "last_updated": null
  },
  {
    "indonesianURN": "3215900",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "842",
    "babName": "Motivasi shalat malam",
    "hadithNumber": "1590",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; telah memberitakan kepada kami Jarir dari Manshur dari Abu Wa'il dari 'Abdullah dia berkata; Diceritakan kepada Rasulullah Shalallahu 'Alaihi Wa Sallam bahwa ada seorang lelaki yang tidur semalaman hingga pagi, maka beliau bersabda: \"Syaithan telah mengencingi kedua telinga laki-laki itu.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "1116160",
    "last_updated": null
  },
  {
    "indonesianURN": "3215910",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "842",
    "babName": "Motivasi shalat malam",
    "hadithNumber": "1591",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin 'Ali dia berkata; telah menceritakan kepada kami 'Abdul 'Aziz bin 'Abdush Shamad dia berkata; telah menceritakan kepada kami Manshur dari Abu Wa'il dari 'Abdullah Bahwa seorang laki-laki berkata; \"Wahai Rasulullah, tadi malam si Fulan tidur hingga pagi dan meninggalkan shalat. Beliau Shalallahu 'Alaihi Wa Sallam bersabda: Syaithan telah mengencingi kedua telinga orang itu.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "1116170",
    "last_updated": null
  },
  {
    "indonesianURN": "3215920",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "842",
    "babName": "Motivasi shalat malam",
    "hadithNumber": "1592",
    "hadithText": "Telah mengabarkan kepada kami Ya'qub bin Ibrahim dia berkata; telah menceritakan kepada kami Yahya dari Ibnu 'Ajlan dia berkata; telah menceritakan kepadaku Al Qa'qa' dari Abu Shalih dari Abu Hurairah dia berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Allah merahmati seorang pemuda yang bangun untuk shalat dimalam hari, lalu ia membangunkan istrinya untuk shalat, jika ia enggan maka ia memercikkan air diwajahnya, dan Allah merahmati seorang istri yang bangun untuk shalat dimalam hari lalu ia membangunkan suaminya untuk shalat, jika ia enggan maka ia memercikkan air kewajahnya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "1116180",
    "last_updated": null
  },
  {
    "indonesianURN": "3215930",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "842",
    "babName": "Motivasi shalat malam",
    "hadithNumber": "1593",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Al Laits dari 'Uqail dari Az Zuhri dari 'Ali bin Husain bahwasanya Al Husain bin 'Ali menceritakan kepadanya dari 'Ali bin Abu Thalib, bahwa Nabi Shalallahu 'Alaihi Wa Sallam pernah mendatangi dia dan Fatimah pada malam hari, lalu beliau bersabda: \"Tidakkah kalian shalat (malam)?\" Aku menjawab; `'Wahai Rasulullah, jiwa-jiwa kami ada di tangan Allah, jadi jika Dia hendak membangunkannya maka Dia akan membangunkannya.\" Kemudian beliau pergi ketika kuucapkan hal itu, dan aku mendengar beliau pergi sambil memukul pahanya dan bergumam dengan membaca ayat, 'Dan manusia adalah makhluk yang paling banyak membantah.\" (Qs. AI Kahfi (18): 54)</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "1116190",
    "last_updated": null
  },
  {
    "indonesianURN": "3215940",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "842",
    "babName": "Motivasi shalat malam",
    "hadithNumber": "1594",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'd bin Ibrahim bin Sa'd dia berkata; pamanku telah menceritakan kepada kami, dia berkata; bapakku telah menceritakan kepada kami dari Ibnu Ishaq dia berkata; telah menceritakan kepadaku Hakim bin Hakim bin 'Abbad bin Hunaif dari Muhammad bin Muslim bin Syihab dari 'Ali bin Husain dari bapaknya dari kakeknya yaitu 'Ali bin Abu Thalib dia berkata; Nabi Shalallahu 'Alaihi Wa Sallam pernah mendatangi dirinya dan Fatimah pada malam hari, lalu beliau bersabda: \"Tidakkah kalian shalat (malam) '?\" Aku menjawab, \"Wahai Rasulullah, jiwa-jiwa kami ada di tangan Allah, jadi jika Dia hendak membangunkannya maka Dia akan membangunkannya.\" Kemudian beliau pergi ketika kuucapkan hal itu, dan aku mendengar beliau pergi sambil memukul pahanya dan bergumam dengan membaca ayat, \"Dan manusia adalah makhluk yang paling banyak membantah.\" (Qs. AI Kahfi (18): 54).</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "1116200",
    "last_updated": null
  },
  {
    "indonesianURN": "3215950",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "843",
    "babName": "Keutamaan shalat malam",
    "hadithNumber": "1595",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id dia berkata; telah menceritakan kepada kami Abu 'Awanah dari Abu Bisyr dari Humaid bin 'Abdurrahman bin 'Auf dari Abu Hurairah dia berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Puasa yang paling utama setelah puasa Ramadlan adalah puasa di bulan Muharram, dan shalat yang paling utama setelah shalat wajib adalah shalat malam.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "1116210",
    "last_updated": null
  },
  {
    "indonesianURN": "3215960",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "843",
    "babName": "Keutamaan shalat malam",
    "hadithNumber": "1596",
    "hadithText": "Telah mengabarkan kepada kami Suwaid bin Nashr dia berkata; telah memberitakan kepada kami 'Abdullah dia berkata; telah menceritakan kepada kami Syu'bah dari Abu Bisyr Ja'far bin Abu Wahsyiyyah bahwasanya ia mendengar Humaid bin 'Abdurrahman berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Shalat yang paling utama setelah shalat wajib adalah shalat malam, dan puasa yang paling utama setelah puasa Ramadlan adalah puasa Muharram.\" Hadist ini dimursalkan oleh Syu'bah bin Hajaj.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "17",
    "matchingArabicURN": "1116220",
    "last_updated": null
  },
  {
    "indonesianURN": "3215970",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "844",
    "babName": "Keutamaan shalat malam ketika safar",
    "hadithNumber": "1597",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dia berkata; telah menceritakan kepada kami Muhammad dia berkata; telah menceritakan kepada kami Syu'bah dari Manshur dia berkata; aku mendengar Rib'iyy dari Zaid bin Zhabyan -dan dia merafa'kannya sampai Abu Dzarr -; Ada tiga orang yang Allah mencintai mereka 1). Seseorang yang mendatangi rombongan dan meminta mereka dengan menyebut nama Allah, ia meminta rombongan itu padahal tidak ada hubungan kekerabatan, namun mereka tidak mau memberi. Lantas ada salah seorang dari rombongan itu melambatkan diri. Dengan menyembunyikan rahasia, orang tadi lantas memberi si peminta, sehingga tidak seorang pun mengetahui pemberiannya selain Allah dan orang pun tidak tahu apa yang diberikannya 2). Sebuah rombongan yang berjalan di malam hari, hingga saat waktu tidur lebih mereka cintai daripada yang lain, mereka singgah dan mereka letakkan kepala mereka, namun ada seseorang yang justru mencari keutamaan dengan merendahkan diri kepada-Ku dan membaca ayat-ayat-Ku 3). Seseorang yang mengikuti ekspedisi militer, rombongan pasukannya menyerang musuh lantas mereka terpukul mundur, namun dalam kondisi ini, ia justru menghadang musuh hingga terbunuh atau mendapat kemenangan.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "18",
    "matchingArabicURN": "1116230",
    "last_updated": null
  },
  {
    "indonesianURN": "3215980",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "845",
    "babName": "Waktu shalat malam",
    "hadithNumber": "1598",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Ibrahim Al Bashri dari Bisyr bin Al Mufadldlal dia berkata; telah menceritakan kepada kami Syu'bah dari Asy'ats bin Muslim dari bapaknya dari Masruq dia berkata; Aku berkata kepada 'Aisyah 'Amalan apakah yang paling disukai Rasulullah Shalallahu 'Alaihi Wa Sallam? ' la menjawab; `Yang terus menerus (dilakukan) '. Aku bertanya lagi; 'Kapan (waktu) Rasulullah bangun untuk shalat malam? ' Ia menjawab; `Bila mendengar ayam berkokok'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "19",
    "matchingArabicURN": "1116240",
    "last_updated": null
  },
  {
    "indonesianURN": "3215990",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "846",
    "babName": "Bacaan pembuka shalat malam",
    "hadithNumber": "1599",
    "hadithText": "Telah mengabarkan kepada kami 'Ishmah bin Al Fadhl dia berkata; telah menceritakan kepada kami Zaid bin Al Hubab dari Mu'awiyah bin Shalih dia berkata; telah menceritakan kepada kami Al Azhar bin Sa'id dari 'Ashim bin Humaid dia berkata; Aku bertanya kepada 'Aisyah, \"Bagaimana Rasulullah memulai shalat malam?\" Aisyah berkata; \"Engkau telah bertanya tentang sesuatu yang tidak pernah ditanyakan oleh seorang pun sebelumnya. Rasulullah Shalallahu 'Alaihi Wa Sallam bertakbir sepuluh kali, bertahmid sepuluh kali, bertasbih sepuluh kali, bertahlil sepuluh kali, dan beristighfar (memohon ampunan) sepuluh kali. Lalu beliau mengucapkan doa: 'Ya Allah, ampunilah aku, berilah aku petunjuk, berilah aku rezeki dan kesehatan. Aku berlindung kepada-Mu dari sempitnya tempat pada hari Kiamat nanti'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "20",
    "matchingArabicURN": "1116250",
    "last_updated": null
  },
  {
    "indonesianURN": "3216000",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "846",
    "babName": "Bacaan pembuka shalat malam",
    "hadithNumber": "1600",
    "hadithText": "Telah mengabarkan kepada kami Suwaid bin Nashr dia berkata; telah memberitakan kepada kami 'Abdullah dari Ma'mar dan Al Auza'i dari Yahya bin Abu Katsir dari Abu Salamah dari Rabi'ah bin Ka'b Al Aslami dia berkata; \"Aku pernah menginap di kamar Nabi Shalallahu 'Alaihi Wa Sallam, sehingga bila beliau bangun malam kami mendengarnya. Beliau mengucapkan: `Subhanallahi rabbil 'alamin (Maha Suci Allah, Tuhan semesta alam) ' beberapa lama, kemudian mengucapkan: `Subhanallahi wa bihamdih (Maha Suci Allah dan segala puji bagi-Nya) ' juga beberapa lama.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "21",
    "matchingArabicURN": "1116260",
    "last_updated": null
  },
  {
    "indonesianURN": "3216010",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "846",
    "babName": "Bacaan pembuka shalat malam",
    "hadithNumber": "1601",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id dia berkata; telah menceritakan kepada kami Sufyan dari Al Ahwal Sulaiman bin Abu Muslim dari Thawus dari Ibnu 'Abbas dia berkata; \"Apabila Rasulullah Shalallahu 'Alaihi Wa Sallam bangun malam, maka beliau mengerjakan shalat tahajjud. Beliau mengucapkan: 'Ya Allah, segala puji bagi-Mu. Engkaulah (pemberi) cahaya langit dan bumi serta penghuninya. Segala puji bagi-Mu, Engkau pengatur langit dan bumi serta penghuninya. Segala puji bagi-Mu, Engkaulah penguasa langit dan bumi serta penghuninya. Segala puji bagi-Mu, Engkau benar, dan janji-Mu benar, surga itu benar, neraka itu benar, hari Kiamat itu benar, para nabi itu benar, dan Muhammad itu benar. Kepada-Mulah aku memasrahkan diri dan kepada Engkau aku bertawakal. Kepada Engkaulah aku beriman. Kemudian Qutaibah menyebutkan kalimat yang artinya, 'kepada Engkaulah aku mengadu, dan kepada Engkaulah aku berhukum. Ampunilah dosa-dosaku yang telah lalu dan yang akan datang serta yang terang-terangan. Engkaulah Yang paling dahulu dan Engkaulah yang paling Akhir. Tiada Tuhan (yang berhak disembah) kecuali Engkau, tiada daya dan kekuatan kecuali dengan (pertolongan) Allah'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "22",
    "matchingArabicURN": "1116270",
    "last_updated": null
  },
  {
    "indonesianURN": "3216020",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "846",
    "babName": "Bacaan pembuka shalat malam",
    "hadithNumber": "1602",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dia berkata; telah memberitakan kepada kami Ibnul Qasim dari Malik dia berkata; telah menceritakan kepadaku Makhramah bin Sulaiman dari Kuraib bahwasanya 'Abdullah bin 'Abbas mengabarkan kepadanya, bahwa dia pernah bermalam di rumah bibinya Maimunah (istri Nabi shallallahu 'alaihi wasallam), lalu dia berbaring di atas bantal, sementara Rasulullah shallallahu 'alaihi wasallam dan keluarganya berbaring di (tikar) yang panjang. Nabi shallallahu 'alaihi wasallam tidur hingga tengah malam -sebelum atau sesudahnya sedikit-, Rasulullah shallallahu 'alaihi wasallam bangun, terus duduk dan mengusap mukanya dengan tangan, lalu membaca sepuluh ayat terakhir surah Ali Imran. Setelah itu beliau pergi ke bejana air yang tergantung, lalu berwudlu dengan air itu. Beliau memperbagus wudlunya, kemudian mengerjakan shalat. Abdullah bin Abbas berkata; 'Aku berdiri, lalu aku mengerjakan seperti apa yang dikerjakan beliau. Kemudian aku pergi ke samping beliau, beliau memegang kepalaku dengan tangan kanannya seraya menyentil telingaku. Setelah itu beliau shalat dua raka'at, lalu dua raka'at, dua raka'at, dua raka'at, lalu dua raka'at, dan dua raka'at lagi. Kemudian mengerjakan shalat witir. Setelah itu beliau berbaring, sampai datang muadzin, lalu berdiri mengerjakan shalat dua raka'at yang ringan.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "23",
    "matchingArabicURN": "1116280",
    "last_updated": null
  },
  {
    "indonesianURN": "3216030",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "847",
    "babName": "Bersiwak ketika shalat malam",
    "hadithNumber": "1603",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin 'Ali dan Muhammad bin Al Mutsanna dari 'Abdurrahman dari Sufyan dari Manshur dan Al A'masy dan Hushain dari Abu Wa'il dari Hudzaifah bahwa Nabi Shalallahu 'Alaihi Wa Sallam apabila bangun untuk shalat malam beliau menggosok mulutnya dengan siwak.'</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "24",
    "matchingArabicURN": "1116290",
    "last_updated": null
  },
  {
    "indonesianURN": "3216040",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "847",
    "babName": "Bersiwak ketika shalat malam",
    "hadithNumber": "1604",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdul A'la dia berkata; telah menceritakan kepada kami Khalid dia berkata; telah menceritakan kepada kami Syu'bah dari Hushain dia berkata; Aku mendengar Abu Wa'il menceritakan dari Hudzaifah dia berkata; Nabi Shalallahu 'Alaihi Wa Sallam apabila bangun untuk shalat malam, beliau menggosok mulutnya dengan siwak.'</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "25",
    "matchingArabicURN": "1116300",
    "last_updated": null
  },
  {
    "indonesianURN": "3216050",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "848",
    "babName": "Perselisihan Abu hashin Usman bin 'Ashim dalam masalah ini",
    "hadithNumber": "1605",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id dari Ishaq bin Sulaiman dari Abu Sinan dari Abu Hashin dari Syaqiq dari Hudzafah dia berkata; \"Apabila kami bangun untuk shalat malam, kami diperintahkan untuk bersiwak.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "26",
    "matchingArabicURN": "1116310",
    "last_updated": null
  },
  {
    "indonesianURN": "3216060",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "848",
    "babName": "Perselisihan Abu hashin Usman bin 'Ashim dalam masalah ini",
    "hadithNumber": "1606",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman dia berkata; telah menceritakan kepada kami 'Ubaidullah dia berkata; telah memberitakan kepada kami Israil dari Abu Hashin dari Syaqiq dia berkata; \"Kami diperintahkan menggosok mulut kami dengan siwak bila hendak shalat malam.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "27",
    "matchingArabicURN": "1116320",
    "last_updated": null
  },
  {
    "indonesianURN": "3216070",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "849",
    "babName": "Bacaan pembuka shalat malam",
    "hadithNumber": "1607",
    "hadithText": "Telah mengabarkan kepada kami Al 'Abbas bin 'Abdul 'Azhim dia berkata; telah memberitakan kepada kami 'Umar bin Yunus dia berkata; telah menceritakan kepada kami 'Ikrimah bin 'Ammar dia berkata; telah menceritakan kepadaku Yahya bin Abu Katsir dia berkata; telah menceritakan kepadaku Abu Salamah bin 'Abdurrahman dia berkata; \"Aku pernah bertanya kepada Aisyah; `Dengan apa Rasulullah Shalallahu 'Alaihi Wa Sallam memulai shalat malam? ' la menjawab; `Apabila bangun malam maka beliau memulai shalat dengan mengucapkan doa: `Ya Allah, Tuhan Jibril, Mikail, dan Israfil, Sang pencipta langit dan bumi, Maha mengetahui hal-hal yang gaib dan yang nampak, Engkau menghukumi di antara hamba-hambaMu dalam perselisihan mereka. Ya Allah, tunjukilah aku kepada kebenaran yang banyak diperselisihkan. Sesungguhnya Engkau memberi petunjuk kepada siapa saja yang Engkau kehendaki menuju jalan yang benar'.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "28",
    "matchingArabicURN": "1116330",
    "last_updated": null
  },
  {
    "indonesianURN": "3216080",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "849",
    "babName": "Bacaan pembuka shalat malam",
    "hadithNumber": "1608",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dia berkata; telah memberitakan kepada kami Ibnu Wahb dari Yunus dari Ibnu Syihab dia berkata; telah menceritakan kepadaku Humaid bin 'Abdurrahman bin 'Auf bahwa seseorang dari shahabat Nabi Shalallahu 'Alaihi Wa Sallam berkata; \"Aku pernah berkata -ketika aku dalam suatu perjalanan bersama Rasulullah shallallahu 'alaihi wasallam- `Demi Allah, aku akan mengawasi shalat Rasulullah shallallahu 'alaihi wasallam hingga aku bisa melihat -cara shalat beliau. Setelah Rasulullah mengerjakan shalat lsya' -yakni shalat 'Atamah beliau berbaring beberapa lama pada malam itu, kemudian bangun lalu memandang ke ufuk (langit), sambil membaca ayat: 'Ya Tuhan kami, tidaklah Engkau menciptakan hal ini dengan sia-sia...hingga ayat, 'Sesungguhnva engkau tidak mengingkari janji\" (Qs. Ali `lmraan (3): 191-194). Kemudian beliau menjulurkan tangannya ke kasur lalu mengeluarkan siwak. lalu beliau menuangkan air dari ember yang ada padanya, kemudian bersiwak. Selanjutnya beliau berdiri dan mengerjakan shalat. Sampai aku berkata; `Beliau mengerjakan shalat seukuran tidurnya'. Kemudian berbaring hingga aku berkata, 'Beliau tidur seukuran shalatnva'. Kemudian beliau bangun lalu mengerjakan seperti yang dikerjakan pada pertama kali, lalu bersabda seperti yang beliau sabdakan sebelumnya. Rasulullah Shalallahu 'Alaihi Wa Sallam mengerjakan hal tersebut tiga kali sebelum terbit Fajar.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "29",
    "matchingArabicURN": "1116340",
    "last_updated": null
  },
  {
    "indonesianURN": "3216090",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "850",
    "babName": "Shalat Rasulullah ketika malam",
    "hadithNumber": "1609",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; telah memberitakan kepada kami Yazid dia berkata; telah memberitakan kepada kami Humaid dari Anas dia berkata; \"Tidaklah kami berkehendak untuk melihat Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat melainkan pasti kami bisa melihatnya. Dan tidaklah kami berkehendak untuk melihat Rasulullah tidur melainkan kami pasti bisa melihatnya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "30",
    "matchingArabicURN": "1116350",
    "last_updated": null
  },
  {
    "indonesianURN": "3216100",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "850",
    "babName": "Shalat Rasulullah ketika malam",
    "hadithNumber": "1610",
    "hadithText": "Telah mengabarkan kepada kami Harun bin 'Abdullah dia berkata; telah menceritakan kepada kami Hajjaj dia berkata; berkata Ibnu Juraij dari bapaknya, telah mengabarkan kepadaku Ibnu Abu Mulaikah bahwasanya Ya'la bin Mamlak mengabarkan kepadanya bahwasanya ia bertanya kepada Ummu Salamah tentang shalat Nabi Shalallahu 'Alaihi Wa Sallam, maka ia menjawab; \"Beliau Shalallahu 'Alaihi Wa Sallaw shalat isya' kemudian bertasbih. Setelah itu beliau shalat lagi sebagaimana yang dikehendaki-Nya di waktu malam, lalu beliau pulang dan tidur yang lamanya sebagaimana beliau shalat. Kemudian beliau bangun kembali dan shalat yang lamanya sebagaimana beliau tidur tadi. Shalat ini adalah shalat malam beliau yang terakhir hingga subuh.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "31",
    "matchingArabicURN": "1116360",
    "last_updated": null
  },
  {
    "indonesianURN": "3216110",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "850",
    "babName": "Shalat Rasulullah ketika malam",
    "hadithNumber": "1611",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Al Laits dari 'Abdullah bin 'Ubaidullah bin Abu Mulaikah dari Ya'la bin Mamlak bahwasanya ia bertanya kepada Ummu Salamah -istri Nabi Shalallahu 'Alaihi Wa Sallam- tentang bacaan dan shalat beliau Shalallahu 'Alaihi Wa Sallam. Maka Ummu Salamah menjawab; 'Ada apa dengan shalat Rasulullah Shalallahu 'Alaihi Wa Sallam? Beliau shalat, kemudian tidur yang lamanya sebagaimana shalatnya. Lalu beliau beliau shalat lagi seukuran tidurnya tadi, kemudian tidur lagi seukuran shalatnya hingga shubuh. Ummu Salamah juga menyifati bacaan Nabi Shalallahu 'Alaihi Wa Sallam, ia menyifatinya dengan bacaan yang bisa terdengar dengan jelas huruf demi huruf.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "32",
    "matchingArabicURN": "1116370",
    "last_updated": null
  },
  {
    "indonesianURN": "3216120",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "851",
    "babName": "Shalat nabiyulah Dawud ketika malam",
    "hadithNumber": "1612",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Sufyan dari 'Amr bin Dinar dari 'Amru bin Aus bahwasanya ia mendengar 'Abdullah bin 'Amru bin Al 'Ash berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Puasa yang paling dicintai Allah Azza wa Jalla adalah puasa Nabi Daud? laihis Salam, beliau berpuasa sehari dan berbuka sehari. Shalat yang paling dicintai Allah Azza wa Jalla adalah shalat Nabi Daud, beliau tidur separuh malam lalu bangun (untuk shalat) pada sepertiganya, lalu tidur lagi pada seperenamnya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "33",
    "matchingArabicURN": "1116380",
    "last_updated": null
  },
  {
    "indonesianURN": "3216130",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "852",
    "babName": "Shalat nabiyullah Musa dan perselisihan Sulaiman Attamimi",
    "hadithNumber": "1613",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Ali bin Harb dia berkata; telah menceritakan kepada kami Mu'adz bin Khalid dia berkata; telah memberitakan kepada kami Hammad bin Salamah dari Sulaiman At Taimi dari Tsabit dari Anas bin Malik. Nabi Shalallahu 'Alaihi Wa Sallam bersabda: \"Pada malam Isra Mi'raj aku datang kepada Musa 'Alaihi Salam di bukit pasir merah, dan dia sedang shalat di dalam kuburannya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "34",
    "matchingArabicURN": "1116390",
    "last_updated": null
  },
  {
    "indonesianURN": "3216140",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "852",
    "babName": "Shalat nabiyullah Musa dan perselisihan Sulaiman Attamimi",
    "hadithNumber": "1614",
    "hadithText": "Telah mengabarkan kepada kami Al 'Abbas bin Muhammad dia berkata; telah menceritakan kepada kami Yunus bin Muhammad dia berkata; telah menceritakan kepada kami Hammad bin Salamah dari Sulaiman At Taimi dan Tsabit dari Anas Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Aku datang kepada Musa 'Alaihis Salam di bukit pasir merah, dan dia sedang shalat.\" Abu Abdurrahman berkata; 'Menurut kami Hadist ini lebih shahih dari pada Hadits Mu'adz bin Khalid. Wallahu Ta'ala A'lam.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "35",
    "matchingArabicURN": "1116400",
    "last_updated": null
  },
  {
    "indonesianURN": "3216150",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "852",
    "babName": "Shalat nabiyullah Musa dan perselisihan Sulaiman Attamimi",
    "hadithNumber": "1615",
    "hadithText": "Telah mengabarkan kepadaku Ahmad bin Sa'id dia berkata; telah menceritakan kepada kami Habban dia berkata; telah menceritakan kepada kami Hammad bin Salamah dia berkata; telah memberitakan kepada kami Tsabit dan Sulaiman At Taimi dari Anas bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Aku pernah melewati kuburan Nabi Musa Alaihis Salam, dan dia sedang shalat di kuburannya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "36",
    "matchingArabicURN": "1116410",
    "last_updated": null
  },
  {
    "indonesianURN": "3216160",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "852",
    "babName": "Shalat nabiyullah Musa dan perselisihan Sulaiman Attamimi",
    "hadithNumber": "1616",
    "hadithText": "Telah mengabarkan kepada kami 'Ali bin Khasyram dia berkata; telah menceritakan kepada kami 'Isa dari Sulaiman At Taimi dari Anas bin Malik dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku melewati Musa Alaihis Salam, pada malam aku diisra'kan (diperjalankan) dan dia sedang shalat di kuburannya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "37",
    "matchingArabicURN": "1116420",
    "last_updated": null
  },
  {
    "indonesianURN": "3216170",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "852",
    "babName": "Shalat nabiyullah Musa dan perselisihan Sulaiman Attamimi",
    "hadithNumber": "1617",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdul A'la dia berkata; telah menceritakan kepada kami Mu'tamir dari Bapaknya dari Anas bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam saat malam diisra'kan melewati Musa? laihis Salam, dan dia sedang shalat di kuburannya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "38",
    "matchingArabicURN": "1116430",
    "last_updated": null
  },
  {
    "indonesianURN": "3216180",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "852",
    "babName": "Shalat nabiyullah Musa dan perselisihan Sulaiman Attamimi",
    "hadithNumber": "1618",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Habib bin 'Arabi dan Isma'il bin Mas'ud, mereka berdua berkata; telah menceritakan kepada kami Mu'tamir dia berkata; Aku mendengar bapakku berkata; Aku mendengar Anas berkata; telah mengabarkan kepadaku sebagian sahabat Nabi shallallahu 'alaihi wasallam bahwa ketika Nabi shallallahu 'alaihi wasallam diisra'kan beliau melewati Musa? laihis Salam, dan dia sedang shalat di kuburannya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "39",
    "matchingArabicURN": "1116440",
    "last_updated": null
  },
  {
    "indonesianURN": "3216190",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "852",
    "babName": "Shalat nabiyullah Musa dan perselisihan Sulaiman Attamimi",
    "hadithNumber": "1619",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Ibnu Abu 'Adi dari Sulaiman dari Anas dari sebagian Sahabat Nabi shallallahu 'alaihi wasallam bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Pada saat malam diisra'kan aku melewati Musa? laihis Salam, dan dia sedang shalat di kuburannya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "40",
    "matchingArabicURN": "1116450",
    "last_updated": null
  },
  {
    "indonesianURN": "3216200",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "853",
    "babName": "Menghidupkan malam",
    "hadithNumber": "1620",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin 'Utsman bin Sa'id bin Katsir dia berkata; bapakku dan Baqiyyah telah menceritakan kepada kami, mereka berkata; telah menceritakan kepada kami Ibnu Abu Hamzah dia berkata; telah menceritakan kepadaku Az Zuhri dia berkata; telah mengabarkan kepadaku 'Ubaidullah bin 'Abdullah bin Al Harits bin Naufal dari 'Abdullah bin Khabbab bin Al Arat dari Bapaknya -seorang peserta perang badr bersama Rasulullah shallallahu 'alaihi wasallam- bahwa dia pernah memperhatikan cara shalat Rasulullah shallallahu 'alaihi wasallam pada semua waktu malamnya hingga Fajar. Setelah Rasulullah selesai shalat, Khabbab datang kepada beliau, lalu berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, bapak ibuku jadi jaminan, engkau telah mengerjakan shalat yang belum pernah aku lihat engkau mengerjakan sebelumnya!\" Rasulullah shallallahu 'alaihi wasallampun menjawab: \"Ya, itu adalah shalat yang penuh perasaan antara harap dan khawatir. Aku meminta kepada Rabbku tiga perkara, Dia memberiku dua perkara dan yang satu Dia menolaknya. Aku meminta kepada Rabbku Azza wa Jalla agar tidak membinasakan kita dengan bencana yang telah menyebabkan binasanya umat-umat sebelum kita, dan Allah memberikannya kepadaku. Aku juga meminta kepada Raabku Azza wa Jalla agar tidak menjadikan musuh menguasai (menang) atas kita, dan Dia juga memberikannya. Aku juga meminta agar Dia tidak mencerai beraikan kita sehingga terpisah-pisah menjadi beberapa kelompok (yang saling bertentangan), tetapi Dia tidak memberikannya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "41",
    "matchingArabicURN": "1116460",
    "last_updated": null
  },
  {
    "indonesianURN": "3216210",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "854",
    "babName": "Perselisihan Aisyah dalam menghidupkan malam",
    "hadithNumber": "1621",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin Yazid dia berkata; telah menceritakan kepada kami Sufyan dari Abu Ya'fur dari Muslim dari Masruq dia berkata; 'Aisyah berkata; \"Bila telah masuk tanggal sepuluh (Ramadlan) maka Rasulullah shallallahu 'alaihi wasallam menghidupkan malam. Beliau membangunkan keluarganya dan mengikat kainnya (menjauhi istri).\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "42",
    "matchingArabicURN": "1116470",
    "last_updated": null
  },
  {
    "indonesianURN": "3216220",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "854",
    "babName": "Perselisihan Aisyah dalam menghidupkan malam",
    "hadithNumber": "1622",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin Al Mubarak dia berkata; telah menceritakan kepada kami Yahya dia berkata; telah menceritakan kepada kami Zuhair dari Abu Ishaq dia berkata; \"Aku datang kepada Al Aswad bin Yazid -dia adalah teman sekaligus saudara bagiku- lalu berkata; 'Wahai Abu Amru, ceritakan kepadaku apa yang telah diceritakan oleh Aisyah kepadamu tentang shalat Rasulullah shallallahu 'alaihi wasallam? ' la menjawab; 'Aisyah berkata; \"Rasulullah tidur pada awal malam dan menghidupkan akhir malam dengan ibadah.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "43",
    "matchingArabicURN": "1116480",
    "last_updated": null
  },
  {
    "indonesianURN": "3216230",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "854",
    "babName": "Perselisihan Aisyah dalam menghidupkan malam",
    "hadithNumber": "1623",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Ishaq dia berkata; telah menceritakan kepada kami 'Abdah bin Sulaiman dari Sa'id dari Qatadah dari Zurarah bin Aufa dari Sa'ad bin Hisyam dari 'Aisyah Radliallahu? nha dia berkata; \"Aku tidak tahu bahwa Rasulullah shallallahu 'alaihi wasallam pernah membaca Al Qur'an seluruhnya dalam satu malam. Aku juga tidak tahu bahwa beliau shalat malam secara sempurna hingga pagi, dan aku pun tidak tahu bahwa beliau berpuasa satu bulan sempurna selain bulan Ramadlan.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "44",
    "matchingArabicURN": "1116490",
    "last_updated": null
  },
  {
    "indonesianURN": "3216240",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "854",
    "babName": "Perselisihan Aisyah dalam menghidupkan malam",
    "hadithNumber": "1624",
    "hadithText": "Telah mengabarkan kepada kami Syu'aib bin Yusuf dari Yahya dari Hisyam dia berkata; bapakku telah mengabarkan kepadaku dari 'Aisyah bahwa Nabi shallallahu 'alaihi wasallam masuk ke tempatnya dan di sisinya ada seorang perempuan. lalu beliau berkata; \"Siapa ini\" \" Aisyah menjawab; \"Dia Fulanah, dia tidak tidur.\" Lalu Aisyah menceritakan tentang shalatnya. Rasulullah bersabda: \"Cukup, kalian seharusnya mengerjakan shalat semampunya. Demi Allah, Allah tidak pernah bosan hingga kalian yang bosan. Akan tetapi sebaik-baik agama (amalan) adalah yang dilakukan secara kontinyu oleh pelakunya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "45",
    "matchingArabicURN": "1116500",
    "last_updated": null
  },
  {
    "indonesianURN": "3216250",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "854",
    "babName": "Perselisihan Aisyah dalam menghidupkan malam",
    "hadithNumber": "1625",
    "hadithText": "Telah mengabarkan kepada kami 'Imran bin Musa dari 'Abdul Warits dia berkata; telah menceritakan kepada kami 'Abdul 'Aziz dari Anas bin Malik bahwa Rasulullah shallallahu 'alaihi wasallam masuk ke dalam masjid, dan beliau melihat seutas tali menjulur di antara dua tiang, maka beliau berkata: \"Tali apa ini?\" Mereka menjawab; \"Talinya Zainab. Bila ia letih ketika sedang shalat, maka ia berpegangan dengan tali itu.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Lepaskanlah tali itu. Hendaknva salah seorang dari kalian shalat pada saat segar, dan bila letih maka hendaknya ia duduk.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "46",
    "matchingArabicURN": "1116510",
    "last_updated": null
  },
  {
    "indonesianURN": "3216260",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "854",
    "babName": "Perselisihan Aisyah dalam menghidupkan malam",
    "hadithNumber": "1626",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id dan Muhammad bin Manshur -dan lafadz ini miliknya- dari Sufyan dari Ziyad bin 'Ilaqah dia berkata; Aku mendengar Al Mughirah bin Syu'bah berkata; \"Nabi shallallahu 'alaihi wasallam shalat malam hingga kedua kakinya bengkak, lalu dikatakan kepadanya, `Bukankah dosa-dosa engkau yang telah lewat dan yang akan datang telah diampuni! ' Beliau berkata: 'Apakah aku tidak boleh menjadi hamba yang bersyukur?\"'</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "47",
    "matchingArabicURN": "1116520",
    "last_updated": null
  },
  {
    "indonesianURN": "3216270",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "854",
    "babName": "Perselisihan Aisyah dalam menghidupkan malam",
    "hadithNumber": "1627",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin 'Ali dia berkata; telah menceritakan kepada kami Shalih bin Mihran -dan dia adalah seorang yang tsiqah- dia berkata; telah menceritakan kepada kami An Nu'man bin 'Abdus Salam dari Sufyan dari 'Ashim bin Kulaib dari Bapaknya dari Abu Hurairah dia berkata; Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat hingga kedua kakinya pecah-pecah.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "48",
    "matchingArabicURN": "1116530",
    "last_updated": null
  },
  {
    "indonesianURN": "3216280",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "855",
    "babName": "Bagaimana yang dilakukan jika membuka shalat dengan berdiri dan perselisihan para pengutip",
    "hadithNumber": "1628",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Hammad dari Budail dan Ayyub dari 'Abdullah bin Syaqiq dari 'Aisyah dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah shalat malam beberapa lama, dan jika beliau shalat (diawali) dengan berdiri maka beliau juga ruku' dengan berdiri, dan jika shalatnya (diawali) dengan duduk maka beliau juga ruku' dengan duduk.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "49",
    "matchingArabicURN": "1116540",
    "last_updated": null
  },
  {
    "indonesianURN": "3216290",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "855",
    "babName": "Bagaimana yang dilakukan jika membuka shalat dengan berdiri dan perselisihan para pengutip",
    "hadithNumber": "1629",
    "hadithText": "Telah mengabarkan kepada kami 'Abdah bin 'Abdurrahim dia berkata; telah memberitakan kepada kami Waki' dia berkata; telah menceritakan kepadaku Yazid bin Ibrahim dari Ibnu Sirin dari 'Abdullah bin Syaqiq dari 'Aisyah dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah shalat dengan berdiri, juga dengan duduk. Jika beliau mengawali shalatnya dengan berdiri maka beliau ruku' dengan berdiri, sedangkan jika beliau mengawali shalatnya dengan duduk maka beliau ruku' dengan duduk.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "50",
    "matchingArabicURN": "1116550",
    "last_updated": null
  },
  {
    "indonesianURN": "3216300",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "855",
    "babName": "Bagaimana yang dilakukan jika membuka shalat dengan berdiri dan perselisihan para pengutip",
    "hadithNumber": "1630",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dia berkata; telah menceritakan kepada kami Ibnul Qasim dari Malik dia berkata; telah menceritakan kepadaku 'Abdullah bin Yazid dan Abu An Nadlar dari Abu Salamah dari 'Aisyah bahwa Nabi shallallahu 'alaihi wasallam pernah shalat sambil duduk dan membaca surah sambil duduk. Jika bacaannya tersisa sekitar tiga puluh atau empat puluh ayat, maka beliau berdiri lalu membacanya sambil berdiri, kemudian ruku' dan sujud. Lalu pada rakaat kedua beliau juga melakukan hal seperti itu.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "51",
    "matchingArabicURN": "1116560",
    "last_updated": null
  },
  {
    "indonesianURN": "3216310",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "855",
    "babName": "Bagaimana yang dilakukan jika membuka shalat dengan berdiri dan perselisihan para pengutip",
    "hadithNumber": "1631",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; telah memberitakan kepada kami 'Isa bin Yunus dia berkata; telah menceritakan kepada kami Hisyam bin 'Urwah dari Bapaknya dari 'Aisyah dia berkata; \"Aku belum pernah melihat Rasulullah shallallahu 'alaihi wasallam shalat sambil duduk, kecuali saat umurnya sudah tua. Beliau juga mengerjakan shalat sambil duduk saat membaca Al Qur'an. Jika bacaan Al Qur'an tinggal tiga puluh atau empat puluh ayat, maka beliau berdiri lalu membaca surat sambil berdiri, lalu ruku'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "52",
    "matchingArabicURN": "1116570",
    "last_updated": null
  },
  {
    "indonesianURN": "3216320",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "855",
    "babName": "Bagaimana yang dilakukan jika membuka shalat dengan berdiri dan perselisihan para pengutip",
    "hadithNumber": "1632",
    "hadithText": "Telah mengabarkan kepada kami Ziyad bin Ayyub dia berkata; telah menceritakan kepada kami Ibnu 'Ulayyah dia berkata; telah menceritakan kepada kami Al Walid bin Abu Hisyam dari Abu Bakr bin Muhammad dari 'Amrah dari 'Aisyah dia berkata; \"Rasulullah shallallahu 'alaihi wasallam membaca (Al Qur'an dalam shalat) sambil duduk, dan bila hendak ruku' maka beliau berdiri seukuran membaca empat puluh ayat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "53",
    "matchingArabicURN": "1116580",
    "last_updated": null
  },
  {
    "indonesianURN": "3216330",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "855",
    "babName": "Bagaimana yang dilakukan jika membuka shalat dengan berdiri dan perselisihan para pengutip",
    "hadithNumber": "1633",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin 'Ali dari 'Abdul A'la dia berkata; telah menceritakan kepada kami Hisyam dari Al Hasan dari Sa'ad bin Hisyam bin 'Amir dia berkata; \"Aku datang ke Madinah lalu aku menemui Aisyah Radliallahu? nha, kemudian ia berkata; 'Siapa kamu? ' Aku menjawab; 'Sa'ad bin Hisyam bin Amir'. ia lalu berkata; 'Semoga Allah memberikan rahmat kepada ayahmu! ' Aku berkata lagi, 'Kabarkanlah kepadaku tentang cara shalat Rasulullah shallallahu 'alaihi wasallam? ' la menjawab; `Rasulullah shallallahu 'alaihi wasallam dulu begini dan begitu'. Aku berkata; \"Tentu'. Aisyah berkata; 'Rasulullah shallallahu 'alaihi wasallam shalat Isya' pada malam hari, kemudian kembali ke tempat tidurnya, lalu tidur. Pada tengah malam beliau bangun untuk hajatnya dan bersuci, lalu berwudlu dan masuk ke masjid, kemudian shalat delapan rakaat. Terbayang olehku bahwa beliau menyamakan (lama) bacaannya dan ruku' serta sujudnya. Setelah itu shalat witir satu rakaat, kemudian shalat dua rakaat sambil duduk. Kemudian beliau berbaring miring. Kadangkala Bilal datang dan mengumandangkan adzan untuk shalat sebelum beliau tidur atau sedang tidur. Mungkin juga aku ragu apakah beliau sudah tidur atau belum tidur! hingga Bilal mengumandangkan adzan untuk shalat. Begitulah cara Rasulullah shallallahu 'alaihi wasallam shalat hingga beliau tua dan bertambah gemuk.' Aisyah menceritakan daging (gemuk) nya Rasulullah shallallahu 'alaihi wasallam masya Allah. dia berkata; 'Rasulullah shallallahu 'alaihi wasallam shalat Isya' bersama para sahabat kemudian kembali ke tempat tidurnya. Pada tengah malam beliau bangun ke tempat bersucinya dan hajatnya, lalu berwudhu, kemudian masuk ke masjid lalu shalat enam rakaat. Terbayang olehku bahwa beliau menyamakan bacaannya, ruku'nya, serta sujudnya. Beliau juga shalat witir satu rakaat. Kemudian shalat dua rakaat sambil duduk, lalu berbaring miring. Kadangkala Bilal datang lalu mengumandangkan adzan untuk shalat sebelum beliau tidur atau sedang tidur. Aku juga ragu apakah beliau sudah tidur? Hingga Bilal mengumandangkan adzan untuk shalat.' Aisyah berkata; 'Maka senantiasa seperti itulah cara shalat Rasulullah shallallahu 'alaihi wasallam.'</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "54",
    "matchingArabicURN": "1116590",
    "last_updated": null
  },
  {
    "indonesianURN": "3216340",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "856",
    "babName": "Shalat dengan duduk pada shalat sunnah dan perselisihan pada Abu Ishaq",
    "hadithNumber": "1634",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin 'Ali tentang hadits Abu 'Ashim, dia berkata; telah menceritakan kepada kami 'Umar bin Abu Zaidah dia berkata; telah menceritakan kepadaku Abu Ishaq dari Al Aswad dari 'Aisyah dia berkata; \"Rasulullah shallallahu 'alaihi wasallam tetap saja menciumku, padahal beliau sedang puasa, dan Tidaklah beliau meninggal sehingga kebanyakan shalat Rasulullah adalah sambil duduk.\" -Kemudian ia menyebutkan suatu kalimat yang maknanya adalah-: kecuali shalat wajib (beliau kerjakan sambil berdiri), dan perbuatan yang paling dicintai adalah yang dilakukan secara kontinyu oleh seseorang, walaupun sedikit. Yunus menyelisihi Hadits ini, dia meriwayatkan dari Abu Ishaq dari Al Aswad dari Ummu Salamah.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "55",
    "matchingArabicURN": "1116600",
    "last_updated": null
  },
  {
    "indonesianURN": "3216350",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "856",
    "babName": "Shalat dengan duduk pada shalat sunnah dan perselisihan pada Abu Ishaq",
    "hadithNumber": "1635",
    "hadithText": "Telah mengabarkan kepada kami Sulaiman bin Salim Al Balkhi dia berkata; telah menceritakan kepada kami An Nadlar dia berkata; telah memberitakan kepada kami Yunus dari Abu Ishaq dari Al Aswad dari Ummu Salamah dia berkata; \"Tidaklah Rasulullah shallallahu 'alaihi wasallam wafat hingga kebanyakan shalatnya adalah dilaksanakan sambil duduk, kecuali shalat wajib.\" Syu'bah dan Sufyan menyelisihi Hadits tersebut, mereka berdua berkata; 'Dari Abu Ishaq dari Abu Salamah dari Ummu Salamah.'</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "56",
    "matchingArabicURN": "1116610",
    "last_updated": null
  },
  {
    "indonesianURN": "3216360",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "856",
    "babName": "Shalat dengan duduk pada shalat sunnah dan perselisihan pada Abu Ishaq",
    "hadithNumber": "1636",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud telah menceritakan kepada kami Khalid dari Syu'bah dari Abu Ishaq dia berkata; Aku mendengar Abu Salamah dari Ummu Salamah dia berkata; \"Tidaklah Rasulullah shallallahu 'alaihi wasallam wafat hingga kebanyakan shalatnya adalah sambil duduk, kecuali shalat fardlu. Perbuatan yang paling dicintai adalah yang dilakukan secara kontinyu, walaupun sedikit.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "57",
    "matchingArabicURN": "1116620",
    "last_updated": null
  },
  {
    "indonesianURN": "3216370",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "856",
    "babName": "Shalat dengan duduk pada shalat sunnah dan perselisihan pada Abu Ishaq",
    "hadithNumber": "1637",
    "hadithText": "Telah mengabarkan kepada kami 'Abdullah bin 'Abdush Shamad dia berkata; telah menceritakan kepada kami Yazid dia berkata; telah menceritakan kepada kami Sufyan dari Abu Ishaq dari Abu Salamah dari Ummu Salamah dia berkata; \"Demi Dzat yang jiwaku berada di tangan-Nya, tidaklah Rasulullah shallallahu 'alaihi wasallam wafat hingga shalatnya sering dilakukan sambil duduk, kecuali shalat wajib. Perbuatan yang sangat dicintai beliau adalah yang dilakukan secara kontinyu, walaupun- jumlahnya- sedikit.\" Utsman bin Abu Sulaiman menyelisihinya, dia meriwayatkan dari Abu Salamah, dari Aisyah.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "58",
    "matchingArabicURN": "1116630",
    "last_updated": null
  },
  {
    "indonesianURN": "3216380",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "856",
    "babName": "Shalat dengan duduk pada shalat sunnah dan perselisihan pada Abu Ishaq",
    "hadithNumber": "1638",
    "hadithText": "Telah mengabarkan kepada kami Al Hasan bin Muhammad dari Hajjaj dari Ibnu Juraij dia berkata; telah mengabarkan kepadaku 'Utsman bin Abu Sulaiman Abu Salamah mengabarkan kepadanya bahwasanya 'Aisyah mengabarkan kepadanya; Rasulullah shallallahu 'alaihi wasallam tidak wafat hingga sering melakukan shalatnya sambil duduk.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "59",
    "matchingArabicURN": "1116640",
    "last_updated": null
  },
  {
    "indonesianURN": "3216390",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "856",
    "babName": "Shalat dengan duduk pada shalat sunnah dan perselisihan pada Abu Ishaq",
    "hadithNumber": "1639",
    "hadithText": "Telah mengabarkan kepada kami Abul Asy'ats dari Yazid bin Zurai' dia berkata; telah memberitakan kepada kami Al Jurairi dari 'Abdullah bin Syaqiq dia berkata; \"Aku bertanya kepada Aisyah, `Apakah Rasulullah shallallahu 'alaihi wasallam pernah shalat sambil duduk? ' lalu Aisyah menjawab; `Ya, ketika beliau telah lanjut usia'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "60",
    "matchingArabicURN": "1116650",
    "last_updated": null
  },
  {
    "indonesianURN": "3216400",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "856",
    "babName": "Shalat dengan duduk pada shalat sunnah dan perselisihan pada Abu Ishaq",
    "hadithNumber": "1640",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Ibnu Syihab dari As Saib bin Yazid dari Al Muththalib bin Abu Wada'ah dari Hafshah dia berkata; \"Aku tidak pernah melihat Rasulullah shallallahu 'alaihi wasallam shalat sunnah sambil duduk, hingga menjelang setahun sebelum beliau walat, (saat itu) beliau sering shalat sambil duduk, membaca surah Al Qur'an dengan tartil, sampai-sampai beliau memperlama dalam membacanya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "61",
    "matchingArabicURN": "1116660",
    "last_updated": null
  },
  {
    "indonesianURN": "3216410",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "857",
    "babName": "Keutamaan shalat berdiri daripada shalat duudk",
    "hadithNumber": "1641",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id dia berkata; telah menceritakan kepada kami Yahya dari Sufyan dia berkata; telah menceritakan kepada kami Manshur dari Hilal bin Yasaf dari Abu Yahya dari 'Abdullah bin 'Amru dia berkata; \"Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam shalat sambil duduk, maka aku berkata kepada beliau; 'Aku pernah mendapatkan hadits dari engkau, bahwa engkau bersabda: \"Shalat orang sambil duduk (mendapatkan) setengah (pahala) dari shalat yang dilakukan sambil berdiri. Dan engkau shalat sambil duduk.\" Beliau shallallahu 'alaihi wasallam menjawab: `Ya, tetapi aku tidak seperti salah satu dari kalian.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "62",
    "matchingArabicURN": "1116670",
    "last_updated": null
  },
  {
    "indonesianURN": "3216420",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "858",
    "babName": "Keutamaan shalat sambil duduk daripada tidur",
    "hadithNumber": "1642",
    "hadithText": "Telah mengabarkan kepada kami Humaid bin Mas'adah dari Sufyan bin Habib dari Husain Al Mu'allim dari 'Abdullah bin Buraidah dari 'Imran bin Hushain dia berkata; \"Aku pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang orang yang shalat sambil duduk, lalu beliau bersabda: \"Barangsiapa shalat dengan berdiri maka itu lebih utama. Barangsiapa shalat dengan duduk maka baginya setengah pahala dari pahala shalat yang dilakukan dengan berdiri. Barangsiapa shalat dengan tiduran maka baginya setengah pahala dari pahala shalat Yang dilakukan dengan duduk.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "63",
    "matchingArabicURN": "1116680",
    "last_updated": null
  },
  {
    "indonesianURN": "3216430",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "859",
    "babName": "Bagaimana shalat dengan duduk",
    "hadithNumber": "1643",
    "hadithText": "Telah mengabarkan kepada kami Harun bin 'Abdullah dia berkata; telah menceritakan kepada kami Abu Dawud Al Ja'fari dari Hafsh dari Humaid dari 'Abdullah bin Syaqiq dari 'Aisyah dia berkata; 'Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam shalat sambil duduk dengan kaki bersilang di bawah paha (mutarabi').\" Abu Abdurrahman berkata; 'Aku tidak mengetahui seorangpun yang meriwayatkan hadits ini selain Abu Dawud dan ia adalah terpercaya dan aku menganggap hadits salah. Wallahu Ta'ala A'lam.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "64",
    "matchingArabicURN": "1116690",
    "last_updated": null
  },
  {
    "indonesianURN": "3216440",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "860",
    "babName": "Bagaimana bacaan malam",
    "hadithNumber": "1644",
    "hadithText": "Telah mengabarkan kepada kami Syu'aib bin Yusuf dia berkata; telah menceritakan kepada kami 'Abdurrahman dari Mu'awiyah bin Shalih dari 'Abdullah bin Abu Qais dia berkata; \"Aku pernah bertanya kepada Aisyah tentang cara Rasulullah shallallahu 'alaihi wasallam membaca (Al Qur'an) di malam hari, `Beliau membacanya dengan bersuara keras atau pelan (tanpa bersuara)? ' Aisyah menjawab; 'Semuanya pernah dilakukan beliau. Kadang beliau membacanya dengan suara keras dan kadang membacanya dengan pelan (tanpa bersuara) '.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "65",
    "matchingArabicURN": "1116700",
    "last_updated": null
  },
  {
    "indonesianURN": "3216450",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "861",
    "babName": "Keutamaan membaca dengan lirih daripada dengan nyaring",
    "hadithNumber": "1645",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Muhammad bin Bakkar bin Bilal dia berkata; telah menceritakan kepada kami Muhammad bin Sumai' dia berkata; telah menceritakan kepada kami Zaid bin Waqid dari Katsir bin Murrah bahwasanya 'Uqbah bin 'Amir menceritakan kepada mereka; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang membaca Al Qur'an dengan mengeraskan suaranya seperti orang yang menampakkan sedekah, dan orang yang memelankan suaranya dalam membaca Al Qur 'an seperti orang yang menyembunyikan sedekahnya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "66",
    "matchingArabicURN": "1116710",
    "last_updated": null
  },
  {
    "indonesianURN": "3216460",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "862",
    "babName": "Menyamakan antara berdiri, ruku', berdiri setelah ruku', sujud dan duduk",
    "hadithNumber": "1646",
    "hadithText": "Telah mengabarkan kepada kami Al Husain bin Manshur dia berkata; telah menceritakan kepada kami 'Abdullah bin Numair dia berkata; telah menceritakan kepada kami Al A'masy dari Sa'd bin 'Ubaidah dari Al Mustaurid bin Al Ahnaf dari Shilah bin Zufar dari Hudzaifah dia berkata; \"Aku pernah shalat dengan Rasulullah shallallahu 'alaihi wasallam pada suatu malam, beliau memulainya dengan membaca surah Al Baqarah. Lalu aku berkata dalam hatiku; -Mungkin- beliau akan ruku' pada ayat ke seratus. Namun beliau malah meneruskannya'. Aku berkata dalam hatiku, '-Mungkin- beliau akan ruku' saat dua ratus ayat, namun beliau malah meneruskannya'. Aku berkata dalam hatiku, 'Beliau shalat dengan surat Al Baqarah dalam satu rakaat. Kemudian beliau meneruskan (shalatnya), dan memulainya dengan membaca surah An Nisaa'. Beliau membacanya (hingga selesai), kemudian memulai lagi dengan surah Ali 'Imraan, dan beliau membacanya (hingga selesai) dengan perlahan-perlahan. Jika beliau menjumpai ayat tasbih maka beliau bertasbih (memuji Allah), jika beliau menjumpai ayat yang menganjurkan untuk meminta maka beliau pun meminta (kepada Allah), dan jika beliau menjumpai ayat yang berkenaan dengan memohon perlindungan maka beliau memohon perlindungan. Kemudian beliau ruku dengan membaca subhana rabbiyal 'azhimi (Maha Suci Tuhanku yang Maha Agung), yang (karenanya) ruku beliau sama dengan (lamanya) berdiri. Kemudian beliau mengangkat kepalanya, lalu mengucapkan Sami'allahu liman Hamidah (Allah Maha Mendengar orang yang memuji-Nya). Dan (lamanya) berdiri beliau sama dengan (lamanya) beliau ruku'. Kemudian beliau sujud dengan membaca subhana rabbiyal a'laa (Maha Suci Tuhanku Yang Maha Tinggi). Sujud beliau sama dengan (lamanya) ruku' beliau.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "67",
    "matchingArabicURN": "1116720",
    "last_updated": null
  },
  {
    "indonesianURN": "3216470",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "862",
    "babName": "Menyamakan antara berdiri, ruku', berdiri setelah ruku', sujud dan duduk",
    "hadithNumber": "1647",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; telah memberitakan kepada kami An Nadlar bin Muhammad Al Marwazi -seorang yang tsiqah- dia berkata; telah menceritakan kepada kami Al 'Ala bin Al Musayyab dari 'Amru bin Murrah dari Thalhah bin Yazid Al Anshari dari Hudzaifah bahwa ia pernah shalat dengan Rasulullah shallallahu 'alaihi wasallam di bulan Ramadlan, beliau ruku' dengan membaca subhana rabbiyal 'azhimi (Maha Suci Tuhanku Yang Maha Agung), yang (lamanya) ruku' beliau sama dengan (lamanya) berdiri beliau. Kemudian beliau duduk dan membaca rabbighfirli, rabighfirli (Ya Tuhanku, ampunilah aku. Ya Tuhanku, ampunilah aku), yang (lamanya) duduk beliau sama dengan (lamanya) berdiri. Kemudian beliau sujud dan membaca subhana rabbiyal a'laa (Maha Suci Tuhanku Yang Maha Tinggi), yang (lamanya) sujud beliau sama dengan (lamanya) berdiri. Tidaklah beliau shalat kecuali hanya empat rakaat, hingga Bilal datang untuk shalat Subuh.\" Abu Abdurrahman berkata; 'Menurutku Hadist ini mursal, aku tidak mengetahui bahwa Thalhah bin Yazid telah mendengar dari Hudzaifah. Karena telah berkata Al 'Alla bin Musayyab mengenai Hadist ini dari seseorang, dari Hudzaifah.'</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "68",
    "matchingArabicURN": "1116730",
    "last_updated": null
  },
  {
    "indonesianURN": "3216480",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "863",
    "babName": "Bagaimana shalat malam",
    "hadithNumber": "1648",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dia berkata; telah menceritakan kepada kami Muhammad bin Ja'far dan 'Abdurrahman, mereka berkata; telah menceritakan kepada kami Syu'bah dari Ya'la bin 'Atha bahwasanya ia mendengar 'Ali Al Azdi telah mendengar Ibnu 'Umar menceritakan dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Shalat (sunah) malam dan siang hari adalah dua rakaat-dua rakaat. Abu Abdurrahman berkata; 'Menurutku Hadist ini salah. Wallahu Ta'ala? lam.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "69",
    "matchingArabicURN": "1116740",
    "last_updated": null
  },
  {
    "indonesianURN": "3216490",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "863",
    "babName": "Bagaimana shalat malam",
    "hadithNumber": "1649",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Qudamah dia berkata; telah menceritakan kepada kami Jarir dari Manshur dari Habib dari Thawus dia berkata; berkata Ibnu 'Umar; \"Ada seorang laki-laki bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang shalat malam? Lalu beliau bersabda: \"Dua rakaat-dua rakaat. Jika kamu khawatir akan segera datang waktu Subuh maka (cukup) satu rakaat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "70",
    "matchingArabicURN": "1116750",
    "last_updated": null
  },
  {
    "indonesianURN": "3216500",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "863",
    "babName": "Bagaimana shalat malam",
    "hadithNumber": "1650",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin 'Utsman dan Muhammad bin Shadaqah mereka berkata; telah menceritakan kepada kami Muhammad bin Harb dari Az Zubaidi dari Az Zuhri dari Salim dari Bapaknya dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Shalat malam itu dua rakaat-dua rakaat. Jika kamu khawatir akan segera Subuh maka shalat witirlah satu rakaat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "71",
    "matchingArabicURN": "1116760",
    "last_updated": null
  },
  {
    "indonesianURN": "3216510",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "863",
    "babName": "Bagaimana shalat malam",
    "hadithNumber": "1651",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur dia berkata; telah menceritakan kepada kami Sufyan dari Ibnu Abu Labid dari Abu Salamah dari Ibnu 'Umar dia berkata; \"Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam saat di atas mimbar ditanya tentang shalat malam? Lalu beliau menjawab: \"Dua rakaat-dua rakaat. Jika kamu khawatir akan segera Subuh maka shalatlah witir satu rakaaat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "72",
    "matchingArabicURN": "1116770",
    "last_updated": null
  },
  {
    "indonesianURN": "3216520",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "863",
    "babName": "Bagaimana shalat malam",
    "hadithNumber": "1652",
    "hadithText": "Telah mengabarkan kepada kami Musa bin Sa'id dia berkata; telah menceritakan kepada kami Ahmad bin 'Abdullah bin Yunus dia berkata; telah menceritakan kepada kami Zuhair dia berkata; telah menceritakan kepada kami Al Hasan bin Al Hurr dia berkata; telah menceritakan kepada kami Nafi' bahwasanya Ibnu 'Umar mengabarkan kepada mereka, seorang lelaki bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang shalat malam? Lalu beliau menjawab: \"Dua rakaat-dua rakaat. Jika salah seorang dari kalian khawatir akan segera Subuh maka shalatlah witir satu rakaat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "73",
    "matchingArabicURN": "1116780",
    "last_updated": null
  },
  {
    "indonesianURN": "3216530",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "863",
    "babName": "Bagaimana shalat malam",
    "hadithNumber": "1653",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Al Laits dari Nafi' dari Ibnu 'Umar beliau bersabda: \"Shalat malam itu dua rakaat-dua rakaat. Jika kamu khawatir akan segera Subuh maka shalatlah witir satu rakaat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "74",
    "matchingArabicURN": "1116790",
    "last_updated": null
  },
  {
    "indonesianURN": "3216540",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "863",
    "babName": "Bagaimana shalat malam",
    "hadithNumber": "1654",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Muhammad bin Al Mughirah dia berkata; telah menceritakan kepada kami 'Utsman dari Syu'aib dari Az Zuhri dari Salim dari Ibnu 'Umar dia berkata; \"Seorang lelaki bertanya kepada Rasulullah shallallahu 'alaihi wasallam, 'Bagaimana cara shalat malam? Lalu beliau menjawab: \"Dua rakaat-dua rakaat. Jika salah seorang dari kalian khawatir akan segera Subuh maka shalatlah witir satu rakaat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "75",
    "matchingArabicURN": "1116800",
    "last_updated": null
  },
  {
    "indonesianURN": "3216550",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "863",
    "babName": "Bagaimana shalat malam",
    "hadithNumber": "1655",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Yahya dia berkata; telah menceritakan kepada kami Ya'qub bin Ibrahim dia berkata; telah menceritakan kepada kami keponakanku Ibnu Syihab dari pamannya dia berkata; telah mengabarkan kepadaku Humaid bin 'Abdurrahman bahwasanya 'Abdullah bin 'Umar mengabarkan kepadanya; \"Seorang lelaki bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang shalat malam? Lalu Rasulullah shallallahu 'alaihi wasallam menjawab: \"Dua rakaat-dua rakaat. Jika karena khawatir akan segera Subuh maka shalatlah witir satu rakaat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "76",
    "matchingArabicURN": "1116810",
    "last_updated": null
  },
  {
    "indonesianURN": "3216560",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "863",
    "babName": "Bagaimana shalat malam",
    "hadithNumber": "1656",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Al Haitsam dia berkata; telah menceritakan kepada kami Harmalah dia berkata; telah menceritakan kepada kami Ibnu Wahb dia berkata; telah mengabarkan kepadaku 'Amru bin Al Harits, Ibnu Syihab menceritakan kepadanya bahwasanya Salim bin 'Abdullah dan Humaid bin 'Abdurrahman menceritakan kepadanya dari 'Abdullah bin 'Umar dia berkata; \"Ada seorang lelaki berdiri lalu bertanya; `Wahai Rasulullah, bagaimanakah cara shalat malam? ' Rasulullah shallallahu 'alaihi wasallam menjawab: 'Dua rakaat-dua rakaat, Jika kamu khawatir akan segera subuh maka shalatlah witir satu raka'at.'</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "77",
    "matchingArabicURN": "1116820",
    "last_updated": null
  },
  {
    "indonesianURN": "3216570",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "864",
    "babName": "Perintah witir",
    "hadithNumber": "1657",
    "hadithText": "Telah mengabarkan kepada kami Hannad bin As Sari dari Abu Bakr bin 'Ayyasy dari Abu Ishaq dari 'Ashim bin Dhamrah dari 'Ali radliallahu 'anhu dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat witir, kemudian bersabda: 'Wahai ahli Al Qur'an! Kerjakanlah shalat witir, karena Allah Azza wa Jalla ganjil (Esa) dan mencintai yang ganjil'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "78",
    "matchingArabicURN": "1116830",
    "last_updated": null
  },
  {
    "indonesianURN": "3216580",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "864",
    "babName": "Perintah witir",
    "hadithNumber": "1658",
    "hadithText": "Telah mengabarkan kepadaku Muhammad bin Isma'il bin Ibrahim dari Abu Nu'aim dari Sufyan dari Abu Ishaq dari 'Ashim bin Dhamrah dari 'Ali radliallahu 'anhu dia berkata; \"Shalat witir tidak harus seperti shalat wajib, tetapi witir adalah sunnah yang disunnahkan oleh Rasulullah shallallahu 'alaihi wasallam.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "79",
    "matchingArabicURN": "1116840",
    "last_updated": null
  },
  {
    "indonesianURN": "3216590",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "865",
    "babName": "Dorongan melakukan witr sebelum tidur",
    "hadithNumber": "1659",
    "hadithText": "Telah mengabarkan kepada kami Sulaiman bin Salim dan Muhammad bin 'Ali bin Al Hasan bin Syaqiq dari An Nadlar bin Syumail dia berkata; telah memberitakan kepada kami Syu'bah dari Abu Syimr dari Abu 'Utsman dari Abu Hurairah dia berkata; \"Kekasihku (Rasulullah) mewasiatkan tiga perkara kepadaku, yaitu shalat witir sebelum tidur, puasa tiga hari di setiap bulan, dan shalat Dluha dua rakaat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "80",
    "matchingArabicURN": "1116850",
    "last_updated": null
  },
  {
    "indonesianURN": "3216600",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "865",
    "babName": "Dorongan melakukan witr sebelum tidur",
    "hadithNumber": "1660",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dia berkata; telah menceritakan kepada kami Muhammad dia berkata; Syu'bah -kemudian dia menyebutkan kalimat yang maknanya- dari 'Abbas Al Jurairi dia berkata; Aku mendengar Abu 'Utsman dari Abu Hurairah dia berkata; \"Kekasihku (Rasulullah) mewasiatkan tiga perkara kepadaku, yaitu shalat witir pada permulaan malam, shalat (sunnah) Fajar dua rakaat, dan puasa tiga hari pada setiap bulan.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "81",
    "matchingArabicURN": "1116860",
    "last_updated": null
  },
  {
    "indonesianURN": "3216610",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "866",
    "babName": "Larangan Nabi Shallallahu'alaihiwasallam perihal dua witr dalam semalam",
    "hadithNumber": "1661",
    "hadithText": "Telah mengabarkan kepada kami Hannad bin As Sari dari Mulazim bin 'Amr dia berkata; telah menceritakan kepadaku 'Abdullah bin Badr dari Qais bin Thalq dia berkata; \"Ayahku Thalq bin Ali mengunjungi kami pada bulan Ramadlan, dan dia bersama kami sampai sore. Pada hari itu dia shalat malam bersama kami, lalu shalat witir bersama kami. Kemudian berangkat ke masjid dan shalat bersama para sahabatnya hingga sisa shalat witir saja. Kemudian dia memerintahkan seseorang untuk maju sambil berkata kepadanya; 'Shalatlah witir bersama mereka, karena aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada dua witir dalam satu malam.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "82",
    "matchingArabicURN": "1116870",
    "last_updated": null
  },
  {
    "indonesianURN": "3216620",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "867",
    "babName": "Waktu witr",
    "hadithNumber": "1662",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dia berkata; telah menceritakan kepada kami Muhammad dia berkata; telah menceritakan kepada kami Syu'bah dari Abu Ishaq dari Al Aswad bin Yazid dia berkata; Aku bertanya kepada 'Aisyah tentang -cara- shalat Rasulullah shallallahu 'alaihi wasallam? Lalu ia menjawab; 'Beliau tidur pada permulaan malam, kemudian bangun. Jika waktu sudah mendekati Subuh maka beliau mengerjakan shalat witir, kemudian kembali ke tempat tidurnya. Bila beliau punya hajat terhadap istrinya maka beliau bersetubuh dengan istrinya, dan jika beliau mendengar adzan maka beliau segera beranjak. Jika beliau dalam keadaan junub, beliau menyiram diri dengan air (mandi) sedangkan jika tidak junub maka beliau hanya berwudlu kemudian keluar untuk shalat'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "83",
    "matchingArabicURN": "1116880",
    "last_updated": null
  },
  {
    "indonesianURN": "3216630",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "867",
    "babName": "Waktu witr",
    "hadithNumber": "1663",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Manshur dia berkata; telah menceritakan kepada kami 'Abdurrahman dari Sufyan dari Abu Hishn dari Yahya bin Watstsab dari Masruq dari 'Aisyah dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat witir pada permulaan malam, akhir, dan pertengahan malam. Beliau selesai shalat witir setelah menjelang Subuh.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "84",
    "matchingArabicURN": "1116890",
    "last_updated": null
  },
  {
    "indonesianURN": "3216640",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "867",
    "babName": "Waktu witr",
    "hadithNumber": "1664",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Al Laits dari Nafi' bahwasanya Ibnu 'Umar berkata; \"Barangsiapa mengerjakan shalat malam, maka jadikanlah di akhir shalatnya dengan shalat witir, karena Rasulullah shallallahu 'alaihi wasallam memerintahkan hal tersebut.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "85",
    "matchingArabicURN": "1116900",
    "last_updated": null
  },
  {
    "indonesianURN": "3216650",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "868",
    "babName": "Perintah witr sebelum subuh",
    "hadithNumber": "1665",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Fadlalah bin Ibrahim dia berkata; telah memberitakan kepada kami Muhammad bin Al Mubarak dia berkata; telah menceritakan kepada kami Mu'awiyah bin Sallam bin Abu Sallam dari Yahya bin Abu Katsir dia berkata; telah mengabarkan kepadaku Abu Nadlrah Al 'Awaqi bahwasanya ia mendengar Abu Sa'id Al Khudri berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah ditanya tentang shalat witir? Lalu beliau menjawab: 'Shalatlah witir sebelum datang Subuh'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "86",
    "matchingArabicURN": "1116910",
    "last_updated": null
  },
  {
    "indonesianURN": "3216660",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "868",
    "babName": "Perintah witr sebelum subuh",
    "hadithNumber": "1666",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Durusta dia berkata; telah menceritakan kepada kami Abu Isma'il Al Qannad dia berkata; telah menceritakan kepada kami Yahya bin Abu Katsir dari Abu Nadlrah dari Abu Sa'id dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Shalatlah witir sebelum Subuh.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "87",
    "matchingArabicURN": "1116920",
    "last_updated": null
  },
  {
    "indonesianURN": "3216670",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "869",
    "babName": "Witr setelah adzan",
    "hadithNumber": "1667",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Hakim dia berkata; telah menceritakan kepada kami Ibnu Abu 'Adi dari Syu'bah dari Ibrahim bin Muhammad bin Al Muntasyir dari Bapaknya bahwa dia pernah berada di masjid Amru bin Syurahbil, lalu dikumandangkanlah adzan untuk shalat, maka mereka pun menunggunya (Abdullah). Kemudian dia datang dan berkatas \"Aku tadi sedang shalat witir.\" la (Muntasyir) berkata; 'Abdullah pun ditanya; 'Apakah ada shalat witir setelah adzan? ' la menjawab; `Ya, ada. Juga setelah iqamah'. Kemudian ia menyampaikan hadits dari Nabi shallallahu 'alaihi wasallam, bahwa beliau pernah tertidur dari shalat (Subuh) hingga matahari terbit, kemudian beliau mengerjakan shalat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "88",
    "matchingArabicURN": "1116930",
    "last_updated": null
  },
  {
    "indonesianURN": "3216680",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "870",
    "babName": "Witir diatas hewan tunggangan",
    "hadithNumber": "1668",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id dia berkata; telah menceritakan kepada kami Yahya bin Sa'id dari 'Ubaidullah bin Al Akhnas dari Nafi' dari Ibnu 'Umar bahwa Nabi shallallahu 'alaihi wasallam melaksanakan witir di atas unta tunggangannya.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "89",
    "matchingArabicURN": "1116940",
    "last_updated": null
  },
  {
    "indonesianURN": "3216690",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "870",
    "babName": "Witir diatas hewan tunggangan",
    "hadithNumber": "1669",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Ya'qub dia berkata; telah mengabarkan kepadaku 'Abdullah bin Muhammad bin 'Ali dia berkata; telah menceritakan kepada kami Zuhair dari Al Hasan bin Al Hurr dari Nafi' bahwasanya Ibnu 'Umar melaksanakan witir di atas untanya, dan dia berkata; Bahwa Nabi shallallahu 'alaihi wasallam pernah melakukan demikian.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "90",
    "matchingArabicURN": "1116950",
    "last_updated": null
  },
  {
    "indonesianURN": "3216700",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "870",
    "babName": "Witir diatas hewan tunggangan",
    "hadithNumber": "1670",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Malik dari Abu Bakr bin 'Umar bin 'Abdurrahman bin 'Abdullah bin 'Umar bin Al Khaththab dari Sa'id bin Yasar dia berkata; Ibnu 'Umar berkata kepadaku; \"Rasulullah shallallahu 'alaihi wasallam pernah melaksanakan witir di atas untanya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "91",
    "matchingArabicURN": "1116960",
    "last_updated": null
  },
  {
    "indonesianURN": "3216710",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "871",
    "babName": "Berapa rakaat shalat witr?",
    "hadithNumber": "1671",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Yahya bin 'Abdullah dia berkata; telah menceritakan kepada kami Wahb bin Jarir dia berkata; telah menceritakan kepada kami Syu'bah dari Abu At Tayyah dari Abu Mijlaz dari Ibnu 'Umar bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Witir itu satu raka? t pada akhir malam.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "92",
    "matchingArabicURN": "1116970",
    "last_updated": null
  },
  {
    "indonesianURN": "3216720",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "871",
    "babName": "Berapa rakaat shalat witr?",
    "hadithNumber": "1672",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dia berkata; telah menceritakan kepada kami Yahya dan Muhammad, mereka berkata; telah menceritakan kepada kami -kemudian dia menyebutkan kalimat yang maknanya- Syu'bah dari Qatadah dari Abu Mijlaz dari Ibnu 'Umar dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Witir itu satu raka? t (yang dilaksanakan) pada akhir malam.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "93",
    "matchingArabicURN": "1116980",
    "last_updated": null
  },
  {
    "indonesianURN": "3216730",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "871",
    "babName": "Berapa rakaat shalat witr?",
    "hadithNumber": "1673",
    "hadithText": "Telah mengabarkan kepada kami Al Hasan bin Muhammad dari 'Affan dia berkata; telah menceritakan kepada kami Hammam dia berkata; telah menceritakan kepada kami Qatadah dari 'Abdullah bin Syaqiq dari Ibnu 'Umar bahwa seorang badui bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang shalat malam? Lalu beliau bersabda: \"Shalat malam itu dua rakaat-dua rakaat, sedangkan shalat witir satu rakaat pada akhir malam.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "94",
    "matchingArabicURN": "1116990",
    "last_updated": null
  },
  {
    "indonesianURN": "3216740",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "872",
    "babName": "Bagaimana berwitir dengan satu rakaat?",
    "hadithNumber": "1674",
    "hadithText": "Telah mengabarkan kepada kami Ar Rabi' bin Sulaiman dia berkata; telah menceritakan kepada kami Hajjaj bin Ibrahim dia berkata; telah menceritakan kepada kami Ibnu Wahb dari 'Amru bin Al Harits dari 'Abdurrahman bin Al Qasim, telah menceritakan kepadanya bapaknya dari 'Abdullah bin 'Umar dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Shalat malam dua rakaat-dua rakaat. jika kamu hendak menyelesaikan maka shalatlah satu rakaat, sebagai witir bagi shalat yang telah kamu kerjakan.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "95",
    "matchingArabicURN": "1117000",
    "last_updated": null
  },
  {
    "indonesianURN": "3216750",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "872",
    "babName": "Bagaimana berwitir dengan satu rakaat?",
    "hadithNumber": "1675",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Khalid bin Ziyad dari Nafi' dari Ibnu 'Umar dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Shalat malam itu dua rakaat-dua rakaat, dan shalat witir itu satu rakaat'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "96",
    "matchingArabicURN": "1117010",
    "last_updated": null
  },
  {
    "indonesianURN": "3216760",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "872",
    "babName": "Bagaimana berwitir dengan satu rakaat?",
    "hadithNumber": "1676",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dan Al Harits bin Miskin secara baca dan aku mendengarnya lafazh ini darinya, dari Ibnul Qasim dia berkata; telah menceritakan kepadaku Malik dari Nafi' dan 'Abdullah bin Dinar dari 'Abdullah bin 'Umar bahwa ada seorang lelaki yang bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang shalat malam? Lalu Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Shalat malam itu dua rakaat-dua rakaat. Jika salah seorang dari kalian khawatir datangnya waktu shalat Subuh maka hendaklah ia shalat satu rakaat, sebagai witir untuk shalat yang telah dikerjakan.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "97",
    "matchingArabicURN": "1117020",
    "last_updated": null
  },
  {
    "indonesianURN": "3216770",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "872",
    "babName": "Bagaimana berwitir dengan satu rakaat?",
    "hadithNumber": "1677",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Fadhalah bin Ibrahim dia berkata; telah menceritakan kepada kami Muhammad bin Al Mubarak dia berkata; telah menceritakan kepada kami Mu'awiyah bin Sallam dari Yahya bin Abu Katsir dia berkata; telah menceritakan kepada kami Abu Salamah bin 'Abdurrahman dan Nafi' dari Ibnu 'Umar dari Rasulullah shallallahu 'alaihi wasallam, bahwa ia (Ibnu Umar) mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Shalat malam itu dua rakaat-dua rakaat. Jika kalian khawatir dengan datangnya waktu shalat Subuh, maka shalatlah witir satu rakaat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "98",
    "matchingArabicURN": "1117030",
    "last_updated": null
  },
  {
    "indonesianURN": "3216780",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "872",
    "babName": "Bagaimana berwitir dengan satu rakaat?",
    "hadithNumber": "1678",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Manshur dia berkata; telah memberitakan kepada kami 'Abdurrahman dia berkata; Malik dari Az Zuhri dari 'Urwah dari 'Aisyah Bahwa Nabi shallallahu 'alaihi wasallam shalat malam sebelas rakaat, dengan shalat witir satu rakaat. kemudian berbaring miring ke sebelah kanan.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "99",
    "matchingArabicURN": "1117040",
    "last_updated": null
  },
  {
    "indonesianURN": "3216790",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "873",
    "babName": "Bagaimana berwitir dengan tiga ?",
    "hadithNumber": "1679",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dan Al Harits bin Miskin secara baca dan aku mendengarnya, lafazh ini darinya dari Ibnul Qasim dia berkata; telah menceritakan kepadaku Malik dari Sa'id bin Abu Sa'id Al Maqburi dari Abu Salamah bin 'Abdurrahman dia mengabarkan kepadanya bahwa dia pernah bertanya kepada Aisyah tentang cara shalat Rasulullah shallallahu 'alaihi wasallam pada bulan Ramadhan? Lalu Aisyah menjawab; \"Rasulullah shallallahu 'alaihi wasallam tidak pernah shalat lebih dari sebelas rakaat, tidak pada bulan Ramadlan dan juga bulan lainnya. Beliau shallallahu 'alaihi wasallam shalat empat rakaat, kamu jangan bertanya tentang baik dan lamanya. Kemudian shalat empat rakaat lagi, juga kamu jangan bertanya tentang baik dan lamanya, lalu Beliau shalat witir tiga rakaat'.\" Aisyah berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, apakah engkau tidur sebelum shalat witir?\" Beliau bersabda: 'Wahai Aisyah, mataku tidur namun hatiku tidak tidur.'</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "100",
    "matchingArabicURN": "1117050",
    "last_updated": null
  },
  {
    "indonesianURN": "3216800",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "873",
    "babName": "Bagaimana berwitir dengan tiga ?",
    "hadithNumber": "1680",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud dia berkata; telah menceritakan kepada kami Bisyr bin Al Mufadldlal dia berkata; telah menceritakan kepada kami Sa'id dari Qatadah dari Zurarah bin Aufa dari Sa'd bin Hisyam bahwasanya 'Aisyah berkata kepadanya; \"Rasulullah Shallallahu'alaihi wa Sallam tidak mengucapkan salam pada rakaat kedua shalat witir.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "101",
    "matchingArabicURN": "1117060",
    "last_updated": null
  },
  {
    "indonesianURN": "3216810",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "874",
    "babName": "Perselisihan lafadz pengutip berita Ubbay bin Ka'b  tentang witir",
    "hadithNumber": "1681",
    "hadithText": "Telah mengabarkan kepada kami 'Ali bin Maimun dia berkata; telah menceritakan kepada kami Makhlad bin Yazid dari Sufyan dari Zubaid dari Sa'id bin 'Abdurrahman bin Abza dari Bapaknya dari Ubay bin Ka'ab bahwa Rasulullah shallallahu 'alaihi wasallam pernah shalat witir tiga rakaat, pada rakaat pertama beliau membaca: \": Sabbihisma rabbikal a'laa (surah Al A'la).\" Pada rakaat kedua membaca: \"Qul ya ayyuhal kafirun (surah Al Kaafiruun), \" dan pada rakaat ketiga beliau membaca \"Qul huwallahu ahad (surah Al Ikhlas).\" Lalu beliau qunut sebelum ruku'. Setelah selesai beliau membaca \"Subbhanal Malikil Quddus\" tiga kali. Beliau memanjangkan pada yang terakhir kalinya.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "102",
    "matchingArabicURN": "1117070",
    "last_updated": null
  },
  {
    "indonesianURN": "3216820",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "874",
    "babName": "Perselisihan lafadz pengutip berita Ubbay bin Ka'b  tentang witir",
    "hadithNumber": "1682",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; telah memberitakan kepada kami 'Isa bin Yunus dari Sa'id bin Abu 'Arubah dari Qatadah dari Sa'id bin 'Abdurrahman bin Abza dari Bapaknya dari Ubay bin Ka'b dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pada rakaat pertama dalam shalat witir membaca surah Al A'laa'. Pada rakaat kedua membaca surah Al Kaafiruun', dan pada rakaat ketiga membaca surah Al Ikhlash.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "103",
    "matchingArabicURN": "1117080",
    "last_updated": null
  },
  {
    "indonesianURN": "3216830",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "874",
    "babName": "Perselisihan lafadz pengutip berita Ubbay bin Ka'b  tentang witir",
    "hadithNumber": "1683",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Musa dia berkata; telah memberitakan kepada kami 'Abdul 'Aziz bin Khalid dia berkata; telah menceritakan kepada kami Sa'id bin Abu 'Arubah dari Qatadah dari 'Azrah dari Sa'id bin 'Abdurrahman bin Abza dari Bapaknya dari Ubay bin Ka'ab dia berkata; \"Rasulullah shallallahu 'alaihi wasallam ketika shalat witir membaca surah Al A'Iaa, pada rakaat kedua membaca surah Al Kaafiruun, dan pada rakaat ketiga membaca surah Al Ikhlash. Beliau tidak mengucapkan salam kecuali pada rakaat terakhir. Setelah selesai salam beliau lalu membaca doa: `Subhaanal malikul qudduus' tiga kali.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "104",
    "matchingArabicURN": "1117090",
    "last_updated": null
  },
  {
    "indonesianURN": "3216840",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "875",
    "babName": "Perselisihan Abu Ishaq tentang hadis Sa'id bin Jubair",
    "hadithNumber": "1684",
    "hadithText": "Telah mengabarkan kepada kami Al Husain bin 'Isa dia berkata; telah menceritakan kepada kami Abu Usamah dia berkata; telah menceritakan kepada kami Zakaria bin Abu Zaidah dari Abu Ishaq dari Sa'id bin Jubair dari Ibnu 'Abbas dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat witir tiga rakaat. Pada rakaat pertama beliau membaca surah Al A'laa, pada rakaat kedua membaca surah Al Kaafiruun, dan pada rakaat ketiga beliau membaca Qul Huwallahu ahad.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "105",
    "matchingArabicURN": "1117100",
    "last_updated": null
  },
  {
    "indonesianURN": "3216850",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "875",
    "babName": "Perselisihan Abu Ishaq tentang hadis Sa'id bin Jubair",
    "hadithNumber": "1685",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman dia berkata; telah menceritakan kepada kami Abu Nu'aim dia berkata; telah menceritakan kepada kami Zuhair dari Abu Ishaq dari Sa'id bin Jubair dari Ibnu 'Abbas bahwa dia mengerjakan shalat witir dengan tiga rakaat. Pada rakaat pertama dia membaca surah Al A'laa, pada rakaat kedua membaca surah Al Kaafiruun, dan pada rakaat ketiga beliau membaca Qul Huwallahu ahad.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "106",
    "matchingArabicURN": "1117110",
    "last_updated": null
  },
  {
    "indonesianURN": "3216860",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "876",
    "babName": "Perselisihan Hubaib bin Abi tsabit tentang hadis ibn Abbas",
    "hadithNumber": "1686",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Rafi' dia berkata; telah menceritakan kepada kami Mu'awiyah bin Hisyam dia berkata; telah menceritakan kepada kami Sufyan dari Habib bin Abu Tsabit dari Muhammad bin 'Ali dari Bapaknya dari kakeknya dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bangun malam lalu bersiwak, kemudian shalat dua rakaat. Lalu tidur lagi. Kemudian bangun dan bersiwak, lalu berwudlu, dan shalat dua rakaat hingga enam rakaat, kemudian witir tiga rakaat. Setelah itu shalat dua rakaat lagi.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "107",
    "matchingArabicURN": "1117120",
    "last_updated": null
  },
  {
    "indonesianURN": "3216880",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "876",
    "babName": "Perselisihan Hubaib bin Abi tsabit tentang hadis ibn Abbas",
    "hadithNumber": "1688",
    "hadithText": "Telah mengabarkan kepada kami Harun bin 'Abdullah dia berkata; telah menceritakan kepada kami Yahya bin Adam dia berkata; telah menceritakan kepada kami Abu Bakr An Nahsyali dari Habib bin Abu Tsabit dari Yahya bin Al Jazzar dari Ibnu 'Abbas dia berkata; Bahwa Rasulullah shallallahu 'alaihi wasallam shalat malam delapan rakaat dan shalat witir tiga rakaat. Lalu beliau shalat dua rakaat sebelum shalat Fajar. Amru bin Murrah menyelisihinya, dia meriwayatkan dari Yahya bin Al Jazzar dari Ummu Salamah dari Rasulullah shallallahu 'alaihi wasallam.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "110",
    "matchingArabicURN": "1117150",
    "last_updated": null
  },
  {
    "indonesianURN": "3216890",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "876",
    "babName": "Perselisihan Hubaib bin Abi tsabit tentang hadis ibn Abbas",
    "hadithNumber": "1689",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Harb dia berkata; telah menceritakan kepada kami Abu Mu'awiyah dari Al A'masy dari 'Amru bin Murrah dari Yahya bin Al Jazzar dari Ummu Salamah dia berkata; \"Rasulullah shallallahu 'alaihi wasallam shalat witir tiga belas rakaat. Setelah bertambah tua dan lemah beliau shalat witir sembilan rakaat. Umarah bin Umair menyelisihinya, dia meriwayatkan dari Yahya bin Al Jazzar dari Aisyah.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "111",
    "matchingArabicURN": "1117160",
    "last_updated": null
  },
  {
    "indonesianURN": "3216900",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "876",
    "babName": "Perselisihan Hubaib bin Abi tsabit tentang hadis ibn Abbas",
    "hadithNumber": "1690",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman dia berkata; telah menceritakan kepada kami Husain dari Zaidah dari Sulaiman dari 'Umarah bin 'Umair dari Yahya bin Al Jazzar dari 'Aisyah dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat malam sembilan rakaat, dan setelah usianya bertambah dan kondisinya semakin lemah beliau shalat tujuh rakaat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "112",
    "matchingArabicURN": "1117170",
    "last_updated": null
  },
  {
    "indonesianURN": "3216910",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "877",
    "babName": "Perselisihan Azzuhri tentang hadis Abu Ayyub tentang witr",
    "hadithNumber": "1691",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin 'Utsman dia berkata; telah menceritakan kepada kami Baqiyyah dia berkata; telah menceritakan kepadaku Dlubarah bin Abu As Salil dia berkata; telah menceritakan kepadaku Duwaid bin Nafi' dia berkata; telah mengabarkan kepadaku Ibnu Syihab dia berkata; telah menceritakan kepada kami 'Atha bin Yazid dari Abu Ayyub, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Shalat witir itu benar. Barangsiapa hendak shalat witir, maka ia boleh mengerjakannya tujuh rakaat. Barangsiapa hendak shalat witir, maka ia boleh mengerjakannya lima rakaat. Barangsiapa hendak shalat witir, maka ia boleh mengerjakannya tiga rakaat, dan Barangsiapa hendak shalat witir, maka ia boleh mengerjakannya satu rakaat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "113",
    "matchingArabicURN": "1117180",
    "last_updated": null
  },
  {
    "indonesianURN": "3216920",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "877",
    "babName": "Perselisihan Azzuhri tentang hadis Abu Ayyub tentang witr",
    "hadithNumber": "1692",
    "hadithText": "Telah mengabarkan kepada kami Al 'Abbas bin Al Walid bin Mazid dia berkata; bapakku telah mengabarkan kepadaku, dia berkata; telah menceritakan kepada kami Al Auza'i dia berkata; telah menceritakan kepadaku Az Zuhri dia berkata; telah menceritakan kepada kami 'Atha bin Yazid dari Abu Ayyub, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Shalat witir itu benar. Barangsiapa hendak shalat witir, maka ia boleh mengerjakannya lima rakaat. Barangsiapa hendak shalat witir, maka ia boleh mengerjakannya tiga rakaat, dan barangsiapa hendak shalat witir, maka ia boleh mengerjakannya satu rakaat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "114",
    "matchingArabicURN": "1117190",
    "last_updated": null
  },
  {
    "indonesianURN": "3216930",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "877",
    "babName": "Perselisihan Azzuhri tentang hadis Abu Ayyub tentang witr",
    "hadithNumber": "1693",
    "hadithText": "Telah mengabarkan kepada kami Ar Rabi' bin Sulaiman bin Dawud dia berkata; telah menceritakan kepada kami 'Abdullah bin Yusuf dia berkata; telah menceritakan kepada kami Al Haitsam bin Humaid dia berkata; telah menceritakan kepadaku Abu Mu'aid dari Az Zuhri dia berkata; telah menceritakan kepadaku 'Atha bin Yazid bahwasanya ia mendengar Abu Ayyub Al Anshari berkata; \"Shalat witir itu hak. Barangsiapa suka shalat witir lima rakaat maka hendaklah ia mengerjakannya. Barangsiapa suka shalat witir tiga rakaat, maka hendaklah ia mengerjakannya, dan barangsiapa suka shalat witir satu rakaat, maka hendaklah ia mengerjakanlah.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "115",
    "matchingArabicURN": "1117200",
    "last_updated": null
  },
  {
    "indonesianURN": "3216940",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "877",
    "babName": "Perselisihan Azzuhri tentang hadis Abu Ayyub tentang witr",
    "hadithNumber": "1694",
    "hadithText": "Telah berkata Al Harits bin Miskin secara baca dan aku mendengarnya dari Sufyan dari Az Zuhri dari 'Atha bin Yazid dari Abu Ayyub dia berkata; \"Barangsiapa ingin, hendaklah ia shalat witir tujuh rakaat. Barangsiapa ingin. hendaklah ia shalat witir lima rakaat. Barangsiapa ingin, hendaklah ia shalat witir tiga rakaat. Barangsiapa ingin, hendaklah ia shalat witir satu rakaat, dan barangsiapa ingin hanya sekedar dengan isyarat maka hendaklah ia menggunakan isyarat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "116",
    "matchingArabicURN": "1117210",
    "last_updated": null
  },
  {
    "indonesianURN": "3216950",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "878",
    "babName": "Bagaimana witir dengan lima, dan perselisihan Hakam tentang hadis witir",
    "hadithNumber": "1695",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Jarir dari Manshur dari Al Hakam dari Miqsam dari Ummu Salamah dia berkata; Rasulullah shallallahu 'alaihi wasallam shalat witir dengan lima dan tujuh rakaat beliau tidak memisahkan rakaatnya dengan salam ataupun perkataan.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "117",
    "matchingArabicURN": "1117220",
    "last_updated": null
  },
  {
    "indonesianURN": "3216960",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "878",
    "babName": "Bagaimana witir dengan lima, dan perselisihan Hakam tentang hadis witir",
    "hadithNumber": "1696",
    "hadithText": "Telah mengabarkan kepada kami Al Qasim bin Zakaria bin Dinar dia berkata; telah menceritakan kepada kami 'Ubaidullah dari Israil dari Manshur dari Al Hakam dari Miqsam dari Ibnu 'Abbas dari Ummu Salamah dia berkata; \"Rasulullah shallallahu 'alaihi wasallam shalat witir lima rakaat atau tujuh rakaat tanpa memisahkan diantara rakaat-rakaatnya dengan salam.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "118",
    "matchingArabicURN": "1117230",
    "last_updated": null
  },
  {
    "indonesianURN": "3216970",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "878",
    "babName": "Bagaimana witir dengan lima, dan perselisihan Hakam tentang hadis witir",
    "hadithNumber": "1697",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Isma'il bin Ibrahim dari Yazid dia berkata; telah menceritakan kepada kami Sufyan bin Al Husain dari Al Hakam dari Miqsam dia berkata; \"Shalat witir itu tujuh rakaat, maka jangan kurang dari lima rakaat.\" Lalu aku (Miqsam) menceritakan hal itu kepada Ibrahim, maka ia bertanya; \"Dari siapa ia menyebutkan hal itu?\" Aku menjawab; \"Aku tidak tahu.\" Al Hakam berkata; \"Aku pergi haji dan berjumpa dengan Miqsam, lalu aku bertanya kepadanya, 'Dari siapa kamu menyebutkannya? ' la menjawab. 'Dari orang yang tsiqah (terpercaya), dari Aisyah dan Maimunah'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "119",
    "matchingArabicURN": "1117240",
    "last_updated": null
  },
  {
    "indonesianURN": "3216980",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "878",
    "babName": "Bagaimana witir dengan lima, dan perselisihan Hakam tentang hadis witir",
    "hadithNumber": "1698",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Manshur dia berkata; telah memberitakan kepada kami 'Abdurrahman dari Sufyan dari Hisyam bin 'Urwah dari Bapaknya dari 'Aisyah, bahwa Nabi shallallahu 'alaihi wasallam pernah shalat witir lima rakaat dan beliau tidak duduk (tasyahud) kecuali pada rakaat terakhir.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "120",
    "matchingArabicURN": "1117250",
    "last_updated": null
  },
  {
    "indonesianURN": "3216990",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "879",
    "babName": "Bagaimana witir dengan tujuh",
    "hadithNumber": "1699",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud dia berkata; telah menceritakan kepada kami Khalid dia berkata; telah menceritakan kepada kami Syu'bah dari Qatadah dari Zurarah bin Aufa dari Sa'ad bin Hisyam dari 'Aisyah dia berkata; \"Setelah Rasulullah shallallahu 'alaihi wasallam berusia lanjut dan mulai gemuk, beliau shalat tujuh rakaat tanpa duduk, kecuali pada akhir rakaat. Lalu shalat dua rakaat sambil duduk setelah salam (dari yang tujuh rakaat), sehingga semuanya berjumlah sembilan rakaat. Wahai anakku! Bila Rasulullah shallallahu 'alaihi wasallam mengerjakan suatu shalat, maka beliau suka untuk melakukannya secara kontinyu.\" Hisyam Ad Dastuwai menyelisihinya.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "121",
    "matchingArabicURN": "1117260",
    "last_updated": null
  },
  {
    "indonesianURN": "3217000",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "879",
    "babName": "Bagaimana witir dengan tujuh",
    "hadithNumber": "1700",
    "hadithText": "Telah mengabarkan kepada kami Zakaria bin Yahya dia berkata; telah menceritakan kepada kami Ishaq bin Ibrahim dia berkata; telah menceritakan kepada kami Mu'adz bin Hisyam dia berkata; bapakku telah menceritakan kepadaku dari Qatadah dari Zurarah bin Aufa dari Sa'd bin Hisyam dari 'Aisyah dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat witir sembilan rakaat maka beliau melakukannya tanpa duduk, kecuali pada rakaat kedelapan. Lalu memuji Allah, berdzikir, dan berdoa kepada-Nya. Kemudian beliau bangun lagi tanpa salam (pada rakaat kedelapan tersebut). Kemudian shalat rakaat yang ke sembilan, lalu duduk dan berdzikir kepada Allah Azza wa Jalla. Setelah itu berdoa kemudian mengucapkan salam yang terdengar oleh kami. lalu beliau shalat dua rakaat sambil duduk. Setelah tua dan lemah, beliau shalat witir tujuh rakaat, beliau tidak duduk kecuali pada rakaat yang keenam, lalu beliau bangkit lagi dan tidak mengucapkan salam untuk melaknjutkan rakaat yang ketujuh. Setelah itu beliau salam. Kemudian beliau shalat dua rakaat sambil duduk.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "122",
    "matchingArabicURN": "1117270",
    "last_updated": null
  },
  {
    "indonesianURN": "3217010",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "880",
    "babName": "Bagaimana witr dengan sembilan",
    "hadithNumber": "1701",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Ishaq dari 'Abdah dari Sa'id dari Qatadah dari Zurarah bin Aufa dari Sa'd bin Hisyam bahwasanya 'Aisyah berkata; \"Kami mempersiapkan siwak Rasulullah shallallahu 'alaihi wasallam dan alat bersucinya, lalu Allah Azza wa Jalla membangunkannya sekehendak Dia membangunkan pada malam hari. kemudian beliau bersiwak dan berwudlu, lalu shalat sembilan rakaat tanpa duduk kecuali pada rakaat kedelapan. Setelah itu beliau memuji Allah dan mengucapkan shalawat kepada Nabi shallallahu 'alaihi wasallam, dan berdoa di antara rakaat-rakaat tersebut tanpa salam. Kemudian shalat rakaat yang kesembilan, lalu duduk ia (perawi) menyebutkan suatu kalimat yang semakna dan memuji Allah serta bershalawat kepada Nabi shallallahu 'alaihi wasallam lalu berdoa, kemudian salam yang terdengar oleh kami. Setelah itu beliau shalat lagi dua rakaat sambil duduk.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "123",
    "matchingArabicURN": "1117280",
    "last_updated": null
  },
  {
    "indonesianURN": "3217020",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "880",
    "babName": "Bagaimana witr dengan sembilan",
    "hadithNumber": "1702",
    "hadithText": "Telah mengabarkan kepada kami Zakaria bin Yahya dia berkata; telah menceritakan kepada kami Ishaq dia berkata; telah memberitakan kepada kami 'Abdurrazzaq dia berkata; telah menceritakan kepada kami Ma'mar dari Qatadah dari Zurarah bin Aufa bahwasanya Sa'd bin Hisyam bin 'Amir setelah datang kepada kami mengabarkan, bahwa dia pernah datang kepada Ibnu Abbas lalu bertanya tentang cara shalat witir Rasulullah shallallahu 'alaihi wasallam, maka (Ibnu Abbas) berkata; \"Maukah aku beri tahu penghuni bumi ini yang sangat mengetahui cara shalat witir Rasulullah shallallahu 'alaihi wasallam\"?\" Dia menjawab, \"Siapa?\" Ibnu Abbas berkata, 'Aisyah.\" Lalu kami datang dengan mengucapkan salam kepadanya kemudian masuk dan bertanya; \"Wahai Ummul Mukminin, kabarkanlah kepadaku tentang -cara- shalat witir Rasulullah shallallahu 'alaihi wasallam?\" Aisyah lalu berkata; \"Kami dulu mempersiapkan siwak dan air wudlunya. lalu Allah Azza Wa Jalla membangunkannya sekehendak-Nya pada malam hari. Kemudian beliau shallallahu 'alaihi wasallam bersiwak dan berwudlu, lalu mengerjakan shalat sembilan rakaat tanpa ada duduk kecuali pada rakaat kedelapan. Beliau memuji Allah, berdzikir, dan berdoa kepada-Nya, lalu bangkit tanpa salam. Kemudian shalat rakaat yang kesembilan, lalu duduk dan memuji Allah, berdzikir, serta berdoa kepada-Nya, kemudian mengucapkan salam yang diperdengarkan kepada kami. Setelah itu beliau shalat lagi dua rakaat sambil duduk, sehingga shalatnya berjumlah sebelas rakaat. Setelah Rasulullah shallallahu 'alaihi wasallam mencapai umur senja dan bertambah gemuk. beliau mengerjakan witir tujuh rakaat, lalu shalat dua rakaat sambil duduk setelah salam, sehingga semuanya berjumlah sembilan rakaat. Wahai anakku, bila Rasulullah shallallahu 'alaihi wasallam mengerjakan suatu shalat, maka beliau senang untuk melakukannya secara kontinyu.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "124",
    "matchingArabicURN": "1117290",
    "last_updated": null
  },
  {
    "indonesianURN": "3217030",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "880",
    "babName": "Bagaimana witr dengan sembilan",
    "hadithNumber": "1703",
    "hadithText": "Telah mengabarkan kepada kami Zakaria bin Yahya dia berkata; telah menceritakan kepada kami Ishaq bin Ibrahim dia berkata; telah memberitakan kepada kami 'Abdurrazzaq dia berkata; telah menceritakan kepada kami Ma'mar dari Qatadah dari Al Hasan dia berkata; telah mengabarkan kepadaku Sa'd bin Hisyam dari 'Aisyah, bahwa dia (Sa'ad bin Hisyam) mendengar Aisyah berkata; \"Rasulullah shallallahu 'alaihi wasallam shalat witir sembilan rakaat, kemudian shalat dua rakaat sambil duduk. Setelah beliau lemah, beliau mengerjakan shalat witir tujuh rakaat, kemudian shalat dua rakaat sambil duduk.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "125",
    "matchingArabicURN": "1117300",
    "last_updated": null
  },
  {
    "indonesianURN": "3217040",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "880",
    "babName": "Bagaimana witr dengan sembilan",
    "hadithNumber": "1704",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dia berkata; telah menceritakan kepada kami Hajjaj dia berkata; telah menceritakan kepada kami Hammad dari Qatadah dari Al Hasan dari Sa'd bin Hisyam dari 'Aisyah, bahwa Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat witir sembilan rakaat, lalu shalat dua rakaat sambil duduk.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "126",
    "matchingArabicURN": "1117310",
    "last_updated": null
  },
  {
    "indonesianURN": "3217050",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "880",
    "babName": "Bagaimana witr dengan sembilan",
    "hadithNumber": "1705",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin Al Khalanji dia berkata; telah menceritakan kepada kami Abu Sa'id -budak bani Hasyim- dia berkata; telah menceritakan kepada kami Hushain bin Nafi' dia berkata; telah menceritakan kepada kami Al Hasan dari Sa'ad bin Hisyam bahwa dia pernah datang kepada Aisyah, lalu bertanya kepadanya tentang cara shalat Rasulullah shallallahu 'alaihi wasallam, maka ia (Aisyah) menjawab; \"Beliau shalat delapan rakaat pada malam hari, lalu witir dengan rakaat yang kesembilan, dan shalat lagi dua rakaat sambil duduk.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "127",
    "matchingArabicURN": "1117320",
    "last_updated": null
  },
  {
    "indonesianURN": "3217060",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "880",
    "babName": "Bagaimana witr dengan sembilan",
    "hadithNumber": "1706",
    "hadithText": "Telah mengabarkan kepada kami Hannad bin As Sari dari Abul Ahwash dari Al A'masy aku mengiranya dari Ibrahim dari Al Aswad dari 'Aisyah dia berkata; \"Rasulullah shallallahu 'alaihi wasallam shalat pada malam hari sembilan rakaat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "128",
    "matchingArabicURN": "1117330",
    "last_updated": null
  },
  {
    "indonesianURN": "3217070",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "881",
    "babName": "Bagaimana witr dengan sebelas rakaat",
    "hadithNumber": "1707",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Manshur dia berkata; telah menceritakan kepada kami 'Abdurrahman dia berkata; telah menceritakan kepada kami Malik dari Az Zuhri dari 'Urwah dari 'Aisyah, bahwa Nabi shallallahu 'alaihi wasallam mengerjakan shalat pada malam hari sebelas rakaat dan shalat witir satu rakaat di antara sebelas rakaat tersebut, kemudian berbaring ke sebelah kanan.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "129",
    "matchingArabicURN": "1117340",
    "last_updated": null
  },
  {
    "indonesianURN": "3217080",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "882",
    "babName": "Witr dengan tiga belas rakaat",
    "hadithNumber": "1708",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Harb dia berkata; telah menceritakan kepada kami Abu Mu'awiyah dari Al A'masy dari 'Amr bin Murrah dari Yahya bin Al Jazzar dari Ummu Salamah dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah mengerjakan shalat witir tiga belas rakaat, dan setelah tua dan lemah beliau shalat witir sembilan rakaat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "130",
    "matchingArabicURN": "1117350",
    "last_updated": null
  },
  {
    "indonesianURN": "3217090",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "883",
    "babName": "Bacaan witir",
    "hadithNumber": "1709",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Ya'qub dia berkata; telah menceritakan kepada kami Abu An Nu'man dia berkata; telah menceritakan kepada kami Hammad bin Salamah dari 'Ashim Al Ahwal dari Abu Mijlaz bahwasanya Abu Musa pernah berada di antara Makkah dan Madinah, dia shalat Isya' dua rakaat, kemudian berdiri, lalu shalat satu rakaat sebagai witir dengan membaca seratus ayat dari surah An-Nisaa'. Kemudian dia berkata: \"Aku tidak menyia-nyiakan untuk menapakkan telapak kakiku dimana Rasulullah shallallahu 'alaihi wasallam menapakkan telapak kakinya, dan aku membaca sebagaimana Rasulullah shallallahu 'alaihi wasallam membacanya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "131",
    "matchingArabicURN": "1117360",
    "last_updated": null
  },
  {
    "indonesianURN": "3217100",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "884",
    "babName": "Bacaan lain",
    "hadithNumber": "1710",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Husain bin Ibrahim bin Isykab An Nasa'i dia berkata; telah memberitakan kepada kami Muhammad bin Abu 'Ubaidah dia berkata; bapakku telah menceritakan kepada kami dari Al A'masy dari Thalhah dari Dzarr dari Sa'id bin 'Abdurrahman bin Abza dari bapaknya dari Ubay bin Ka'ab dia berkata; \"Rasulullah shallallahu 'alaihi wasallam membaca surah Al A'laa, surah Al Kaafiruun, dan surah Al lkhlas dalam shalat witir. Jika telah salam maka beliau membaca: 'Subhaanal malikil qudduus' tiga kali'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "132",
    "matchingArabicURN": "1117370",
    "last_updated": null
  },
  {
    "indonesianURN": "3217110",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "884",
    "babName": "Bacaan lain",
    "hadithNumber": "1711",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Musa dia berkata; telah menceritakan kepada kami 'Abdurrahman bin 'Abdullah bin Sa'd dari telah menceritakan kepada kami Abu Ja'far Ar Razi dari Al A'masy dari Zubaid dan Thalhah dari Dzarr dari Sa'id bin 'Abdurrahman bin Abza dari bapaknya dari Ubay bin Ka'b dia berkata; \"Rasulullah shallallahu 'alaihi wasallam shalat witir dengan membaca surah Al A'laa. surah Al Kaafiruun, dan surah Al Ikhlaash.\" Hushain menyelisihi kedua Hadist di atas, dia meriwayatkan dari Abu Dzar dari Abdurrahman bin Abza dari Bapaknya dari Nabi shallallahu 'alaihi wasallam.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "133",
    "matchingArabicURN": "1117380",
    "last_updated": null
  },
  {
    "indonesianURN": "3217120",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "884",
    "babName": "Bacaan lain",
    "hadithNumber": "1712",
    "hadithText": "Telah mengabarkan kepada kami Al Hasan bin Qaza'ah dari Hushain bin Numair dari Hushain bin 'Abdurrahman dari Dzarr dari Ibnu 'Abdurrahman bin Abza dari bapaknya, bahwa Rasulullah shallallahu 'alaihi wasallam membaca surah Al A'laa, surah Al Kaafiruun, dan surah Al Ikhlaash dalam shalat Witir.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "134",
    "matchingArabicURN": "1117390",
    "last_updated": null
  },
  {
    "indonesianURN": "3217130",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "885",
    "babName": "Perselisihan Syu'bah",
    "hadithNumber": "1713",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Yazid dia berkata; telah menceritakan kepada kami Bahz bin Asad dia berkata; telah menceritakan kepada kami Syu'bah dari Salamah dan Zubaid dari Dzarr dari Ibnu 'Abdurrahman bin Abza dari bapaknya, bahwa Rasulullah shallallahu 'alaihi wasallam shalat witir dengan membaca surah Al A'laa, surah Al Kaafiruun, dan surah Al Ikhlas. Jika beliau telah mengucapkan salam, maka beliau membaca doa, \"Subhaanal malikil qudduus\" tiga kali, dan mengeraskan suaranya pada yang ketiga kalinya.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "135",
    "matchingArabicURN": "1117400",
    "last_updated": null
  },
  {
    "indonesianURN": "3217140",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "885",
    "babName": "Perselisihan Syu'bah",
    "hadithNumber": "1714",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdul A'la dia berkata; telah menceritakan kepada kami Khalid dia berkata; telah menceritakan kepada kami Syu'bah dia berkata; telah mengabarkan kepadaku Salamah dan Zubaid dari Dzarr dari Ibnu 'Abdurrahman bin Abza dari 'Abdurrahman bahwa Rasulullah shallallahu 'alaihi wasallam shalat witir dengan membaca surah Al A'laa, surah Al Kaafiruun, dan surah Al Ikhlaash. Jika beliau telah mengucapkan salam maka beliau membaca, \"Subhaanal malikil qudduus\" dan mengeraskan suaranya saat membaca \"Subhaanal malikil qudduus\" yang ketiga kalinya. Manshur telah meriwayatkannya dari Salamah bin Kuhail dan dia tidak menyebutkan Dzar.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "136",
    "matchingArabicURN": "1117410",
    "last_updated": null
  },
  {
    "indonesianURN": "3217150",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "885",
    "babName": "Perselisihan Syu'bah",
    "hadithNumber": "1715",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Qudamah dari Jarir dari Manshur dari Salamah bin Kuhail dari Sa'id bin 'Abdurrahman bin Abza dari bapaknya, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam shalat witir dengan membaca surah AI A'laa, surah Al Kaafiruun, dan surah Al lkhlas. Jika beliau telah mengucapkan salam dan selesai maka beliau membaca: \"Subhaanal malikil qudduus\" tiga kali, dan memanjangkan suaranya pada yang ketiga kalinya. Abdul Malik bin Abu Sulaiman telah meriwayatkannya dari Zubaid, dan dia tidak menyebutkan Dzar.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "137",
    "matchingArabicURN": "1117420",
    "last_updated": null
  },
  {
    "indonesianURN": "3217160",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "885",
    "babName": "Perselisihan Syu'bah",
    "hadithNumber": "1716",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman dia berkata; telah menceritakan kepada kami Muhammad bin 'Ubaid dia berkata; telah menceritakan kepada kami 'Abdul Malik bin Abu Sulaiman dari Zubaid dari Sa'id bin 'Abdurrahman bin Abza dari bapaknya, bahwa Rasulullah shallallahu 'alaihi wasallam shalat witir dengan membaca surah Al A'laa, surah Al Kaafiruun, dan surah Al Ikhlas. Muhammad bin Juhadah telah meriwatkannya dari Zubaid, dan dia tidak menyebutkan Dzar.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "138",
    "matchingArabicURN": "1117430",
    "last_updated": null
  },
  {
    "indonesianURN": "3217170",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "885",
    "babName": "Perselisihan Syu'bah",
    "hadithNumber": "1717",
    "hadithText": "Telah mengabarkan kepada kami 'Imran bin Musa dia berkata; telah menceritakan kepada kami 'Abdul Warits dia berkata; telah menceritakan kepada kami Muhammad bin Juhadah dari Zubaid dari Ibnu Abza dari bapaknya, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam shalat witir dengan membaca surah AI A'laa, surah Al Kaafiruun, dan surah Al Ikhlas. Setelah selesai beliau membaca, 'Subhanaal malikil quddus' tiga kali.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "139",
    "matchingArabicURN": "1117440",
    "last_updated": null
  },
  {
    "indonesianURN": "3217190",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "886",
    "babName": "Perselisihan Malik bin Mighwal+I1127",
    "hadithNumber": "1719",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Ash Shabbah dia berkata; telah menceritakan kepada kami Al Hasan bin Habib dia berkata; telah menceritakan kepada kami Rauh bin Al Qasim dari 'Atha bin As Saib dari Sa'id bin 'Abdurrahman bin Abza dari bapaknya bahwa Rasulullah shallallahu 'alaihi wasallam dalam shalat witir membaca surah Al A'laa, surah Al Kaafiruun, dan surah Al Ikhlaash.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "142",
    "matchingArabicURN": "1117470",
    "last_updated": null
  },
  {
    "indonesianURN": "3217200",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "887",
    "babName": "Perselisihan  Syu'bah dari Qatadah dalam hadis ini",
    "hadithNumber": "1720",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dia berkata; telah menceritakan kepada kami Abu Dawud dia berkata; telah menceritakan kepada kami Syu'bah dari Qatadah dia berkata; Aku mendengar 'Azrah menceritakan dari Sa'id bin 'Abdurrahman bin Abza dari bapaknya dia berkata; \"Rasulullah shallallahu 'alaihi wasallam shalat witir dengan membaca surah Al A'laa, surah Al Kaafiruun, dan surah Al Ikhlaash. Setelah selesai beliau membaca, \"Suhhaanal malikil qudduus\" tiga kali.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "143",
    "matchingArabicURN": "1117480",
    "last_updated": null
  },
  {
    "indonesianURN": "3217210",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "887",
    "babName": "Perselisihan  Syu'bah dari Qatadah dalam hadis ini",
    "hadithNumber": "1721",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Manshur dia berkata; telah menceritakan kepada kami Abu Dawud dia berkata; telah menceritakan kepada kami Syu'bah dari Qatadah dari Zurarah dari 'Abdurrahman bin Abza, dari Rasulullah shallallahu 'alaihi wasallam, beliau shalat witir dengan membaca surah AI A'laa, surah Al Kaafiruun dan surah Al Ikhlas. Setelah selesai beliau membaca, \"Subhanal malikil yudduus\" tiga kali, dan beliau memanjangkannya pada yang ketiga.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "144",
    "matchingArabicURN": "1117490",
    "last_updated": null
  },
  {
    "indonesianURN": "3217220",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "887",
    "babName": "Perselisihan  Syu'bah dari Qatadah dalam hadis ini",
    "hadithNumber": "1722",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dia berkata; telah menceritakan kepada kami Muhammad dia berkata; telah menceritakan kepada kami Syu'bah dia berkata; aku mendengar Qatadah menceritakan dari Zurarah dari 'Abdurrahman bin Abza, bahwa Rasulullah shallallahu 'alaihi wasallam shalat witir dengan membaca surah Al A'laa. Syababah menyelisih kedua Hadits diatas, dia meriwayatkan dari Qatadah dari Zurarah bin Aufa dari 'Imran bin Hushain.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "145",
    "matchingArabicURN": "1117500",
    "last_updated": null
  },
  {
    "indonesianURN": "3217230",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "887",
    "babName": "Perselisihan  Syu'bah dari Qatadah dalam hadis ini",
    "hadithNumber": "1723",
    "hadithText": "Telah mengabarkan kepada kami Bisyr bin Khalid dia berkata; telah menceritakan kepada kami Syababah dari Syu'bah dari Qatadah dari Zurarah bin Aufa dari 'Imran bin Hushain bahwasanya Nabi shallallahu 'alaihi wasallam shalat witir dengan Sabbihis Marabbikal A'la, Abu Abdurrahman berkata aku tidak mengetahui seorang pun yang mengikuti Syababah pada hadits ini, Yahya bin Said menyelisihinya.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "146",
    "matchingArabicURN": "1117510",
    "last_updated": null
  },
  {
    "indonesianURN": "3217240",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "887",
    "babName": "Perselisihan  Syu'bah dari Qatadah dalam hadis ini",
    "hadithNumber": "1724",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dia berkata; telah menceritakan kepada kami Yahya bin Sa'id dari Syu'bah dari Qatadah dari Zurarah dari 'Imran bin Hushain dia berkata; \"Ketika Nabi shallallahu 'alaihi wasallam shalat Zhuhur, ada seorang lelaki yang membaca surah Al A'laa. Setelah selesai shalat, Rasulullah shallallahu 'alaihi wasallam bertanya: `Siapa tadi yang membaca surah AI A'laa? ' Seseorang menjawab; `Aku'. Lalu beliau shallallahu 'alaihi wasallam bersabda: 'Aku sudah tahu bahwa sebagian mereka telah menyelisihiku dengan bacaannya'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "147",
    "matchingArabicURN": "1117520",
    "last_updated": null
  },
  {
    "indonesianURN": "3217250",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "888",
    "babName": "Doa ketika witr",
    "hadithNumber": "1725",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Abul Ahwash dari Abu Ishaq dari Buraid dari Abul Haura' dia berkata; Al Hasan berkata; \"Rasulullah shallallahu 'alaihi wasallam mengajarkan kepadaku beberapa kalimat yang harus aku ucapkan dalam shalat witir ketika berdoa, yaitu doa qunut: 'Ya Allah, berilah aku petunjuk sebagaimana orang-orang yang Engkau beri petunjuk. Berilah aku kesehatan sebagaimana orang-orang yang telah Engkau beri kesehatan. Sayangilah aku sebagaimana orang-orang yang Engkau sayangi. Berilah berkah apa yang Engkau berikan kepadaku. Jagalah aku dari kejahatan yang telah Engkau tetapkan..Sesungguhnya Engkaulah yang menetapkan (memberi hukuman), dan tidak ada yang menetapkan kepada-Mu. Sesungguhnya tidak akan hina orang yang Engkau bela. Maha Suci Rabb kami dan Maha Tinggi Engkau'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "148",
    "matchingArabicURN": "1117530",
    "last_updated": null
  },
  {
    "indonesianURN": "3217260",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "888",
    "babName": "Doa ketika witr",
    "hadithNumber": "1726",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dia berkata; telah menceritakan kepada kami Ibnu Wahb dari Yahya bin 'Abdullah bin Salim dari Musa bin 'Uqbah dari 'Abdullah bin 'Ali dari Al Hasan bin 'Ali dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengajarkan kepadaku beberapa kalimat dalam shalat witir ketika berdoa, yaitu: 'Ya Allah, berilah aku petunjuk sebagaimana orang-orang yang Engkau beri petunjuk. Berilah berkah apa yang Engkau berikan kepadaku. Sayangilah aku sebagaimana orang-orang yang Engkau sayangi. Jagalah aku dari kejahatan yang telah Engkau tetapkan.. Sesungguhnya Engkaulah yang menetapkan (memberi hukuman), dan tidak ada yang menetapkan kepada-Mu. Sesungguhnya tidak akan hina orang yang Engkau bela. Maha Suci Rabb kami dan Maha Tinggi Engkau'. Dan shalawat Allah senantiasa tercurah atas Nabi shallallahu 'alaihi wasallam.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "149",
    "matchingArabicURN": "1117540",
    "last_updated": null
  },
  {
    "indonesianURN": "3217270",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "888",
    "babName": "Doa ketika witr",
    "hadithNumber": "1727",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin Al Mubarak dia berkata; telah menceritakan kepada kami Sulaiman bin Harb dan Hisyam bin 'Abdul Malik mereka berkata; telah menceritakan kepada kami Hammad bin Salamah dari Hisyam bin 'Amr Al Fazari dari 'Abdurrahman bin Al Harits bin Hisyam dari 'Ali bin Abu Thalib bahwa Nabi shallallahu 'alaihi wasallam pada akhir shalat witir mengucapkan: \"Ya Allah, Aku berlindung kepada-Mu dengan keridlaan-Mu dari kemurkaan-Mu, dengan maaf-Mu dari siksa-Mu, dan aku berlindung dengan-Mu dari-Mu. Aku tidak bisa menghitung pujian kepada-Mu sebagaimana Engkau telah memuji diri-Mu sendiri.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "150",
    "matchingArabicURN": "1117550",
    "last_updated": null
  },
  {
    "indonesianURN": "3217280",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "889",
    "babName": "Tidak mengangkat kedua tangan ketika witir",
    "hadithNumber": "1728",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dia berkata; telah menceritakan kepada kami 'Abdurrahman dari Syu'bah dari Tsabit Al Banani dari Anas dia berkata; \"Rasulullah shallallahu 'alaihi wasallam tidak mengangkat kedua tangannya sedikitpun dalam berdoa, kecuali ketika Shalat Istiqa'.\" Syu'bah berkata; \"Aku berkata kepada Tsabit, 'Apakah engkau mendengarnya dari Anas\" la menjawab, `Subhanallah'. Aku ulangi lagi, `Engkau mendengar darinya? ' la menjawab, 'Subhanallah'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "151",
    "matchingArabicURN": "1117560",
    "last_updated": null
  },
  {
    "indonesianURN": "3217290",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "890",
    "babName": "Lama sujud setelah witr",
    "hadithNumber": "1729",
    "hadithText": "Telah mengabarkan kepada kami Yusuf bin Sa'id dia berkata; telah menceritakan kepada kami Hajjaj dia berkata; telah menceritakan kepada kami Laits dia berkata; telah menceritakan kepadaku 'Uqail dari Ibnu Syihab dari 'Urwah dari 'Aisyah dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat sebelas rakaat antara selesai shalat Isya' sampai dengan waktu shalat Fajar, selain dua rakaar sebelum fajar. Beliau juga shalat witir satu rakaat, dan sujud yang lamanya seukuran dengan salah seorang dari kalian membaca lima puluh ayat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "152",
    "matchingArabicURN": "1117570",
    "last_updated": null
  },
  {
    "indonesianURN": "3217300",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "891",
    "babName": "Tasbih setelah selesai witr perselisihan Sofyan",
    "hadithNumber": "1730",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Harb dia berkata; telah menceritakan kepada kami Qasim dari Sufyan dari Zubaid dari Sa'id bin 'Abdurrahman bin Abza dari bapaknya dari Nabi shallallahu 'alaihi wasallam, bahwa beliau mengerjakan shalat witir dengan membaca surah Al A'laa, surah AI Kaafiruun dan surah AI lkhlas. Setelah salam beliau membaca: \"Subhanal malikil qudduus\" tiga kali dengan suara yang keras.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "153",
    "matchingArabicURN": "1117580",
    "last_updated": null
  },
  {
    "indonesianURN": "3217310",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "891",
    "babName": "Tasbih setelah selesai witr perselisihan Sofyan",
    "hadithNumber": "1731",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Yahya dia berkata; telah menceritakan kepada kami Muhammad bin 'Ubaid dari Sufyan Ats Tsauri dan 'Abdul Malik bin Abu Sulaiman dari Zubaid dari Sa'id bin 'Abdurrahman bin Abza dari bapaknya dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah shalat witir dengan membaca surah Al A'laa, surah Al Kaafiruun, dan surah Al Ikhlas. Setelah selesai salam beliau membaca: `Subhanal Malikil qudduus\" tiga kali dengan mengeraskan suaranya.\" Abu Nu'aim menyelisihi kedua Hadist di atas, dia meriwayatkan dari Sufyan dari Zubaid dari Dzar dari Sa'id</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "154",
    "matchingArabicURN": "1117590",
    "last_updated": null
  },
  {
    "indonesianURN": "3217320",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "891",
    "babName": "Tasbih setelah selesai witr perselisihan Sofyan",
    "hadithNumber": "1732",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Isma'il bin Ibrahim dari Abu Nu'aim dari Sufyan dari Zubaid dari Dzarr dari Sa'id bin 'Abdurrahman bin Abza dari bapaknya dia berkata; \"Rasulullah shallallahu 'alaihi wasallam shalat witir dengan membaca surah Al A'laa, surah Al Kaafiruun, dan surah Al Ikhlas. Apabila beliau hendak beranjak maka beliau membaca: 'Subhaanal Malikil Quddus' tiga kali dengan mengeraskan suaranya. Abu Abdurrahman berkata; 'Menurut kami Abu Nu? im lebih tsiqah dari pada Muhammad bin Ubaid dan Qasim bin Yazid. sedangkan sahabat-sahabat Sufyan yang menurut kami lebih kuat mengenai Hadits ini adalah, Yahya bin Sa'id Al Qattan, Abdullah bin Al Mubaarak, Waki'bin Al Jarrah, Abdurrahman bin Mahdi, Abu Nu'aim, kemudian Al Aswad Wallahu A'lam. Dan telah meriwayatkan pula Jarir bin Hazim dari Zubaid dia berkata; 'Beliau memanjangkan dan mengeraskan suaranya pada yang ketiga kali.'</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "155",
    "matchingArabicURN": "1117600",
    "last_updated": null
  },
  {
    "indonesianURN": "3217330",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "891",
    "babName": "Tasbih setelah selesai witr perselisihan Sofyan",
    "hadithNumber": "1733",
    "hadithText": "Telah mengabarkan kepada kami Harami bin Yunus bin Muhammad dia berkata; bapakku telah menceritakan kepada kami, dia berkata; telah menceritakan kepada kami Jarir dia berkata; aku mendengar Zubaid menceritakan dari Dzarr dari Sa'id bin 'Abdurrahman bin Abza dari bapaknya dia berkata; \"Rasulullah shallallahu 'alaihi wasallam shalat witir dengan membaca surah Al A'laa, surah Al Kaafiruun, dan surah Al lkhlas. Setelah salam beliau membaca: `Subhanal malikil qudduus\" tiga kali, dan pada yang ketiga kalinya beliau memanjangkan dan mengeraskan suaranya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "156",
    "matchingArabicURN": "1117610",
    "last_updated": null
  },
  {
    "indonesianURN": "3217350",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "892",
    "babName": "Dibolehkan shalat antara witir dan dua rakaat fajar",
    "hadithNumber": "1735",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Fadhalah bin Ibrahim dia berkata; telah menceritakan kepada kami Muhammad bin Al Mubarak Ash Shuri dia berkata; telah menceritakan kepada kami Mu'awiyah bin Sallam dari Yahya bin Abu Katsir dia berkata; telah mengabarkan kepadaku Abu Salamah bin 'Abdurrahman bahwasanya ia bertanya kepada 'Aisyah tentang shalat Rasulullah shallallahu 'alaihi wasallam pada malam hari, lalu Aisyah menjawab; \"Beliau shalat tiga belas rakaat, sembilan rakaat dengan berdiri, termasuk witir di dalamnya, lalu dua rakaat sambil duduk. Bila hendak ruku' maka beliau berdiri, lalu ruku' dan sujud. Hal tersebut dilakukan setelah witir. Jika sudah mendengar adzan Subuh maka beliau berdiri lalu shalat dua rakaat yang ringan.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "159",
    "matchingArabicURN": "1117640",
    "last_updated": null
  },
  {
    "indonesianURN": "3217360",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "893",
    "babName": "Menjaga dua rakaat fajar",
    "hadithNumber": "1736",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dia berkata; telah menceritakan kepada kami 'Utsman bin 'Umar dia berkata; telah menceritakan kepada kami Syu'bah dari Ibrahim bin Muhammad dari bapaknya dari Masruq dari 'Aisyah bahwa Nabi shallallahu 'alaihi wasallam tidak pernah meninggalkan shalat empat rakaat sebelum Zhuhur dan dua rakaat sebelum Fajar. Kebanyakan para pengikut Syu'bah menyelisihi riwayat Hadits ini, mereka tidak menyebutkan Masruq.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "160",
    "matchingArabicURN": "1117650",
    "last_updated": null
  },
  {
    "indonesianURN": "3217370",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "893",
    "babName": "Menjaga dua rakaat fajar",
    "hadithNumber": "1737",
    "hadithText": "Telah mengabarkan kepadaku Ahmad bin 'Abdullah bin Al Hakam dia berkata; telah menceritakan kepada kami Muhammad bin Ja'far dia berkata; telah menceritakan kepada kami Syu'bah dari Ibrahim bin Muhammad ia mendengar bapaknya bercerita, bahwa ia mendengar 'Aisyah berkata; bahwa Nabi shallallahu 'alaihi wasallam tidak pernah meninggalkan shalat empat rakaat sebelum Zhuhur dan dua rakaat sebelum subuh. Abu Abdurrahman berkata; 'Menurut kami Hadits ini lebih shahih. Sedangkan Hadits Utsman bin Umar adalah salah. Wallahu Ta'ala A'lam.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "161",
    "matchingArabicURN": "1117660",
    "last_updated": null
  },
  {
    "indonesianURN": "3217380",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "893",
    "babName": "Menjaga dua rakaat fajar",
    "hadithNumber": "1738",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Ishaq dia berkata; telah menceritakan kepada kami 'Abdah dari Sa'id dari Qatadah dari Zurarah bin Aufa dari Sa'd bin Hisyam dari 'Aisyah dia berkata; dari Nabi shallallahu 'alaihi wasallam, beliau shallallahu 'alaihi wasallam bersabda: \"Shalat Fajar dua rakaat lebih baik daripada dunia dan seisinya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "162",
    "matchingArabicURN": "1117670",
    "last_updated": null
  },
  {
    "indonesianURN": "3217390",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "894",
    "babName": "Waktu dua rakaat fajar",
    "hadithNumber": "1739",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id dia berkata; telah menceritakan kepada kami Al Laits dari Nafi' dari Ibnu 'Umar dari Hafshah dari Rasulullah shallallahu 'alaihi wasallam bahwa apabila adzan shalat Subuh telah dikumandangkan, maka beliau shalat dua rakaat yang ringan, sebelum berdiri untuk shalat Subuh.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "163",
    "matchingArabicURN": "1117680",
    "last_updated": null
  },
  {
    "indonesianURN": "3217400",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "894",
    "babName": "Waktu dua rakaat fajar",
    "hadithNumber": "1740",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur dia berkata; telah menceritakan kepada kami Sufyan dia berkata; telah menceritakan kepada kami 'Amr dari Az Zuhri dari Salim dari Ibnu 'Umar dia berkata; telah mengabarkan kepadaku Hafshah, \"Bahwa apabila Fajar telah meneranginya, maka Nabi shallallahu 'alaihi wasallam shalat dua rakaat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "164",
    "matchingArabicURN": "1117690",
    "last_updated": null
  },
  {
    "indonesianURN": "3217410",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "895",
    "babName": "Tidur setelah dua rakaat fajar ditas  bagian badan sebelah kanan",
    "hadithNumber": "1741",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Manshur dia berkata; telah menceritakan kepada kami 'Ali bin 'Ayyasy dia berkata; telah menceritakan kepada kami Syu'aib dari Az Zuhri dia berkata; telah mengabarkan kepadaku 'Urwah dari 'Aisyah dia berkata; \"Bila muadzin telah diam pada adzan yang pertama untuk shalat Fajar, maka beliau berdiri untuk Shalat dua rakaat yang ringan sebelum shalat Fajar setelah Fajar nampak jelas, kemudian berbaring pada bagian kanannya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "165",
    "matchingArabicURN": "1117700",
    "last_updated": null
  },
  {
    "indonesianURN": "3217420",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "896",
    "babName": "Celaan bagi yang tidak melaksanakan shalat malam",
    "hadithNumber": "1742",
    "hadithText": "Telah mengabarkan kepada kami Suwaid bin Nashr dia berkata; telah menceritakan kepada kami 'Abdullah dari Al Auza'i dari Yahya bin Abu Katsir dari Abu Salamah dari 'Abdullah bin 'Amru dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Janganlah engkau menjadi seperti fulan, ia bangun pada malam hari, namun ia tidak melakukan shalat malam.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "166",
    "matchingArabicURN": "1117710",
    "last_updated": null
  },
  {
    "indonesianURN": "3217430",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "896",
    "babName": "Celaan bagi yang tidak melaksanakan shalat malam",
    "hadithNumber": "1743",
    "hadithText": "Telah mengabarkan kepada kami Al Harits bin Asad dia berkata; telah menceritakan kepada kami Bisyr bin Bakr dia berkata; telah menceritakan kepadaku Al Auza'i dia berkata; telah menceritakan kepadaku Yahya bin Abu Katsir dari 'Umar bin Al Hakam bin Tsauban dia berkata; telah menceritakan kepadaku Abu Salamah bin 'Abdurrahman dari 'Abdullah bin 'Amru dia berkata; 'Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: 'Janganlah kamu seperti si Fulan yang bangun malam, tetapi ia tidak mengerjakan shalat malam', \"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "167",
    "matchingArabicURN": "1117720",
    "last_updated": null
  },
  {
    "indonesianURN": "3217440",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1744",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Ibrahim Al Bashri dia berkata; telah menceritakan kepada kami Khalid bin Al Harits dia berkata; Aku membacakan kepada 'Abdul Hamid bin Ja'far dari Nafi' dari Shafiyyah dari Hafshah dari Nabi shallallahu 'alaihi wasallam, bahwa beliau mengerjakan shalat Fajar dua rakaat yang ringan.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "168",
    "matchingArabicURN": "1117730",
    "last_updated": null
  },
  {
    "indonesianURN": "3217450",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1745",
    "hadithText": "Telah mengabarkan kepada kami Syu'aib bin Sy'aib bin Ishaq dia berkata; telah menceritakan kepada kami 'Abdul Wahhab dia berkata; telah memberitakan kepada kami Syu'aib dia berkata; telah menceritakan kepada kami Al Auza'i dia berkata; telah menceritakan kepadaku Yahya dia berkata; telah menceritakan kepadaku Nafi' dia berkata; telah menceritakan kepadaku Ibnu 'Umar dia berkata; telah menceritakan kepadaku Hafshah, bahwa Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat dua rakaat yang ringan diantara adzan dan iqamah shalat Fajar. Abu Abdurrahman berkata; 'Menurutku kedua Hadits di atas adalah salah, Wallah Ta'la A'lam.'</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "169",
    "matchingArabicURN": "1117740",
    "last_updated": null
  },
  {
    "indonesianURN": "3217460",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1746",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Manshur dia berkata; telah memberitakan kepada kami Yahya dia berkata; telah menceritakan kepada kami Al Auza'i dia berkata; telah menceritakan kepadaku Yahya dari Nafi' dari Ibnu 'Umar dari Hafshah dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat dua rakaat yang ringan diantara adzan dan shalat.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "170",
    "matchingArabicURN": "1117750",
    "last_updated": null
  },
  {
    "indonesianURN": "3217470",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1747",
    "hadithText": "Telah mengabarkan kepada kami Hisyam bin 'Ammar dia berkata; telah menceritakan kepada kami Yahya bin Hamzah dia berkata; telah menceritakan kepada kami Al Auza'i dari Yahya dari Abu Salamah dia berkata; dia dan Nafi' dari Ibnu 'Umar dari Hafshah bahwa Nabi shallallahu 'alaihi wasallam mengerjakan shalat dua rakaat yang ringan diantara adzan dan shalat, yakni shalat Fajar dua rakaat.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "171",
    "matchingArabicURN": "1117760",
    "last_updated": null
  },
  {
    "indonesianURN": "3217480",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1748",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Manshur dia berkata; telah menceritakan kepada kami Mu'adz bin Hisyam dia berkata; bapakku telah menceritakan kepada kami dari Yahya bin Abu Katsir dia berkata; telah menceritakan kepadaku Nafi', Ibnu 'Umar menceritakan kepadanya bahwa Hafshah menceritakan kepadanya, Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat dua rakaat yang ringan diantara adzan dan iqamah shalat Subuh.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "172",
    "matchingArabicURN": "1117770",
    "last_updated": null
  },
  {
    "indonesianURN": "3217490",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1749",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Muhammad dia berkata; telah menceritakan kepada kami Muhammad bin Jahdham, dia berkata; Isma'il telah menceritakan kepada kami dari 'Umar bin Nafi' dari bapaknya dari Ibnu 'Umar dia berkata; Hafshah mengabarkan kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat dua rakaat sebelum Subuh.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "173",
    "matchingArabicURN": "1117780",
    "last_updated": null
  },
  {
    "indonesianURN": "3217500",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1750",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin 'Abdul Hakim dia berkata; telah memberitakan kepada kami Ishaq bin Al Furat dari Yahya bin Ayyub dia berkata; telah menceritakan kepadaku Yahya bin Sa'id dia berkata; telah memberitakan kepada kami Nafi' dari Ibnu 'Umar dari Hafshah bahwa ia mengabarkan kepadanya, apabila Rasulullah shallallahu 'alaihi wasallam (mendengar) seruan untuk shalat Subuh maka beliau sujud dua kali (shalat dua rakaat) sebelum shalat Subuh.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "174",
    "matchingArabicURN": "1117790",
    "last_updated": null
  },
  {
    "indonesianURN": "3217510",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1751",
    "hadithText": "Telah mengabarkan kepada kami 'Abdullah bin Ishaq dari Abu 'Ashim dari Ibnu Juraij dia berkata; telah mengabarkan kepadaku Musa bin 'Uqbah dari Nafi' dari Ibnu 'Umar dari Hafshah Ummul Mu'minin ia mengabarkan kepadanya bahwa apabila muadzin telah diam (selesai adzan) maka beliau shalat dua rakaat yang ringan.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "175",
    "matchingArabicURN": "1117800",
    "last_updated": null
  },
  {
    "indonesianURN": "3217520",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1752",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dia berkata; telah memberitakan kepada kami Ibnul Qasim dari Malik dia berkata; telah menceritakan kepadaku Nafi' dari 'Abdullah bin 'Umar bahwasanya Hafshah Ummul Mu'minin mengabarkan kepadanya bila muadzin telah diam (selesai) dari adzan shalat Subuh dan pagi sudah nampak maka beliau shallallahu 'alaihi wasallam shalat (sunnah) dua rakaat ringan sebelum melaksanakan shalat (Subuh).</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "176",
    "matchingArabicURN": "1117810",
    "last_updated": null
  },
  {
    "indonesianURN": "3217530",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1753",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud dia berkata; telah menceritakan kepada kami Khalid bin Al Harits dia berkata; telah menceritakan kepada kami 'Ubaidullah dari Nafi' dari 'Abdullah dia berkata; telah menceritakan kepadaku saudara perempuanku Hafshah bahwa Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat dua rakaat ringan sebelum Fajar.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "177",
    "matchingArabicURN": "1117820",
    "last_updated": null
  },
  {
    "indonesianURN": "3217540",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1754",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin Yazid dia berkata; bapakku telah menceritakan kepada kami, dia berkata; telah menceritakan kepada kami Juwairiyah bin Asma dari Nafi' dari 'Abdullah bin 'Umar dari Hafshah bahwa Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat dua rakaat ringan jika fajar telah terbit.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "178",
    "matchingArabicURN": "1117830",
    "last_updated": null
  },
  {
    "indonesianURN": "3217550",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1755",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin 'Abdullah bin Al Hakam dia berkata; telah menceritakan kepada kami Muhammad bin Ja'far dia berkata; telah menceritakan kepada kami Syu'bah dari Zaid bin Muhammad dia berkata; aku mendengar Nafi' dari Ibnu 'Umar dari Hafshah bahwa dia berkata; \"Jika telah terbit Fajar maka Rasulullah shallallahu 'alaihi wasallam tidak mengerjakan shalat kecuali dua rakaat ringan.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "179",
    "matchingArabicURN": "1117840",
    "last_updated": null
  },
  {
    "indonesianURN": "3217560",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1756",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id dia berkata; telah menceritakan kepada kami Al Laits dari Nafi' dari Ibnu 'Umar dari Hafshah dari Rasulullah shallallahu 'alaihi wasallam, bahwa jika adzan shalat Subuh telah dikumandangkan maka beliau mengerjakan shalat dua rakaat ringan sebelum berdiri untuk shalat. Dan telah meriwayatkan pula Salim dari Ibnu Umar dari Hafshah.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "180",
    "matchingArabicURN": "1117850",
    "last_updated": null
  },
  {
    "indonesianURN": "3217570",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1757",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; telah memberitakan kepada kami 'Abdurrazzaq dia berkata; telah menceritakan kepada kami Ma'mar dari Az Zuhri dari Salim; Ibnu 'Umar berkata; telah mengabarkan kepadaku Hafshah bahwa Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat dua rakaat sebelum shalat fajar (subuh). Hal itu dilakukan setelah terbit fajar.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "181",
    "matchingArabicURN": "1117860",
    "last_updated": null
  },
  {
    "indonesianURN": "3217580",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1758",
    "hadithText": "Telah mengabarkan kepada kami Al Husain bin 'Isa dia berkata; telah menceritakan kepada kami Sufyan dari 'Amru dari Az Zuhri dari Salim dari bapaknya dia berkata; telah mengabarkan kepadaku Hafshah bahwa bila Fajar telah menerangi maka Rasulullah shallallahu 'alaihi wasallam shalat dua rakaat.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "182",
    "matchingArabicURN": "1117870",
    "last_updated": null
  },
  {
    "indonesianURN": "3217590",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1759",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Khalid dia berkata; telah menceritakan kepada kami Al Walid dari Abu 'Amru dari Yahya dia berkata; telah menceritakan kepadaku Abu Salamah dari 'Aisyah bahwa Rasulullah shallallahu 'alaihi wasallam shalat dua rakaat ringan diantara adzan dan iqamah shalat Fajar.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "183",
    "matchingArabicURN": "1117880",
    "last_updated": null
  },
  {
    "indonesianURN": "3217600",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1760",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud dia berkata; telah menceritakan kepada kami Khalid dia berkata; telah menceritakan kepada kami Hisyam dia berkata; telah menceritakan kepada kami Yahya dari Abu Salamah bahwa dia bertanya kepada Aisyah tentang shalat Rasulullah shallallahu 'alaihi wasallam pada malam hari? Lalu Aisyah menjawab; \"Beliau mengerjakan shalat tiga belas rakaat; beliau shalat delapan rakaat kemudian witir. Lalu shalat dua rakaat sambil duduk. Jika hendak ruku' maka beliau berdiri lalu ruku'. Beliau juga shalat dua rakaat diantara adzan dan iqamah shalat Subuh.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "184",
    "matchingArabicURN": "1117890",
    "last_updated": null
  },
  {
    "indonesianURN": "3217610",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1761",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Nashr dia berkata; telah menceritakan kepada kami 'Amr bin Muhammad dia berkata; telah menceritakan kepada kami 'Atstsam bin 'Ali dia berkata; telah menceritakan kepada kami Al A'masy dari Habib bin Abu Tsabit dari Sa'id bin Jubair dari Ibnu 'Abbas dia berkata; Nabi shallallahu 'alaihi wasallam shalat dua rakaat fajar jika beliau mendengar adzan dan beliau meringankannya. Abu Abdurrahman berkata; 'Ini adalah hadits mungkar.'</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "185",
    "matchingArabicURN": "1117900",
    "last_updated": null
  },
  {
    "indonesianURN": "3217620",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "897",
    "babName": "Waktu dua rakaat fajar dan perselisihan Nafi'",
    "hadithNumber": "1762",
    "hadithText": "Telah mengabarkan kepada kami Suwaid bin Nashr dia berkata; telah menceritakan kepada kami 'Abdullah dia berkata; telah memberitakan kepada kami Yunus dari Az Zuhri dia berkata; telah mengabarkan kepadaku As Saib bin Yazid, bahwa Rasulullah shallallahu 'alaihi wasallam pernah diceritakan perihal Syuraih Al Hadlrami, lalu beliau shallallahu 'alaihi wasallam bersabda; \"Dia tidak berbantalkan Al Qur'an.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "186",
    "matchingArabicURN": "1117910",
    "last_updated": null
  },
  {
    "indonesianURN": "3217630",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "898",
    "babName": "Yang berkebiasaan shalat malam lantas ketiduran",
    "hadithNumber": "1763",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id dari Malik dari Muhammad bin Al Munkadir dari Sa'id bin Jubair dari seseorang yang lapang hatinya, dia mengabarkan kepadanya dari 'Aisyah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang yang biasa shalat malam lalu ia dikalahkan oleh tidurnya melainkan Allah akan menuliskan pahala shalatnya, dan tidurnya merupakan sedekah baginya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "187",
    "matchingArabicURN": "1117920",
    "last_updated": null
  },
  {
    "indonesianURN": "3217660",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "901",
    "babName": "Berapa rakaat orang yang ketiduran waktu malamnya, atau karena sakit ?",
    "hadithNumber": "1766",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id dia berkata; telah menceritakan kepada kami Abu 'Awanah dari Qatadah dari Zurarah dari Sa'ad bin Hisyam dari 'Aisyah bahwa apabila Rasulullah shallallahu 'alaihi wasallam tidak mengerjakan shalat malam karena tertidur atau sakit, maka beliau shallallahu 'alaihi wasallam shalat dua belas rakaat pada siang harinya.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "192",
    "matchingArabicURN": "1117970",
    "last_updated": null
  },
  {
    "indonesianURN": "3217670",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "902",
    "babName": "Orang yang ketiduran dari hizib (bacaan alquran), kapan melunasi?",
    "hadithNumber": "1767",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id dia berkata; telah menceritakan kepada kami Abu Shafwan 'Abdullah bin Sa'id bin 'Abdul Malik bin Marwan dari Yunus dari Ibnu Syihab bahwasanya As Saib bin Yazid dan 'Ubaidullah mengabarkan kepadanya, dari 'Abdurrahman bin 'Abdul Qari berkata; Aku mendengar 'Umar bin Al Khaththab berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa tertidur dari shalat sunnah malam, lalu ia mengqadhanya diantara waktu shalat Fajar dan shalat Zhuhur, maka dituliskan baginya pahala seolah-olah ia mengerjakannya pada malam hari tersebut'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "193",
    "matchingArabicURN": "1117980",
    "last_updated": null
  },
  {
    "indonesianURN": "3217680",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "902",
    "babName": "Orang yang ketiduran dari hizib (bacaan alquran), kapan melunasi?",
    "hadithNumber": "1768",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Rafi' dia berkata; telah menceritakan kepada kami 'Abdurrazzaq dia berkata; telah memberitakan kepada kami Ma'mar dari Az Zuhri dari 'Abdurrahman bin 'Abdul Qari bahwasanya 'Umar bin Al Khaththab berkata; \"Barangsiapa tertidur dari shalat sunnah malam, lalu ia mengqadlanya diantara waktu shalat Fajar dan shalat Zhuhur, maka seolah-olah ia mengerjakannya pada malam hari tersebut'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "194",
    "matchingArabicURN": "1117990",
    "last_updated": null
  },
  {
    "indonesianURN": "3217690",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "902",
    "babName": "Orang yang ketiduran dari hizib (bacaan alquran), kapan melunasi?",
    "hadithNumber": "1769",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id dari Malik dari Dawud bin Al Hushain dari Al A'raj dari 'Abdurrahman bin 'Abdul Qari bahwasanya 'Umar bin Al Khaththab berkata; dia berkata; \"Barangsiapa kehilangan kesempatan pada malam hari, lalu ia mengqadlanya ketika matahari tergelincir sampai shalat Zhuhur, maka ia tidak kehilangannya atau seolah-olah ia mendapatkannya.\" Abdurrahman bin Auf telah meriwayatkannya secara mauquf.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "195",
    "matchingArabicURN": "1118000",
    "last_updated": null
  },
  {
    "indonesianURN": "3217700",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "902",
    "babName": "Orang yang ketiduran dari hizib (bacaan alquran), kapan melunasi?",
    "hadithNumber": "1770",
    "hadithText": "Telah mengabarkan kepada kami Suwaid bin Nashr dia berkata; telah menceritakan kepada kami 'Abdullah dari Syu'bah dari Sa'd bin Ibrahim dari Humaid bin 'Abdurrahman dia berkata; \"Barangsiapa kehilangan kesempatan shalat pada malam hari maka hendaklah ia mengerjakannya sebelum Zhuhur, itu menyamai shalat malam.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "196",
    "matchingArabicURN": "1118010",
    "last_updated": null
  },
  {
    "indonesianURN": "3217710",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "903",
    "babName": "Pahala orang yang shalat dua belas rakaat sehari-semalam",
    "hadithNumber": "1771",
    "hadithText": "Telah mengabarkan kepada kami Al Husain bin Manshur bin Ja'far An Naisaburi dia berkata; telah menceritakan kepada kami Ishaq bin Sulaiman dia berkata; telah menceritakan kepada kami Mughirah bin Ziyad dari 'Atha dari 'Aisyah dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengerjakan shalat dua belas rakaat secara kontinyu pada malam dan siang, maka dia akan masuk surga. Empat rakaat sebelum Zhuhur dan dua rakaat sesudahnya, dua rakaat setelah Maghrib dan dua rakaat setelah Isya, serta dua rakaat sebelum Fajar.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "197",
    "matchingArabicURN": "1118020",
    "last_updated": null
  },
  {
    "indonesianURN": "3217720",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "903",
    "babName": "Pahala orang yang shalat dua belas rakaat sehari-semalam",
    "hadithNumber": "1772",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Yahya dia berkata; telah menceritakan kepada kami Muhammad bin Bisyr dia berkata; telah menceritakan kepada kami Abu Yahya Ishaq bin Sulaiman Ar Razi dari Al Mughirah bin Ziyad dari 'Atha bin Abu Rabah dari 'Aisyah Radliallahu? nha dia berkata; bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengerjakan shalat dua belas rakaat secara kontinyu, maka Allah Azza wa Jalla akan membangunkan rumah untuknya di dalam surga. Empat rakaat sebelum Zhuhur dan dua rakaat sesudah Zhuhur, dua rakaat setelah Maghrib dan dua rakaat setelah Isya, serta dua rakaat sebelum Fajar.'</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "198",
    "matchingArabicURN": "1118030",
    "last_updated": null
  },
  {
    "indonesianURN": "3217730",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "903",
    "babName": "Pahala orang yang shalat dua belas rakaat sehari-semalam",
    "hadithNumber": "1773",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Ma'dah bin 'Isa dia berkata; telah menceritakan kepada kami Al Hasan bin A'yan dia berkata; telah menceritakan kepada kami Ma'qil dari 'Atha dia berkata; Aku diberi kabar bahwasanya Ummu Habibah bintu Abu Sufyan berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Barangsiapa mengerjakan dua belas rakaat pada siang dan malamnya selain shalat wajib, Allah membangunkan baginya sebuah rumah di surga'.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "199",
    "matchingArabicURN": "1118040",
    "last_updated": null
  },
  {
    "indonesianURN": "3217740",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "903",
    "babName": "Pahala orang yang shalat dua belas rakaat sehari-semalam",
    "hadithNumber": "1774",
    "hadithText": "Telah mengabarkan kepadaku Ibrahim bin Al Hasan dia berkata; telah menceritakan kepada kami Hajjaj bin Muhammad dia berkata; Ibnu Juraij berkata; \"Aku berkata kepada Atha', 'Telah sampai kepadaku bahwa engkau shalat dua belas rakaat sebelum shalat Jum'at! Apa yang telah sampai kepadamu? ' Ia menjawab; `Aku diberitahu bahwa Ummu Habibah menceritakan kepada Anbasah bin Abu Sufyan bahwa Nabi shallallahu 'alaihi wasallam pernah bersabda: \"Barangsiapa mengerjakan shalat dua belas rakaat pada siang dan malamnya selain shalat wajib, maka Allah Azza wa Jalla akan membangunkan baginya sebuah rumah di surga.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "200",
    "matchingArabicURN": "1118050",
    "last_updated": null
  },
  {
    "indonesianURN": "3217750",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "903",
    "babName": "Pahala orang yang shalat dua belas rakaat sehari-semalam",
    "hadithNumber": "1775",
    "hadithText": "Telah mengabarkan kepada kami Ayyub bin Muhammad dia berkata; telah memberitakan kepada kami Mu'ammar bin Sulaiman dia berkata; telah menceritakan kepada kami Zaid bin Hibban dari Ibnu Juraij dari 'Atha dari 'Anbasah bin Abu Sufyan dari Ummu Habibah dia berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengerjakan shalat dua belas raka'at maka Allah Azza wa Jalla akan membangunkan untuknya sebuah rumah di surga'.\" Abu Abdurrahman berkata; 'Atha tidak mendengar dari dari 'Anbasah.'</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "201",
    "matchingArabicURN": "1118060",
    "last_updated": null
  },
  {
    "indonesianURN": "3217760",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "903",
    "babName": "Pahala orang yang shalat dua belas rakaat sehari-semalam",
    "hadithNumber": "1776",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Rafi' dia berkata; telah menceritakan kepada kami Zaid bin Hubab dia berkata; telah menceritakan kepadaku Muhammad bin Sa'id Ath Thaifi dia berkata; telah menceritakan kepada kami 'Atha bin Abu Rabah dari Ya'la bin Umayyah dia berkata; \"Aku memasuki Thaif, maka aku menemui 'Ansabah bin Abu Sufyan yang waktu itu dia sedang menghadapi kematian (sakaratul maut). Aku melihatnya lagi kesakitan, Aku berkata kepadanya; 'Engkau berada dalam kebaikan', lalu dia berkata; 'Saudara perempuanku, Ummu Habibah, memberitahukanku bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengerjakan shalat dua belas rakaat pada siang dan malamnya, Allah Azza wa Jalla akan membangunkan baginya sebuah rumah di surga.\" Abu Yunus Al Qusyairi menyelisihinya.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "202",
    "matchingArabicURN": "1118070",
    "last_updated": null
  },
  {
    "indonesianURN": "3217770",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "903",
    "babName": "Pahala orang yang shalat dua belas rakaat sehari-semalam",
    "hadithNumber": "1777",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Hatim bin Nu'aim dia berkata; telah menceritakan kepada kami Hibban dan Muhammad bin Makki mereka berkata; telah memberitakan kepada kami 'Abdullah dari Abu Yunus Al Qusyairi dari Ibnu Abu Rabah dari Syahr bin Hausyab, dia menceritakannya dari Ummu Habibah bintu Abu Sufyan dia berkata; \"Barangsiapa mengerjakan shalat dua belas rakaat dalam sehari, lalu shalat sebelum Zhuhur, Allah akan membangun sebuah rumah untuknya di surga.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "203",
    "matchingArabicURN": "1118080",
    "last_updated": null
  },
  {
    "indonesianURN": "3217780",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "903",
    "babName": "Pahala orang yang shalat dua belas rakaat sehari-semalam",
    "hadithNumber": "1778",
    "hadithText": "Telah mengabarkan kepada kami Ar Rabi' bin Sulaiman dia berkata; telah memberitakan kepada kami Abul Aswad dia berkata; telah menceritakan kepadaku Bakr bin Mudhar dari Ibnu 'Ajlan dari Abu Ishaq Al-Hamdani dari 'Amru bin Aus dari 'Ansabah bin Abu Sufyan dari Ummu Habibah bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Ada dua belas raka'at yang barang siapa mengerjakannya, maka Allah akan membangunkan baginya rumah di surga.\" Yaitu empat raka'at sebelum zhuhur, dua raka'at sesudahnya, dua raka'at sebelum ashar, dua raka'at sesudah maghrib dan dua raka'at sebelum shalat subuh.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "204",
    "matchingArabicURN": "1118090",
    "last_updated": null
  },
  {
    "indonesianURN": "3217790",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "903",
    "babName": "Pahala orang yang shalat dua belas rakaat sehari-semalam",
    "hadithNumber": "1779",
    "hadithText": "Telah mengabarkan kepada kami Abul Azhar Ahmad bin Al Azhar An Naisaburi dia berkata; telah menceritakan kepada kami Yunus bin Muhammad dia berkata; telah menceritakan kepada kami Fulaih dari Suhail bin Abu Shalih dari Abu Ishaq dari Al Musayyab dari 'Anbasah bin Abu Sufyan dari Ummu Habibah dia berkata; \"Ada dua belas raka'at yang barang siapa mengerjakannya, Allah membangunkan baginya rumah di surga.\" Yaitu empat raka'at sebelum zhuhur, dua raka'at sesudahnya, dua raka'at sebelum ashar, dua raka'at sesudah maghrib dan dua raka'at sebelum shalat subuh.\" Abu Abdurrahman berkata; ' Fulaih bin Sulaiman orangnya lemah.'</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "205",
    "matchingArabicURN": "1118100",
    "last_updated": null
  },
  {
    "indonesianURN": "3217800",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "903",
    "babName": "Pahala orang yang shalat dua belas rakaat sehari-semalam",
    "hadithNumber": "1780",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman dia berkata; telah menceritakan kepada kami Abu Nu'aim dia berkata; telah memberitakan kepada kami Zuhair dari Abu Ishaq dari Al Musayyab bin Rafi' dari 'Ansabah -saudara Ummu Habibah- dari Ummu Habibah dia berkata; \"Barang siapa mengerjakan shalat dalam sehari semalam dua belas raka? t selain shalat wajib, maka akan dibangunkan baginya sebuah rumah di surga. Yaitu empat raka'at sebelum zhuhur, dua raka'at sesudahnya, dua raka'at sebelum ashar, dua raka'at sesudah maghrib dan dua raka'at sebelum shalat subuh.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "206",
    "matchingArabicURN": "1118110",
    "last_updated": null
  },
  {
    "indonesianURN": "3217810",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "904",
    "babName": "Perbedaan pada Ismail bin Khalid",
    "hadithNumber": "1781",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Isma'il bin Ibrahim dia berkata; telah menceritakan kepada kami Yazid bin Harun dia berkata; telah memberitakan kepada kami Isma'il dari Al Musayyab bin Rafi' dari 'Ansabah bin Abu Sufyan dari Ummu Habibah dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa mengerjakan shalat dalam sehari semalam dua belas raka? t, maka akan dibangunkan baginya sebuah rumah di surga.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "207",
    "matchingArabicURN": "1118120",
    "last_updated": null
  },
  {
    "indonesianURN": "3217820",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "904",
    "babName": "Perbedaan pada Ismail bin Khalid",
    "hadithNumber": "1782",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman dia berkata; telah menceritakan kepada kami Ya'la dia berkata; telah menceritakan kepada kami Isma'il dari Al Musayyab bin Rafi' dari 'Ansabah bin Abu Sufyan dari Ummu Habibah dia berkata; \"Barang siapa mengerjakan shalat dalam sehari semalam dua belas raka? t selain shalat wajib, akan dibangunkan baginya sebuah rumah di surga.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "208",
    "matchingArabicURN": "1118130",
    "last_updated": null
  },
  {
    "indonesianURN": "3217830",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "904",
    "babName": "Perbedaan pada Ismail bin Khalid",
    "hadithNumber": "1783",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Hatim dia berkata; telah menceritakan kepada kami Muhammad bin Makki dan Hibban mereka berkata; telah menceritakan kepada kami 'Abdullah dari Isma'il dari Al Musayyab bin Rafi' dari Ummu Habibah dia berkata; \"Barang siapa mengerjakan shalat dalam sehari semalam dua belas raka? t selain shalat wajib, Allah Azza wa Jalla membangunkan untuknya sebuah rumah di surga.\" Dalam hadits lain Hushain tidak menyandarkannya kepada Nabi shallallahu 'alaihi wasallam, dan dia menyebutkan Dzakwandi antara Anbasah dan Al Musayyab.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "209",
    "matchingArabicURN": "1118140",
    "last_updated": null
  },
  {
    "indonesianURN": "3217840",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "904",
    "babName": "Perbedaan pada Ismail bin Khalid",
    "hadithNumber": "1784",
    "hadithText": "Telah mengabarkan kepada kami Zakaria bin Yahya dia berkata; telah menceritakan kepada kami Wahb dia berkata; telah menceritakan kepada kami Khalid dari Hushain dari Al Musayyab bin Rafi' dari Abu Shalih Dzakwan dia berkata; Telah menceritakan kepadaku 'Ansabah bin Abu Sufyan bahwasanya Ummu Habibah berkata kepadanya; \"Barang siapa mengerjakan shalat dalam sehari semalam dua belas raka? t selain shalat wajib, akan dibangunkan untuknya sebuah rumah di surga.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "210",
    "matchingArabicURN": "1118150",
    "last_updated": null
  },
  {
    "indonesianURN": "3217850",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "904",
    "babName": "Perbedaan pada Ismail bin Khalid",
    "hadithNumber": "1785",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Habib dia berkata; telah menceritakan kepada kami Hammad dari 'Ashim dari Abu Shalih dari Ummu Habibah dia berkata; \"Barangsiapa mengerjakan shalat dalam sehari dua belas rakaat selain shalat wajib, Allah membangunkannya atau akan dibangunkan untuknya sebuah rumah di surga.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "211",
    "matchingArabicURN": "1118160",
    "last_updated": null
  },
  {
    "indonesianURN": "3217860",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "904",
    "babName": "Perbedaan pada Ismail bin Khalid",
    "hadithNumber": "1786",
    "hadithText": "Telah mengabarkan kepada kami 'Ali bin Al Mutsanna dari Suwaid bin 'Amr dia berkata; telah menceritakan kepadaku Hammad dari 'Ashim dari Abu Shalih dari Ummu Habibah dia berkata; \"Barangsiapa mengerjakan shalat dalam sehari semalam dua belas rakaat, Allah membangunkan untuknya sebuah rumah di surga.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "212",
    "matchingArabicURN": "1118170",
    "last_updated": null
  },
  {
    "indonesianURN": "3217870",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "904",
    "babName": "Perbedaan pada Ismail bin Khalid",
    "hadithNumber": "1787",
    "hadithText": "Telah mengabarkan kepada kami Zakaria bin Yahya dia berkata; telah menceritakan kepada kami Ishaq dia berkata; telah menceritakan kepada kami An Nadhr dia berkata; telah menceritakan kepada kami Hammad bin Salamah dari 'Ashim dari Abu Shalih dari Ummu Habibah dia berkata; \"Barangsiapa mengerjakan shalat dalam sehari dua belas rakaat, akan dibangunkan untuknya sebuah rumah di surga.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "213",
    "matchingArabicURN": "1118180",
    "last_updated": null
  },
  {
    "indonesianURN": "3217880",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "904",
    "babName": "Perbedaan pada Ismail bin Khalid",
    "hadithNumber": "1788",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin Al Mubarak dia berkata; telah menceritakan kepada kami Yahya bin Ishaq dia berkata; telah menceritakan kepada kami Muhammad bin Sulaiman dari Suhail bin Abu Shalih dari bapaknya dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa mengerjakan shalat dalam sehari dua belas rakaat selain shalat fardlu maka Allah akan membangun untuknya sebuah rumah disurga.\" Abu Abdurrahman berkata; Ini salah, Muhammad bin Sulaiman itu lemah ia adalah putra Al Ashbahani dan hadits ini telah diriwayatkan dari beberapa jalan selain jalan ini tanpa lafadz yang telah disebutkan.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "214",
    "matchingArabicURN": "1118190",
    "last_updated": null
  },
  {
    "indonesianURN": "3217890",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "904",
    "babName": "Perbedaan pada Ismail bin Khalid",
    "hadithNumber": "1789",
    "hadithText": "Telah mengabarkan kepadaku Yazid bin Muhammad bin 'Abdush Shamad dia berkata; telah menceritakan kepada kami Hisyam Al 'Aththar dia berkata; telah menceritakan kepadaku Isma'il bin 'Abdullah bin Sama'ah dari Musa bin A'yan dari Abu 'Amru Al Auza'i dari Hassan bin 'Athiyyah dia berkata; \"Ketika ajal Anbasah sudah dekat, ia ditanya, maka ia menjawab; 'Aku pernah mendengar Ummu Habibah -istri Nabi shallallahu 'alaihi wasallam- menceritakan dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Barangsiapa mengerjakan shalat empat rakaat sebelum Zhuhur dan empat rakaat sesudahnya, Allah Azza wa Jalla mengharamkan dagingnya disentuh oleh api neraka\".' Setelah aku mendengarnya maka aku tidak pernah meninggalkannya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "215",
    "matchingArabicURN": "1118200",
    "last_updated": null
  },
  {
    "indonesianURN": "3217900",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "904",
    "babName": "Perbedaan pada Ismail bin Khalid",
    "hadithNumber": "1790",
    "hadithText": "Telah mengabarkan kepada kami Hilal bin Al 'Ala bin Hilal dia berkata; bapakku telah menceritakan kepada kami, dia berkata; telah menceritakan kepada kami 'Ubaidullah dari Zaid bin Abu Unaisah dia berkata; telah menceritakan kepadaku Ayyub -seorang lelaki dari penduduk Syam- dari Al Qasim Ad Dimasyqi dari 'Ansabah bin Abu Sufyan dia berkata; telah mengabarkan kepadaku saudara perempuanku Ummu Habibah -Istri Nabi shallallahu 'alaihi wasallam- bahwa kekasihnya (yakni Abu Al Qasim shallallahu 'alaihi wasallam) mengabarkannya dengan bersabda: \"Tidak ada seorang mukmin pun yang mengerjakan shalat empat rakaat sesudah Zhuhur, yang wajahnya disentuh oleh api neraka selama-lamanya, jika Allah Azza wa Jalla menghendakinya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "216",
    "matchingArabicURN": "1118210",
    "last_updated": null
  },
  {
    "indonesianURN": "3217910",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "904",
    "babName": "Perbedaan pada Ismail bin Khalid",
    "hadithNumber": "1791",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Nashih dia berkata; telah menceritakan kepada kami Marwan bin Muhammad dari Sa'id bin 'Abdul 'Aziz dari Sulaiman bin Musa dari Makhul dari 'Ansabah bin Abu Sufyan dari Ummu Habibah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengerjakan shalat empat rakaat sebelum Zhuhur dan empat rakaat sesudahnya, Allah Azza wa Jalla mengharamkannya masuk ke dalam neraka.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "217",
    "matchingArabicURN": "1118220",
    "last_updated": null
  },
  {
    "indonesianURN": "3217920",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "904",
    "babName": "Perbedaan pada Ismail bin Khalid",
    "hadithNumber": "1792",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Khalid dari Marwan bin Muhammad dia berkata; telah menceritakan kepada kami Sa'id bin 'Abdul 'Aziz dari Sulaiman bin Musa dari Makhul dari 'Ansabah bin Abu Sufyan dari Ummu Habibah, Marwan berkata; - dan dia merasa senang jika dibacakan kepadanya- Dari Ummu Habibah dari Nabi shallallahu 'alaihi wasallam beliau tidak memungkirinya, Ummu Habibah berkata; \"Barangsiapa mengerjakan shalat empat rakaat sebelum Zhuhur dan empat rakaat sesudahnya, Allah wa Jalla mengharamkannya masuk ke dalam neraka.\" Abu Abdurrahman berkata; ' Makhul tidak pernah mendengar dari 'Anbasah sedikitpun.'</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "218",
    "matchingArabicURN": "1118230",
    "last_updated": null
  },
  {
    "indonesianURN": "3217930",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "904",
    "babName": "Perbedaan pada Ismail bin Khalid",
    "hadithNumber": "1793",
    "hadithText": "Telah mengabarkan kepada kami 'Abdullah bin Ishaq dia berkata; telah menceritakan kepada kami Abu 'Ashim dia berkata; telah menceritakan kepada kami Sa'id bin 'Abdul 'Aziz dia berkata; Aku mendengar Sulaiman bin Musa menceritakan dari Muhammad bin Abu Sufyan dia berkata; -tatkala kematian hendak menjemputnya yang waktu itu dia sedang dalam kesakitan- dia berkata; 'Telah menceritakan kepadaku saudariku Ummu Habibah binti Abu Sufyan dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa senantiasa menjaga shalat empat rakaat sebelum zhuhur dan empat rakaat sesudahnya, Allah Ta'ala mengharamkannya masuk ke dalam neraka.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "219",
    "matchingArabicURN": "1118240",
    "last_updated": null
  },
  {
    "indonesianURN": "3217940",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "904",
    "babName": "Perbedaan pada Ismail bin Khalid",
    "hadithNumber": "1794",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin 'Ali dia berkata; telah menceritakan kepada kami Abu Qutaibah dia berkata; telah menceritakan kepada kami Muhammad bin 'Abdullah bin Asy Syu'aisyi dari bapaknya dari 'Ansabah bin Abu Sufyan dari Ummu Habibah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa mengerjakan shalat empat rakaat sebelum Zhuhur dan empat rakaat sesudahnya, maka ia tidak akan disentuh oleh api neraka.\" Abu Abdurrahman berkata; 'Hadits ini salah, yang benar adalah Hadits Marwan dari Hadits Sa'id bin Abdul Aziz.'</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "220",
    "matchingArabicURN": "1118250",
    "last_updated": null
  },
  {
    "indonesianURN": "3216871",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "876",
    "babName": "Perselisihan Hubaib bin Abi tsabit tentang hadis ibn Abbas",
    "hadithNumber": "1687",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman dia berkata; telah menceritakan kepada kami Husain dari Zaidah dari Hushain dari Habib bin Abu Tsabit dari Muhammad bin 'Ali bin 'Abdullah bin 'Abbas dari Bapaknya dari kakeknya, dia berkata; \"Aku di sisi Rasulullah shallallahu 'alaihi wasallam, beliau bangun dan bersiwak, lalu membaca ayat ini (hingga selesai): Sesungguhnya dalam penciptaan langit dan bumi, silih bergantinya malam dan siang terdapat tanda-tanda bagi orang-orang yang berakal'. (Qs. Ali 'Imraan (3): 190) kemudian beliau melaksanakan shalat dua rakaat, kemudian kembali ke tempatnya dan tidur, sampai aku mendengar dengkur beliau. Kemudian beliau bangun, berwudlu, menggosok gigi, lalu shalat dua rakaat kemudian tidur kembali lalu bangun, berwudlu dan shalat dua rakaat dan melakukan witir sebanyak tiga rakaat.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "108",
    "matchingArabicURN": "1117130",
    "last_updated": null
  },
  {
    "indonesianURN": "3216872",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "876",
    "babName": "Perselisihan Hubaib bin Abi tsabit tentang hadis ibn Abbas",
    "hadithNumber": "1687",
    "hadithText": "Telah mengabarkan kepadaku Muhammad bin Jabalah ia berkata, telah menceritakan kepada kami Ma'mar bin Makhlad tsiqah, ia berkata, telah menceritakan kepadaku Ubaidullah bin 'Amru dari Zaid dari Habib bin Abu Tsabit dari Muhammad bin 'Ali dari Ibnu Abbas ia berkata, Rasulullah shallallahu 'alaihi wasallam bangun kemudian melakukan sunnah... Ibnu Abbas memamaparkan hadits.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "109",
    "matchingArabicURN": "1117140",
    "last_updated": null
  },
  {
    "indonesianURN": "3217181",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "886",
    "babName": "Perselisihan Malik bin Mighwal+I1127",
    "hadithNumber": "1718",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Muhammad bin 'Ubaidullah dia berkata; telah menceritakan kepada kami Syu'aib bin Harb dari Malik dari Zubaid dari Ibnu Abza dari bapaknya, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam dalam shalat witir membaca surah Al A'laa, surah Al Kaafiruun, dan surah Al lkhlaash.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "140",
    "matchingArabicURN": "1117450",
    "last_updated": null
  },
  {
    "indonesianURN": "3217182",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "886",
    "babName": "Perselisihan Malik bin Mighwal+I1127",
    "hadithNumber": "1718",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman dia berkata; telah menceritakan kepada kami Yahya bin Adam dia berkata; telah menceritakan kepada kami Malik dari Zubaid dari Dzar dari Ibnu Abza secara mursal. Dan telah meriwayatkan pula Atha bin As Saib dari Sa'id bin Abdurrahman bin Abza dari Bapaknya.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "141",
    "matchingArabicURN": "1117460",
    "last_updated": null
  },
  {
    "indonesianURN": "3217341",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "891",
    "babName": "Tasbih setelah selesai witr perselisihan Sofyan",
    "hadithNumber": "1734",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dia berkata; telah menceritakan kepada kami 'Abdul 'Aziz bin 'Abdush Shamad dia berkata; telah menceritakan kepada kami Sa'id dari Qatadah dari 'Azrah dari Sa'id bin 'Abdurrahman bin Abza dari bapaknya, bahwa Rasulullah shallallahu 'alaihi wasallam shalat witir dengan membaca surah Al A'laa, surah AI Kaafiruun, dan surah Al lkhlas. Setelah selesai beliau membaca, \"Subhanal Malikil Qudduus.\" Hisyam telah memursalkan Hadits ini.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "157",
    "matchingArabicURN": "1117620",
    "last_updated": null
  },
  {
    "indonesianURN": "3217342",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "891",
    "babName": "Tasbih setelah selesai witr perselisihan Sofyan",
    "hadithNumber": "1734",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Ismail bin Ibrahim dari Abu Amir dari Hisyam dari Qatadah dari ? zrah dari Sa'id bin Abdurrahman bin Abza bahwa Nabi shallallahu 'alaihi wasallam shalat witir dan seterusnya sebagaimana Hadits diatas.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "158",
    "matchingArabicURN": "1117630",
    "last_updated": null
  },
  {
    "indonesianURN": "3217641",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "899",
    "babName": "Nama si laki-laki Ridha",
    "hadithNumber": "1764",
    "hadithText": "Telah mengabarkan kepada kami Abu Dawud dia berkata; telah menceritakan kepada kami Muhammad bin Sulaiman dia berkata; telah menceritakan kepada kami Abu Ja'far Ar Razi dari Muhammad bin Al Munkadir dari Sa'id bin Jubair dari Al Aswad bin Yazid dari 'Aisyah dia berkata; bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa biasa mengerjakan shalat malam, lalu ia tertidur (tidak sempat shalat), maka tidurnya tersebut merupakan sedekah yang Allah Azza wa Jalla sedekahkan kepadanya, dan Allah menuliskan pahala baginya.\"</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "188",
    "matchingArabicURN": "1117930",
    "last_updated": null
  },
  {
    "indonesianURN": "3217642",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "899",
    "babName": "Nama si laki-laki Ridha",
    "hadithNumber": "1764",
    "hadithText": "Telah mengabarkan Ahmad bin Nashr dia berkata; telah menceritakan kepada kami Yahya bin Abu Bukair dia berkata; Telah menceritakan kepada kami Abu Ja'far Ar Raazi dari Muhammad bin Al Munkadir dari Sa'id bin Jubair dari Aisyah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda, -kemudian dia menyebutkan Hadits di atas-. Abu Abdurrahman berkata; Abu Ja'far Ar Raazi, orangnya lemah.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "189",
    "matchingArabicURN": "1117940",
    "last_updated": null
  },
  {
    "indonesianURN": "3217651",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "900",
    "babName": "Mendatangi kasur dengan berniyat shalat malam, lantas ketiduran",
    "hadithNumber": "1765",
    "hadithText": "Telah mengabarkan kepada kami Harun bin 'Abdullah dia berkata; telah menceritakan kepada kami Husain bin 'Ali dari Zaidah dari Sulaiman dari Habib bin Abu Tsabit dari 'Abdah bin Abu Lubabah dari Suwaid bin Ghafalah dari Abu Ad Darda' yang sampai kepada Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa yang hendak tidur dan ia berniat untuk shalat malam, lalu ia tertidur hingga datang waktu subuh maka ia mendapat pahala apa yang ia niatkan, dan tidurnya adalah sedekah baginya dari Allah Azza wa Jalla.\" Sufyan menyelisihinya.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "190",
    "matchingArabicURN": "1117950",
    "last_updated": null
  },
  {
    "indonesianURN": "3217652",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "20",
    "bookName": "Qiyamul lail dan shalat sunnah siang hari",
    "babNumber": "900",
    "babName": "Mendatangi kasur dengan berniyat shalat malam, lantas ketiduran",
    "hadithNumber": "1765",
    "hadithText": "Telah mengabarkan kepada kami Suwaid bin Nasr ia berkata; Telah menceritakan kepada kami Abdullah ia berkata; dari Sufyan Attsauri dari Abdah ia berkata, Aku mendengar Suwaid bin Ghaflah dari Abu Dzar dan Abu Darda' secara mauquf.</b>",
    "bookID": "20.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "191",
    "matchingArabicURN": "1117960",
    "last_updated": null
  }
]