[
  {
    "indonesianURN": "3223920",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1110",
    "babName": "Kewajiban zakat",
    "hadithNumber": "2392",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin 'Ammar Al Maushuli dari Al Mu'afa dari Zakariy bin Ishaq Al Makki dia berkata; telah menceritakan kepada kami Yahya bin 'Abdullah bin Shafiy dari Abu Ma'bad dari Ibnu 'Abbas dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada Mu'adz ketika beliau mengutusnya ke Yaman: \"Engkau akan menemui kaum ahli kitab. Jika engkau datang kepada mereka, serulah agar mereka bersaksi bahwa tiada ilah (sesembahan) yang berhak disembah kecuali Allah dan Muhammad adalah utusan Allah. Jika mereka menaati dalam hal itu, beritahukanlah kepada mereka bahwa Allah -Azza wa Jalla- telah mewajibkan atas mereka shalat lima waktu dalam sehari semalam. Jika mereka -artinya: menaatimu- dalam hal itu, beritahukanlah bahwa Allah -Azza wa Jalla- telah mewajibkan atas mereka sedekah yang diambil dari orang-orang kaya di antara mereka, lalu diberikan kepada orang-orang fakir di antara mereka. Jika mereka menaati dalam hal itu, takutlah terhadap doa orang yang dizhalimi.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124440",
    "last_updated": null
  },
  {
    "indonesianURN": "3223930",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1110",
    "babName": "Kewajiban zakat",
    "hadithNumber": "2393",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdul A'la dia berkata; telah menceritakan kepada kami Mu'tamir dia berkata; Aku mendengar Bahz bin Hakim menceritakan dari bapaknya dari kakeknya, dia berkata; Aku berkata; \"Wahai Nabi Allah, tidaklah aku datang menemuimu hingga aku bersumpah lebih dari bilangan mereka (jari-jari tangannya), untuk tidak mendatangimu dan tidak memeluk agamamu. Sungguh, dahulu aku adalah seorang yang tidak mengetahui sedikit pun kecuali apa yang Allah -Azza wa Jalla- dan Rasul-Nya ajarkan kepadaku, dan sungguh aku bertanya kepadamu atas nama wahyu Allah, dengan apa Rabbmu mengutusmu kepada kami?\" Beliau menjawab: 'Dengan Islam.' Aku bertanya; 'Apakah tanda-tanda Islam? ' Beliau bersabda: 'Hendaklah engkau mengucapkan; 'Aku menyerahkan wajahku kepada Allah dan membuang semua bentuk sesembahan selain kepada-Nya', mendirikan shalat dan menunaikan zakat.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124450",
    "last_updated": null
  },
  {
    "indonesianURN": "3223940",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1110",
    "babName": "Kewajiban zakat",
    "hadithNumber": "2394",
    "hadithText": "Telah mengabarkan kepada kami 'Isa bin Musawir dia berkata; telah menceritakan kepada kami Muhammad bin Syu'aib bin Syabur dari Mu'awiyah bin Sallam dari saudaranya Zaid bin Sallam bahwasanya ia telah mengabarkan kepadanya, dari kakeknya Abu Sallam dari 'Abdurrahman bin Ghunam, Abu Malik Al Asy'ari menceritakan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Menyempurnakan wudlu adalah separuh dari iman, kalimat Alhamdulillah mengisi -penuh- timbangan, tasbih dan takbir mengisi -penuh- langit dan bumi, shalat adalah cahaya, zakat adalah bukti, kesabaran adalah cahaya dan Al Qur'an adalah hujjah yang membela atau justeru hujjah yang menuntut dirimu.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124460",
    "last_updated": null
  },
  {
    "indonesianURN": "3223950",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1110",
    "babName": "Kewajiban zakat",
    "hadithNumber": "2395",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin 'Abdul Hakim dari Syu'aib dari Al Laits dia berkata; telah memberitakan kepada kami Khalid dari Ibnu Abu Hilal dari Nu'aim Al Mujmir Abu 'Abdullah dia berkata; telah mengabarkan kepadaku Shuhaib bahwasanya ia mendengar dari Abu Hurairah dan Abu Sa'id mereka berkata; Rasulullah shallallahu 'alaihi wasallam berkhutbah pada suatu hari, beliau bersabda: \"Demi jiwaku yang berada ditanganNya, \" sebanyak tiga kali, lalu beliau mengisak tangis, dan diantara kami pun mulai menangis, kami tidak mengetahui atas apa beliau bersumpah lalu beliau mengangkat kepalanya dan tampak di wajahnya kegembiraan, hal itu lebih kami sukai daripada unta merah (harta terbaik), kemudian beliau bersabda: 'Tidaklah seorang hamba melaksanakan shalat lima waktu, berpuasa Ramadlan, mengeluarkan zakat dan ia menjauhi tujuh buah dosa besar kecuali akan dibukakan untuknya pintu-pintu surga dan dikatakan padanya masuklah dengan keselamatan.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124470",
    "last_updated": null
  },
  {
    "indonesianURN": "3223960",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1110",
    "babName": "Kewajiban zakat",
    "hadithNumber": "2396",
    "hadithText": "Telah mengabarkan kepadaku 'Amr bin 'Utsman bin Sa'id bin Katsir dia berkata; bapakku telah menceritakan kepada kami dari Syu'aib dari Az Zuhri dia berkata; telah mengabarkan kepadaku Humaid bin 'Abdurrahman bahwasanya Abu Hurairah berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang menafkahkan sesuatu yaang berpasang-pasangan di jalan Allah, akan dipanggil dari pintu-pintu surga, 'Wahai hamba Allah, ini lebih baik bagimu'. Dan surga memiliki pintu-pintu; barangsiapa yang termasuk rajin mengerjakan shalat, akan dipanggil dari pintu shalat; barangsiapa yang termasuk rajin jihad, akan dipanggil dari pintu jihad; barangsiapa yang termasuk rajin bersedekah, akan dipanggil dari pintu sedekah; dan barangsiapa yang termasuk rajin berpuasa, akan dipanggil dari pintu Ar-Rayyan.\" Abu Bakar Ash-Shidiq berkata; 'Jika seseorang dipanggil dari salah satu diantara pintu-pintu itu, itu sebuah kepastian (tidak aneh), namun apakah ada seseorang yang dipanggil dari semua pintu-pintu itu, Wahai Rasulullah? ' Beliau bersabda: 'Ya, dan aku berharap agar engkau termasuk di antara mereka.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124480",
    "last_updated": null
  },
  {
    "indonesianURN": "3223970",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1111",
    "babName": "Teguran keras tidak membayar zakat",
    "hadithNumber": "2397",
    "hadithText": "Telah mengabarkan kepada kami Hannad bin As Sari dalam haditsnya dari Abu Mu'awiyah dari Al A'masy dari Al Ma'rur bin Suwaid dari Abu Dzarr dia berkata; Aku pernah datang menemui Nabi shallallahu 'alaihi wasallam dan beliau sedang duduk di bawah naungan Ka'bah. Setelah melihatku datang, beliau bersabda: \"Mereka adalah orang-orang yang merugi, demi Pemelihara Ka'bah.\" aku bertanya-tanya; 'Apa yang terjadi padaku? Barangkali telah diturunkan sesuatu tentang diriku! ' Aku bertanya; 'Siapakah mereka, sungguh bapak dan ibuku sebagai tebusannya? ' Beliau bersabda: 'Orang yang banyak hartanya, kecuali orang yang mengatakan begini, begini dan begini, hingga di hadapannya, samping kanan dan samping kirinya.' Kemudian beliau bersabda: 'Demi Dzat yang jiwaku berada di tangan-Nya. Tidaklah seorang meninggal, lalu ia meninggalkan unta atau sapi yang belum ditunaikan zakatnya, kecuali akan datang pada hari Kiamat lebih besar dan lebih gemuk dari sebelumnya, menginjakkan dengan tapak kakinya dan menyeruduknya dengan tanduknya. Setiap kali yang terakhir selesai, diulang lagi yang pertama, hingga diputuskan perkara di hadapan manusia.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124490",
    "last_updated": null
  },
  {
    "indonesianURN": "3223980",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1111",
    "babName": "Teguran keras tidak membayar zakat",
    "hadithNumber": "2398",
    "hadithText": "Telah mengabarkan kepada kami Mujahid bin Musa dia berkata; telah menceritakan kepada kami Ibnu 'Uyainah dari Jami' bin Abu Rasyid dari Abu Wa'il dari 'Abdullah dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang memiliki harta yang ia tidak menunaikan hak hartanya, melainkan akan dijadikan untuknya ular botak sebagai kalung di lehernya, ia berlari terbirit-birit darinya namun ular tersebut terus mengikutinya.\" Kemudian beliau membaca pembenarannya dari Kitabullah -Azza wa Jalla-, 'Sekali-kali janganlah orang-orang yang bakhil dengan harta yang Allah berikan kepada mereka dari karunia-Nya menyangka bahwa kebakhilan baik bagi mereka. Sebenarnya kebakhilan itu adalah buruk bagi mereka. Harta yang mereka bakhilkan itu dikalungkan kelak di lehernya di hari kiamat...\". (QS. Ali Imraan 3: 180)</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124500",
    "last_updated": null
  },
  {
    "indonesianURN": "3223990",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1111",
    "babName": "Teguran keras tidak membayar zakat",
    "hadithNumber": "2399",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud dia berkata; telah menceritakan kepada kami Yazid bin Zurai' dia berkata; telah menceritakan kepada kami Sa'id bin Abu 'Arubah dia berkata; telah menceritakan kepada kami Qatadah dari Abu 'Amru Al Ghudani bahwasanya Abu Hurairah berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapakah orangnya yang memiliki unta, ia tidak memberikan haknya saat najdah-nya dan rislah-nya?\" -Mereka bertanya; 'Wahai Rasulullah! Apa itu najdah dan rislah?\" Beliau menjawab: 'Saat sulitnya dan saat lapangnya.'- sungguh akan datang pada hari Kiamat, lebih cepat dari sebelumnya, lebih gemuk dan lebih runcing. Ia (si pemilik) ditelungkupkan di tempat yang luas, lalu diinjak dengan tapak kakinya. Jika yang terakhir telah datang gilirannya, diulang lagi mulai yang pertamanya, dalam sehari yang kadarnya lima puluh ribu tahun, hingga diputuskan perkara di hadapan manusia, lalu ia melihat jalannya. Siapakah orangnya yang memiliki sapi, ia tidak memberikan haknya saat najdahnya dan rislahnya, akan datang pada hari kiamat lebih cepat dari sebelumnya, lebih gemuk dan lebih runcing. Ia ditelungkupkan di tempat yang luas, lalu setiap yang memiliki tanduk menyeruduknya dengan tanduknya dan setiap yang memiliki kuku telapak kaki menginjaknya dengan kuku telapak kakinya. Jika yang terakhir telah melewatinya diulang lagi yang pertamanya dalam sehari yang kadarnya lima puluh ribu tahun, hingga diputuskan perkara di hadapan manusia, lalu ia melihat jalannya. Dan siapakah orang yang memiliki kambing, ia tidak memberikan haknya dalam najdah dan rislah, sungguh akan datang pada hari Kiamat lebih cepat dari sebelumnya, lebih banyak, lebih gemuk dan lebih runcing. Ia ditelungkupkan di tempat yang luas, lalu setiap yang memiliki kuku menginjaknya dengan kukunya dan setiap yang memiliki tanduk menyeruduknya dengan tanduknya. Tidak ada yang bengkok tanduknya dan tidak ada yang pecah. Jika yang terakhir telah melewatinya diulang lagi yang pertamanya dalam sehari yang kadarnya lima puluh ribu tahun, hingga diputuskan perkara di hadapan manusia, lalu ia melihat jalannya.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124510",
    "last_updated": null
  },
  {
    "indonesianURN": "3224000",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1112",
    "babName": "Orang-orang yang tidak mau membayar zakat",
    "hadithNumber": "2400",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Al Laits dari 'Uqail dari Az Zuhri dia berkata; telah mengabarkan kepadaku 'Ubaidullah bin 'Abdullah bin 'Utbah bin Mas'ud dari Abu Hurairah dia berkata; Setelah Rasulullah shallallahu 'alaihi wasallam wafat, lalu -kekhalifahan- sesudahnya digantikan oleh Abu Bakar, namun orang kafir dari bangsa Arab mengingkarinya. Umar berkata kepada Abu Bakar; \"Bagaimana caramu memerangi manusia, sedangkan Rasulullah shallallahu 'alaihi wasallam telah bersabda: 'Aku diperintahkan untuk memerangi manusia hingga mereka mengatakan, La Ilaaha Ilallah (tidak ada Ilah yang berhak disembah kecuali Allah) '. Barangsiapa yang mengatakan, 'La Ilaaha Ilallah', berarti ia telah memelihara harta dan jiwanya dariku kecuali dengan haknya dan hisabnya atas Allah'.' Abu Bakar -radliallahu 'anhu- berkata; 'Sungguh benar-benar aku akan perangi orang yang memisahkan antara shalat dan zakat. zakat adalah hak harta. Demi Allah, andaikata mereka menghalangiku untuk mengambil zakat unta yang dahulu mereka berikan kepada Rasulullah shallallahu 'alaihi wasallam, niscaya akan aku perangi mereka karena hal itu.' Umar -radliallahu 'anhu- berkata; 'Demi Allah, tidak ada hal lain kecuali aku melihat Allah telah melapangkan dada Abu Bakar untuk berperang, aku mengetahui bahwa hal itu adalah suatu kebenaran.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124520",
    "last_updated": null
  },
  {
    "indonesianURN": "3224010",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1113",
    "babName": "Hukuman bagi yang tidak mau membayar zakat",
    "hadithNumber": "2401",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin 'Ali dia berkata; Telah menceritakan kepada kami Yahya dia berkata; Telah menceritakan kepada kami Bahz bin Hakim dia berkata; Bapakku telah menceritakan kepadaku dari kakekku, dia berkata; Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Pada setiap empat puluh ekor unta yang dilepas, (mencari makan sendiri), zakatnya satu ekor unta Ibnatu labun (unta yang umurnya memasuki tahun ketiga). Tidak boleh dipisahkan unta itu untuk mengurangi perhitungan zakat. Barangsiapa memberinya karena mengharap pahala, ia akan mendapat pahalanya. Barangsiapa menolak untuk mengeluarkannya, kami akan mengambilnya beserta setengah hartanya, karena keputusan Rabb kami. Tidak halal bagi keluarga Muhammad memakan harta (zakat) sedikitpun.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124530",
    "last_updated": null
  },
  {
    "indonesianURN": "3224020",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1114",
    "babName": "Zakat unta",
    "hadithNumber": "2402",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id dia berkata; Telah menceritakan kepada kami Sufyan dia berkata; Telah menceritakan kepadaku 'Amru bin Yahya, demikian juga diriwayatkan dari jalur lainnya, dan telah mengabarkan kepada kami Muhammad bin Al Mutsanna dan Muhammad bin Basysyar dari 'Abdurrahman dari Sufyan dan Syu'bah dan Malik dari 'Amru bin Yahya dari bapaknya dari Abu Sa'id Al Khudri bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada biji-bijian yang kurang dari lima wasaq, tidak ada zakat pada unta yang kurang dari lima dzaud (ekor) dan tidak ada zakat pada perak yang kurang dari lima uqiyah.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124540",
    "last_updated": null
  },
  {
    "indonesianURN": "3224030",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1114",
    "babName": "Zakat unta",
    "hadithNumber": "2403",
    "hadithText": "Telah mengabarkan kepada kami 'Isa bin Hammad dia berkata; Telah memberitakan kepada kami Al Laits dari Yahya bin Sa'id dari 'Amru bin Yahya bin 'Umarah dari bapaknya dari Abu Sa'id Al Khudri bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada unta yang kurang dari lima dzaud (ekor), tidak ada zakat pada perak yang kurang dari lima uqiyah dan tidak ada zakat pada biji-bijian yang kurang dari lima wasaq.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124550",
    "last_updated": null
  },
  {
    "indonesianURN": "3224040",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1114",
    "babName": "Zakat unta",
    "hadithNumber": "2404",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin Al Mubarak dia berkata; Telah menceritakan kepada kami Al Muzhaffar bin Mudrik Abu Kamil dia berkata; Telah menceritakan kepada kami Hammad bin Salamah dia berkata; Aku mengambil kitab ini dari Tsumamah bin 'Abdullah bin Anas bin Malik dari Anas bin Malik bahwasanya Abu Bakr menulis untuk mereka; \" Ini adalah kewajiban zakat yang Rasulullah shallallahu 'alaihi wasallam wajibkan atas kaum muslimin, Allah -Azza wa Jalla- perintahkan Rasul-Nya shallallahu 'alaihi wasallam untuk menunaikannya. Barangsiapa di antara kaum muslimin dimintai zakat tersebut berdasarkan aturannya, hendaklah ia memberikannya; dan barangsiapa yang dimintai lebih dari itu, maka janganlah ia memberikannya. Unta yang kurang dari dua puluh lima ekor, pada setiap kelipatan lima ekor zakatnya satu ekor kambing. Jika mencapai dua puluh lima ekor hingga tiga puluh lima ekor unta, zakatnya seekor unta betina yang umurnya telah menginjak tahun kedua. Jika tidak ada, zakatnya seekor unta jantan yang umurnya telah menginjak tahun ketiga. Jika mencapai tiga puluh enam hingga empat puluh lima ekor unta, zakatnya seekor anak unta betina yang umurnya telah menginjak tahun ketiga. Jika telah mencapai empat puluh enam sampai enam puluh ekor unta, zakatnya seekor anak unta betina yang umurnya telah masuk tahun keempat dan bisa dikawini unta jantan. Jika telah mencapai enampuluh satu hingga tujuh puluh lima ekor unta, zakatnya seekor unta betina yang umurnya telah masuk tahun kelima. Jika mencapai tujuh puluh enam hingga sembilan puluh ekor unta, zakatnya dua ekor anak unta betina yang umurnya telah menginjak tahun kedua. Jika telah mencapai sembilan puluh satu hingga seratus dua puluh ekor unta, zakatnya dua ekor unta betina yang umurnya telah masuk tahun keempat dan dapat dikawini unta jantan. Jika telah melebihi seratus dua puluh ekor unta, maka setiap empat puluh ekor zakatnya seekor anak unta betina yang umurnya masuk tahun ketiga dan setiap lima puluh ekor, zakatnya seekor unta betina yang umurnya masuk tahun keempat. Jika umur unta-unta yang menjadi kewajiban zakat berbeda-beda, maka barangsiapa yang jumlah untanya telah mewajibkannya untuk mengeluarkan seekor unta betina yang umurnya masuk tahun kelima, padahal ia tidak memilikinya dan yang ia miliki adalah unta betina yang umurnya masuk tahun keempat, maka ia boleh mengeluarkan seekor anak unta yang umurnya masuk tahun keempat ditambah dua ekor kambing jika hal itu -dirasa- mudah baginya, atau ditambah dua puluh dirham. Barangsiapa yang jumlah untanya telah wajib mengeluarkan seekor unta betina yang umurnya masuk tahun keempat, padahal ia tidak memilikinya dan ia memiliki unta betina yang umurnya masuk tahun kelima, maka ia boleh mengeluarkan seekor anak unta yang umurnya masuk tahun kelima, dan petugas zakat memberikan kepadanya dua puluh dirham atau dua kambing jika hal itu -dirasa- mudah baginya. Barangsiapa yang jumlah untanya telah mewajibkannya mengeluarkan seekor unta betina yang umurnya masuk tahun keempat, padahal ia tidak memilikinya dan ia hanya memiliki unta betina yang umurnya masuk tahun ketiga, maka ia boleh mengeluarkan seekor anak unta yang umurnya masuk tahun ketiga ditambah dua ekor kambing, jika hal itu -dirasa- mudah baginya, atau ditambah dua puluh dirham. Barangsiapa yang jumlah untanya telah mewajibkannya mengeluarkan seekor unta betina yang umurnya masuk tahun ketiga, padahal ia tidak memilikinya dan ia memilikinya dan ia memiliki unta betina yang umurnya masuk tahun keempat, maka ia boleh mengeluarkan seekor anak unta yang umurnya masuk tahun keempat dan petugas zakat memberikan kepadanya dua puluh dirham atau dua ekor kambing. Barangsiapa yang jumlah untanya telah mewajibkannya mengeluarkan seekor unta betina yang umurnya masuk tahun ketiga, padahal ia tidak memilikinya dan ia hanya memiliki unta betina yang umurnya masuk tahun kedua, maka ia boleh mengeluarkan seekor unta yang umurnya masuk tahun kedua ditambah dua ekor kambing jika hal itu -dirasa- mudah baginya, atau ditambah dua puluh dirham. Barangsiapa yang jumlah untanya telah mewajibkannya mengeluarkan seekor unta betina yang umurnya masuk tahun kedua, padahal ia tidak memilikinya dan ia memiliki unta jantan yang umurnya masuk tahun ketiga, maka ia boleh mengeluarkan seekor anak unta jantan yang umurnya masuk tahun ketiga dan tidak perlu ditambah yang lain. Barangsiapa yang tidak memiliki unta kecuali hanya empat ekor, tidak wajib atasnya zakat kecuali bila pemiliknya menginginkan. Mengenai zakat kambing yang dilepas mencari makan sendiri, jika mencapai empat puluh ekor hingga seratus dua puluh ekor kambing, zakatnya satu ekor kambing. Jika lebih dari seratus dua puluh hingga dua ratus ekor kambing, zakatnya dua ekor kambing. Jika lebih dari dua ratus hingga tiga ratus ekor kambing, zakatnya tiga ekor kambing. Jika lebih dari tiga ratus ekor kambing, maka setiap seratus ekor zakatnya seekor kambing. Tidak boleh dikeluarkan untuk zakat hewan yang tua dan yang cacat dan tidak boleh dikeluarkan yang jantan kecuali jika pemiliknya menghendaki. Tidak boleh dikumpulkan antara hewan-hewan ternak yang terpisah dan tidak boleh dipisahkan antara hewan-hewan ternak yang terkumpul karena takut mengeluarkan zakat. Hewan ternak kumpulan dari dua orang, pada waktu zakat harus kembali dibagi rata antara keduanya. Jika kambing yang dilepas mencari makan sendiri kurang satu ekor dari empat puluh ekor, maka tidak ada zakatnya, kecuali jika pemiliknya menghendakinya. Tentang zakat perak, setiap dua ratus dirham zakatnya seperempat puluhnya (dua setengah persen). Jika hanya seratus sembilan puluh dirham, maka tidak ada zakatnya, kecuali jika pemiliknya menghendakinya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124560",
    "last_updated": null
  },
  {
    "indonesianURN": "3224050",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1115",
    "babName": "Tidak mau membayar zakat unta",
    "hadithNumber": "2405",
    "hadithText": "Telah mengabarkan kepada kami 'Imran bin Bukair dia berkata; Telah menceritakan kepada kami 'Ali bin 'Abbas dia berkata; Telah menceritakan kepada kami Syu'aib dia berkata; Telah menceritakan kepadaku Abu Az Zinad dari apa-apa yang diceritakan oleh 'Abdurrahman Al A'raj dari apa-apa yang disebutkan, bahwasanya ia mendengar Abu Hurairah berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Unta akan mendatangi pemiliknya -pada hari Kiamat- dengan kondisi yang lebih baik dari sebelumnya. Jika ia tidak memberikan haknya, unta itu menginjaknya dengan tapak kakinya dan kambing mendatangi pemiliknya dengan kondisi yang lebih baik dari sebelumnya. Jika dia tidak memberikan haknya, kambing itu menginjaknya dengan kuku-kuku telapak kakinya dan menyeruduknya dengan tanduknya, -Beliau bersabda: - Di antara haknya ialah agar ia dibawa ke tempat air. Ketahuilah, janganlah sekali-kali salah seorang di antara kalian datang pada hari Kiamat dengan membawa seekor unta yang dibawa di atas lehernya, unta itu memiliki suara keras, lalu ia berkata; 'Wahai Muhammad'. Maka kukatakan; 'Aku tidak memiliki suatu tanggungan pun untukmu, sungguh telah kusampaikan'. Ketahuilah, janganlah sekali-kali salah seorang di antara kalian datang pada hari Kiamat dengan membawa seekor kambing yang ia bawa di atas lehernya. Kambing itu memiliki suara keras, lalu ia berkata; 'Wahai Muhammad'. Maka kukatakan; 'Aku tidak memiliki suatu tanggungan pun untukmu, sungguh telah kusampaikan'. Beliau bersabda: 'Harta simpanan salah seorang di antara mereka (jika tidak dikeluarkan zakatnya), pada hari Kiamat adalah ular yang berkepala putih (karena banyak racunnya), pemiliknya lari darinya dan ular itu menuntutnya; 'Akulah harta simpananmu', hal tersebut terus seperti itu hingga ular itu menelan jari-jarinya.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124570",
    "last_updated": null
  },
  {
    "indonesianURN": "3224060",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1116",
    "babName": "Tidak dikenai zakat unta jika digunakan untuk angkutan (transportasi)",
    "hadithNumber": "2406",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin 'Abdul A'la dia berkata; Telah menceritakan kepada kami Mu'tamir dia berkata; Aku mendengar Bahaz bin Hakim menceritakan dari bapaknya dari kakeknya, dia berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Pada setiap unta yang dilepas mencari makan sendiri, setiap empat puluh ekor zakatnya satu ekor unta betina yang umurnya masuk tahun ketiga. Unta tidak boleh dipisahkan untuk mengurangi perhitungan zakat. Barangsiapa memberinya karena mengharap pahala, ia akan mendapat pahalanya. Barangsiapa menolak untuk mengeluarkannya, kami akan mengambilnya beserta setengah hartanya karena keputusan Rabb kami. Tidak halal bagi keluarga Muhammad shallallahu 'alaihi wasallam darinya sedikitpun.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124580",
    "last_updated": null
  },
  {
    "indonesianURN": "3224070",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1117",
    "babName": "Zakat sapi",
    "hadithNumber": "2407",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Rafi' dia berkata; Telah menceritakan kepada kami Yahya bin Adam dia berkata; Telah menceritakan kepada kami Mufadldlal bin Muhalhal dari Al A'masy dari Syaqiq dari Masruq dari Mu'adz bahwa Rasulullah shallallahu 'alaihi wasallam mengutusnya ke negeri Yaman, dan memerintahkannya untuk mengambil (zakat) dari setiap orang yang telah baligh sebesar satu dinar, atau yang sebanding dengan nilai itu berupa kain dari Yaman, dan dari setiap tiga puluh ekor sapi -zakatnya- seekor sapi yang berumur satu tahun lebih yang jantan atau betina, dan setiap empat puluh ekor sapi -zakatnya- seekor sapi betina berumur dua tahun lebih.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124590",
    "last_updated": null
  },
  {
    "indonesianURN": "3224080",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1117",
    "babName": "Zakat sapi",
    "hadithNumber": "2408",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman dia berkata; Telah menceritakan kepada kami Ya'la bin 'Ubaid dia berkata; Telah menceritakan kepada kami Al A'masy dari Syaqiq dari Masruq dan Al A'masy dari Ibrahim mereka berdua berkata; Mu'adz berkata; \"Rasulullah shallallahu 'alaihi wasallam mengutusku ke negeri Yaman, lalu beliau memerintahku untuk mengambil dari setiap empat puluh ekor sapi -zakatnya- seekor anak sapi betina berumur dua tahun lebih, dari setiap tiga puluh ekor sapi -zakatnya- seekor sapi jantan yang berumur setahun lebih, serta dari setiap orang yang baligh diambil (jizyah) satu dinar atau yang sebanding dengan nilai pakaian dari Yaman.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124600",
    "last_updated": null
  },
  {
    "indonesianURN": "3224090",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1117",
    "babName": "Zakat sapi",
    "hadithNumber": "2409",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Harb dia berkata; Telah menceritakan kepada kami Abu Mu'awiyah dari Al A'masy dari Ibrahim dari Masruq dari Mu'adz dia berkata; \"Setelah Rasulullah shallallahu 'alaihi wasallam mengutusnya ke negeri Yaman, beliau memerintahnya untuk mengambil (zakat) dari setiap tiga puluh ekor sapi seekor anak sapi yang berumur setahun lebih yang jantan atau yang betina, dan setiap empat puluh ekor sapi, seekor sapi betina berumur dua tahun lebih serta dari setiap orang yang telah baligh diambil (jizyah) satu dinar atau yang sebanding dengan nilai pakaian dari Yaman.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124610",
    "last_updated": null
  },
  {
    "indonesianURN": "3224100",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1117",
    "babName": "Zakat sapi",
    "hadithNumber": "2410",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur Ath Thusi dia berkata; Telah menceritakan kepada kami Ya'qub dia berkata; Bapakku telah menceritakan kepada kami dari Ibnu Ishaq dia berkata; Telah menceritakan kepadaku Sulaiman Al A'masy dari Abu Wa'il bin Salamah dari Mu'adz bin Jabal dia berkata; \"Ketika Rasulullah shallallahu 'alaihi wasallam mengutusku ke negeri Yaman, beliau menyuruhku untuk tidak mengambil (zakat) dari sapi sedikitpun hingga mencapai tiga puluh ekor. Jika sudah mencapai tiga puluh ekor, maka zakatnya seekor anak sapi yang berumur satu tahun lebih, baik yang jantan atau betina. Apabila mencapai empat puluh, maka zakatnya satu ekor sapi yang sudah berumur dua tahun lebih.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124620",
    "last_updated": null
  },
  {
    "indonesianURN": "3224110",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1118",
    "babName": "Tidak mau membayar zakat sapi",
    "hadithNumber": "2411",
    "hadithText": "Telah mengabarkan kepada kami Washil bin 'Abdul A'la dari Ibnu Fudhail dari 'Abdul Malik bin Abu Sulaiman dari Abu Az Zubair dari Jabir bin 'Abdullah dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada seorang pun dari pemilik unta, sapi dan kambing yang tidak menunaikan haknya melainkan akan dibangkitkan pada hari Kiamat, ditelungkupkan di tempat yang luas. Setiap yang memiliki kuku telapak kaki akan menginjaknya dengan kuku-kuku telapak kakinya dan setiap yang memiliki tanduk akan menyeruduk dengan tanduknya. Di antara binatang-binatang tersebut tidak ada yang bengkok dan tidak ada yang pecah tanduknya.\" Kami bertanya; 'Wahai Rasulullah shallallahu 'alaihi wasallam! Apa haknya? ' Beliau menjawab: 'Meminjamkan pejantannya, meminjamkan untuk mengambil air dari sumur dan membawa muatan di atasnya pada jalan Allah. Dan tidak ada pemilik harta yang tidak menunaikan haknya melainkan akan dibuatkan untuk dirinya pada hari Kiamat seperti ular yang berkepala putih (karena banyak racunnya), yang pemiliknya lari darinya namun ular tersebut terus mengikutinya seraya mengatakan; 'Inilah harta simpananmu yang kamu bakhil dengannya'. Ketika ia melihat bahwa hal itu sudah menjadi keharusan untuknya, ia memasukkan tangan ke mulutnya, lalu ia segera menggigitnya seperti hewan pejantan menggigit.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124630",
    "last_updated": null
  },
  {
    "indonesianURN": "3224120",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1119",
    "babName": "Zakat kambing",
    "hadithNumber": "2412",
    "hadithText": "Telah mengabarkan kepada kami 'Abdullah bin Fadhalah bin Ibrahim An Nasaa'i dia berkata; Telah memberitakan kepada kami Syuraih bin An Nu'man dia berkata; Telah menceritakan kepada kami Hammad bin Salamah dari Tsumamah bin 'Abdullah bin Anas bin Malik dari Anas bin Malik bahwasanya Abu Bakr -radliallahu 'anhu- menulis untuknya; \" ini adalah kewajiban zakat yang Rasulullah shallallahu 'alaihi wasallam wajibkan atas kaum muslimin, yang Allah perintahkan Rasul-Nya shallallahu 'alaihi wasallam untuk menunaikannya. Barangsiapa di antara kaum muslimin yang dimintai zakat tersebut berdasarkan aturannya, hendaklah ia memberikannya; dan barangsiapa yang dimintai lebih dari itu, janganlah ia memberikannya: Unta yang kurang dari dua puluh lima ekor, pada setiap kelipatan lima ekor zakatnya satu ekor kambing. Jika mencapai dua puluh lima ekor hingga tiga puluh lima ekor, zakatnya seekor unta betina yang umurnya telah menginjak tahun kedua. Jika tidak ada, zakatnya seekor unta jantan yang umurnya telah menginjak tahun ketiga. Jika mencapai tiga puluh enam hingga empat puluh lima ekor unta, zakatnya seekor anak unta betina yang umurnya telah menginjak tahun ketiga. Jika telah mencapai empat puluh enam sampai enam puluh ekor unta, zakatnya seekor anak unta betina yang umurnya telah masuk tahun keempat dan bisa dikawini unta jantan. Jika telah mencapai enam puluh satu hingga tujuh puluh lima ekor unta, zakatnya seekor unta betina yang umurnya telah masuk tahun kelima. Jika telah mencapai tujuh puluh enam hingga sembilan puluh ekor unta, zakatnya dua ekor anak unta betina yang umurnya telah menginjak tahun kedua. Jika telah mencapai sembilan puluh satu hingga seratus dua puluh ekor unta, zakatnya dua ekor unta betina yang umurnya telah masuk tahun keempat dan dapat dikawini unta jantan. Jika telah melebihi seratus dua puluh ekor unta, maka setiap empat puluh ekor zakatnya seekor anak unta betina yang umurnya masuk tahun ketiga; dan setiap lima puluh ekor, zakatnya seekor unta betina yang umurnya masuk tahun keempat. Jika umur unta-unta yang menjadi kewajiban zakat berbeda-beda, barangsiapa yang jumlah untanya telah wajib mengeluarkan seekor unta betina yang umurnya masuk tahun kelima, namun ia tidak memilikinya dan ia hanya memiliki unta betina yang umurnya masuk tahun keempat, maka ia boleh mengeluarkan seekor anak unta yang umurnya masuk tahun keempat ditambah dua ekor kambing jika hal itu -dirasa- mudah baginya, atau ditambah dua puluh dirham. Barangsiapa yang jumlah untanya telah wajib mengeluarkan seekor unta betina yang umurnya masuk tahun keempat, padahal ia tidak memilikinya dan ia memiliki unta betina yang umurnya masuk tahun kelima, maka ia boleh mengeluarkan seekor anak unta yang umurnya masuk tahun kelima dan petugas zakat memberikan kepadanya dua puluh dirham atau dua ekor kambing jika hal itu -dirasa- mudah baginya. Barangsiapa yang jumlah untanya telah wajib mengeluarkan zakat seekor unta betina yang umurnya masuk tahun keempat, namun ia tidak memilikinya dan ia memiliki unta betina yang umurnya masuk tahun ketiga, maka ia boleh mengeluarkan seekor anak unta yang umurnya masuk tahun ketiga ditambah dua ekor kambing jika hal itu -dirasa- mudah baginya, atau ditambah dua puluh dirham. Barangsiapa yang jumlah untanya telah wajib mengeluarkan zakat seekor unta betina yang umurnya masuk tahun ketiga, padahal ia tidak memilikinya dan ia memiliki unta betina yang umurnya masuk tahun keempat, maka ia boleh mengeluarkan seekor anak unta yang umurnya masuk tahun keempat dan petugas zakat memberikan kepadanya dua puluh dirham atau dua ekor kambing. Barangsiapa yang jumlah untanya telah mewajibkan mengeluarkan seekor unta betina yang umurnya masuk tahun ketiga, padahal ia tidak memilikinya dan ia memiliki unta betina yang umurnya masuk tahun kedua, maka ia boleh mengeluarkan seekor unta yang umurnya masuk tahun kedua ditambah dua ekor kambing jika hal itu -dirasa- mudah baginya, atau ditambah dua puluh dirham. Barangsiapa yang jumlah untanya telah mewajibkannya mengeluarkan seekor unta betina yang umurnya masuk tahun kedua, padahal ia tidak memilikinya dan ia memiliki unta jantan yang umurnya masuk tahun ketiga, maka ia boleh mengeluarkan seekor unta jantan yang umurnya masuk tahun ketiga dan tidak perlu ditambah yang lain. Barangsiapa yang tidak memiliki unta kecuali hanya empat ekor, tidak wajib atasnya zakat kecuali bila pemiliknya. Mengenai zakat kambing yang dilepas mencari makan sendiri, jika mencapai empat puluh ekor hingga seratus dua puluh ekor kambing, zakatnya satu ekor kambing. Jika lebih dari seratus dua puluh hingga dua ratus ekor kambing, zakatnya dua ekor kambing. Jika lebih dua ratus hingga tiga ratus ekor kambing, zakatnya tiga ekor kambing. Jika lebih dari tiga ratus ekor kambing, maka setiap seratus ekor zakatnya seekor kambing. Tidak boleh dikeluarkan untuk zakat hewan yang tua dan cacat dan tidak boleh dikeluarkan yang jantan, kecuali jika pemiliknya menghendaki. Tidak boleh dikumpulkan antara hewan-hewan ternak yang terpisah dan tidak boleh dipisahkan antara hewan-hewan ternak yang terkumpul karena takut mengeluarkan zakat. Hewan ternak kumpulan dari dua orang, pada waktu zakat haru kembali di bagi rata antara keduanya. Jika kambing yang dilepas mencari makan sendiri kurang satu ekor dari empat puluh ekor, maka tidak ada zakatnya, kecuali jika pemiliknya menghendaki. Tentang zakat perak, setiap dua ratus dirham zakatnya seperempat puluhnya (dua setengah persen). Jika hanya seratus sembilan ratus dirham, maka tidak ada zakatnya, kecuali jika pemiliknya menghendakinya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124640",
    "last_updated": null
  },
  {
    "indonesianURN": "3224130",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1120",
    "babName": "Tidak mau membayar zakat kambing",
    "hadithNumber": "2413",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin Al Mubarak dia berkata; Telah menceritakan kepada kami Waki' dia berkata; Telah menceritakan kepada kami Al A'masy dari Al Ma'rur bin Suwaid dari Abu Dzarr dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada seorang pun dari pemilik unta, sapi dan kambing yang tidak mau menunaikan zakatnya, kecuali akan datang pada hari Kiamat binatang itu lebih besar dan lebih gemuk dari sebelumnya, ia menyeruduknya dengan tanduknya dan menginjak orang itu dengan tapak kakinya. Setiap kali yang terakhir selesai diulang lagi yang pertamanya, hingga perkaranya diputuskan di hadapan manusia.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124650",
    "last_updated": null
  },
  {
    "indonesianURN": "3224140",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1121",
    "babName": "Menyatukan hewan yang terpisah dan memisah hewan yang menyatu",
    "hadithNumber": "2414",
    "hadithText": "Telah mengabarkan kepada kami Hannad bin As Sariy dari Husyaim dari Hilal bin Khabbab dari Maisarah Abu Shalih dari Suwaid bin Ghaflah dia berkata; Petugas pengambil zakat utusan Nabi shallallahu 'alaihi wasallam datang kepada kami, lalu aku menemuinya, duduk di sampingnya dan mendengarkan ia berkata; \" Dalam perjanjianku agar kita tidak mengambil hewan yang masih menyusu dari induknya, tidak mengumpulkan antara hewan-hewan ternak yang terpisah dan memisahkan antara hewan-hewan ternak yang terkumpul.\" Lalu datang kepadanya seseorang dengan membawa unta yang besar punuknya seraya berkata; 'Ambillah unta ini! ' namun petugas zakat itu menolak.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124660",
    "last_updated": null
  },
  {
    "indonesianURN": "3224150",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1121",
    "babName": "Menyatukan hewan yang terpisah dan memisah hewan yang menyatu",
    "hadithNumber": "2415",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Zaid bin Yazid bin Abu Az Zarqa' dia berkata; Bapakku telah menceritakan kepada kami, dia berkata; Telah menceritakan kepada kami Sufyan dari 'Ashim bin Kulaib dari bapaknya dari Wail bin Hujr bahwa Nabi shallallahu 'alaihi wasallam mengutus seorang petugas pengambil zakat, lalu ia mendatangi seseorang dan orang itu memberikan seekor anak unta sapihan yang kurus, maka Nabi shallallahu 'alaihi wasallam bersabda: \"Kami telah mengutus seorang petugas pengambil zakat utusan Allah dan Rasul-Nya, dan sungguh si fulan telah memberikan kepadanya seekor anak unta sapihan yang kurus. Ya Allah, janganlah Engkau berikan berkah kepadanya dan jangan pula kepada untanya.\" Lalu berita itu sampai kepada orang tersebut, maka ia datang dengan membawa unta yang baik seraya berkata; 'Aku bertaubat kepada Allah -Azza wa Jalla- dan kepada Nabi-Nya shallallahu 'alaihi wasallam, ' Nabi shallallahu 'alaihi wasallam bersabda: 'Ya Allah, berikan berkah kepadanya dan kepada untanya.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124670",
    "last_updated": null
  },
  {
    "indonesianURN": "3224160",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1122",
    "babName": "Doa imam untuk pemilik zakat",
    "hadithNumber": "2416",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Yazid dia berkata; telah menceritakan kepada kami Bahz bin Asad dia berkata; telah menceritakan kepada kami Syu'bah dia berkata; 'Amru bin Murrah telah mengabarkan kepadaku, dia berkata; Aku mendengar 'Abdullah bin Abu Aufa berkata; Rasulullah shallallahu 'alaihi wasallam ketika didatangi oleh suatu kaum dengan mambawa zakat mereka, beliau berdo'a: \"Ya Allah berilah rahmat atas keluarga si fulan.\" Lalu Abu Aufa datang kepada beliau dengan membawa zakatnya, maka beliau berdo'a: 'Ya Allah berilah rahmat kepada keluarga Abu Aufa.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124680",
    "last_updated": null
  },
  {
    "indonesianURN": "3224170",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1123",
    "babName": "Jika penarik zakat melakukan kezhaliman dalam masalah zakat",
    "hadithNumber": "2417",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dan Muhammad bin Basysyar - dan lafadz ini miliknya - mereka berdua berkata; telah menceritakan kepada kami Yahya dari Muhammad bin Isma'il dari 'Abdurrahman bin Hilal dia berkata; Jarir berkata; Sekelompok orang dari Arab badui datang menemui Nabi shallallahu 'alaihi wasallam, lalu mereka berkata; \"Wahai Rasulullah! Sekelompok orang datang dari petugas pengambil zakat utusanmu berbuat zhalim.\" Beliau bersabda: 'Buatlah para petugas pengambil zakat yang mengambil zakat kalian merasa ridla.' Mereka bertanya; 'Meskipun berbuat zhalim? ' Beliau bersabda: 'Buatlah para petugas pengambil zakat yang mengambil zakat kalian, merasa ridla.' Mereka bertanya; 'Meskipun berbuat zhalim? ' Beliau bersabda: 'Buatlah para petugas pengambil zakat yang mengambil zakat kalian merasa ridla.' Jarir berkata; 'Tidak pernah seorang petugas pengambil zakat kembali dari tempatku sejak aku mendengar Rasulullah shallallahu 'alaihi wasallam kecuali dia merasa ridla.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124690",
    "last_updated": null
  },
  {
    "indonesianURN": "3224180",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1123",
    "babName": "Jika penarik zakat melakukan kezhaliman dalam masalah zakat",
    "hadithNumber": "2418",
    "hadithText": "Telah mengabarkan kepada kami Ziyad bin Ayyub dia berkata; telah menceritakan kepada kami Isma'il bin 'Ulayyah dia berkata; telah memberitakan kepada kami Dawud dari Asy Sya'bi dia berkata; Jarir berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika datang kepada kalian petugas pengambil zakat, jadikanlah ia kembali dalam keadaan ridla terhadap kalian.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124700",
    "last_updated": null
  },
  {
    "indonesianURN": "3224210",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1124",
    "babName": "Pemilik harta menyerahkan harta dengan tanpa pilihan penarik zakat",
    "hadithNumber": "2421",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Manshur dan Mahmud bin Ghailan mereka berdua berkata; Telah menceritakan kepada kami Abu Nu'aim dia berkata; Telah menceritakan kepada kami Sufyan dari Ibrahim bin Maisarah dari 'Utsman bin 'Abdullah bin Al Aswad dari 'Abdullah bin Hilal Ats Tsaqafi dia berkata; Seseorang datang kepada Nabi shallallahu 'alaihi wasallam lalu ia berkata hampir saja aku terbunuh setelahmu karena zakat seekor kambing betina, lalu beliau bersabda: \"Kalau bukan karena (untuk diberikan) orang-orang Muhajirin yang fakir maka aku tidak akan mengambilnya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124750",
    "last_updated": null
  },
  {
    "indonesianURN": "3224220",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1125",
    "babName": "Zakat kuda",
    "hadithNumber": "2422",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin Al Mubarak dia berkata; telah menceritakan kepada kami Waki' dari Syu'bah dan Sufyan dari 'Abdullah bin Dinar dari Sulaiman bin Yasar dari 'Irak bin Malik dari Abu Hurairah dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidak wajib zakat atas seorang muslim pada budak dan kudanya'.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124760",
    "last_updated": null
  },
  {
    "indonesianURN": "3224230",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1125",
    "babName": "Zakat kuda",
    "hadithNumber": "2423",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Ali bin Harb Al Marwazi dia berkata; telah menceritakan kepada kami Muhriz bin Al Wadldlah dari Isma'il bin Umayyah dari Makhul dari 'Irak bin Malik dari Abu Hurairah Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak wajib zakat atas seorang muslim pada budak dan kudanya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124770",
    "last_updated": null
  },
  {
    "indonesianURN": "3224240",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1125",
    "babName": "Zakat kuda",
    "hadithNumber": "2424",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur dia berkata; Telah menceritakan kepada kami Sufyan dia berkata; Telah menceritakan kepada kami Ayyub bin Musa dari Makhul dari Sulaiman bin Yasar dari 'Irak bin Malik dari Abu Hurairah dia menyandarkannya kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak wajib zakat atas seseorang muslim pada budak dan kudanya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124780",
    "last_updated": null
  },
  {
    "indonesianURN": "3224250",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1125",
    "babName": "Zakat kuda",
    "hadithNumber": "2425",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id dia berkata; telah menceritakan kepada kami Yahya dari Khutsaim dia berkata; bapakku telah menceritakan kepada kami dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak wajib zakat atas seseorang pada kuda dan budaknya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124790",
    "last_updated": null
  },
  {
    "indonesianURN": "3224260",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1126",
    "babName": "Zakat budak",
    "hadithNumber": "2426",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dan Al Harits bin Miskin secara baca, dan aku mendengarnya, lafazh ini miliknya, dari Ibnul Qasim dia berkata; telah menceritakan kepadaku Malik dari 'Abdullah bin Dinar dari Sulaiman bin Yasar dari 'Irak bin Malik dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak wajib zakat atas seseorang pada kuda dan budaknya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124800",
    "last_updated": null
  },
  {
    "indonesianURN": "3224270",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1126",
    "babName": "Zakat budak",
    "hadithNumber": "2427",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Hammad dari Khutsaim bin 'Irak bin Malik dari bapaknya dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak wajib zakat atas seseorang pada kuda dan budaknya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124810",
    "last_updated": null
  },
  {
    "indonesianURN": "3224280",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1127",
    "babName": "Zakat uang perak",
    "hadithNumber": "2428",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Habib bin 'Arabi dari Hammad dia berkata; telah menceritakan kepada kami Yahya bin Sa'id dari 'Amru bin Yahya dari bapaknya dari Abu Sa'id Al Khudri dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada perak yang kurang dari lima ekor uqiyah, tidak ada zakat pada unta yang kurang dari lima ekor dan tidak ada zakat pada (biji-bijian) yang kurang dari lima wasaq.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124820",
    "last_updated": null
  },
  {
    "indonesianURN": "3224290",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1127",
    "babName": "Zakat uang perak",
    "hadithNumber": "2429",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dia berkata; telah memberitakan kepada kami Ibnul Qasim dari Malik dia berkata; telah menceritakan kepadaku Muhammad bin 'Abdullah bin 'Abdurrahman bin Abu Sha'sha'ah Al Mazini dari bapaknya dari Abu Sa'id Al Khudri bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada kurma yang kurang dari lima wasaq, tidak ada zakat pada perak yang kurang dari lima uqiyah dan tidak ada zakat pada unta yang kurang dari lima ekor.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124830",
    "last_updated": null
  },
  {
    "indonesianURN": "3224300",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1127",
    "babName": "Zakat uang perak",
    "hadithNumber": "2430",
    "hadithText": "Telah mengabarkan kepada kami Harun bin 'Abdullah dia berkata; telah menceritakan kepada kami Abu Usamah dari Al Walid bin Katsir dari Muhammad bin 'Abdurrahman bin Abu Sha'sha'ah dari Yahya bin 'Umarah dan 'Abbad bin Tamim dari Abu Sa'id Al Khudri bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada kurma yang kurang dari lima wasaq, tidak ada zakat pada perak yang kurang dari lima uqiyah dan tidak ada zakat pada unta yang kurang dari lima ekor.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124840",
    "last_updated": null
  },
  {
    "indonesianURN": "3224310",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1127",
    "babName": "Zakat uang perak",
    "hadithNumber": "2431",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur Ath-Thusi dia berkata; telah menceritakan kepada kami Ya'qub dia berkata; Bapakku telah menceritakan kepada kami, dia berkata; Telah menceritakan kepada kami Ibnu Ishaq dia berkata; Telah menceritakan kepadaku Muhammad bin Yahya bin Hibban dan Muhammad bin 'Abdullah bin 'Abdurrahman bin Abu Sha'sha'ah -dan mereka berdua adalah tsiqah- dari Yahya bin 'Umarah bin Abu Hasan dan 'Abbad bin Tamim -dan mereka berdua adalah tsiqah- dari Abu Sa'id Al Khudri bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada perak yang kurang dari lima uqiyah dan tidak ada zakat pada unta yang kurang dari lima ekor dan tidak ada zakat pada (biji-bijian) yang kurang dari lima wasaq.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124850",
    "last_updated": null
  },
  {
    "indonesianURN": "3224320",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1127",
    "babName": "Zakat uang perak",
    "hadithNumber": "2432",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan dia berkata; telah menceritakan kepada kami Abu Usamah dia berkata; telah menceritakan kepada kami Sufyan dari Abu Ishaq dari 'Ashim bin Dhamrah dari 'Ali radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh aku telah membebaskan diri dari -kewajiban mengeluarkan sedekah- kuda dan budak, maka tunaikanlah zakat harta kalian dari setiap dua ratus (dirham) lima dirham.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124860",
    "last_updated": null
  },
  {
    "indonesianURN": "3224330",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1127",
    "babName": "Zakat uang perak",
    "hadithNumber": "2433",
    "hadithText": "Telah mengabarkan kepada kami Husain bin Manshur dia berkata; telah menceritakan kepada kami Ibnu Numair dia berkata; telah menceritakan kepada kami Al A'masy dari Abu Ishaq dari 'Ashim bin Dhamrah dari 'Ali radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh aku telah membebaskan diri dari -kewajiban mengeluarkan sedekah- kuda dan budak, dan tidak ada zakat pada harta yang kurang dari dua ratus dirham.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124870",
    "last_updated": null
  },
  {
    "indonesianURN": "3224350",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1129",
    "babName": "Tidak mau membayar zakat",
    "hadithNumber": "2435",
    "hadithText": "Telah mengabarkan kepada kami Al Fadhl bin Sahl dia berkata; Telah menceritakan kepada kami Abu An Nadhr Hasyim bin Al Qasim dia berkata; Telah menceritakan kepada kami 'Abdul 'Aziz bin 'Abdullah bin Abu Salamah dari 'Abdullah bin Dinar dari Ibnu 'Umar ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Orang yang tidak mau menunaikan zakat hartanya, pada hari Kiamat hartanya itu diubah seperti ular berkepala putih (karena banyak racunnya) yang memiliki dua titik hitam di atas matanya atau dua taringnya.\" -Ibnu Umar berkata- Lalu ular itu mengikutinya -atau mengulanginya, ia menuturkan-, ular itu berkata; 'Akulah harta simpananmu, akulah harta simpananmu'.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124900",
    "last_updated": null
  },
  {
    "indonesianURN": "3224360",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1129",
    "babName": "Tidak mau membayar zakat",
    "hadithNumber": "2436",
    "hadithText": "Telah mengabarkan kepada kami Al Fadhl bin Sahl dia berkata; Telah menceritakan kepada kami Hasan bin Musa Al Asyyab dia berkata; Telah menceritakan kepada kami 'Abdurrahman bin 'Abdullah bin Dinar Al Madani dari bapaknya dari Abu Shalih dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang diberi harta oleh Allah -Azza wa Jalla-, lalu ia tidak menunaikan zakatnya, maka hartanya akan diubah pada hari Kiamat seperti seekor ular berkepala putih (karena banyak racunnya) serta memiliki dua titik hitam di atas matanya atau dua taring, memangsa dengan kedua tulang rahangnya pada hari Kiamat, lalu mengatakan, 'Akulah harta simpananmu, akulah harta simpananmu'.\" Kemudian membaca ayat ini: 'Janganlah sekali-kali orang-orang yang bakhil dengan harta yang Allah berikan kepada mereka dari karunia-Nya menyangka....' dan seterusnya.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124910",
    "last_updated": null
  },
  {
    "indonesianURN": "3224370",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1130",
    "babName": "Zakat kurma",
    "hadithNumber": "2437",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin Al Mubarak dia berkata; Telah menceritakan kepada kami Waki' dari Sufyan dari Isma'il bin Umayyah dari Muhammad bin Yahya bin Habban dari Yahya bin 'Umarah dari Abu Sa'id Al Khudri dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada biji-bijian atau kurma yang kurang dari lima wasaq.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124920",
    "last_updated": null
  },
  {
    "indonesianURN": "3224380",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1131",
    "babName": "Zakat gandum",
    "hadithNumber": "2438",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud dia berkata; telah menceritakan kepada kami Yazid bin Zurai' dia berkata; Telah menceritakan kepada kami Rauh bin Al Qasim dia berkata; Telah menceritakan kepadaku 'Amru bin Yahya bin 'Umarah dari bapaknya dari Abu Sa'id Al Khudri dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak halal mengeluarkan zakat pada gandum dan kurma hingga mencapai lima wasaq, tidak halal mengeluarkan zakat pada perak hingga mencapai lima uqiyah dan tidak halal mengeluarkan zakat pada unta hingga mencapai lima ekor.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124930",
    "last_updated": null
  },
  {
    "indonesianURN": "3224390",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1132",
    "babName": "Zakat biji-bijian",
    "hadithNumber": "2439",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dia berkata; telah menceritakan kepada kami 'Abdurrahman dia berkata; telah menceritakan kepada kami Sufyan dari Isma'il bin Umayyah dari Muhammad bin Yahya bin Habban dari Yahya bin 'Umarah dari Abu Sa'id Al Khudri bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada biji-bijian dan kurma hingga mencapai lima wasaq, tidak ada zakat pada unta yang kurang dari lima ekor dan tidak ada pula zakat pada perak yang kurang dari lima uqiyah.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124940",
    "last_updated": null
  },
  {
    "indonesianURN": "3224400",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1133",
    "babName": "Ukuran dikenaik kewajiban zakat",
    "hadithNumber": "2440",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin Al Mubarak dia berkata; telah menceritakan kepada kami Waki' dia berkata; telah menceritakan kepada kami Idris Al Audi dari 'Amru bin Murrah dari Abu Al Bukhtari dari Abu Sa'id Al Khudri ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada perak yang kurang dari lima uqiyah.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124950",
    "last_updated": null
  },
  {
    "indonesianURN": "3224410",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1133",
    "babName": "Ukuran dikenaik kewajiban zakat",
    "hadithNumber": "2441",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin 'Abdah dia berkata; telah menceritakan kepada kami Hammad dari Yahya bin Sa'id dan 'Ubaidullah bin 'Umar dari 'Amru bin Yahya dari bapaknya dari Abu Sa'id Al Khudri dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada zakat pada perak yang kurang dari lima uqiyah, tidak ada zakat pada unta yang kurang dari lima ekor dan tidak ada zakat pada biji-bijian yang kurang dari lima wasaq.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124960",
    "last_updated": null
  },
  {
    "indonesianURN": "3224420",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1134",
    "babName": "Yang terkena kewajiban sepersepuluh dan seperdua puluh",
    "hadithNumber": "2442",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Sa'id bin Al Haitsam Abu Ja'far Al Aili dia berkata; telah menceritakan kepada kami Ibnu Wahb dia berkata; telah mengabarkan kepadaku Yunus dari Ibnu Syihab dari Salim dari bapaknya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tanaman yang disiram dengan air hujan, sungai dan mata air atau tanaman yang hanya hidup dengan air hujan, zakatnya sepersepuluh; dan tanaman yang disiram dengan tenaga manusia atau binatang zakatnya separuh dari sepersepuluh (seperduapuluh).\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124970",
    "last_updated": null
  },
  {
    "indonesianURN": "3224430",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1134",
    "babName": "Yang terkena kewajiban sepersepuluh dan seperdua puluh",
    "hadithNumber": "2443",
    "hadithText": "Telah mengabarkan kepadaku 'Amr bin Sawwad bin Al Aswad bin 'Amr dan Ahmad bin 'Amru dan Al Harits bin Miskin secara baca dan aku mendengarnya dari Ibnu Wahb dia berkata; Telah menceritakan kepada kami 'Amru bin Al Harits bahwasanya Abu Az Zubair menceritakan kepadanya bahwasanya dia mendengar Jabir bin 'Abdullah berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tanaman yang disiram dengan air hujan, sungai dan mata air atau tanaman yang hanya hidup dengan air hujan, zakatnya sepersepuluh; dan tanaman yang disiram dengan tenaga manusia atau binatang zakatnya separuh dari sepersepuluh (seperduapuluh).\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124980",
    "last_updated": null
  },
  {
    "indonesianURN": "3224440",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1134",
    "babName": "Yang terkena kewajiban sepersepuluh dan seperdua puluh",
    "hadithNumber": "2444",
    "hadithText": "Telah mengabarkan kepada kami Hannad bin As Sari dari Abu Bakr bin 'Ayyasy dari 'Ashim dari Abu Wa'il dari Mu'adz dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengutusku ke negeri Yaman, lalu beliau memerintahkanku untuk mengambil sepersepuluh hasil tanaman yang disiram dengan air hujan dan separuh dari sepersepuluh (seperduapuluh) hasil tanaman yang disiram dengan tenaga manusia.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124990",
    "last_updated": null
  },
  {
    "indonesianURN": "3224450",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1135",
    "babName": "Berapa tukang taksir membiarkan buah-buahan dalam pohon",
    "hadithNumber": "2445",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dia berkata; Telah menceritakan kepada kami Yahya bin Sa'id dan Muhammad bin Ja'far mereka berdua berkata; Telah menceritakan kepada kami Syu'bah dia berkata; Aku mendengar Khubaib bin 'Abdurrahman menceritakan dari 'Abdurrahman bin Mas'ud bin Niyar dia berkata; Sahl bin Abu Hatsmah datang kepada kami, sedangkan kami sedang berada di pasar, lalu dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian memperkirakan buah yang masih berada di atas pohon dengan taksiran, maka ambillah dan sisakanlah sepertiganya. Jika kalian tidak meninggalkan sepertiganya -Syu'bah merasa ragu- maka tinggalkanlah seperempatnya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125000",
    "last_updated": null
  },
  {
    "indonesianURN": "3224460",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1136",
    "babName": "Firman-Nya \"Jangan kau pilih yang buruk untuk kalian infakkan\"",
    "hadithNumber": "2446",
    "hadithText": "Telah mengabarkan kepada kami Yunus bin 'Abdul A'la dan Al Harits bin Miskin secara baca dan aku mendengarnya dari Ibnu Wahb dia berkata; telah menceritakan kepadaku 'Abdul Jalil bin Humaid Al Yahshabi bahwasanya Ibnu Syihab menceritakan kepadanya, dia berkata; telah menceritakan kepadaku Abu Umamah bin Sahl bin Hunaif tentang ayat yang Allah -Azza wa Jalla- firmankan: \"Dan janganlah kamu memilih yang buruk-buruk lalu kamu menafkahkan daripadanya.\" Ia berkata; 'Yaitu kurma yang jelek dan warna yang tidak segar, Rasulullah shallallahu 'alaihi wasallam melarang diambilkan sesuatu yang hina (jelek, kasar, kualitas rendahan) pada zakat.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125010",
    "last_updated": null
  },
  {
    "indonesianURN": "3224470",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1136",
    "babName": "Firman-Nya \"Jangan kau pilih yang buruk untuk kalian infakkan\"",
    "hadithNumber": "2447",
    "hadithText": "Telah mengabarkan kepada kami Ya'qub bin Ibrahim dia berkata; Telah memberitakan kepada kami Yahya dari 'Abdul Hamid bin Ja'far dia berkata; Telah menceritakan kepadaku Shalih bin Abu 'Arib dari Katsir bin Murrah Al Khadrami dari 'Auf bin Malik dia berkata; Rasulullah shallallahu 'alaihi wasallam keluar dengan memegang tongkat dan seseorang telah menggantungkan ikatan kurma yang paling jelek, lalu beliau mencela ikatan tersebut, kemudian bersabda: \"Ohh, kalaulah saja pemilik zakat ini mengeluarkan zakat yang lebih baik dari iniOh, pemilik zakat ini akan memakan kurma yang paling jelek pada hari Kiamat.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125020",
    "last_updated": null
  },
  {
    "indonesianURN": "3224480",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1137",
    "babName": "Tambang",
    "hadithNumber": "2448",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Abu 'Awanah dari 'Ubaidullah bin Al Akhnas dari Amru bin Syuaib dari ayahnya dari kakeknya dia berkata; Rasulullah shallallahu 'alaihi wasallam ditanya tentang barang temuan, beliau bersabda: \"Jika ia berada di jalan yang sering dilalui ataupun di desa yang ramai penduduknya maka umumkanlah selama setahun, barangkali pemiliknya datang namun jika tidak maka ia menjadi milikmu, dan jika tidak pada jalan yang dilalui atau tidak di desa yang ramai penduduknya maka di dalamnya atau pada harta karun zakatnya seperlima.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125030",
    "last_updated": null
  },
  {
    "indonesianURN": "3224500",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1137",
    "babName": "Tambang",
    "hadithNumber": "2450",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Ibnu Syihab dari Sa'id dan Abu Salamah dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kerusakan akibat binatang ternak tidak ada tanggungan -bagi pemiliknya-, sumur yang digali lalu menyebabkan orang lain tersungkur ke dalamnya tidak ada tanggungan -bagi pemiliknya-, tanah digali untuk mencari barang tambang lalu orang lain tersungkur ke dalamnya tidak ada tanggungan -bagi pemiliknya- dan pada harta karun zakatnya seperlima.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125060",
    "last_updated": null
  },
  {
    "indonesianURN": "3224510",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1137",
    "babName": "Tambang",
    "hadithNumber": "2451",
    "hadithText": "Telah mengabarkan kepada kami Ya'qub bin Ibrahim telah menceritakan kepada kami Husyaim telah memberitakan kepada kami Manshur dan Hisyam dari Ibnu Sirin dari Abu Hurairah radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sumur yang digali lalu menyebabkan orang lain tersungkur ke dalamnya tidak ada tanggungan -bagi pemiliknya-, kerusakan akibat binatang ternak tidak ada tanggungan -bagi pemiliknya-, tanah yang digali untuk mencari barang tambang lalu orang lain tersungkur ke dalamnya tidak ada tanggungan -bagi pemiliknya- dan pada harta karun zakatnya seperlima.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125070",
    "last_updated": null
  },
  {
    "indonesianURN": "3224520",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1138",
    "babName": "Zakat madu",
    "hadithNumber": "2452",
    "hadithText": "Telah mengabarkan kepadaku Al Mughirah bin 'Abdurrahman dia berkata; Telah menceritakan kepada kami Ahmad bin Abu Syu'aib dari Musa bin A'yan dari 'Amr bin Al Harits dari 'Amru bin Syuaib dari ayahnya dari kakeknya ia berkata; \"Hilal datang menemui Rasulullah shallallahu 'alaihi wasallam dengan membawa sepersepuluh madunya dan meminta kepada beliau untuk menjaga lembah -yang dinamakan Salabah-, maka Rasulullah shallallahu 'alaihi wasallam menjaga lembah tersebut untuknya. Saat Umar bin Khaththab menjadi khalifah, Sufyan bin Wahb menulis surat kepada Umar menanyakan tentangnya, \" maka Umar menulis; 'Jika dia memberikan kepadaku zakat yang dahulu ia berikan kepada Rasulullah shallallahu 'alaihi wasallam berupa seperpuluh kurmanya, maka jagalah lebah Salabah tersebut untuknya. Jika tidak, maka itu hanyalah kurma yang mengikuti curah hujan dan yang dimakan oleh orang yang menginginkannya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125080",
    "last_updated": null
  },
  {
    "indonesianURN": "3224530",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1139",
    "babName": "Kewajiban zakat Ramadhan",
    "hadithNumber": "2453",
    "hadithText": "Telah mengabarkan kepada kami 'Imran bin Musa dari 'Abdul Warits dia berkata; Telah menceritakan kepada kami Ayyub dari Nafi' dari Ibnu 'Umar dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mewajibkan zakat Ramadlan atas orang merdeka, budak dan wanita sebesar satu sha' kurma atau satu sha' sya'ir (gandum), lalu orang-orang menyamakannya dengan setengah sha' burr (tepung).\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125090",
    "last_updated": null
  },
  {
    "indonesianURN": "3224540",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1140",
    "babName": "Kewajiban zakat Ramadhan untuk budak",
    "hadithNumber": "2454",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; Telah menceritakan kepada kami Hammad dari Ayyub dari Nafi' dari Ibnu 'Umar dia berkata; Rasulullah shallallahu 'alaihi wasallam mewajibkan zakat fitrah atas laki-laki, wanita, orang merdeka dan budak sebesar satu sha' kurma atau satu sha' gandum.\" Ibnu Umar berkata; 'Lalu orang-orang menyamakannya dengan setengah sha' burr.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125100",
    "last_updated": null
  },
  {
    "indonesianURN": "3224550",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1141",
    "babName": "Kewajiban zakat Ramadhan untuk anak kecil",
    "hadithNumber": "2455",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; Telah menceritakan kepada kami Malik dari Nafi' dari Ibnu 'Umar dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mewajibkan zakat Ramadlan atas setiap anak kecil dan orang tua, orang merdeka dan budak, laki-laki dan wanita sebesar satu sha' kurma atau satu sha' gandum.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125110",
    "last_updated": null
  },
  {
    "indonesianURN": "3224560",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1142",
    "babName": "Kewajiban zakat Ramadhan untuk muslimin, bukan non muslim yang mengikat perjanjian",
    "hadithNumber": "2456",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dan Al Harits bin Miskin secara baca dan aku mendengarnya, lafazh ini miliknya, dari Ibnul Qasim dia berkata; Telah menceritakan kepadaku Malik dari Nafi' dari Ibnu 'Umar bahwa Rasulullah shallallahu 'alaihi wasallam mewajibkan zakat fitrah dari bulan Ramadlan atas manusia sebesar satu sha' kurma atau satu sha' gandum, atas setiap orang merdeka atau budak, laki-laki atau wanita dari kaum muslimin.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125120",
    "last_updated": null
  },
  {
    "indonesianURN": "3224570",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1142",
    "babName": "Kewajiban zakat Ramadhan untuk muslimin, bukan non muslim yang mengikat perjanjian",
    "hadithNumber": "2457",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Muhammad bin As Sakan dia berkata; telah menceritakan kepada kami Muhammad bin Jahdham dia berkata; Telah menceritakan kepada kami Isma'il bin Ja'far dari 'Umar bin Nafi' dari bapaknya dari Ibnu 'Umar dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mewajibkan zakat fitrah sebesar satu sha' kurma atau satu sha' gandum atas orang merdeka dan budak, laki-laki dan wanita, anak kecil dan orang tua dari kaum muslimin dan memerintahkannya agar ditunaikan sebelum orang-orang berangkat melaksanakan shalat.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125130",
    "last_updated": null
  },
  {
    "indonesianURN": "3224580",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1143",
    "babName": "Berapa takaran diwajibkan?",
    "hadithNumber": "2458",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; telah memberitakan kepada kami 'Isa dia berkata; Telah menceritakan kepada kami 'Ubaidulah dari Nafi' dari Ibnu 'Umar dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mewajibkan zakat fitrah atas anak kecil dan orang tua, laki-laki dan wanita, orang merdeka dan budak sebesar satu sha' kurma atau satu sha' gandum.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125140",
    "last_updated": null
  },
  {
    "indonesianURN": "3224590",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1144",
    "babName": "Kewajiban zakat fithri sebelum diturunkan ayat zakat",
    "hadithNumber": "2459",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud dia berkata; Telah menceritakan kepada kami Yazid bin Zurai' dia berkata; Telah memberitakan kepada kami Syu'bah dari Al Hakim bin 'Utaibah dari Al Qasim bin Mukhaimirah dari 'Amru bin Syurahbil dari Qais bin Saad bin Ubadah dia berkata; \"Kami dahulu berpuasa 'Asyura dan menunaikan zakat fitrah. Setelah turun ayat tentang Ramadlan dan kewajiban zakat, kami tidak diperintah menunaikannya dan tidak pula dilarang, namun kami terus melaksanakannya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125150",
    "last_updated": null
  },
  {
    "indonesianURN": "3224600",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1144",
    "babName": "Kewajiban zakat fithri sebelum diturunkan ayat zakat",
    "hadithNumber": "2460",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin Al Mubarak dia berkata; Telah menceritakan kepada kami Waki' dari Sufyan dari Salamah bin Kuhail dari Al Qasim bin Mukhaimirah dari Abu 'Ammar Al Hamdani dari Qais bin Sa'd dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk menunaikan zakat fitrah sebelum turun ayat tentang kewajiban zakat. Setelah turun ayat tentang zakat, beliau tidak memerintahkan dan tidak melarangnya, namun kami terus melaksanakannya.\" Abdurrahman berkata; Abu 'Ammar namanya adalah 'Arib bin Humaid dan 'Amru bin Syurahbil biasa dipanggil dengan Abu Maisarah. Salamah bin kuhail menyelisihi Al Hakam di dalam sanadnya, dan Al Hakam lebih kuat dibanding Salamah bin Kuhail.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125160",
    "last_updated": null
  },
  {
    "indonesianURN": "3224610",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1145",
    "babName": "Takaran zakat fithri",
    "hadithNumber": "2461",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dia berkata; Telah menceritakan kepada kami Khalid bin Al Harits dia berkata; Telah menceritakan kepada kami Humaid dari Al Hasan dia berkata; Pada akhir bulan Ibnu 'Abbas -yang waktu itu dia memimpin kota Bashrah- berkata; \"Keluarkanlah zakat puasa kalian!\". Orang-orang pun saling memandang satu sama lainnya, Ibnu Abbas melanjutkan; 'Adakah disini penduduk Madinah, berdirilah kalian dan beritahukanlah kepada sahabat-sahabat kalian karena mereka tidak mengetahui bahwa zakat ini adalah zakat yang diwajibkan Rasulullah shallallahu 'alaihi wasallam kepada setiap laki-laki maupun perempuan, orang merdeka ataupun budak, satu sha' gandum atau kurma, atau setengah sha' tepung, maka tunaikanlah. Hisyam menyelisihinya, dia berkata; 'Dari Muhammad bin Sirin.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125170",
    "last_updated": null
  },
  {
    "indonesianURN": "3224620",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1145",
    "babName": "Takaran zakat fithri",
    "hadithNumber": "2462",
    "hadithText": "Telah mengabarkan kepada kami 'Ali bin Maimun dari Makhlad dari Hisyam dari Ibnu Sirin dari Ibnu 'Abbas dia berkata; Rasulullah shallallahu 'alaihi wasallam menyebutkan zakat fitrah beliau bersabda; 'Satu sha', tepung atau kurma atau gandum atau sejenis gandum -yang berwarna putih tak berkulit-.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125180",
    "last_updated": null
  },
  {
    "indonesianURN": "3224630",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1145",
    "babName": "Takaran zakat fithri",
    "hadithNumber": "2463",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; Telah menceritakan kepada kami Hammad dari Ayyub dari Abu Raja' dia berkata; \"Aku mendengar Ibnu 'Abbas berkhutbah di atas mimbar kalian -yaitu mimbar Bashrah- mengatakan; 'Zakat fitrah sebesar satu sha' makanan'.\" Abu Abdurrahman berkata; 'Hadits ini lebih kuat dari ketiga Hadits lainnya.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125190",
    "last_updated": null
  },
  {
    "indonesianURN": "3224640",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1146",
    "babName": "Kurma dalam zakat fitri",
    "hadithNumber": "2464",
    "hadithText": "Telah mengabarkan kepadaku Muhammad bin 'Ali bin Harb dia berkata; Telah menceritakan kepada kami Muhriz bin Al Wadhdhah dari Isma'il bin Umayyah dari Al Harits bin 'Abdurrahman bin Abu Dzubab dari 'Iyadl bin 'Abdullah bin Abu Sarh dari Abu Sa'id Al Khudri dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mewajibkan zakat fitrah sebesar satu sha' gandum, satu sha' kurma atau satu sha' susu kering.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125200",
    "last_updated": null
  },
  {
    "indonesianURN": "3224650",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1147",
    "babName": "Kismis",
    "hadithNumber": "2465",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin Al Mubarak dia berkata; Telah menceritakan kepada kami Waki' dari Sufyan dari Zaid bin Aslam dari 'Iyadh bin 'Abdullah bin Abu Sarh dari Abu Sa'id dia berkata; \"Kami mengeluarkan zakat fitrah ketika Rasulullah shallallahu 'alaihi wasallam masih ada di antara kami sebesar satu sha' makanan, satu sha' gandum, satu sha' kurma, satu sha'anggur kering atau satu sha' susu kering.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125210",
    "last_updated": null
  },
  {
    "indonesianURN": "3224660",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1147",
    "babName": "Kismis",
    "hadithNumber": "2466",
    "hadithText": "Telah mengabarkan kepada kami Hannad bin As Sariy dari Waki' dari Dawud bin Qais dari 'Iyadh bin 'Abdullah dari Abu Sa'id dia berkata; \"Kami mengeluarkan zakat fitrah ketika Rasulullah shallallahu 'alaihi wasallam masih ada di antara kami sebesar satu sha' makanan, satu sha' kurma, satu sha' gandum atau satu sha' susu kering. Kami terus melaksanakan seperti itu hingga Mu'awiyah datang dari Syam. Dan di antara yang ia ajarkan kepada orang-orang adalah: Ia berkata; \"Kami tidak melihat dua mud gandum Syam kecuali menyamai satu sha' dari ini.\" Abu Sa'id berkata; 'Maka orang-orang mengambil pendapat tersebut'.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125220",
    "last_updated": null
  },
  {
    "indonesianURN": "3224670",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1148",
    "babName": "(Daqiq) Gandum yang sudah halus",
    "hadithNumber": "2467",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur dia berkata; Telah menceritakan kepada kami Sufyan dari Ibnu 'Ajlan dia berkata; Aku mendengar 'Iyadh bin 'Abdullah mengabarkan dari Abu Sa'id Al Khudri dia berkata; \"Kami tidak pernah mengeluarkan zakat fitrah di zaman Rasulullah shallallahu 'alaihi wasallam kecuali satu sha' kurma, satu sha' gandum, satu sha' anggur kering, satu sha' tepung, satu sha' susu kering atau satu sha' sejenis gandum -yang berwarna putih tak berkulit-.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125230",
    "last_updated": null
  },
  {
    "indonesianURN": "3224680",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1149",
    "babName": "(Hintah) Biji gandum",
    "hadithNumber": "2468",
    "hadithText": "Telah mengabarkan kepada kami 'Ali bin Hujr dia berkata; Telah menceritakan kepada kami Yazid bin Harun dia berkata; Telah menceritakan kepada kami Humaid dari Al Hasan bahwasanya Ibnu 'Abbas berkhutbah di Bashrah dia berkata; \"Tunaikanlah zakat puasa kalian!\". Orang-orangpun saling memandang satu sama lainnya, Ibnu Abbas melanjutkan; 'Adakah disini penduduk Madinah?, berdirilah kalian dan beritahukanlah kepada sahabat-sahabat kalian karena mereka tidak mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam telah mewajibkan zakat fitrah kepada yang kecil maupun yang dewasa, orang merdeka ataupun budak, laki-laki maupun perempuan setengah sha' tepung atau satu sha' kurma, atau gandum. Al Hasan berkata; Ali berkata; 'Adapun Jika Allah melapangkan kalian, berbuat lapangkanlah kalian, keluarkanlah satu sha' tepung atau yang lainnya.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125240",
    "last_updated": null
  },
  {
    "indonesianURN": "3224690",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1150",
    "babName": "(Salat) Gandum yang kulitnya sudah dihilangkan",
    "hadithNumber": "2469",
    "hadithText": "Telah mengabarkan kepada kami Musa bin 'Abdurrahman dia berkata; Telah menceritakan kepada kami Husain dari Zaidah dia berkata; Telah menceritakan kepada kami 'Abdul 'Aziz bin Abu Rawwad dari Nafi' dari Ibnu 'Umar dia berkata; \"Dahulu orang-orang mengeluarkan zakat fitrah di zaman Nabi shallallahu 'alaihi wasallam sebesar satu sha' gandum, kurma, atau sejenis gandum -yang berwarna putih tak berkulit- atau anggur kering.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125250",
    "last_updated": null
  },
  {
    "indonesianURN": "3224700",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1151",
    "babName": "(Sya'ir) Gandum yang sudah ditapis",
    "hadithNumber": "2470",
    "hadithText": "Telah mengabarkan kepada kami 'Umar bin 'Ali dia berkata; telah menceritakan kepada kami Yahya dia berkata; Telah menceritakan kepada kami Dawud bin Qais dia berkata; Telah menceritakan kepada kami 'Iyadl dari Abu Sa'id Al Khudri dia berkata; \"Kami mengeluarkan zakat fitrah di masa Rasulullah shallallahu 'alaihi wasallam sebesar satu sha' gandum, kurma, anggur kering atau susu kering, kami terus melaksanakan hal itu hingga pada masa Mu'awiyah, ia berkata; 'Aku tidak melihat dua mud gandum Syam kecuali menyamai satu sha' gandum'.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125260",
    "last_updated": null
  },
  {
    "indonesianURN": "3224710",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1152",
    "babName": "Keju (Susu dikeringkan)",
    "hadithNumber": "2471",
    "hadithText": "Telah mengabarkan kepada kami 'Isa bin Hammad dia berkata; Telah memberitakan kepada kami Al Laits dari Yazid dari 'Abdullah bin 'Abdullah bin 'Utsman bahwasanya 'Iyadh bin 'Abdullah bin Sa'd menceritakan kepadanya bahwasanya Abu Sa'id Al Khudri berkata; \"Kami pernah mengeluarkan zakat fitrah di masa Rasulullah shallallahu 'alaihi wasallam sebesar satu sha' kurma, satu sha' gandum atau satu sha' susu kering. Kami tidak mengeluarkan yang lain.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125270",
    "last_updated": null
  },
  {
    "indonesianURN": "3224720",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1153",
    "babName": "Berapa sha'",
    "hadithNumber": "2472",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Zurarah dia berkata; Telah memberitakan kepada kami Al Qasim bin Malik dari Al Ju'aid aku mendengar As Saib bin Yazid berkata; \"Satu sha' pada masa Rasulullah shallallahu 'alaihi wasallam adalah satu mud dan duapertiga takaran -dua telapak tangan- kalian sekarang dan ditambahkan sedikit.\" Abu Abdurrahman berkata; 'Dan telah menceritakan kepadaku Ziyad bin Ayyub.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125280",
    "last_updated": null
  },
  {
    "indonesianURN": "3224730",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1153",
    "babName": "Berapa sha'",
    "hadithNumber": "2473",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman dia berkata; Telah menceritakan kepada kami Abu Nu'aim dia berkata; Telah menceritakan kepada kami Sufyan dari Hanzhalah dari Thawus dari Ibnu 'Umar dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Takaran (yang benar) itu ialah takaran penduduk Madinah, dan timbangan (yang benar) itu ialah timbangan penduduk Makkah.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125290",
    "last_updated": null
  },
  {
    "indonesianURN": "3224740",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1154",
    "babName": "Waktu yang disunnahkan membayar zakat fitri",
    "hadithNumber": "2474",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Ma'dan bin 'Isa dia berkata; Telah menceritakan kepada kami Al Hasan; Telah menceritakan kepada kami Zuhair; Telah menceritakan kepada kami Musa. Demikian juga diriwiyatkan dari jalur lainnya, dia berkata; Dan telah memberitakan kepada kami Muhammad bin 'Abdullah bin Bazi' dia berkata; Telah menceritakan kepada kami Al Fudlail dia berkata; Telah menceritakan kepada kami Musa dari Nafi' dari Ibnu 'Umar bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk menunaikan zakat fitrah sebelum orang-orang berangkat untuk melaksanakan shalat. Ibnu Bazi' berkata; 'Zakat Fitrah'.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125300",
    "last_updated": null
  },
  {
    "indonesianURN": "3224750",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1155",
    "babName": "Mengeluarkan zakat dari suatu negeri ke negeri lain",
    "hadithNumber": "2475",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin Al Mubarak dia berkata; Telah menceritakan kepada kami Waki' dia berkata; Telah menceritakan kepada kami Zakaria bin Ishaq - dan dia adalah seorang yang tsiqah - dari Yahya bin 'Abdullah bin Shaifi dari Abu Ma'bad dari Ibnu 'Abbas bahwa Nabi shallallahu 'alaihi wasallam mengutus Mu'adz bin Jabal ke negeri Yaman, lalu beliau bersabda: \" Engkau akan mendatangi kaum Ahli Kitab, maka ajaklah mereka untuk bersaksi bahwa tiada ilah (sesembahan) yang berhak disembah kecuali Allah dan bersaksi bahwa aku adalah utusan Allah. Jika mereka menaatimu, maka beritahukanlah kepada mereka bahwa Allah -Azza Wa Jalla- mewajibkan atas mereka shalat lima waktu dalam sehari semalam. Jika mereka menaatimu, beritahukanlah bahwa Allah -Azza Wa Jalla- mewajibkan atas mereka sedekah pada harta mereka yang diambil dari orang-orang kaya di antara mereka lalu diberikan kepada orang-orang fakir diantara mereka. Jika mereka menaatimu dalam hal itu, jauhilah oleh kamu dari harta mereka yang paling berharga, dan takutlah terhadap do'a orang yang dizhalimi, karena tidak ada penghalang di antara doa tersebut dan Allah -Azza Wa Jalla-.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125310",
    "last_updated": null
  },
  {
    "indonesianURN": "3224760",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1156",
    "babName": "Jika memberikan zakat kepada orang kaya diluar perkiraan",
    "hadithNumber": "2476",
    "hadithText": "Telah mengabarkan kepada kami 'Imran bin Bakkar dia berkata; Telah menceritakan kepada kami 'Ali bin 'Ayyasy dia berkata; Telah menceritakan kepada kami Syu'aib dia berkata; Telah menceritakan kepadaku Abu Az Zinad dari apa-apa yang diceritakan kepadanya oleh 'Abdurrahman Al A'raj dari apa-apa yang disebutkan bahwa ia mendengar Abu Hurairah menceritakannya dari Rasulullah Shalallahu 'Alaihi Wa Sallam, beliau bersabda: \"Seorang berkata; 'Sungguh aku benar-benar akan bersedekah! ' Lalu ia keluar dengan membawa sedekahnya dan memberikannya kepada seorang pencuri, maka mereka membicarakannya; 'Seorang pencuri diberi sedekah.' Ia berdoa; 'Ya Allah, segala puji hanya bagi-Mu terhadap seorang pencuri. Sungguh aku benar-benar akan bersedekah.' Lalu ia keluar dengan membawa sedekahnya dan memberikannya kepada seorang wanita yang berzina, maka mereka membicarakannya; 'Malam ini seorang wanita yang berzina diberi sedekah'. Dia berdoa; 'Ya Allah, segala puji hanya bagi-Mu terhadap seorang wanita yang berzina. Sungguh aku benar-benar akan bersedekah'. Lalu ia keluar dengan membawa sedekahnya dan memberikannya kepada orang kaya, maka mereka membicarakannya; 'Seorang kaya diberi sedekah.' Dia berdoa; 'Ya Allah, segala puji hanya bagi-Mu terhadap seorang wanita yang berzina, seorang pencuri dan seorang yang kaya'. Lalu orang tersebut dibawa dan dikatakan kepadanya dalam mimpinya; 'Sedekahmu sungguh telah diterima. Adapun seorang wanita yang berzina, barangkali ia akan menjauhkan diri dari perzinaannya; barangkali seorang pencuri akan menjauhkan diri dari pencuriannya; dan barangkali orang yang kaya akan mengambil pelajaran, lalu ia menginfakkan apa yang Allah -Azza Wa Jalla- telah berikan kepadanya'.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125320",
    "last_updated": null
  },
  {
    "indonesianURN": "3224770",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1157",
    "babName": "Sedekah dari rampasan yang belum dibagi secara resmi",
    "hadithNumber": "2477",
    "hadithText": "Telah mengabarkan kepada kami Al Husain bin Muhammad Adz-Dzari' dia berkata; Telah menceritakan kepada kami Yazid bin Zurai' dia berkata; Telah menceritakan kepada kami Syu'bah dia berkata; telah memberitakan kepada kami Isma'il bin Mas'ud dia berkata; Telah menceritakan kepada kami Bisyr bin Al Mufadhdhal dia berkata; telah menceritakan kepada kami Syu'bah dan lafadz ini milik Bisyr, dari Qatadah dari Abu Al Malih dari bapaknya dia berkata; Aku mendengar Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \" Allah Azza Wa Jalla tidak akan menerima shalat tanpa bersuci dan tidak menerima zakat yang diambil dari mencuri.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125330",
    "last_updated": null
  },
  {
    "indonesianURN": "3224780",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1157",
    "babName": "Sedekah dari rampasan yang belum dibagi secara resmi",
    "hadithNumber": "2478",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; telah menceritakan kepada kami Al Laits dari Sa'id bin Abu Sa'id dari Sa'id bin Yasar bahwasanya ia mendengar Abu Hurairah berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Tidaklah seseorang bersedekah berupa sesuatu yang baik -dan Allah Azza Wa jalla tidak menerima kecuali yang baik- melainkan Ar-Rahman Azza Wa Jalla akan mengambilnya dengan tangan kanan-Nya. Jika sedekah itu berupa satu biji kurma, maka akan bertambah di telapak tangan Ar-Rahman hingga menjadi lebih besar dari gunung; seperti salah seorang dari kalian yang memelihara anak kuda atau anak untanya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125340",
    "last_updated": null
  },
  {
    "indonesianURN": "3224790",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1158",
    "babName": "Kesungguhan ketika dalam keterbatasan",
    "hadithNumber": "2479",
    "hadithText": "Telah mengabarkan kepada kami 'Abdul Wahhab bin 'Abdul Hakim dari Hajjaj, berkata; Ibnu Juraij; Telah mengabarkan kepadaku 'Utsman bin Abu Sulaiman dari 'Ali Al Azdi dari 'Ubaid bin 'Amir dari 'Abdullah bin Hubsyi Al Khats'ami bahwa Nabi shallallahu 'alaihi wasallam ditanya; \"Amal apa yang paling utama?\" Beliau bersabda: \"Keimanan tanpa ada keraguan padanya, jihad tanpa ada kedengkian dan haji mabrur.\" Beliau ditanya; \"Shalat apa yang paling utama?\" Beliau menjawab: \"Lama dalam berdoa ketika shalat; sebelum ruku' dan setelahnya.\" Dikatakan; \"Sedekah apa yang paling utama?\" Beliau menjawab: \"Sedekah yang diupayakan dengan kerja keras saat rejekinya terbatas.\" Dikatakan; \"Hijrah apa yang paling utama?\" Beliau menjawab: \"Orang yang berhijrah (meninggalkan) apa yang Allah -Azza Wa Jalla- haramkan.\" Dikatakan; \"Jihad apa yang paling utama?\" Beliau menjawab: \"Orang yang berjihad melawan kaum musyrikin dengan harta dan jiwanya.\" Dikatakan; \"Mati apa yang paling mulia?\" Beliau menjawab: \"Orang yang darahnya dialirkan dan kudanya disembelih.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125350",
    "last_updated": null
  },
  {
    "indonesianURN": "3224800",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1158",
    "babName": "Kesungguhan ketika dalam keterbatasan",
    "hadithNumber": "2480",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; Telah menceritakan kepada kami Al Laits dari Ibnu 'Ajlan dari Sa'id bin Abu Sa'id dan Al Qa'qa' dari Abu Hurairah bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Satu Dirham -pahalanya- bisa mendahului seratus ribu Dirham.\" Mereka bertanya; 'Bagaimana hal itu? ' Beliau bersabda: 'Seseorang memiliki uang dua Dirham, lalu mensedekahkan satu Dirham; dan seseorang pergi ke tempat hartanya yang melimpah ruah, ia mengambil darinya seratus ribu Dirham, lalu ia bersedekah dengannya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125360",
    "last_updated": null
  },
  {
    "indonesianURN": "3224810",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1158",
    "babName": "Kesungguhan ketika dalam keterbatasan",
    "hadithNumber": "2481",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id dia berkata; Telah menceritakan kepada kami Shafwan bin 'Isa dia berkata; telah menceritakan kepada kami Ibnu 'Ajlan dari Zaid bin Aslam dari Abu Shalih dari Abu Hurairah dia berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Satu Dirham -pahalanya- bisa memenangkan seratus ribu Dirham.\" Mereka bertanya; \"Bagaimana hal itu?\" Beliau bersabda: \"Seorang memiliki uang dua Dirham, lalu mengambil satu Dirham dan bersedekah dengannya; dan seseorang memiliki harta yang banyak, lalu ia mengambil seratus ribu dari harta yang melimpah, kemudian ia bersedekah dengannya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125370",
    "last_updated": null
  },
  {
    "indonesianURN": "3224820",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1158",
    "babName": "Kesungguhan ketika dalam keterbatasan",
    "hadithNumber": "2482",
    "hadithText": "Telah mengabarkan kepada kami Al Husain bin Huraits dia berkata; Telah memberitakan kepada kami Al Fadhl bin Musa dari Al Husain dari Manshur dari Syaqiq dari Abu Mas'ud dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam memerintahkan kami untuk bersedekah, lalu salah seorang di antara kami tidak mendapatkan sesuatu yang bisa disedekahkan, hingga ia pergi ke pasar dan membawa sesuatu di atas punggungnya, lalu datang dengan membawa satu mud -hasil kerja kerasnya- yang ia berikan kepada Rasulullah Shalallahu 'Alaihi Wa Sallam. Sungguh sekarang aku mengetahui seseorang yang memiliki seratus ribu yang sebelumnya ia tidak memiliki satu dirhampun.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125380",
    "last_updated": null
  },
  {
    "indonesianURN": "3224830",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1158",
    "babName": "Kesungguhan ketika dalam keterbatasan",
    "hadithNumber": "2483",
    "hadithText": "Telah mengabarkan kepada kami Bisyr bin Khalid dia berkata; Telah menceritakan kepada kami Ghundar dari Syu'bah dari Sulaiman dari Abu Wa'il dari Abu Mas'ud dia berkata; \"Setelah Rasulullah Shalallahu 'Alaihi Wa Sallam memerintahkan kami untuk bersedekah, maka Abu Uqail bersedekah dengan satu sha', dan datang seseorang dengan membawa lebih banyak dari itu, lalu orang-orang munafik berkata; \" Allah Azza Wa Jalla benar-benar tidak membutuhkan sedekah orang ini, orang ini tidak melakukannya kecuali dengan riya'. Lalu turun ayat: 'Orang-orang munafik itu yaitu orang-orang yang mencela orang-orang mukmin yang memberi sedekah dengan sukarela dan (mencela) orang-orang yang tidak memperoleh (untuk disedekahkan) selain sekadar kesanggupannya.\" (Qs. At Taubah 9: 79).</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125390",
    "last_updated": null
  },
  {
    "indonesianURN": "3224840",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1159",
    "babName": "Tangan diatas",
    "hadithNumber": "2484",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; Telah menceritakan kepada kami Sufyan dari Az Zuhri dia berkata; telah mengabarkan kepadaku Sa'id dan 'Urwah keduanya mendengar Hakim bin Hizam berkata; \"Aku meminta kepada Rasulullah Shalallahu 'Alaihi Wa Sallam, lalu beliau memberiku. Kemudian aku meminta, lalu beliau memberiku. Kemudian aku meminta -lagi-, lalu beliau memberiku. Kemudian beliau bersabda: \" Harta ini hijau lagi manis. Barangsiapa yang mengambil dengan kerelaan jiwa, akan diberkahi; dan barangsiapa yang mengambilnya dengan kesombongan diri, ia tidak akan diberkahi. Hal itu seperti orang yang makan dan tidak merasa kenyang. Tangan di atas lebih baik daripada tangan di bawah'.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125400",
    "last_updated": null
  },
  {
    "indonesianURN": "3224850",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1160",
    "babName": "Mana yang disebut tangn diatas",
    "hadithNumber": "2485",
    "hadithText": "Telah mengabarkan kepada kami Yusuf bin 'Isa dia berkata; Telah memberitakan kepada kami Al Fadl bin Musa dia berkata; telah menceritakan kepada kami Yazid bin Ziyad bin Abul Ja'd dari Jami' bin Syaddad dari Thariq Al Muharibi dia berkata; \"kami sampai di Madinah dan ternyata Rasulullah Shallallahu'alaihi wa Sallam berdiri diatas mimbar berkhutbah dihadapan manusia, beliau bersabda: \"Tangan seorang pemberi adalah diatas, mulailah dengan yang engkau tanggung, ibumu, ayahmu saudari dan saudaramu, kemudian yang dibawahmu dan yang berada dibawahmu.\" Secara ringkas.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125410",
    "last_updated": null
  },
  {
    "indonesianURN": "3224860",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1161",
    "babName": "Tangan dibawah",
    "hadithNumber": "2486",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Nafi' dari 'Abdullah bin 'Umar bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: -Beliau menyebutkan tentang sedekah dan enggan untuk meminta-minta-: \"Tangan di atas lebih baik daripada tangan di bawah. Tangan di atas adalah orang yang berinfak dan tangan yang di bawah adalah orang yang meminta-minta.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125420",
    "last_updated": null
  },
  {
    "indonesianURN": "3224870",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1162",
    "babName": "Sedekah ketika kebutuhan telah terpenuhi",
    "hadithNumber": "2487",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; Telah menceritakan kepada kami Bakr dari Ibnu 'Ajlan dari bapaknya dari Abu Hurairah dari Rasulullah Shalallahu 'Alaihi Wa Sallam, beliau bersabda: \"Sedekah yang paling utama ialah yang diambil dari sisa kebutuhan sendiri. Dan tangan di atas lebih baik daripada tangan yang di bawah, dan mulailah -memberi- orang yang menjadi tanggunganmu.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125430",
    "last_updated": null
  },
  {
    "indonesianURN": "3224880",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1163",
    "babName": "Penafsiran",
    "hadithNumber": "2488",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin 'Ali dan Muhammad bin Al Mutsanna dia berkata; Telah menceritakan kepada kami Yahya dari Ibnu 'Ajlan dari Sa'id dari Abu Hurairah dia berkata; Rasulullah Shallallahu'alaihi wa Sallam bersabda: \"Bersedekahlah kalian\", lalu seseorang berkata ya Rasulullah aku hanya memiliki satu dinar, beliau menjawab: \"Bersedekahlah dengannya untuk dirimu, \" ia berkata aku mempunyai yang lain, beliau bersabda: \"Bersedekahlah untuk istrimu, \" ia berkata aku mempunyai yang lain, beliau bersabda: \"Bersedekahlah untuk anakmu, \" ia berkata aku memiliki yang lain, beliau bersabda: \"Bersedekahlah untuk pembantumu, \" ia berkata aku memiliki yang lain, beliau bersabda: \"Engkau lebih tahu yang berhak engkau beri.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125440",
    "last_updated": null
  },
  {
    "indonesianURN": "3224890",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1164",
    "babName": "Jika seseorang bersedekah padahal dirinya perlu, apa ditolak?",
    "hadithNumber": "2489",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin 'Ali dia berkata; Telah menceritakan kepada kami Yahya dia berkata; Telah menceritakan kepada kami Ibnu 'Ajlan dari 'Iyadl dari Abu Sa'id bahwa seseorang masuk ke masjid pada hari Jum'at dan Rasulullah Shalallahu 'Alaihi Wa Sallam sedang berkhutbah, lalu beliau bersabda: \"Shalatlah dua rakaat!\" Kemudian orang itu datang pada Jum'at kedua dan Nabi shallallahu 'alaihi wasallam sedang berkhutbah, lalu beliau bersabda: 'Shalatlah dua rakaat! ' Kemudian orang itu datang pada Jum'at ketiga dan Nabi shallallahu 'alaihi wasallam sedang berkhutbah, lalu beliau bersabda: 'Shalatlah dua rakaat! ' Kemudian bersabda: 'Bersedekahlah kalian! ' Lalu mereka bersedekah dan beliau memberikannya dua pakaian, kemudian bersabda: 'Bersedekahlah kalian! ' Lalu ia melemparkan salah satu pakaiannya, maka Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: 'Tidakkah kalian melihat orang ini bahwa ia masuk ke masjid dengan kondisi yang kusut, aku berharap kalian memahaminya lalu kalian mau bersedekah kepadanya, tetapi kalian tidak melakukannya'. Lalu kukatakan, 'Bersedekahlah kalian! ' Lalu kalian bersedekah dan kuberikan dia dua pakaian. Kemudian kukatakan, 'Bersedekahlah kalian! ' Lalu ia melemparkan salah satu pakaiannya. 'Ambillah pakaianmu'. Dan beliau membentaknya.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125450",
    "last_updated": null
  },
  {
    "indonesianURN": "3224900",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1165",
    "babName": "Sedekah budak",
    "hadithNumber": "2490",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; Telah menceritakan kepada kami Hatim dari Yazid bin Abu 'Ubaid dia berkata; Aku mendengar 'Umair -budak- Abul Lahm, berkata; \"Tuanku menyuruhku membuat dendeng, lalu datanglah seorang miskin dan aku memberi makan darinya, lalu tuanku mengetahui hal itu, iapun memukulku, lalu aku menemui Rasulullah Shallallahu'alaihi wa Sallam dan beliau memanggilnya, beliau bertanya: \" Kenapa engkau memukulnya?\" Ia menjawab, ia memberi makan orang lain dengan makananku tanpa aku suruh, ia berkata lagi; 'Tanpa perintahku', beliau bersabda: 'Pahalanya untuk kalian berdua.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125460",
    "last_updated": null
  },
  {
    "indonesianURN": "3224910",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1165",
    "babName": "Sedekah budak",
    "hadithNumber": "2491",
    "hadithText": "Telah mengabarkan kepadaku Muhammad bin 'Abdul A'la dia berkata; Telah menceritakan kepada kami Khalid dia berkata; Telah menceritakan kepada kami Syu'bah dia berkata; Telah mengabarkan kepadaku Ibnu Abu Burdah dia berkata; Aku mendengar bapakku menceritakan dari Abu Musa dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Wajib bagi setiap muslim untuk bersedekah.\" Dikatakan; 'Bagaimana pendapatmu jika ia tidak mendapatkannya? ' Beliau bersabda: 'Berusaha dengan tangannya, sehingga ia bisa memberi manfaat untuk dirinya dan bersedekah.' Dikatakan; 'Bagaimana jika ia tidak bisa melakukannya? ' Beliau bersabda: 'Menolong orang yang sangat memerlukan bantuan.' Dikatakan; 'Bagaimana jika ia tidak bisa melakukannya? ' Beliau bersabda: 'Menyuruh untuk melakukan kebaikan.' Dikatakan; 'Bagaimana jika ia tidak melakukannya? ' Beliau bersabda: 'Menahan diri dari kejahatan, karena itu adalah sedekah.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125470",
    "last_updated": null
  },
  {
    "indonesianURN": "3224920",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1166",
    "babName": "Sedekah wanita dari rumah suaminya",
    "hadithNumber": "2492",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dan Muhammad bin Basysyar mereka berdua berkata; telah menceritakan kepada kami Muhammad bin Ja'far dia berkata; telah menceritakan kepada kami Syu'bah dari 'Amru bin Murrah dia berkata; Aku mendengar Abu Wa'il menceritakan dari 'Aisyah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika seorang istri bersedekah dari rumah suaminya, maka ia akan mendapatkan pahala. Suaminya juga mendapatkan pahala yang sama dan orang yang diserahi amanat -hartanya- juga mendapatkan pahala yang sama. Dan pahala masing-masing dari keduanya tidak berkurang sedikitpun karena pahala yang lainnya. Bagi suami mendapatkan pahala karena sesuatu yang ia usahakan, dan bagi istri mendapatkan pahala karena sesuatu yang ia infakkan.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125480",
    "last_updated": null
  },
  {
    "indonesianURN": "3224930",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1167",
    "babName": "Pemberian isteri tanpa sepengetahuan suaminya",
    "hadithNumber": "2493",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud dia berkata; Telah menceritakan kepada kami Khalid bin Al Harits dia berkata; Telah menceritakan kepada kami Husain Al Mu'allim dari 'Amru bin Syu'aib bahwasanya bapaknya menceritakan kepadanya, dari 'Abdullah bin 'Amru dia berkata; \"Setelah Rasulullah Shalallahu 'Alaihi Wa Sallam menaklukan kota Mekkah, beliau berdiri seraya bersabda di dalam khutbahnya: 'Tidak boleh seorang istri memberi tanpa izin suaminya'.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125490",
    "last_updated": null
  },
  {
    "indonesianURN": "3224940",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1168",
    "babName": "Keutamaan sedekah",
    "hadithNumber": "2494",
    "hadithText": "Telah mengabarkan kepada kami Abu Dawud dia berkata; Telah menceritakan kepada kami Yahya bin Hammad dia berkata; Telah memberitakan kepada kami Abu 'Awanah dari Firas dari 'Amir dari Masruq dari 'Aisyah radliallahu 'anha bahwa istri-istri Nabi shallallahu 'alaihi wasallam berkumpul di samping beliau, lalu mereka berkata; \"Manakah di antara kita yang paling cepat menyusulmu?\" Maka beliau bersabda: 'Yang paling panjang tangannya di antara kalian.' Maka mereka mengambil bambu dan segera mengukurnya. Ternyata di kemudian hari Saudah adalah yang paling cepat menyusul beliau. Maka mereka sadar bahwa maksud beliau yang paling panjang tangannya adalah yang paling banyak bersedekah.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125500",
    "last_updated": null
  },
  {
    "indonesianURN": "3224950",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1169",
    "babName": "Sedekah mana paling utama?",
    "hadithNumber": "2495",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan dia berkata; Telah menceritakan kepada kami Waki' dia berkata; Telah menceritakan kepada kami Sufyan dari 'Umarah bin Al Qa'qa' dari Abu Zur'ah dari Abu Hurairah dia berkata; Seseorang bertanya; \"Wahai Rasulullah! Sedekah apa yang paling utama?\" Beliau menjawab: 'Kamu bersedekah padahal saat itu kamu dalam keadaan sehat dan sangat berat untuk bersedekah (bakhil), kamu mendambakan kehidupan dan takut fakir.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125510",
    "last_updated": null
  },
  {
    "indonesianURN": "3224960",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1169",
    "babName": "Sedekah mana paling utama?",
    "hadithNumber": "2496",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin 'Ali dia berkata; Telah menceritakan kepada kami Yahya dia berkata; Telah menceritakan kepada kami 'Amru bin 'Utsman dia berkata; Aku mendengar Musa bin Thalhah bahwa Hakim bin Hizam menceritakannya, dia berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Sedekah yang paling utama ialah yang diambil dari sisa kebutuhan sendiri. Dan tangan di atas lebih baik daripada tangan di bawah, dan mulailah -memberi sedekah- orang yang menjadi tanggunganmu.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125520",
    "last_updated": null
  },
  {
    "indonesianURN": "3224970",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1169",
    "babName": "Sedekah mana paling utama?",
    "hadithNumber": "2497",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Sawwad bin Al Aswad bin 'Amru dari Ibnu Wahb dia berkata; Telah memberitakan kepada kami Yunus dari Ibnu Syihab dia berkata; Telah menceritakan kepada kami Sa'id bin Al Musayyab bahwasanya ia mendengar Abu Hurairah berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Sebaik-baik sedekah ialah yang diambil dari sisa kebutuhan sendiri. Dan mulailah -memberi sedekah- orang yang menjadi tanggunganmu.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125530",
    "last_updated": null
  },
  {
    "indonesianURN": "3224980",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1169",
    "babName": "Sedekah mana paling utama?",
    "hadithNumber": "2498",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dia berkata; Telah menceritakan kepada kami Muhammad dia berkata; Telah menceritakan kepada kami Syu'bah dari 'Adi bin Tsabit dia berkata; Aku mendengar 'Abdullah bin Yazid Al Anshari menceritakan dari Abu Mas'ud dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika seseorang memberikan nafkah kepada keluarganya dan ia mengharapkan pahalanya, hal itu adalah sedekah baginya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125540",
    "last_updated": null
  },
  {
    "indonesianURN": "3224990",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1169",
    "babName": "Sedekah mana paling utama?",
    "hadithNumber": "2499",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; Telah menceritakan kepada kami Al Laits dari Abu Az Zubair dari Jabir dia berkata; \"Seseorang dari bani Udzrah -menjanjikan- untuk memerdekakan budaknya setelah ia meninggal, lalu hal itu sampai kepada Rasulullah Shalallahu 'Alaihi Wa Sallam, maka beliau bertanya: 'Apakah kamu memiliki harta selain dia? ' Ia menjawab; 'Tidak'. Lalu Rasulullah Shalallahu 'Alaihi Wa Sallam bertanya: 'Siapakah yang membelinya dariku? ' Lalu Nu'man bin Abdullah Al Adawi membelinya dengan harga delapan ratus Dirham. Ia datang dengan membawa uang tersebut kepada Rasulullah Shalallahu 'Alaihi Wa Sallam, lalu beliau memberikan kepadanya, kemudian beliau bersabda: 'Mulailah dengan dirimu, bersedekahlah padanya. Jika ada kelebihan, maka untuk keluargamu. Jika ada kelebihan dari keluargamu, maka untuk kerabatmu. Jika ada kelebihan dari kerabatmu, maka begini dan begini -beliau bersabda: - yang ada di hadapanmu, di samping kananmu dan di samping kirimu.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125550",
    "last_updated": null
  },
  {
    "indonesianURN": "3225000",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1170",
    "babName": "Sedekah bakhil",
    "hadithNumber": "2500",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur dia berkata; Telah menceritakan kepada kami Sufyan dari Ibnu Juraij dari Al Hasan bin Muslim dari Thawus dia berkata; Aku mendengar Abu Hurairah, kemudian dia berkata; Telah menceritakan kepada kami Abu Az Zinad dari Al A'raj dari Abu Hurairah dia berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \" Perumpamaan orang yang berinfak serta bersedekah dan orang yang bakhil adalah seperti dua orang yang memakai dua jubah -atau dua tameng dari besi-, mulai dari payudara (dada) sampai tulang selangka mereka berdua. Jika orang tersebut ingin berinfak, maka baju besinya melebar atau bergerak hingga menutupi ujung jarinya dan menghilangkan bekas-jalan-nya. Jika orang yang bakhil ingin berinfak, baju besinya mengerut, dan setiap baju besi tetap di tempatnya (tidak melebar) hingga mengambilnya dengan tulang selangkanya atau dengan lehernya.\" Abu Hurairah berkata; 'Aku menyaksikan bahwa ia melihat Rasulullah Shalallahu 'Alaihi Wa Sallam melebarkan tameng besi tetapi tidak melebar.' Thawus berkata; 'Aku mendengar Abu Hurairah -ia memberikan isyarat dengan tangannya- dan beliau melebarkan tameng besi tetapi tidak melebar.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125560",
    "last_updated": null
  },
  {
    "indonesianURN": "3225010",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1170",
    "babName": "Sedekah bakhil",
    "hadithNumber": "2501",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman dia berkata; Telah menceritakan kepada kami 'Affan dia berkata; Telah menceritakan kepada kami Wuhaib dia berkata; Telah menceritakan kepada kami 'Abdullah bin Thawus dari Bapaknya dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam bersabda: \"Permisalan orang bakhil dengan orang yang suka berinfaq adalah seperti dua orang laki-laki yang mengenakan baju besi yang membungkus tulang dadanya. Adapun orang yang suka berinfaq, setiap ia ingin berinfaq baju besi itu seakan akan membesar dan memberikan kelonggaran baginya sehingga dosanya dihapuskan, sedangkan bagi orang yang bakhil setiap ia ingin berinfaq baju besi tersebut mengecil dan menghimpitnya.\" Abu Hurairah berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ia berusaha agar baju besinya lapang, namun tidak bisa lapang.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125570",
    "last_updated": null
  },
  {
    "indonesianURN": "3225020",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1171",
    "babName": "Menghitung sedekah",
    "hadithNumber": "2502",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin 'Abdul Hakam dari Syu'aib; Telah menceritakan kepadaku Al Laits dia berkata; Telah menceritakan kepada kami Khalid dari Ibnu Abu Hilal dari Umayyah bin Hind dari Abu Umamah bin Sahl bin Hunaif dia berkata; \"Pada suatu hari kami duduk-duduk di masjid dengan beberapa orang dari Muhajirin dan Anshar, lalu kami menyuruh seseorang untuk meminta ijin masuk ke rumah 'Aisyah, lalu kami masuk ke rumahnya. Aisyah berkata; suatu kali seseorang masuk ke rumahku dan disisiku ada Rasulullah Shallallahu'alaihi wa sallam, aku menyuruhnya dan aku memanggilnya lalu melarangnya, kemudian Rasulullah Shallallahu'alaihi wa sallam bersabda: \"Apakah engkau mau agar seseorang tidak masuk ke rumahmu dan ia tidak keluar kecuali dengan sepegetahuanmu?\" Aku menjawab; 'Ya, beliau bersabda: \"Tenanglah ya 'Aisyah janganlah engkau menghitung-hitung pemberianmu, maka Allah pun akan memperhitungkan apa yang telah kamu perbuat.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125580",
    "last_updated": null
  },
  {
    "indonesianURN": "3225030",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1171",
    "babName": "Menghitung sedekah",
    "hadithNumber": "2503",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Adam dari 'Abdah dari Hisyam bin 'Urwah dari Fathimah dari Asma' binti Abu Bakr bahwa Nabi shallallahu 'alaihi wasallam bersabda kepada Aisyah: \"Janganlah engkau menghitung-hitung pemberianmu, maka Allah pun akan memperhitungkan apa yang telah kamu perbuat.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125590",
    "last_updated": null
  },
  {
    "indonesianURN": "3225040",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1171",
    "babName": "Menghitung sedekah",
    "hadithNumber": "2504",
    "hadithText": "Telah mengabarkan kepada kami Al Hasan bin Muhammad dari Hajjaj dia berkata; Ibnu Juraij berkata; Telah mengabarkan kepadaku Ibnu Abu Mulaikah dari 'Abbad bin 'Abdullah bin Az Zubair dari Asma' binti Abu Bakr bahwa ia datang menemui Nabi shallallahu 'alaihi wasallam seraya berkata; wahai Nabiyullah, aku tidak mempunyai apa-apa kecuali hanya apa yang telah diberikan Az Zubair kepadaku, apakah aku boleh berinfak dengannya? Beliau menjawab: \"Berinfaklah dan janganlah kamu menahan pemberian, Karena jika demikian Allah akan menahan pemberian-Nya kepadamu.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125600",
    "last_updated": null
  },
  {
    "indonesianURN": "3225050",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1172",
    "babName": "Sedekah sekalipun sedikit",
    "hadithNumber": "2505",
    "hadithText": "Telah mengabarkan kepada kami Nashr bin 'Ali dari Khalid; Telah menceritakan kepada kami Syu'bah dari Al Muhil dari 'Adi bin Hatim dari Nabi shallallahu 'alaihi wasallam bersabda: \"Takutlah kalian dengan api neraka, walaupun dengan menginfakkan sepotong kurma.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125610",
    "last_updated": null
  },
  {
    "indonesianURN": "3225060",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1172",
    "babName": "Sedekah sekalipun sedikit",
    "hadithNumber": "2506",
    "hadithText": "Telah memberitakan kepada kami Isma'il bin Mas'ud dia berkata; Telah menceritakan kepada kami Khalid dia berkata; Telah menceritakan kepada kami Syu'bah bahwa 'Amru bin Murrah Telah menceritakan kepada mereka dari Khaitsamah dari 'Adi bin Hatim dia berkata; Rasulullah shallallahu 'alaihi wasallam menyebutkan tentang neraka, maka wajah beliau berubah (karena takut darinya), lalu beliau berlindung darinya. Syu'bah menyebutkan, bahwa Rasulullah shallallahu 'alaihi wasallam berlindung dari api neraka sebanyak tiga kali, lalu beliau bersabda: \"Takutlah kalian dari api neraka, walaupun dengan menginfakkan sepotong kurma. Jika kalian tidak mendapatkannya, maka dengan kalimat yang baik.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125620",
    "last_updated": null
  },
  {
    "indonesianURN": "3225070",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1173",
    "babName": "Anjuran bersedekah",
    "hadithNumber": "2507",
    "hadithText": "Telah mengabarkan kepada kami Azhar bin Jamil dia berkata; Telah menceritakan kepada kami Khalid bin Al Harits dia berkata; Telah menceritakan kepada kami Syu'bah dia berkata; -dan dia menyebutkan 'Aun bin Abu Juhaifah, - dia berkata; Aku mendengar Al Mundzir bin Jarir bercerita dari Bapaknya dia berkata; \"Kami pernah bersama Nabi shallallahu 'alaihi wasallam di siang hari, tiba-tiba datang suatu kaum dalam keadaan telanjang kaki sambil menggantungkan pedang-pedang mereka. Mayoritas mereka -bahkan seluruhnya- dari kalangan Mudlar. Maka wajah Rasulullah shallallahu 'alaihi wasallam pun berubah karena kemiskinan yang terlihat pada mereka. Kemudian beliau keluar dan menyuruh Bilal untuk mengumandangkan adzan, lalu mendirikan shalat. Kemudian beliau shalat dan setelah itu berkhuthbah seraya bersabda: \" Hai sekalian manusia, bertakwalah kepada Tuhan-mu yang telah menciptakan kamu dari seorang diri, dan dari padanya Allah menciptakan isterinya; dan dari pada keduanya Allah memperkembang biakkan laki-laki dan perempuan yang banyak. Dan bertakwalah kepada Allah yang dengan nama-Nya kamu saling meminta satu sama lain, dan hubungan silaturrahim. Sesungguhnya Allah selalu menjaga dan mengawasi kamu Annisa: 1. Hai orang-orang yang beriman, bertakwalah kepada Allah dan hendaklah setiap diri memperhatikan apa yang telah diperbuatnya untuk hari esok Al Hasyr: 18. Lalu bersabda: 'seseorang bersedekah dengan uang dinarnya, atau dirhamnya, atau pakaiannya, atau satu sha gandum, atau satu sha kurma, hingga beliau bersabda; walaupun dengan sepotong kurma.' Lalu seseorang dari kalangan Anshar datang dengan membawa satu ikat barang yang ia bawa, seolah-olah ia sudah tidak sanggup untuk membawanya. Orang-orangpun berdatangan hingga aku melihat dua karung makanan dan pakaian. Akupun melihat wajah Rasulullah shallallahu 'alaihi wasallam bersinar gembira seperti gemerlapnya emas. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membuat contoh baik di dalam Islam, maka baginya pahala dan pahala orang yang mengamalkan contoh baik tersebut tanpa mengurangi pahala mereka sedikit pun. Dan barang siapa yang membuat contoh buruk di dalam Islam, maka baginya dosa dan dosa orang yang mengamalkan contoh buruk tersebut tanpa mengurangi dosa mereka sedikitpun.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125630",
    "last_updated": null
  },
  {
    "indonesianURN": "3225080",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1173",
    "babName": "Anjuran bersedekah",
    "hadithNumber": "2508",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdul A'la dia berkata; Telah menceritakan kepada kami Khalid dia berkata; Telah menceritakan kepada kami Syu'bah dari Ma'bad bin Khalid dari Haritsah dia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bersedekahlah kalian, karena akan datang kepada kalian suatu zaman ketika seseorang bersedakah, lalu berkatalah orang yang diberi sedekah; \"Kalaulah engkau datang kemarin, pastilah aku terima, adapun sekarang maka aku tidak memerlukan lagi.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125640",
    "last_updated": null
  },
  {
    "indonesianURN": "3225090",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1174",
    "babName": "Sedekah mendatangkan pertolongan",
    "hadithNumber": "2509",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dia berkata; Telah menceritakan kepada kami Yahya dia berkata; Telah menceritakan kepada kami Sufyan dia berkata; Telah mengabarkan kepadaku Abu Burdah bin 'Abdullah bin Abu Burdah dari Kakeknya Abu Burdah dari Abu Musa dari Nabi shallallahu 'alaihi wasallam bersabda: \"Berikanlah pertolongan agar kalian saling memperoleh pahala dan semoga Allah melaksanakan apa yang dikehendaki-Nya melalui ucapan nabi-Nya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125650",
    "last_updated": null
  },
  {
    "indonesianURN": "3225100",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1174",
    "babName": "Sedekah mendatangkan pertolongan",
    "hadithNumber": "2510",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Sa'id dia berkata; Telah memberitakan kepada kami Sufyan dari 'Amru dari Ibnu Munabih dari Saudaranya dari Mu'awiyah bin Abu Sufyan bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya seorang laki-laki telah meminta sesuatu kepadaku lalu aku menolaknya hingga kalian saling menolong kepadanya lalu kalian memperoleh pahala karenanya. Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berikanlah pertolongan agar kalian saling memperoleh pahala.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125660",
    "last_updated": null
  },
  {
    "indonesianURN": "3225110",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1175",
    "babName": "Sedekah diertai kebanggaan",
    "hadithNumber": "2511",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Manshur dia berkata; Telah menceritakan kepada kami Muhammad bin Yusuf dia berkata; Telah menceritakan kepada kami Al Auza'i dari Yahya bin Abu Katsir dia berkata; Telah menceritakan kepadaku Muhammad bin Ibrahim bin Al Harits At Taimi dari Ibnu Jabir dari Bapaknya dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya diantara cemburu itu ada yang disukai Allah dan ada yang dibenci Allah dan diantara sikap sombong itu ada yang disukai Allah dan ada yang dibenci Allah. Cemburu yang disukai Allah adalah cemburu dalam keraguan dan yang dibenci Allah adalah cemburu diluar keraguan, sedangkan sikap sombong yang disukai Allah adalah sombongnya seseorang dengan dirinya di saat perang dan sombong di saat sedekah. Sedangkan sombong yang dibenci Allah adalah sombong dalam kebathilan.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125670",
    "last_updated": null
  },
  {
    "indonesianURN": "3225120",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1175",
    "babName": "Sedekah diertai kebanggaan",
    "hadithNumber": "2512",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman dia berkata; Telah menceritakan kepada kami Yazid dia berkata; Telah menceritakan kepada kami Hammam dari Qatadah dari 'Amru bin Syu'aib dari Bapaknya dari Kakeknya dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Makanlah dan bersedekahlah serta berpakaianlah dengan tidak berlebihan dan sombong.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125680",
    "last_updated": null
  },
  {
    "indonesianURN": "3225130",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1176",
    "babName": "Pahala penjaga kas jika bersedekah seijin majikannya",
    "hadithNumber": "2513",
    "hadithText": "Telah mengabarkan kepadaku 'Abdullah bin Al Haitsam bin 'Utsman dia berkata; Telah menceritakan kepada kami 'Abdurrahman bin Mahdi dia berkata; Telah menceritakan kepada kami Sufyan dari Buraid bin Abu Burdah dari Kakeknya dari Abu Musa dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang mukmin dengan mukmin yang lainnya bagaikan satu bangunan yang sebagiannya dengan sebagian yang lain saling menopang. Beliau juga bersabda: \"Sesungguhnya bendahara yang dapat dipercaya adalah orang yang memberikan apa yang diperintahkan kepadanya secara baik, dan hatinya merasa rela hingga pun menjadi salah satu dari dua pemberi sedekah.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125690",
    "last_updated": null
  },
  {
    "indonesianURN": "3225140",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1177",
    "babName": "Sedekah secara rahasia",
    "hadithNumber": "2514",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dia berkata; Telah menceritakan kepada kami Ibnu Wahb dari Mu'awiyah bin Shalih dari Bahir bin Sa'ad dari Khalid bin Ma'dan dari Katsir bin Murrah dari 'Uqbah bin 'Amir bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang membaca Qur'an dengan suara keras bagaikan orang yang bersedekah secara terang-terangan, dan orang yang membaca Qur'an dengan pelan-pelan, seperti orang yang bersedekah secara sembunyi-sembunyi.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125700",
    "last_updated": null
  },
  {
    "indonesianURN": "3225150",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1178",
    "babName": "Mengungkit-ungkit pemberian",
    "hadithNumber": "2515",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin 'Ali dia berkata; Telah menceritakan kepada kami Yazid bin Zura'i dia berkata; Telah menceritakan kepada kami 'Umar bin Muhammad dari 'Abdullah bin Yasar dari Salim bin 'Abdullah dari Bapaknya dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tiga golongan yang Allah tidak akan melihat mereka pada hari kiamat; anak yang durhaka kepada orang tua, wanita yang menyerupai laki-laki, dan Dayyuts, yaitu seorang yang merelakan keluarganya berbuat kekejian. Dan tiga golongan mereka tidak akan masuk surga; anak yang durhaka kepada orang tua, pecandu khamer, dan orang yang selalu menyebut-nyebut pemberiannya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125710",
    "last_updated": null
  },
  {
    "indonesianURN": "3225160",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1178",
    "babName": "Mengungkit-ungkit pemberian",
    "hadithNumber": "2516",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dari Muhammad dia berkata; Telah menceritakan kepada kami Syu'bah dari 'Ali bin Al Mudrik dari Abu Zur'ah bin 'Amru bin Jarir dari Kharasyah bin Al Hur dari Abu Dzar dari Nabi shallallahu 'alaihi wasallam bersabda: \"Tiga golongan yang tidak akan diajak bicara, tidak akan dilihat dan tidak akan disucikan oleh Allah Azza wa Jalla pada hari kiamat, bagi mereka adzab yang pedih, lalu Rasulullah shallallahu 'alaihi wasallam menyebutkannya, kemudian Abu Dzar berkata; Rugilah mereka, rugilah mereka. Rasulullah shallallahu 'alaihi wasallam bersabda: Orang yang memanjangkan kainnya dibawah mata kaki, orang yang menjual dagangannya dengan sumpah palsu, dan orang yang menyebut-nyebut pemberiannya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125720",
    "last_updated": null
  },
  {
    "indonesianURN": "3225170",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1178",
    "babName": "Mengungkit-ungkit pemberian",
    "hadithNumber": "2517",
    "hadithText": "Telah mengabarkan kepada kami Bisyr bin Khalid dia berkata; Telah menceritakan kepada kami Ghundar dari Syu'bah dia berkata; Aku mendengar Sulaiman yaitu Al A'masy dari Sulaiman bin Mushir dari Kharasyah bin Al Hur dari Abu Dzar dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tiga golongan yang tidak akan diajak bicara, tidak akan dilihat dan tidak akan disucikan oleh Allah Azza wa Jalla pada hari kiamat, dan bagi mereka adzab yang pedih, yaitu orang yang menyebut-nyebut pemberiannya, orang yang memanjangkan kainnya dibawah mata kaki, dan orang yang menjual dagangannya dengan sumpah palsu.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125730",
    "last_updated": null
  },
  {
    "indonesianURN": "3225180",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1179",
    "babName": "Menolak peminta-minta",
    "hadithNumber": "2518",
    "hadithText": "Telah mengabarkan kepadaku Harun bin 'Abdullah dia berkata; Telah menceritakan kepada kami Ma'an dia berkata; Telah menceritakan kepada kami Malik; (Demikian juga diriwayatkan dari jalur lain), Dan telah memberitakan kepada kami Qutaibah bin Sa'id dari Malik dari Zaid bin Aslam dari Ibnu Bujaid Al Anshari dari Neneknya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berilah orang yang meminta-minta walaupun dengan kaki (unta, kambing dsb).\" Sedangkan di dalam hadits Harun disebutkan kata; 'Muhraq' (yang sudah dibakar).</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125740",
    "last_updated": null
  },
  {
    "indonesianURN": "3225190",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1180",
    "babName": "Siapa meminta dan tidak diberi",
    "hadithNumber": "2519",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al A'la dia berkata; Telah menceritakan kepada kami Al Mu'tamir dia berkata; Aku mendengar Bahz bin Hakim bercerita dari Bapaknya dari Kakeknya dia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang datang kepada tuannya untuk meminta suatu kelebihan yang dimilikinya, lalu ia menolaknya, maka pada hari kiamat akan didatangkan kepadanya seekor ular berbisa yang akan menjilat-jilat kelebihan yang dulu ia tidak mau memberikannya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125750",
    "last_updated": null
  },
  {
    "indonesianURN": "3225200",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1181",
    "babName": "Meminta dengan menyebut nama Allah",
    "hadithNumber": "2520",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; Telah menceritakan kepada kami Abu 'Awanah dari Al A'masy dari Mujahid dari Ibnu 'Umar dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang memintamu perlindungan dengan menyebut nama Allah maka berilah dia perlindungan. Dan barangsiapa yang meminta kepada kalian dengan menyebut nama Allah maka berikanlah, dan siapa yang datang kepada kalian meminta bantuan maka berilah ia bantuan, dan barang siapa yang datang kepada kalian dengan kebaikan, maka balaslah ia, jika kalian tidak mendapatkan sesuatu untuk membalasnya maka doakanlah kebaikan baginya hingga kalian merasa telah membalas kebaikannya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125760",
    "last_updated": null
  },
  {
    "indonesianURN": "3225210",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1182",
    "babName": "Meminta dengan menyebuat \"Atas nama wajah Allah\"",
    "hadithNumber": "2521",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdul A'la dia berkata; Telah menceritakan kepada kami Al Mu'tamir dia berkata; Aku mendengar Bahz bin Hakim dia bercerita dari Bapaknya dari Kakeknya dia berkata; Aku berkata; 'Wahai Nabiyullah, Aku tidak mendatangimu hingga aku bersumpah sebanyak (jumlah jari-jari tangannya), bahwa aku tidak akan mendatangimu dan tidak pula memeluk agamamu, dan sesungguhnya aku sekarang adalah seseorang yang tidak mengetahui sesuatupun kecuali apa yang telah Allah dan Rasul-Nya ajarkan kepadaku, Aku bertanya kepadamu karena Allah Azza wa Jalla, dengan apa Allah mengutusmu kepada kami? Rasul menjawab: \"Dengan Islam.\" Ia berkata; Aku bertanya lagi; Apa tanda-tanda Islam itu? Beliau bersabda: \"Hendaklah kamu mengucapkan; 'Aku telah berserah diri dengan wajahku kepada Allah Azza Wa Jalla dan melepaskan semua bentuk penyekutuan, lalu kamu mengerjakan shalat, mengeluarkan zakat. Setiap muslim dengan muslim yang lainnya adalah haram darahnya karena mereka menjadi saling bersaudara. Allah Azza wa Jalla tidak akan menerima amal seorang musyrik yang telah masuk Islam hingga ia meninggalkan negri kaum musyirikin dan pindah ke negri Islam.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125770",
    "last_updated": null
  },
  {
    "indonesianURN": "3225220",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1183",
    "babName": "Siapa yang meminta dengan menyebut nama Allah dan tidak diberi",
    "hadithNumber": "2522",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Rafi' dia berkata; Telah menceritakan kepada kami Ibnu Abu Fudaik dia berkata; Telah memberitakan kepada kami Ibnu Abu Dzi'b dari Sa'id bin Khalid Al Qarizhi dari Isma'il bin 'Abdurrahman dari 'Atha bin Yasar dari Ibnu 'Abbas bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Maukah aku kabarkan kepada kalian mengenai sebaik-baik kedudukan manusia?\" kami menjawab; iya ya Rasulullah, beliau bersabda: \"Seseorang yang memegang tali kudanya di jalan Allah Azza wa Jalla hingga ia mati atau terbunuh, maukah aku kabarkan kalian dengan yang setelahnya?\" kami menjawab; iya ya Rasulullah, beliau bersabda: \"Seseorang yang mengasingkan dari kaumnya lalu ia mendirikan shalat dan membayar zakat, ia mengasingkan dari keburukan manusia, dan maukah aku kabarkan kepada kalian akan seburuk-buruk manusia?\" kami berkata; iya ya Rasulullah, beliau bersabda: \"Yaitu orang yang diminta dengan nama Allah Azza wa Jalla namun ia tidak memberinya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125780",
    "last_updated": null
  },
  {
    "indonesianURN": "3225230",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1184",
    "babName": "Ganjaran si pemberi",
    "hadithNumber": "2523",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dia berkata; Telah menceritakan kepada kami Muhammad dia berkata; Telah menceritakan kepada kami Syu'bah dari Manshur dia berkata; Aku mendengar Rib'i bercerita dari Zaid bin Zhabyan yang ia sandarkan kepada Abu Dzar dari Nabi shallallahu 'alaihi wasallam bersabda: \"Ada tiga golongan yang Allah cintai dan tiga golongan yang Allah benci.\" Adapun tiga golongan yang Allah cintai adalah seseorang yang mendatangi suatu kaum lalu ia meminta karena Allah bukan meminta atas dasar kekerabatan antara dia dengan mereka, namun mereka menolak memberikan kepadanya. Kemudian ada seseorang yang mengikuti dari belakang mereka lalu ia memberikan sesuatu kepada orang yang meminta tadi secara sembunyi-sembunyi tidak ada yang mengetahui dia dan apa yang berikannya kecuali Allah. Dan suatu kaum yang berjalan di malam hari, hingga tidur merupakan sesuatu yang paling disukai mereka, maka mereka pun singgah dan meletakkan kepala-kepala mereka (tidur). Lalu seseorang bangun untuk berdo'a kepadaku dengan penuh ketawadluan dan ia membaca ayat-ayatku. Yang ketiga, adalah seseorang yang ikut dalam sebuah ekspedisi peperangan, hingga tatkala mereka menghadapi musuh dan kalah, ia tetap maju dengan jiwanya hingga ia terbunuh atau Allah memenangkannya. Adapun tiga golongan yang Allah benci adalah orang yang sudah lanjut usia berzina, orang fakir yang sombong, dan orang kaya yang suka berbuat zhalim.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125790",
    "last_updated": null
  },
  {
    "indonesianURN": "3225240",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1185",
    "babName": "Tafsir istilah miskin",
    "hadithNumber": "2524",
    "hadithText": "Telah mengabarkan kepada kami 'Ali bin Hujr dia berkata; Telah memberitakan kepada kami Isma'il dia berkata; Telah menceritakan kepada kami Syarik dari 'Atha bin Yasar dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukanlah orang miskin itu yang datang untuk mendapatkan satu atau dua butir kurma, atau satu atau dua suap makanan, sesungguhnya orang miskin itu adalah orang yang dapat menjaga diri dari meminta-minta, jika kalian mau maka bacalah (ayat): \" mereka tidak meminta kepada orang secara mendesak.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125800",
    "last_updated": null
  },
  {
    "indonesianURN": "3225250",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1185",
    "babName": "Tafsir istilah miskin",
    "hadithNumber": "2525",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Abu Az Zinad dari Al A'raj dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukanlah seorang yang miskin itu yang mengelilingi manusia lalu meminta-minta dan dia mendapatkan sepotong atau dua potong roti, sebutir atau dua butir korma.\" Para shahabat bertanya: 'ya Rasulullah lalu siapakah yang disebut miskin itu? Beliau bersabda: \"Dia adalah orang yang tidak mendapatkan kekayaan untuk mencukupi dirinya dan orang-orang tidak memahami kebutuhannya lalu memberinya sedekah, dan dia tidak bisa mandiri sehingga meminta-minta manusia.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125810",
    "last_updated": null
  },
  {
    "indonesianURN": "3225260",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1185",
    "babName": "Tafsir istilah miskin",
    "hadithNumber": "2526",
    "hadithText": "Telah mengabarkan kepada kami Nashr bin 'Ali dia berkata; Telah menceritakan kepada kami 'Abdul A'la dia berkata; Telah menceritakan kepada kami Ma'mar dari Az Zuhri dari Abu Salamah dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukanlah orang miskin itu yang datang untuk mendapatkan satu atau dua suap makanan atau satu atau dua butir kurma\". Para sahabat bertanya; 'Lalu bagaimanakah orang yang miskin itu ya Rasulullah? Beliau menjawab: \"Yaitu orang yang tidak mempunyai kecukupan untuk hidupnya, dan orang lain tidak mengetahui kebutuhannya hingga berhak mendapat sedekah.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125820",
    "last_updated": null
  },
  {
    "indonesianURN": "3225270",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1185",
    "babName": "Tafsir istilah miskin",
    "hadithNumber": "2527",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; Telah menceritakan kepada kami Al Laits dari Sa'id bin Abu Sa'id dari 'Abdurrahman bin Bujaid dari Kakeknya, Ummu Bujaid -dan ia termasuk orang yang membai'at Rasulullah shallallahu 'alaihi wasallam-, ia berkata kepada Rasulullah; \"Sesungguhnya terdapat seorang miskin yang berdiri di depan pintuku, dan aku tidak memiliki sesuatu yang dapat aku berikan kepadanya. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata kepadanya: \"Apabila engkau tidak mendapatkan sesuatu yang dapat engkau berikan kepadanya kecuali kaki kambing yang telah dibakar, maka berikanlah kepadanya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125830",
    "last_updated": null
  },
  {
    "indonesianURN": "3225280",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1186",
    "babName": "Fakir yang sombong",
    "hadithNumber": "2528",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dia berkata; Telah menceritakan kepada kami Yahya dari Ibnu 'Ajlan dia berkata; Aku mendengar Bapakku bercerita dari Abu Hurairah dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tiga golongan yang tidak akan diajak bicara oleh Allah pada hari kiamat; 'Seorang yang sudah tua berzina, orang miskin namun sombong, dan pemimpin yang pendusta.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125840",
    "last_updated": null
  },
  {
    "indonesianURN": "3225290",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1186",
    "babName": "Fakir yang sombong",
    "hadithNumber": "2529",
    "hadithText": "Telah mengabarkan kepada kami Abu Dawud dia berkata; Telah menceritakan kepada kami 'Arim dia berkata; Telah menceritakan kepada kami Hammad dia berkata; Telah menceritakan kepada kami 'Ubaidullah bin 'Umar dari Sa'id Al Maqburi dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Empat golongan yang Allah Azza wa Jalla membenci mereka; \"Penjual yang suka bersumpah, orang fakir yang sombong, orang tua renta yang berzina, dan pemimpin yang durjana.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125850",
    "last_updated": null
  },
  {
    "indonesianURN": "3225300",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1187",
    "babName": "Keutamaan menyantuni janda",
    "hadithNumber": "2530",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Manshur dia berkata; Telah menceritakan kepada kami 'Abdullah bin Maslamah dia berkata; Telah menceritakan kepada kami Malik dari Tsaur bin Zaid Ad Dili dari Abu Al Ghaits dari Abu Hurairah dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang membantu para janda dan orang-orang miskin seperti orang yang berjihad di jalan Allah.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125860",
    "last_updated": null
  },
  {
    "indonesianURN": "3225310",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1188",
    "babName": "Mu\"allaf",
    "hadithNumber": "2531",
    "hadithText": "Telah mengabarkan kepada kami Hannad bin As Sari dari Abu Al Ahwash dari Sa'id bin Masruq dari 'Abdurrahman bin bin Abu Nu'am dari Abu Sa'id Al Khudri dia berkata; \"Ali yang sedang berada di Yaman mengirimkan emas yang masih kotor dengan tanah kepada Nabi shallallahu 'alaihi wasallam, lalu beliau membagi-bagikannya kepada empat orang, yaitu; Al Aqra` bin Habis Al Hanzhali, 'Uyainah bin Badr Al Fazari, 'Alqamah bin Ulatsah Al 'Amiri, seorang dari bani Kilab, dan Zaid Al Khair Ath Tha`i, dan seorang dari bani Nabhan.\" Abu Sa'id berkata; \"Maka marahlah orang-orang Quraisy -atau di saat lain ia berkata; 'para pemuka Quraisy'- mereka berkata; \"Beliau memberikan kepada para pembesar penduduk Najed dan membiarkan kita semua.\" Beliau bersabda: \"Sesungguhnya aku berbuat demikian karena ingin melunakkan hati mereka.\" Kemudian datanglah seorang laki-laki yang berjanggot lebat, dahinya menonjol keluar, kedua matanya cekung, tulang pipinya tebal dan berkepala botak.\" Laki-laki itu berkata; \"Wahai Muhammad, takutlah engkau kepada Allah, \" Beliau bersabda: \"Lalu siapakah yang takut kepada Allah jika aku melakukan maksiat kepada-Nya, bagaimana penduduk bumi mempercayaiku tapi kenapa kalian tidak mempercayaiku?\" kemudian orang itu mundur ke belakang. Lalu ada seorang sahabat yang meminta izin kepada Rasulullah shallallahu 'alaihi wasallam untuk membunuhnya, mereka menganggap ia adalah Khalid bin Al Walid. Setelah itu beliau bersabda: \"Sesungguhnya dari keturunan orang itu akan muncul suatu kaum yang membaca Al Qur`an namun tidak pernah sampai pada tenggorokan mereka, mereka membunuh orang-orang Islam dan membiarkan para penyembah berhala, mereka keluar dari Islam sebagaimana meluncurnya anak panah dari busurnya, sekiranya aku menjumpai mereka sungguh akan aku bunuh mereka sebagaimana pembunuhan kaum 'Aad.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125870",
    "last_updated": null
  },
  {
    "indonesianURN": "3225320",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1189",
    "babName": "Bersedekah kepada orang yang menanggung beban hutang, diyat, atau lainnya",
    "hadithNumber": "2532",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Habib bin 'Arabi dari Hammad dari Harun bin Riab dia berkata; Telah menceritakan kepadaku Kinanah bin Nu'aim; (Demikian juga diriwayatkan dari jalur lain), Dan telah mengabarkan kepada kami 'Ali bin Hujr dan lafazh ini miliknya; dia berkata; Telah menceritakan kepada kami Isma'il dari Ayyub dari Harun dari Kinanah bin Nu'aim dari Qabishah bin Mukhariq dia berkata; Aku merasa terbebani dengan tanggunganku (berupa diat, atau hutang), lalu aku mendatangi Nabi shallallahu 'alaihi wasallam, aku bertanya kepadanya tentang penyelesaiannya, beliau menjawab: \"Sesungguhnya permintaan itu tidak halal kecuali bagi tiga orang; yaitu orang laki-laki yang mempunyai tanggungan bagi kaumnya, lalu ia meminta-minta hingga ia dapat menyelesaikan tanggungannya, setelah itu ia berhenti (untuk meminta-minta).\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125880",
    "last_updated": null
  },
  {
    "indonesianURN": "3225330",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1189",
    "babName": "Bersedekah kepada orang yang menanggung beban hutang, diyat, atau lainnya",
    "hadithNumber": "2533",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin An Nadlr bin Musawir dia berkata; Telah menceritakan kepada kami Hammad dari Harun bin Ri'ab dia berkata; Telah menceritakan kepadaku Kinanah bin Nu'aim dari Qabishah bin Mukhariq dia berkata; Aku mempunyai beban tanggungan (hutang, atau diat), maka aku mendatangi Rasulullah shallallahu 'alaihi wasallam untuk minta penyelesaiannya. Beliau berkata: \"Berdirilah wahai Qabisah hingga datang kepada kami sedekah, maka kami memerintahkan untuk memberikan kepadamu darinya. Qabisah berkata; lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Qabisah sesungguhnya sedekah itu tidak halal kecuali bagi salah seorang dari tiga golongan; yaitu seorang laki-laki yang menahan tanggungan (di luar kemampuannya), maka halal baginya meminta-minta sehingga dia mendapatkannya yang dapat mencukupi kebutuhan hidupnya, seorang laki-laki yang tertimpa musibah besar hingga habis hartanya, maka halal baginya meminta-minta, sampai dia mendapatkannya lalu ia berhenti dari meminta-minta. Dan seorang laki-laki yang terkena musibah kefaqiran hingga tiga orang dari kaumnya bersaksi seraya berkata: kefaqiran telah menimpa Fulan, maka halal baginya meminta-minta, sehingga ia mampu menegakkan kehidupannya kembali kemudian ia menahan diri dari meminta-minta. wahai Qabishah selain dari tiga golongan itu maka meminta-minta adalah haram. Keharaman yang menyebabkan pelakunya memakan dari barang yang haram.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125890",
    "last_updated": null
  },
  {
    "indonesianURN": "3225340",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1190",
    "babName": "Sedekah kepada anak yatim",
    "hadithNumber": "2534",
    "hadithText": "Telah mengabarkan kepadaku Ziyad bin Ayyub dia berkata; Telah menceritakan kepada kami Isma'il bin 'Ulayyah; dia berkata; Telah mengabarkan kepadaku Hisyam dia berkata; Telah menceritakan kepadaku Yahya bin Abu Katsir dia berkata; Telah menceritakan kepadaku Hilal dari 'Atha bin Yasar dari Abu Sa'id Al Khudri dia berkata; Rasulullah shallallahu 'alaihi wasallam duduk diatas mimbar, dan kami duduk di sekelilingnya, beliau bersabda: \"Hanyasanya aku takutkan atas kalian setelahku, apa yang dibukakan untuk kalian dari kemewahan, \" lalu beliau menyebutkan dunia dan keindahannya, kemudian seseorang bertanya apakah kebaikan datang dengan keburukan? Namun Rasulullah shallallahu 'alaihi wasallam diam, kemudian dikatakan kepada orang itu kenapa engkau mengatakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam dan beliau tidak menjawabmu? Dan ternyata kami melihat bahwa wahyu turun kepada beliau, setelah itu beliau sadar dan mengusap keringatnya yang bercucuran, beliau bersabda: \"Apakah penanya tadi tadi tidak menyaksikan, sesungguhnya kebaikan tidak datang dengan keburukan, dan sungguh apa yang tumbuh pada musim gugur akan terbunuh atau binasa, kecuali pemakan dedaunan karena ia akan memakannya hingga jika kenyang ia akan menghadap matahari dan memuntahkan apa yang ada diperutnya, lalu ia kencing dan kembali merumput, dan sesungguhnya harta ini adalah hijau dan manis, sebaik-baik teman seorang muslim adalah jika ia memberikan dari hartanya kepada seorang yatim, orang miskin dan ibnu sabil, dan sesungguhnya orang yang mengambilnya secara tidak benar seperti halnya orang yang makan namun tidak kenyang dan ia akan menjadi saksi atasnya pada hari kiamat.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125900",
    "last_updated": null
  },
  {
    "indonesianURN": "3225350",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1191",
    "babName": "Sedekah kepada kerabat",
    "hadithNumber": "2535",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la dia berkata; Telah menceritakan kepada kami Khalid dia berkata; Telah menceritakan kepada kami Ibnu 'Aun dari Hafshah dari Ummu Ar Raaih dari Salman bin 'Amir dari Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya sedekah kepada orang miskin pahalanya satu sedekah, sedangkan sedekah kepada kerabat pahalanya dua; pahala sedekah dan pahala silaturrahim.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125910",
    "last_updated": null
  },
  {
    "indonesianURN": "3225360",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1191",
    "babName": "Sedekah kepada kerabat",
    "hadithNumber": "2536",
    "hadithText": "Telah mengabarkan kepada kami Bisyr bin Khalid dia berkata; Telah menceritakan kepada kami Ghundar dari Syu'bah dari Sulaiman dari Abu Wail dari 'Amru bin Al Harits dari Zainab istri 'Abdullah dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda pada para wanita: \"Bersedekahlah walaupun dengan perhiasan kalian dia berkata.\" Zainab berkata; Abdullah adalah seseorang yang ringan tangannya (sedikit harta), maka Zainabberkata kepadanya; Bolehkah jika aku memberikan sedekahku kepadamu dan kepada anak saudaraku yang yatim. Abdullah berkata; 'Tanyakanlah hal itu pada Rasulullah shallallahu 'alaihi wasallam.' lalu saya pergi menuju rumah beliau, ternyata di pintu rumah beliau ada seorang wanita Anshar yang namanya Zainab, dia ingin menanyakan seperti yang akan aku tanyakan. Kemudian Bilal keluar menemui kami, maka kami berkata kepadanya; \"Tolong tanyakan kepada Rasulullah shallallahu 'alaihi wasallam tentang hal itu dan jangan beritahukan kepada beliau siapa kami. Maka ia pun pergi menemui Rasulullah shallallahu 'alaihi wasallam. Kemudian Rasulullah shallallahu 'alaihi wasallam bertanya: \"Siapakah dua orang itu? Bilal menjawab; 'Zainab.' Rasulullah bertanya lagi: 'Zainab yang mana? ' Bilal menjawab; 'Zainab istri Abdullah dan Zainab wanita Anshar, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya bagi mereka dua pahala, pahala karib kerabat dan pahala sedekah.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125920",
    "last_updated": null
  },
  {
    "indonesianURN": "3225370",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1192",
    "babName": "Meminta-minta",
    "hadithNumber": "2537",
    "hadithText": "Telah mengabarkan kepada kami Abu Dawud dia berkata; Telah menceritakan kepada kami Ya'qub bin Ibrahim dia berkata; Telah menceritakan kepada kami Bapakku dari Shalih dari Ibnu Syihab bahwasanya Abu 'Ubaid -mantan budak- 'Abdurrahman bin Azhar telah mengabarkan kepadanya bahwasanya ia mendengar Abu Hurairah berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya salah seorang dari kalian mengikat satu ikat kayu bakar, kemudian mamanggul di atas punggungnya dan menjualnya adalah lebih baik baginya daripada meminta-minta kepada orang lain, yang kadang memberi dan kadang tidak.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125930",
    "last_updated": null
  },
  {
    "indonesianURN": "3225380",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1192",
    "babName": "Meminta-minta",
    "hadithNumber": "2538",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Abdul Hakam dari Syu'aib dari Al Laits bin Sa'd dari 'Ubaidullah bin Abi Ja'far ia berkata; Saya mendengar Hamzah bin Abdullah berkata; Saya mendengar Abdullah bin Umar berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seseorang tiada berhenti meminta-minta, hingga ia datang pada Hari Kiamat dalam keadaan di wajahnya tidak ada daging sedikitpun\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125940",
    "last_updated": null
  },
  {
    "indonesianURN": "3225390",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1192",
    "babName": "Meminta-minta",
    "hadithNumber": "2539",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Utsman bin abu Shafwan Ats Tsaqafi, ia berkata; Telah menceritakan kepada kami Umayyah bin Khalid, ia berkata; Telah menceritakan kepada kami Syu'bah dari Bistham bin Muslim dari Abdullah bin Khalifah dari 'Aidz bin 'Amru, seseorang menemui Nabi shallallahu 'alaihi wasallam lalu ia meminta sesuatu kepada beliau. Beliau memberinya. Tatkala ia meletakkan kakinya didepan pintu, Rasulullah shallallahu 'alaihi wasallam bersabda: \" Jika kalian tahu resiko meminta-minta, tidak ada seorang pun yang pergi kepada seseorang untuk meminta sesuatu kepadanya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125950",
    "last_updated": null
  },
  {
    "indonesianURN": "3225400",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1193",
    "babName": "Meminta orang shalih",
    "hadithNumber": "2540",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; Telah menceritakan kepada kami Al Laits dari Ja'far bin Rabi'ah dari Bakr bin Sawadah dari Muslim bin Makhsyi dari Ibnu Al Firasi, ia berkata kepada Rasulullah shallallahu 'alaihi wasallam; Apakah saya boleh meminta wahai Rasulullah!\" Rasulullah menjawab: \"Tidak, dan seandainya engkau harus meminta, mintalah kepada orang shaleh.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125960",
    "last_updated": null
  },
  {
    "indonesianURN": "3225410",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1194",
    "babName": "Menahan diri untuk tidak meminta",
    "hadithNumber": "2541",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Ibnu Syihab dari 'Atho` bin Yazid dari Abu Sa'id Al Khudri, terdapat beberapa orang dari Anshar meminta kepada Rasulullah, lalu beliau memberi mereka. Kemudian mereka meminta lagi kepadanya, dan beliau memberi mereka hingga habis yang beliau miliki. Beliau bersabda: \"Aku tidak lagi memiliki sesuatu yang baik, aku tidak menyimpannya. Barang siapa yang menjaga kehormatan dirinya, Allah Azza wa Jalla menjaga kehormatannya, dan barang siapa yang bersabar, Allah akan menjadikannya bersabar. Tidaklah seseorang diberi suatu pemberian yang lebih baik dan lebih luas daripada kesabaran.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125970",
    "last_updated": null
  },
  {
    "indonesianURN": "3225420",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1194",
    "babName": "Menahan diri untuk tidak meminta",
    "hadithNumber": "2542",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Syu'aib, ia berkata; Telah memberitakan kepada kami Ma'n, ia berkata; telah memberitakan kepada kami Malik dari Abu Az Zinad dari Al A'raj dari Abu Hurairah bahwa Rasulullallah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku ada di tangan-Nya, sungguh seseorang diantara kalian mengambil talinya kemudian menggendong kayu bakar di atas punggungnya, adalah lebih baik baginya daripada ia datang kepada seseorang yang Allah 'azza wajalla berikan kepadanya sebagian karunianya, kemudian memintanya hingga orang tersebut memberinya atau menolaknya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125980",
    "last_updated": null
  },
  {
    "indonesianURN": "3225430",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1195",
    "babName": "Keutamaan orang yang tidak meminta",
    "hadithNumber": "2543",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali ia berkata; Telah menceritakan kepada kami Yahya, ia berkata; Telah menceritakan kepada kami Ibnu Abu Dzi`b berkata; Telah menceritakan kepadaku Muhammad bin Qais dari Abdur Rahman bin Yazid bin Mu'awiyah dari Tsauban, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang menanggung untukku satu perkara maka baginya Surga.\" Yahya berkata; Di sini terdapat sebuah kata yang maknanya adalah agar tidak meminta sesuatu kepada manusia.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125990",
    "last_updated": null
  },
  {
    "indonesianURN": "3225440",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1195",
    "babName": "Keutamaan orang yang tidak meminta",
    "hadithNumber": "2544",
    "hadithText": "Telah mengabarkan kepada kami Hisyam bin 'Ammar, ia berkata; telah menceritakan kepada kami Yahya yaitu ibnu Hamzah, ia berkata; Telah menceritakan kepadaku Al Auza'i dari Harun bin Riab bahwa ia telah menceritakan kepadanya dari Abu Bakr dari Qubaishah bin Mukhari, ia berkata; Saya telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak baik meminta-minta kecuali bagi tiga orang, seorang laki-laki yang hartanya tertimpa bencana sehingga ia meminta-minta untuk penopang hidupnya kemudian ia menahan diri dari meminta-minta, dan seorang laki-laki yang membawa barang bawaan (milik orang lain) kemudian ia meminta, hingga ia dapat menyampaikan kepada mereka barang bawaan mereka kemudian menahan diri dari meminta-minta, dan seorang laki-laki yang menyumpah tiga orang adil diantara kaumnya yang mempunyai kebutuhan mendesak, ia berkata \"Dengan nama Allah sungguh telah boleh bagi Si Fulan untuk meminta-minta\", kemudian ia meminta hingga mendapatkan penopang kehidupannya kemudian ia menahan diri dari meminta-minta. Selain hal tersebut adalah perkara yang haram.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126000",
    "last_updated": null
  },
  {
    "indonesianURN": "3225450",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1196",
    "babName": "Batasan kaya",
    "hadithNumber": "2545",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman, ia berkata; Telah menceritakan kepada kami Yahya bin Adam, ia berkata; Telah menceritakan kepada kami Sufyan Ats Tsauri dari Hakim bin Jubair dari Muhammad bin Abdur Rahman bin Yazid dari bapaknya dari Abdullah bin Mas'ud, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang meminta-minta sedang ia memiliki sesuatu yang dapat mencukupinya, ia datang dalam keadaan mencakar atau menggaruk bagian pada wajahnya pada Hari Kiamat\" Beliau ditanya; Wahai Rasulullah, sesuatu apakah yang dapat mencukupinya?\" Beliau menjawab: \"Uang lima puluh dirham atau emas yang seukuran dengannya\" Yahya berkata; Sufyan berkata; Dan aku telah mendengar Zubaid menceritakannya dari Muhammad bin Abdur Rahman bin Yazid.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126010",
    "last_updated": null
  },
  {
    "indonesianURN": "3225460",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1197",
    "babName": "Meminta dengan cara menekan (setengah memaksa)",
    "hadithNumber": "2546",
    "hadithText": "Telah mengabarkan kepada kami Al Husain bin Huraits, ia berkata; Telah memberitakan kepada kami Sufyan dari 'Amr dari Wahb bin Munabbih dari saudaranya dari Mu'awiyah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jangan kalian meminta dengan setengah memaksa, dan janganlah salah seorang diantara kalian meminta sesuatu yang tidak aku sukai, sehingga ia mendapat berkah dari yang aku berikan kepadanya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126020",
    "last_updated": null
  },
  {
    "indonesianURN": "3225470",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1198",
    "babName": "Siapa yang dikatakan menekan (setengah memaksa?)",
    "hadithNumber": "2547",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman, ia berkata; Telah memberitahukan kepada kami Yahya bin Adam dari Sufyan bin 'Uyainah dari Daud bin Syabur dari 'Amr bin bin Syu'aib dari ayahnya dari kakekknya ia berkata Rasulullah shallallahu 'alaihi wasallam bersabda: \" Barangsiapa siapa meminta sesuatu kepada orang lain padahal ia memiliki empat puluh dirham, berarti ia orang yang meminta dengan paksaan.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126030",
    "last_updated": null
  },
  {
    "indonesianURN": "3225480",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1198",
    "babName": "Siapa yang dikatakan menekan (setengah memaksa?)",
    "hadithNumber": "2548",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; Telah menceritakan kepada kami Ibnu Abi Ar Rijal dari 'Umarah bin Ghazziyah dari Abdurrahman bin Abu Sa'id Al Khudri dari bapaknya, ia berkata; Ibuku mengutusku datang kepada Rasulullah shallallahu 'alaihi wasallam kemudian aku menemuinya dan duduk, maka beliau menghadap kepadaku dan bersabda: \"Barang siapa yang merasa cukup, Allah Azza wa Jalla memberinya kecukupan, dan barang siapa yang menjaga kehormatan dirinya, Allah 'azza wajalla menjaga kehormatannya, dan barang siapa yang menahan diri dari meminta, Allah 'azza wajalla memberikan kecukupan, dan barang siapa yang meminta-minta sedangkan ia memiliki harta senilai satu uqiyah maka sungguh ia telah meminta dengan setengah paksaan.\" Maka aku katakan; untaku lebih baik dari pada satu uqiyah, kemudian aku kembali dan tidak lagi bertanya kepada beliau.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126040",
    "last_updated": null
  },
  {
    "indonesianURN": "3225490",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1199",
    "babName": "Jika seseorang tidak mempunyai dirham namun mempunyai yang setara",
    "hadithNumber": "2549",
    "hadithText": "Telah berkata Al Harits bin Miskin dengan membacakan riwayat dan aku mendengar dari Ibnu Al Qasim, ia berkata; telah memberitakan kepada kami Malik dari Zaid bin Aslam dari 'Atho` bin Yasar dari seorang laki-laki dari kalangan Bani Asad berkata; aku dan isteriku singgah di sebuah tempat yang terdapat padanya Pohon Ghorqod, kemudian isteriku berkata kepadaku; pergilah kepada Rasulullah shallallah 'alahi wa sallam kemudian mintalah kepada beliau sesuatu yang dapat kita makan. Maka saya pergi kepada Rasulullah shallallahu 'alaihi wasallam. Saya dapati di sisi beliau terdapat seseorang yang meminta kepadanya, dan Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya tidak mendapatkan sesuatu yang dapat saya berikan kepadamu.\" Maka orang tersebut berpaling dari beliau dalam keadaan marah seraya berkata; demi umurku, engkau hanya memberi kepada orang yang engkau kehendaki. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh ia marah kepadaku karena saya tidak mendapatkan sesuatu yang dapat aku berikan kepadanya, barang siapa yang meminta-minta sedangkan ia memiliki satu uqiyah atau yang setara dengannya maka sungguh ia telah meminta dengan setengah memaksa.\" Al Asadi berkata, \"Sungguh satu ekor unta perah kami lebih baik daripada satu uqiyah, sedangkan satu uqiyah adalah empat puluh dirham. Kemudian aku kembali dan tidak bertanya kepada beliau, lalu datang kepada Rasulullah shallallahu 'alaihi wasallam setelah itu gandum dan kismis, maka kemudian beliau membagikan sebagiannya kepada kami hingga Allah 'azza wajalla memberikan kecukupan kepada kami.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126050",
    "last_updated": null
  },
  {
    "indonesianURN": "3225500",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1199",
    "babName": "Jika seseorang tidak mempunyai dirham namun mempunyai yang setara",
    "hadithNumber": "2550",
    "hadithText": "Telah mengabarkan kepada kami Hannad bin As Sari dari Abu Bakr dari Abu Hashin dari Salim dari Abu Hurairah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal sedekah untuk orang yang kaya, dan orang yang sehat kuat dan memiliki kemampuan untuk bekerja.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126060",
    "last_updated": null
  },
  {
    "indonesianURN": "3225510",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1200",
    "babName": "Orang kuat dan mampu bekerja namun meminta",
    "hadithNumber": "2551",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali dan Muhammad bin Al Mutsanna, mereka berkata; telah menceritakan kepada kami Yahya dari Hisyam bin 'Urwah, ia berkata; telah menceritakan kepadaku Ayahku, ia berkata; telah menceritakan kepadaku 'Ubaidullah bin 'Adi bin Al Khiyar, dua orang laki-laki menceritakan kepadanya, mereka berdua datang kepada Rasulullah shallallahu 'alaihi wasallam dan meminta beliau sebagian dari sedekah, maka beliau membolak-balikkan pandangan kepada mereka berdua. Muhammad berkata dengan redaksi; pandangan beliau. Beliau lihat mereka berdua adalah orang yang kuat, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian berdua mau (saya akan memberikannya), namun ingat, sebenarnya tidak ada bagian bagi orang yang kaya dalam sedekah tersebut dan juga tidak bagi orang yang kuat dan bisa berusaha.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126070",
    "last_updated": null
  },
  {
    "indonesianURN": "3225520",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1201",
    "babName": "Seseorang meminta penguasa (pejabat)",
    "hadithNumber": "2552",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman, berkata Muhammad bin Bisyr, ia berkata; telah memberitakan kepada kami Syu'bah dari Abdul Malik dari Zaid bin 'Uqbah dari Samurah bin Jundab, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Sesungguhnya meminta-minta itu (berakibat) seseorang mencakar-cakar wajahnya di hari kiamat, barangsiapa mau, hendaklah ia tinggalkan, kecuali jika seseorang meminta kepada pemimpin atau meminta sesuatu yang harus ia dapatkan.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126080",
    "last_updated": null
  },
  {
    "indonesianURN": "3225530",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1202",
    "babName": "Seseorang meminta ketika kondisi mengharuskan",
    "hadithNumber": "2553",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan, ia berkata; telah menceritakan kepada kami Waki', ia berkata; telah menceritakan kepada kami Sufyan dari Abdul Malik dari Zaid bin 'Uqbah dari Samurah bin Jundab, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Meminta-minta adalah pekerjaan yang berakibat seseorang mencakar wajahnya (di hari kiamat), kecuali seorang laki-laki yang meminta kepada penguasa atau perkara yang harus ia dapatkan.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126090",
    "last_updated": null
  },
  {
    "indonesianURN": "3225540",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1202",
    "babName": "Seseorang meminta ketika kondisi mengharuskan",
    "hadithNumber": "2554",
    "hadithText": "Telah mengabarkan kepada kami Abdul Jabbar bin Al 'Ala` bin Abdul Jabbar dari Sufyan dari Az Zuhri, ia berkata; telah mengabarkan kepada kami 'Urwah dari Hakim bin Hizam, ia berkata; saya pernah meminta Rasulullah shallallahu 'alaihi wasallam, lalu beliau memberiku, kemudian saya meminta kepadanya, lalu beliau memberiku kemudian saya meminta kepadanya lalu beliau memberiku dan Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Hakim, sesungguhnya harta adalah hijau dan manis, barang siapa yang mengambilnya dengan dengan kerelaan hati (orang yang memberi) maka ia akan diberkahi dalam harta tersebut, sebaliknya barang siapa yang mengambilnya dengan ketamakan hati maka ia tidak akan diberkahi dalam hartanya, dan ia seperti orang yang makan akan tetapi tidak merasa kenyang. Tangan yang di atas lebih baik daripada tangan yang di bawah.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126100",
    "last_updated": null
  },
  {
    "indonesianURN": "3225550",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1202",
    "babName": "Seseorang meminta ketika kondisi mengharuskan",
    "hadithNumber": "2555",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman, ia berkata; telah menceritakan kepada kami Miskin bin Bukair, ia berkata; telah menceritakan kepada kami Al Auza'i dari Az Zuhri dari Sa'id bin Al Musayyab dari Hakim bin Hizam, ia berkata; saya pernah meminta? Rasulullah shallallahu 'alaihi wasallam dan beliau memberiku, kemudian saya memintanya dan beliau memberiku, kemudian saya memintanya, dan beliau memberiku, kemudian Rasulullah shallallahu 'alaihi wasallam? bersabda: \"Wahai Hakim, harta ini adalah hijau dan manis, barang siapa yang mengambilnya dengan kelapangan hati (orang yang memberi) maka ia akan diberkati dalam harta tersebut, sedangkan barang siapa mengambilnya dengan ketamakan hati ia tidak diberkahi dalam harta tersebut, dan ia seperti orang yang makan tapi tidak merasakan kenyang. Tangan di atas lebih baik daripada tangan yang di bawah.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126110",
    "last_updated": null
  },
  {
    "indonesianURN": "3225560",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1202",
    "babName": "Seseorang meminta ketika kondisi mengharuskan",
    "hadithNumber": "2556",
    "hadithText": "Telah? mengabarkan kepada kami Ar Rabi' bin Sulaiman bin Daud, ia berkata; telah? menceritakan kepada kami Ishaq bin Bakr, ia berkata;? menceritakan kepadaku ayahku dari 'Amr bin Al Haris dari Ibnu Syihab dari 'Urwah bin Az Zubair serta Sa'id bin Al Musayyab bahwa Hakim bin Hizam berkata; Saya pernah meminta? Rasulullah shallallahu 'alaihi wasallam lalu beliau memberiku, kemudian saya memintanya lalu beliau memberiku kemudian? Rasulullah shallallahu 'alaihi wasallam? bersabda: \"Wahai Hakim, harta ini adalah manis, barang siapa yang mengambilnya dengan kelapangan hati (orang yang memberi) maka ia akan diberkahi, sebaliknya orang yang mengambilnya dengan ketamakan hati maka ia tidak diberkahi dalam harta tersebut, ia seperti orang yang makan akan tetapi tidak kenyang. Tangan yang di atas lebih baik daripada tangan yang di bawah.\" Hakim berkata; lalu saya berkata; wahai Rasulullah, demi Dzat yang mengutusmu dengan kebenaran, aku tidak akan mengurangi harta seorangpun sedikitpun setelahmu hingga berpisah dengan dunia.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126120",
    "last_updated": null
  },
  {
    "indonesianURN": "3225570",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1203",
    "babName": "Siapa yang Allah beri harta dengan tanpa meminta",
    "hadithNumber": "2557",
    "hadithText": "Telah? mengabarkan kepada kami Qutaibah, ia berkata;? menceritakan kepada kami Al Laits dari Bukair dari Busr bin Sa'id dari Ibnu As Sa'idi Al Maliki, ia berkata; saya pernah ditunjuk Umar untuk mengurusi masalah sedekah, tatkala saya selesai mengurusinya dan menyampaikannya kepadanya, ia memerintahkan agar saya diberi uang, maka saya katakan; sesungguhnya saya bekerja hanya untuk Allah Azza wa Jalla, dan pahalaku di sisi Allah 'azza wajalla. Kemudian ia berkata; ambillah apa yang telah saya berikan kepadamu, karena saya pernah bekerja pada masa? Rasulullah shallallahu 'alaihi wasallam dan mengatakan seperti apa yang telah engkau katakan, kemudian beliau berkata kepadaku: \"Apabila engkau diberi sesuatu dengan tanpa meminta maka makan (ambillah) dan sedekahkan.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126130",
    "last_updated": null
  },
  {
    "indonesianURN": "3225580",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1203",
    "babName": "Siapa yang Allah beri harta dengan tanpa meminta",
    "hadithNumber": "2558",
    "hadithText": "Telah? mengabarkan kepada kami Sa'id bin Abdur Rahman abu Ubaidillah Al Makhzumi, ia berkata; telah? menceritakan kepada kami Sufyan dari Az Zuhri dari As Saib bin Yazin dari Huwaithib bin Abdul 'Uzza, ia berkata; telah mengabarkan kepadaku Abdullah bin As Sa'di bahwa ia pernah datang kepada Umar bin Al Khathab radliallahu 'anhu dari Syam kemudian ia berkata; bukankah aku telah diberi khabar bahwa engkau bekerja mengurusi suatu pekerjaan diantara pekerjaan orang-orang muslim lalu engkau diberi uang dan engkau tidak menerimanya?. Abdullah bin As Sa'di berkata; \"Benar, aku memiliki beberapa ekor kuda, dan beberapa orang sahaya dan aku dalam keadaan baik serta ingin agar amalku menjadi sedekah bagi orang-orang muslim. Maka Umar radliallahu 'anhu berkata; sesungguhnya aku telah menginginkan apa yang engkau inginkan, dahulu Nabi shallallahu 'alaihi wasallam memberiku harta, lalu aku mengatakan; berikan kepada orang yang lebih membutuhkannya daripada diriku. Dan beliau suatu kali memberiku harta, lalu aku mengatakan kepadanya; berikan kepada orang yang lebih membutuhkan kepadanya daripada diriku. Maka beliau bersabda: \"Apa yang telah Allah Azza wa Jalla berikan kepadamu tidak karena meminta dan tidak karena ketamakan maka ambillah, kemudian kembangkan atau sedekahkan, dan yang tidak demikian maka janganlah engkau perturutkan dirimu.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126140",
    "last_updated": null
  },
  {
    "indonesianURN": "3225590",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1203",
    "babName": "Siapa yang Allah beri harta dengan tanpa meminta",
    "hadithNumber": "2559",
    "hadithText": "Telah? mengabarkan kepada kami Katsir bin 'Ubaid, ia berkata; telah? menceritakan kepada kami Muhammad bin Harb dari Az Zubaidy dari Az Zuhri dari As Saib bin Yazid bahwa Huwaithib bin Abdul 'Uzza telah mengabarkan kepadanya bahwa Abdullah bin As Sa'di telah mengabarkan kepadanya bahwa ia datang kepada Umar bin Al Khathab pada masa kekhilafahannya, lalu Umar berkata kepadanya; Benarkah berita yang sampai padaku, bahwa engkau mengurusi beberapa pekerjaan manusia, kemudian apabila engkau diberi uang maka engkau menolaknya?. Maka aku katakan; benar. Lalu Umar radliallahu 'anhu berkata; \"apa yang kamu inginkan dengan melakukan hal tersebut?\" Maka saya katakan; \"saya memiliki beberapa ekor kuda, serta beberapa sahaya dan aku dalam keadaan baik. Saya ingin amalanku menjadi sedekah kepada orang-orang muslim\". Maka Umar berkata kepadanya; \"Janganlah engkau melakukan hal tersebut, sesungguhnya aku pernah berkeinginan seperti yang engkau inginkan. Dahulu Rasulullah shallallahu 'alaihi wasallam memberikan pemberian kepadaku lalu aku katakan; berikan kepada orang yang lebih membutuhkannya daripada diriku. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ambillah kemudian kembangkan atau sedekahkan, apa yang datang kepadamu dari harta ini sedang kamu tidak tamak dan tidak meminta maka ambillah dan yang tidak demikian maka janganlah engkau perturutkan dirimu.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126150",
    "last_updated": null
  },
  {
    "indonesianURN": "3225600",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1203",
    "babName": "Siapa yang Allah beri harta dengan tanpa meminta",
    "hadithNumber": "2560",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Manshur dan Ishaq bin Manshur dari Al Hakam bin Nafi', ia berkata; telah memberitakan kepada kami Syu'aib dari Az Zuhri, ia berkata; telah mengabarkan kepadaku As Saib bin Yazid bahwa Huwaithib bin Abdul 'Uzza telah mengabarkan kepadanya Abdullah bin As Sa'di telah mengabarkan kepadanya bahwa ia telah datang kepada Umar bin Al Khathab pada masa kekhilafahannya, lalu Umar berkata; Benarkah berita yang sampai kepadaku, bahwa engkau mengurusi beberapa pekerjaan manusia, kemudian apabila engkau diberi uang, maka engkau tidak menginginkannya. Ia berkata; maka aku katakan; \"Iya\". Umar bertanya; \"Apa yang kamu inginkan dengan melakukan hal tersebut?\" Maka saya katakan; \"Saya memiliki beberapa ekor kuda, serta beberapa sahaya dan aku dalam keadaan baik. Saya ingin amalanku menjadi sedekah kepada orang-orang muslim. Maka Umar berkata kepadanya; \"Janganlah engkau melakukan hal tersebut, sesungguhnya aku pernah berkeinginan seperti yang engkau inginkan. Dahulu Nabi shallallahu 'alaihi wasallam memberikan pemberian kepadaku lalu aku katakan; berikan kepada orang yang lebih membutuhkannya daripada diriku. Hingga beliau suatu kali beliau memberiku harta, lalu saya katakan; berikan kepada orang yang lebih membutuhkannya daripada diriku. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Ambillah kemudian kembangkan dan sedekahkan, apa yang datang kepadamu dari harta ini sedang engkau tidak tamak dan tidak meminta maka ambillah dan yang tidak demikian maka jangan engkau perturutkan dirimu.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126160",
    "last_updated": null
  },
  {
    "indonesianURN": "3225610",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1203",
    "babName": "Siapa yang Allah beri harta dengan tanpa meminta",
    "hadithNumber": "2561",
    "hadithText": "Telah? mengabarkan kepada kami 'Amr bin Manshur, ia berkata; telah? menceritakan kepada kami Al Hakam bin Nafi', ia berkata; telah memberitakan kepada kami Syu'aib dari Az Zuhri ia berkata; telah mengabarkan kepadaku Salim bin Abdullah bahwa Abdullah bin Umar berkata; saya pernah mendengar Umar radliallahu 'anhu berkata; Nabi shallallahu 'alaihi wasallam pernah memberikan pemberian kepadaku, lalu saya katakan; berikan kepada orang yang lebih membutuhkannya daripada diriku, hingga suatu kali beliau memberiku harta lalu aku katakan kepadanya; berikan kepada orang yang lebih membutuhkannya daripada diriku. Maka beliau bersabda: \"Ambillah, kemudian kembangkan dan sedekahkan. Apa yang datang kepadamu dari harta ini sedang kamu tidak tamak, dan tidak meminta maka ambillah dan yang tidak demikian, maka janganlah engkau perturutkan dirimu.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126170",
    "last_updated": null
  },
  {
    "indonesianURN": "3225620",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1204",
    "babName": "Keluarga Nabi Shallallahu'alaihiwasallam meminta untuk mengelola sedekah",
    "hadithNumber": "2562",
    "hadithText": "Telah? mengabarkan kepada kami 'Amr bin Sawwad bin Al Aswad bin 'Amr dari Ibnu Wahb, ia berkata; telah? menceritakan kepada kami Yunus dari Ibnu Syihab dari Abdullah bin Al Harits bin Naufal Al Hasyimi bahwa Abdul Muththalib bin Rabi'ah bin Al Harits bin Abdul Muththalib telah mengabarkan kepadanya bahwa bapaknya yaitu Rabi'ah bin Al Harits berkata kepada Abdul Muththalib bin Rabi'ah bin Al Harits serta Al Fadhl bin Al Abbas bin Abdul Muththalib; \"Datanglah kalian berdua kepada Rasulullah shallallahu 'alaihi wasallam kemudian katakan kepadanya; angkatlah kami untuk mengurusi masalah shadaqah wahai Rasulullah. Lalu datang Ali bin Abu Thalib dan kami dalam keadaan tersebut, kemudian ia berkata kepada mereka berdua; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam tidak mengangkat salah seorang dari kalian untuk mengurusi masalah shadaqah. Abdul Muththalib berkata; lalu aku bersama Al Fadhl pergi, hingga kami datang kepada Rasulullah shallallahu 'alaihi wasallam. Lalu beliau bersabda kepada kami: \"Sesungguhnya shadaqah ini merupakan kotoran-kotoran manusia, dan shadaqah tersebut tidak halal bagi Muhammad dan keluarga Muhammad shallallahu 'alaihi wasallam.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126180",
    "last_updated": null
  },
  {
    "indonesianURN": "3225630",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1205",
    "babName": "Anak saudara perempuan suatu kaum adalah bagian dari mereka",
    "hadithNumber": "2563",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah? bercerita kepada kami Waki', ia berkata; telah bercerita kepada kami Syu'bah, ia berkata; saya pernah mengatakan kepada Abu Iyas Mu'awiyah bin Qurrah, apakah engkau pernah mendengar Anas bin bin Malik mengatakan; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Anak laki-laki saudara perempuan suatu kaum termasuk bagian dari mereka?\" Ia berkata; ya.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126190",
    "last_updated": null
  },
  {
    "indonesianURN": "3225640",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1205",
    "babName": "Anak saudara perempuan suatu kaum adalah bagian dari mereka",
    "hadithNumber": "2564",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah? memberitakan kepada kami Waki', ia berkata; telah bercerita kepada kami Syu'bah dari Qatadah dari Anas bin Malik dari Rasulullah shallallahu 'alaihi wasallam bersabda: \"Anak laki-laki saudara perempuan suatu kaum merupakan bagian dari mereka.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126200",
    "last_updated": null
  },
  {
    "indonesianURN": "3225650",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1206",
    "babName": "Budak suatu kaum adalah bagian dari mereka",
    "hadithNumber": "2565",
    "hadithText": "Telah? mengabarkan kepada kami 'Amr bin Ali, ia berkata; bercerita kepada kami Yahya, ia berkata;? bercerita kepada kami Syu'bah ia berkata; telah? bercerita kepada kami Al Hakam dari Ibnu Abi Rafi' dari bapaknya, bahwa Rasulullah shallallahu 'alaihi wasallam mengangkat seseorang dari Bani Makhzum untuk mengurusi permasalahan shadaqah, lalu Abu Rafi' ingin mengikutinya, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya shadaqah tidaklah halal bagi kami, dan sesungguhnya hamba sahaya suatu kaum merupakan bagian dari mereka.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126210",
    "last_updated": null
  },
  {
    "indonesianURN": "3225660",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1207",
    "babName": "Sedekah tidak dihalalkan bagi Nabi Shallallahu'alaihiwasallam",
    "hadithNumber": "2566",
    "hadithText": "Telah? mengabarkan kepada kami Ziyad bin Ayub, ia berkata; telah? menceritakan kepada kami Abdul Wahid bin Washil, ia berkata; telah? menceritakan kepada kami Bahz bin Hakim dari bapaknya dari kakeknya, ia berkata; Nabi shallallahu 'alaihi wasallam apabila diberi sesuatu maka beliau bertanya: \"Apakah itu hadiah atau shadaqah?\" Kemudian apabila ada berita itu adalah shadaqah, maka beliau tidak memakannya dan apabila ada berita itu adalah hadiah, maka beliau membentangkan tangannya.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126220",
    "last_updated": null
  },
  {
    "indonesianURN": "3225670",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1208",
    "babName": "Jika sedekah berubah",
    "hadithNumber": "2567",
    "hadithText": "Telah? mengabarkan kepada kami 'Amr bin Yazid, ia berkata;? telah menceritakan kepada kami Bahz bin Asad, ia berkata;? telah menceritakan kepada kami Syu'bah, ia berkata;? telah menceritakan kepada kami Al Hakam dari Ibrahim dari Al Aswad dari 'Aisyah bahwa ia ingin membeli Barirah lalu ia memerdekakannya, namun mereka (tuan-tuannya) memberikan syarat agar mereka tetap menjadi walinya, lalu ia menceritakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam maka beliau bersabda: \" Belilah dia dan merdekakan, sesungguhnya perwalian itu bagi yang memerdekakakan.\" Lalu ia diberi pilihan ketika dimerdekakan, dan Rasulullah shallallahu 'alaihi wasallam diberi daging kemudian dikatakan ini adalah sebagian shadaqah yang diberikan kepada Barirah. Maka beliau bersabda: \"Hal itu baginya merupakan shadaqah dan bagi kami merupakan hadiah.\" Dan suami Barirah adalah orang yang merdeka.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126230",
    "last_updated": null
  },
  {
    "indonesianURN": "3225680",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1209",
    "babName": "Membeli sedekah",
    "hadithNumber": "2568",
    "hadithText": "Telah? mengabarkan kepada kami Muhammad bin Salamah dan Harits bin Miskin dengan membacakan riwayat, dan saya mendengarkan dari Ibnul Qasim, ia berkata;? menceritakan kepada kami Malik dari Zaid bin Aslam dari bapaknya, ia berkata; saya pernah mendengar Umar berkata; saya pernah menanggung kuda di jalan Allah 'azza wajalla, kemudian oang yang memilikinya tidak memperhatikannya, dan saya ingin membelinya dari orang tersebut dan menyangka bahwa ia akan menjualnya dengan harga murah. Lalu saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hal tersebut, maka beliau bersabda: \"Jangan engkau membelinya, walaupun ia memberimu dengan harga satu dirham, karena orang yang mengambil shadaqahnya seperti seekor anjing yang menjilat kembali muntahannya.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126240",
    "last_updated": null
  },
  {
    "indonesianURN": "3225690",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1209",
    "babName": "Membeli sedekah",
    "hadithNumber": "2569",
    "hadithText": "Telah? mengabarkan kepada kami Harun bin Ishaq, ia berkata; telah? menceritakan kepada kami Abdur Razzaq dari Ma'mar dari Az Zuhri dari Salim bin Abdullah dari bapaknya dari Umar bahwa ia telah menanggung kuda di jalan Allah, kemudian ia melihatnya dijual, maka ia ingin membelinya. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Jangan engkau menawar shadaqahmu.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126250",
    "last_updated": null
  },
  {
    "indonesianURN": "3225700",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1209",
    "babName": "Membeli sedekah",
    "hadithNumber": "2570",
    "hadithText": "Telah? mengabarkan kepada kami Muhammad bin Abdullah bin Al Mubarak, ia berkata; telah memberitakan kepada kami Hujain, ia berkata; telah? menceritakan kepada kami Al Laits dari 'Uqail dari Ibnu Syihab dari Salim bin Abdullah bahwa Abdullah bin Umar pernah menceritakan bahwa Umar bershadah dengan seekor kuda di jalan Allah Azza wa jalla, lalu ia mendapati kuda tersebut dijual setelah itu. Maka ia ingin membelinya kemudian ia datang kepada Rasulullah shallallahu 'alaihi wasallam, meminta petunjuk mengenai hal tersebut, maka Rasulullah shallallahu 'alaihi wasallam bersabda: Jangan engkau mengambil kembali shadaqahmu.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126260",
    "last_updated": null
  },
  {
    "indonesianURN": "3225710",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1209",
    "babName": "Membeli sedekah",
    "hadithNumber": "2571",
    "hadithText": "Telah? mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah? menceritakan kepada kami Bisyr serta Yazid, mereka berdua berkata; telah? menceritakan kepada kami Abdur Rahman bin Ishaq dari Az Zuhri dari Sa'id bin Al Musayyab bahwa Rasulullah shallallahu 'alaihi wasallam menyuruh Atab bin Asid untuk menakar anggur, lalu menunaikan zakatnya dalam bentuk kismis seperti halnya zakat pohon kurma ditunaikan zakatnya dalam bentuk buah kurma.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1126270",
    "last_updated": null
  },
  {
    "indonesianURN": "3224191",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1124",
    "babName": "Pemilik harta menyerahkan harta dengan tanpa pilihan penarik zakat",
    "hadithNumber": "2419",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdullah bin Al Mubarak dia berkata; telah menceritakan kepada kami Waki' dia berkata; telah menceritakan kepada kami Zakariya bin Ishaq dari 'Amru bin Abu Sufyan dari Muslim bin Tsafinah dia berkata; Ibnu Al Qomah menugaskan bapakku untuk menjadi pemimpin kaumnya dan menyuruhnya untuk mengambil zakat mereka. Muslim berkata; 'Lalu ayahku mengutusku kepada sebuah kaum agar aku mengambil zakat mereka.' Kemudian aku keluar hingga menemui seorang yang telah tua bernama Si'ir, aku katakan; ayahku mengutusku kepadamu agar kamu menunaikan zakat kambingmu. (orang tua itu) berkata; wahai anak saudaraku! kambing seperti apa yang akan kalian ambil? aku berkata; Biarkan aku memilih sampai aku bisa mengukur susu kambingmu. Dia berkata; 'Wahai anak saudaraku, aku akan memberitahumu bahwa ketika aku berada di sebuah bukit bersama kambing-kambingku pada masa Nabi shallallahu 'alaihi wasallam, tiba-tiba datang kepadaku dua orang laki-laki yang mengendarai unta dan berkata; 'Kami adalah utusan Nabi shallallahu 'alaihi wasallam yang datang kepadamu agar kamu menunaikan zakat kambingmu, aku berkata; 'Apa yang wajib aku keluarkan darinya? ' (Keduanya) berkata; 'Seekor kambing.' Lalu aku pergi menuju seekor kambing, yang aku melihatnya telah mengandung dan gemuk, lalu aku mengeluarkannya kepada mereka. Keduanya berkata; 'Ini adalah kambing yang sedang hamil, padahal Rasulullah shallallahu 'alaihi wasallam melarang kami untuk mengambil kambing yang hamil. (orang tua itu) berkata; 'Lalu aku menuju 'anaq (kambing betina yang berumur enam bulan hingga satu tahun) yang mu'tath, dia berkata; Mu'tath adalah kambing yang tidak bisa melahirkan anak (karena gemuk) padahal sudah masanya untuk bisa melahirkan anak, lalu aku mengeluarkannya kepada mereka dan keduanya berkata; 'Berikan kepada kami, maka aku memberikannya kepada mereka hingga keduanya menaikkannya ke atas unta mereka lalu keduanya pergi.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124710",
    "last_updated": null
  },
  {
    "indonesianURN": "3224192",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1124",
    "babName": "Pemilik harta menyerahkan harta dengan tanpa pilihan penarik zakat",
    "hadithNumber": "2419",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Abdullah dia berkata; Telah menceritakan kepada kami Rauh dia berkata; telah menceritakan kepada kami Zakaria bin Ishaq dia berkata; Telah menceritakan kepadaku Amru bin Abu Sufyan dia berkata; Telah menceritakan kepadaku Muslim bin Tsafinah bahwa Ibnu Al Qomah menugaskan bapakku untuk menjadi pemimpin kaumnya dan menyuruhnya untuk mengambil zakat mereka.- kemudian dia menyampaikan hadits diatas.-</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124720",
    "last_updated": null
  },
  {
    "indonesianURN": "3224201",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1124",
    "babName": "Pemilik harta menyerahkan harta dengan tanpa pilihan penarik zakat",
    "hadithNumber": "2420",
    "hadithText": "Telah mengabarkan kepadaku 'Imran bin Bakkar dia berkata; telah menceritakan kepada kami 'Ali bin 'Ayyasy dia berkata; telah menceritakan kepada kami Syu'aib dia berkata; telah menceritakan kepadaku Abu Az Zinad dari apa-apa yang diceritakan kepadanya oleh 'Abdurrahman Al A'raj disebutkan bahwasanya ia mendengar Abu Hurairah berkata; Umar berkata Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk mengambil zakat, lalu dikatakan; \"Ibnu Jamil, Khalid bin Al Walid dan Abbas bin Abdul Muthalib tidak mau memberikannya.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidaklah Ibnu Jamil merasa enggan untuk membayarnya, hanya saja dahulu ia fakir lalu Allah menjadikan ia kaya. Sedangkan Khalid bin Al Walid, sungguh kalian telah menzhalimi Khalid, ia telah mewakafkan baju besi dan peralatan perangnya di jalan Allah. Sedangkan Al Abbas bin Abdul Muthalib, paman Rasulullah shallallahu 'alaihi wasallam, dia berkewajiban membayar zakat dan zakat yang sama bersamaan dengannya.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124730",
    "last_updated": null
  },
  {
    "indonesianURN": "3224202",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1124",
    "babName": "Pemilik harta menyerahkan harta dengan tanpa pilihan penarik zakat",
    "hadithNumber": "2420",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Hafsh dia berkata; Telah menceritakan kepada kami Bapakku dia berkata; Telah menceritakan kepada kami Ibrahim bin Thahman dari Musa dia berkata; Telah menceritakan kepadaku Abu Zinad dari Abdurrahman dari Abu Hurairah dia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk mengambil zakat sama seperti diatas.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124740",
    "last_updated": null
  },
  {
    "indonesianURN": "3224341",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1128",
    "babName": "Zakat perhiasan",
    "hadithNumber": "2434",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud dia berkata; telah menceritakan kepada kami Khalid dari Husain dari 'Amru bin Syu'aib dari bapaknya dari kakeknya bahwa seorang wanita dari negeri Yaman datang kepada Rasulullah shallallahu 'alaihi wasallam bersama puterinya yang mengenakan dua gelang ditangannya berukuran besar terbuat dari emas, lalu beliau bertanya: \"Apakah kamu telah mengeluarkan zakat gelang ini?\" Ia menjawab; 'Tidak.' Beliau bersabda: 'Apakah kamu senang pada hari Kiamat nanti Allah -Azza wa Jalla- akan menggelangimu dengan dua gelang dari api neraka? ' Ibnu Amru berkata; 'Maka ia segera melepas kedua gelang tersebut dan melemparkannya kepada Rasulullah shallallahu 'alaihi wasallam, seraya berkata; 'Kedua gelang itu untuk Allah dan Rasul-Nya.'</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124880",
    "last_updated": null
  },
  {
    "indonesianURN": "3224342",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1128",
    "babName": "Zakat perhiasan",
    "hadithNumber": "2434",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la dia berkata; telah menceritakan kepada kami Al Mu'tamir bin Sulaiman dia berkata; Aku mendengar Husain berkata; Telah menceritakan kepada kami Amru bin Syu'aib dia berkata; Telah datang kepada Rasulullah shallallahu 'alaihi wasallam seorang wanita bersama puterinya yang mengenakan dua gelang ditangannya, -sebagaimana Hadits di atas secara mursal. Abu Abdurrahman berkata; Khalid lebih kuat dibanding Al Mu'tamir.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1124890",
    "last_updated": null
  },
  {
    "indonesianURN": "3224491",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1137",
    "babName": "Tambang",
    "hadithNumber": "2449",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; telah menceritakan kepada kami Sufyan dari Az Zuhri dari Sa'id dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam. Demikian juga diriwayatkan dari jalur lainnya, telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; Telah memberitakan kepada kami Abdul Razaq berkata; Telah menceritakan kepada kami Ma'mar dari Sa'id dan Abu Salamah dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Luka akibat binatang ternak tidak ada tanggungan -bagi pemiliknya-, sumur yang digali lalu menyebabkan orang lain tersungkur ke dalamnya tidak ada tanggungan -bagi pemiliknya-, tanah yang digali untuk mencari barang tambang lalu orang lain tersungkur ke dalamnya tidak ada tanggungan -bagi pemiliknya- dan pada harta karun zakatnya seperlima.\"</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125040",
    "last_updated": null
  },
  {
    "indonesianURN": "3224492",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "23",
    "bookName": "Zakat",
    "babNumber": "1137",
    "babName": "Tambang",
    "hadithNumber": "2449",
    "hadithText": "Telah mengabarkan kepada kami Yunus bin Abdul A'la dia berkata; Telah menceritakan kepada kami Ibnu Wahb berkata; Telah mengabarkan kepadaku Yunus dari Ibnu Syihab dari Sa'id dan Ubaidullah bin Abdullah dari Abu Hurairah dari Rasulullah shallallahu 'alaihi wasallam seperti itu juga.</b>",
    "bookID": "23.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "1125050",
    "last_updated": null
  }
]