[
  {
    "indonesianURN": "3203460",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "135",
    "babName": "Awalmula haidh, apakah haidh dinamakan nifas?",
    "hadithNumber": "346",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; Telah memberitakan kepada kami Sufyan dari Abdurrahman bin Al Qasim bin Muhammad bin Abu Bakar As-Shiddiq Radliyallahu'anhu dari Bapaknya dari Aisyah Radliyallahu'anha dia berkata; \"Kami pergi bersama Rasulullah shallallahu 'alaihi wasallam dan kami tidak menaksir selain untuk haji. Setelah sampai di Sarif, aku haidl. Ketika Rasulullah shallallahu 'alaihi wasallam datang kepadaku, aku sedang menangis. Beliau lalu bersabda, 'Ada apa denganmu? Apakah kamu sedang haidl? ' Aku menjawab; Ya. Beliau bersabda: Ini adalah perkara yang telah Allah Azza wa Jalla tetapkan bagi kaum wanita, maka kerjakan apa yang dikerjakan oleh orang yang haji, kecuali thawaf di Ka'bah'.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "1103500",
    "last_updated": null
  },
  {
    "indonesianURN": "3203470",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "136",
    "babName": "Istihadhah, kedatangan darah dan penghabisannya",
    "hadithNumber": "347",
    "hadithText": "Telah mengabarkan kepada kami 'Imran bin Yazid dia berkata; Telah menceritakan kepada kami Ismail bin Abdullah yaitu Ibnu Sama'ah dia berkata; Telah menceritakan kepada kami Al Auza'i dia berkata; Telah menceritakan kepada kami Yahya bin Sa'id dia berkata; Telah mengabarkan kepadaku Hisyam bin Urwah dari Urwah bahwa Fatimah binti Qais -dari Bani Asad Quraisy- pernah datang kepada Rasulullah shallallahu 'alaihi wasallam untuk menceritakan bahwa dirinya sedang mengalami istihadah. Seingatnya Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya, \"Itu darah penyakit. Bila datang haidl maka tinggalkan shalat, dan bila telah selesai mandilah dan cucilah darah yang masih ada kemudian kerjakanlah shalat.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "1103510",
    "last_updated": null
  },
  {
    "indonesianURN": "3203480",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "136",
    "babName": "Istihadhah, kedatangan darah dan penghabisannya",
    "hadithNumber": "348",
    "hadithText": "Telah mengabarkan kepada kami Hisyam bin 'Ammar dia berkata; Telah menceritakan kepada kami Sahal bin Hasyim dia berkata; Telah menceritakan kepada kami Al Auza'i dari Az-Zuhri dari Urwah dari Aisyah Radliyallahu'anha, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bila datang haidl, tinggalkan shalat, dan bila selesai, mandilah.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "1103520",
    "last_updated": null
  },
  {
    "indonesianURN": "3203490",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "136",
    "babName": "Istihadhah, kedatangan darah dan penghabisannya",
    "hadithNumber": "349",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; Telah menceritakan kepada kami Al-Laits dari Ibnu Syihab dari 'Urwah dari Aisyah Radliyallahu'anha, bahwa Ummu Habibah binti Jahsy meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam, \"Wahai Rasulullah shallallahu 'alaihi wasallam! Aku mengalami istihadhah? ' Beliau shallallahu 'alaihi wasallam bersabda: \"Itu darah penyakit, maka mandilah kemudian kerjakanlah shalat.\" Lalu dia pun mandi di setiap akan shalat.</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "1103530",
    "last_updated": null
  },
  {
    "indonesianURN": "3203500",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "137",
    "babName": "Wanita mempunyai hari-hari tertentu ketika haid tiap bulan",
    "hadithNumber": "350",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; Telah menceritakan kepada kami Al-Laits dari Yazid bin Abu Habib dari Ja'far bin Rabi'ah dari 'Irak bin Malik dari 'Urwah dari Aisyah bahwa Ummu Habibah bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang darah? Aisyah Radliyallahu'anha lalu berkata, \"Aku melihat tempatnya mencuci pakaian penuh darah. Lantas Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Tetapkanlah olehmu sesuai ukuran kebiasaan haidlmu, kemudian mandilah.\" Juga telah mengabarkan kepada kami Qutaibah dengan hadits yang serupa, tetapi tidak menyebutkan Ja'far bin Rabi'ah.</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "1103540",
    "last_updated": null
  },
  {
    "indonesianURN": "3203510",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "137",
    "babName": "Wanita mempunyai hari-hari tertentu ketika haid tiap bulan",
    "hadithNumber": "351",
    "hadithText": "Telah memberitakan kepada kami Muhammad bin Abdullah bin Al Mubarak dia berkata; Telah menceritakan kepada kami Abu Usamah berkata; Telah menceritakan kepada kami 'Ubaidullah bin Umar berkata; Telah mengabarkan kepadaku dari Nafi' dari Sulaiman bin Yasar dari Ummu Salamah berkata; \"Ada seorang perempuan yang bertanya kepada Nabi shallallahu 'alaihi wasallam, 'Aku sedang istihadhah, maka aku tidak suci. Apakah aku harus meninggalkan shalat? ' beliau shallallahu 'alaihi wasallam bersabda: 'Tidak, tetapi tinggalkan shalat pada ukuran hari dan malam sesuai jadwal haidlmu, kemudian mandi dan balutlah dengan kain pada tempat keluarnya darah, lalu shalatlah'.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "1103550",
    "last_updated": null
  },
  {
    "indonesianURN": "3203520",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "137",
    "babName": "Wanita mempunyai hari-hari tertentu ketika haid tiap bulan",
    "hadithNumber": "352",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Nafi' dari Sulaiman bin Yasar dari Ummu Salamah bahwa ada seorang perempuan yang selalu mengeluarkan darah pada zaman Rasulullah shallallahu 'alaihi wasallam, dia meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam? beliau bersabda, \"Hendaklah kamu menghitung malam dan hari sesuai jadwal haidlmu setiap bulan, sebelum mengalami hal (seringnya darah keluar) tersebut dalam setiap bulannya. Bila waktu kebiasaan haidl telah selesai, maka mandi dan letakkan kain pada tempat haidl, lalu shalatlah. '</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "1103560",
    "last_updated": null
  },
  {
    "indonesianURN": "3203530",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "138",
    "babName": "Quru\" (masa suci)",
    "hadithNumber": "353",
    "hadithText": "Telah mengabarkan kepada kami Ar-Rabi' bin Sulaiman bin Daud bin Ibrahim dia berkata; Telah menceritakan kepada kami Ishaq yaitu Ibnu Bakr bin Mudlar dia berkata; Telah menceritakan kepadaku Bapakku dari Yazid bin Abdullah yaitu Ibnu Usamah bin Al Had dari Abu Bakr yaitu Ibnu Muhammad bin 'Amr bin Hazm dari 'Amrah dari Aisyah dia berkata; Bahwa Ummu Habibah binti Jahsy -istri Abdurrahman bin Auf- mengalami istihadhah dan tidak suci, sehingga hal itu diadukan kepada Rasulullah shallallahu 'alaihi wasallam. Lalu beliau shallallahu 'alaihi wasallam bersabda kepadanya: \"Ini bukan haidl, tetapi hentakan rahim. Jadi hendaklah dia mandi dan mengerjakan shalat. Lalu hendaklah dia memperhatikan kebiasaan masa haidlnya, kemudian meninggalkan shalat dan melihat apa yang terjadi setelah itu, lalu hendaknya mandi setiap akan shalat.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "1103570",
    "last_updated": null
  },
  {
    "indonesianURN": "3203540",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "138",
    "babName": "Quru\" (masa suci)",
    "hadithNumber": "354",
    "hadithText": "Telah mengabarkan kepada kami Abu Musa dia berkata; Telah menceritakan kepada kami Sufyan dari Az-Zuhri dari 'Amrah dari Aisyah bahwa Ummu Habibah binti Jahsy pernah mengalami haidl selama tujuh tahun. Lalu ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang hal tersebut, dan beliau menjawab, \"Itu bukan haidl, tetapi darah penyakit. ' Kemudian beliau memerintahkannya meninggalkan shalat menurut jadwal haidlnya, lalu mandi serta tetap shalat, dan dia mandi setiap akan shalat.</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "1103580",
    "last_updated": null
  },
  {
    "indonesianURN": "3203550",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "138",
    "babName": "Quru\" (masa suci)",
    "hadithNumber": "355",
    "hadithText": "Telah mengabarkan kepada kami 'Isa bin Hammad dia berkata; Telah memberitakan kepada kami Al-Laits dari Yazid bin Abu Habib dari Bukair bin Abdullah dari Al Mundzir bin Al Mughirah dari Urwah bahwa Fatimah binti Abu Hubaisy berkata kepadanya, dirinya pernah datang kepada Rasulullah shallallahu 'alaihi wasallam untuk mengadukan darahnya. Rasulullah shallallahu 'alaihi wasallam lalu bersabda kepadanya: \"Itu darah penyakit. Perhatikanlah jadwal haidlmu. Jika datang maka jangan shalat dan jika telah berlalu jadwal haidlnya maka bersucilah, kemudian shalatlah antara waktu haidl yang satu ke waktu haidl yang lain.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "1103590",
    "last_updated": null
  },
  {
    "indonesianURN": "3203560",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "138",
    "babName": "Quru\" (masa suci)",
    "hadithNumber": "356",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; Telah menceritakan kepada kami 'Abdah, Waki' dan Abu Mu'awiyah mereka berkata; Telah menceritakan kepada kami Hisyam bin Urwah dari Bapaknya dari Aisyah dia berkata, \" Fatimah binti Hubaisy datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata, 'Aku sedang mengalami istihadhah dan aku tidak suci, jadi apakah aku harus meninggalkan shalat? ' Beliau bersabda: 'Tidak, itu darah penyakit, bukan haidl. Bila datang haidl maka tinggalkanlah shalat, dan jika sudah selesai haidl maka cucilah darah itu dan shalatlah.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "1103600",
    "last_updated": null
  },
  {
    "indonesianURN": "3203570",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "139",
    "babName": "Wanita istihadhah menjamak shalat  dengan sekali mandi",
    "hadithNumber": "357",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basyar dia berkata; Telah menceritakan kepada kami Muhammad dia berkata; Telah menceritakan kepada kami Syu'bah dari Abdurrahman bin Al Qasim dari Bapaknya dari Aisyah bahwa ada seorang perempuan yang sedang istihadhah pada jaman Rasulullah shallallahu 'alaihi wasallam, lalu dikatakan kepadanya bahwa itu adalah darah penyakit di luar kebiasaan. Lalu diperintahkan untuk mengakhirkan shalat Zhuhur dan memajukan shalat Ashar, dengan satu kali mandi untuk keduanya. Mengakhirkan maghrib dan memajukan Isya' dengan satu kali mandi untuk keduanya. Dan satu kali mandi untuk shalat subuh.</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "1103610",
    "last_updated": null
  },
  {
    "indonesianURN": "3203580",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "139",
    "babName": "Wanita istihadhah menjamak shalat  dengan sekali mandi",
    "hadithNumber": "358",
    "hadithText": "Telah mengabarkan kepada kami Suwaid bin Nashr dia berkata; Telah menceritakan kepada kami Abdullah dari Sufyan dari Abdurrahman bin Al Qasim dari Al Qasim dari Zainab binti Jahsy, dia berkata; \"Aku berkata kepada Rasulullah Shallallahu'alihi wasallam bahwa aku sedang istihadhah, lalu beliau bersabda: \"Hendaknya kamu duduk (menunggu) pada hari-hari biasa haidl, kemudian mandi dan akhirkanlah shalat Zhuhur dan memajukan shalat Ashar. Mandi dan shalat, juga untuk mengakhirkan Maghrib dan memajukan shalat Isya, serta mandi satu kali untuk dua shalat, kemudian mandi sekali untuk shalat Subuh.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "1103620",
    "last_updated": null
  },
  {
    "indonesianURN": "3203590",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "140",
    "babName": "Perbedaan antara darah haidh dan istihadhah",
    "hadithNumber": "359",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dia berkata; Telah menceritakan kepada kami Ibnu Abu 'Adi dari telah menceritakan kepada kami Muhammad bin Amr yaitu Ibnu 'Alqamah bin Waqqash dari Ibnu Syihab dari Urwah bin Jubair dari Fathimah binti Abu Hubaisy, bahwa ia mengalami istihadhah, maka Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Bila darah itu adalah darah haidl, maka darahnya hitam yang sudah dikenal, sehingga tinggalkanlah shalat. Jika selain itu maka berwudlulah, karena itu adalah darah penyakit.\" Muhammad bin Al Mutsanna berkata; Telah menceritakan kepada kami -tentang ini- Ibnu Abu Adi dari kitabnya.</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "1103630",
    "last_updated": null
  },
  {
    "indonesianURN": "3203600",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "140",
    "babName": "Perbedaan antara darah haidh dan istihadhah",
    "hadithNumber": "360",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dia berkata; Telah menceritakan kepada kami Ibnu Abu Adi -dari hafalannya- dia berkata; Telah menceritakan kepada kami Muhammad bin Amr dari Ibnu syihab dari Urwah dari Aisyah bahwa Fatimah binti Hubaisy mengalami istihadhah, lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya, \"Bila darah itu adalah darah haidl, maka darahnya hitam yang sudah dikenal, sehingga tinggalkanlah shalat. Jika selain itu maka berwudlulah, dan kerjakanlah shalat.\" Abu Abdurrahman berkata; Tidak hanya satu orang yang meriwayatkan hadits ini, dan tidak seorangpun dari mereka yang menyebutkan sebagaimana yang disebutkan oleh Ibnu Adi Wallahu Ta'ala A'lam.</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "1103640",
    "last_updated": null
  },
  {
    "indonesianURN": "3203610",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "140",
    "babName": "Perbedaan antara darah haidh dan istihadhah",
    "hadithNumber": "361",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Habib bin 'Arabi dari Hammad dari Hisyam bin Urwah dari Bapaknya dari Aisyah Radliyallahu'anha bahwa Fatimah binti Hubaisy mengalami istihadhah, lalu bertanya kepada Rasulullah shallallahu 'alaihi wasallam, \"Wahai Rasulullah shallallahu 'alaihi wasallam! Aku sedang istihadhah, maka aku tidak suci. Jadi apakah aku harus meninggalkan shalat?\" Rasulullah shallallahu 'alaihi wasallam menjawab; \"Itu darah penyakit, bukan haidl. Bila datang haidl, maka cucilah bekas darah darimu dan berwudlulah, karena itu hanya darah penyakit, bukan haidl.\" Beliau ditanya, \"Bagaimana dengan mandi?\" Beliau menjawab: \"Tidak seorang pun yang meragukannya.\" Abu Abdurrahman berkata; Yang meriwayatkan hadits ini tidak hanya satu orang, dari Hisyam bin Urwah dan dia tidak menyebutkan didalamnya -wa tawadla'i- (.. dan berwudlulah..) selain Hammad saja. Wallahu Ta'ala A'lam.</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "1103650",
    "last_updated": null
  },
  {
    "indonesianURN": "3203620",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "140",
    "babName": "Perbedaan antara darah haidh dan istihadhah",
    "hadithNumber": "362",
    "hadithText": "Telah mengabarkan kepada kami Suwaid bin Nashr dia berkata; Telah menceritakan kepada kami Abdullah dari Hisyam bin Urwah dari Bapaknya dari Aisyah Radliyallahu'anha dia berkata: Fatimah binti Abu Hubaisy berkata, \"Wahai Rasulullah Shallallahu'alihi wasallam, aku sedang mengalami istihadhah, dan aku tidak suci.\" Beliau Shallallahu'alihi wasallam bersabda: \"Itu hanya darah penyakit, bukan darah haidl. Bila datang waktu haidl, maka tinggalkanlah shalat, dan jika telah selesai haidl, maka cucilah tempat darah itu dan shalatlah.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "17",
    "matchingArabicURN": "1103660",
    "last_updated": null
  },
  {
    "indonesianURN": "3203630",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "140",
    "babName": "Perbedaan antara darah haidh dan istihadhah",
    "hadithNumber": "363",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Hisyam bin Urwah dari Bapaknya dari Aisyah Radliyallahu'anha dia berkata; \" Fatimah binti Abu Hubaisy berkata, 'Wahai Rasulullah shallallahu 'alaihi wasallam, aku tidak suci, jadi apakah aku harus meninggalkan shalat? ' Beliau shallallahu 'alaihi wasallam menjawab: 'Itu hanya darah penyakit, bukan darah haidl. Bila datang haidl, maka tinggalkanlah shalat, dan jika telah selesai waktu jadwal haidlnya, maka cucilah tempat darah itu dan shalatlah.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "18",
    "matchingArabicURN": "1103670",
    "last_updated": null
  },
  {
    "indonesianURN": "3203640",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "140",
    "babName": "Perbedaan antara darah haidh dan istihadhah",
    "hadithNumber": "364",
    "hadithText": "Telah mengabarkan kepada kami Abu Asy'ats dia berkata; Telah menceritakan kepada kami Khalid bin Harits dia berkata; Saya mendengar Hisyam berkata; dari Bapaknya dari Aisyah Radliyallahu'anha dia berkata: ' Fatimah binti Abu Hubaisy berkata, 'Wahai Rasulullah shallallahu 'alaihi wasallam, aku tidak suci, jadi apakah aku harus meninggalkan shalat? ' Beliau shallallahu 'alaihi wasallam menjawab: \"Itu hanya darah penyakit\". Khalid berkata; Dan dari apa yang saya baca ada tambahan lain: \"Dan bukan darah haidl. Jadi bila datang waktu haidl maka tinggalkanlah shalat, dan jika telah selesai haidl maka cucilah tempat itu dan shalatlah.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "19",
    "matchingArabicURN": "1103680",
    "last_updated": null
  },
  {
    "indonesianURN": "3203650",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "141",
    "babName": "Kuning dan keruh",
    "hadithNumber": "365",
    "hadithText": "Telah mengabarkan kepada kami Amr bin Zurarah dia berkata; Telah memberitakan kepada kami Ismail dari Ayyub dari Muhammad dia berkata; \" Ummu Athiyyah berkata; 'Kita tidak menganggap (darah) yang kekuning-kuningan dan (darah) yang kehitam-hitaman (sebagai darah haidl).\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "20",
    "matchingArabicURN": "1103690",
    "last_updated": null
  },
  {
    "indonesianURN": "3203660",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "142",
    "babName": "Memperlakukan wanita haidh",
    "hadithNumber": "366",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; Telah memberitakan kepada kami Sulaiman bin Harb dia berkata; Telah menceritakan kepada kami Hammad bin Salamah dari Tsabit dari Anas dia berkata; orang Yahudi bila istri mereka haidl, mereka tidak mengajak makan dan minum bersama, dan tidak berkumpul bersamanya di rumah. Mereka menanyakan hal itu kepada Nabi shallallahu 'alaihi wasallam, Lalu Allah Azza wa Jalla menurunkan ayat \"Mereka bertanya kepadamu tentang haidl. Katakanlah, 'Itu adalah penyakit…\" Lalu Rasulullah shallallahu 'alaihi wasallam memerintahkan mereka untuk ikut makan dan minum dengannya, berkumpul dengan mereka di rumah, serta berbuat apa saja selain bersetubuh. Perempuan Yahudi tersebut berkata, \"Rasulullah shallallahu 'alaihi wasallam tidak membiarkan satu perkara pun yang ada pada kami kecuali dia menyelisihinya!\" Lalu bangkitlah Usaid bin Hudlair dan Abbad bin Bisyr untuk memberitahukannya kepada Rasulullah shallallahu 'alaihi wasallam, mereka berkata: \"Apakah kita boleh menggauli mereka (para istri) yang sedang haidl?\" Wajah Rasulullah shallallahu 'alaihi wasallam lalu berubah dengan perubahan yang mencolok, sehingga kami menyangka bahwa beliau sangat marah, lalu keduanya pergi. Kemudian Rasulullah shallallahu 'alaihi wasallam menerima hadiah susu, maka beliau mencari jejak kedua orang ini lalu keduanya dibawa kepada Nabi shallallahu 'alaihi wasallam dan beliau memberi minum susu kepada keduanya. Jadi diketahuilah bahwa beliau shallallahu 'alaihi wasallam tidak marah pada kedua orang ini.</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "21",
    "matchingArabicURN": "1103700",
    "last_updated": null
  },
  {
    "indonesianURN": "3203670",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "143",
    "babName": "Jika menggauli wanita haidh padahal tahu",
    "hadithNumber": "367",
    "hadithText": "Telah mengabarkan kepada kami Amr bin Ali dia berkata; Telah menceritakan kepada kami Yahya dari Syu'bah dia berkata; Telah menceritakan kepadaku Al Hakam dari Abdul Hamid dari Miqsam dari Ibnu Abbas dari Nabi shallallahu 'alaihi wasallam, beliau bersabda tentang seseorang laki-laki yang menggauli istrinya dalam keadaan haidl, \"Bersedekahlah dengan satu Dinar atau setengah Dinar.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "22",
    "matchingArabicURN": "1103710",
    "last_updated": null
  },
  {
    "indonesianURN": "3203680",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "144",
    "babName": "Mencumbui wanita haidh dengan baju haidhnya",
    "hadithNumber": "368",
    "hadithText": "Telah mengabarkan kepada kami Ubaidullah bin Sa'id dia berkata; Telah menceritakan kepada kami Mu'adz bin Hisyam dan Telah memberitakan kepada kami Ishaq bin Ibrahim dia berkata; Telah memberitakan kepada kami Mu'adz bin Hisyam dia berkata; Telah menceritakan kepadaku Bapakku dan Telah memberitakan kepada kami Ismail bin Mas'ud dia berkata; Telah menceritakan kepada kami Khalid yaitu Ibnu Al Harits dia berkata; Telah menceritakan kepada kami Hisyam dari Yahya bin Abu Katsir berkata; Telah menceritakan kepadaku Abu Salamah bahwa Zainab binti Abu Salamah berkata kepadanya; Ummu Salamah berkata kepadanya; \"Ketika aku sedang berbaring bersama Rasulullah shallallahu 'alaihi wasallam di dalam selimut, tiba-tiba aku mendapat haidl, maka akupun segera keluar perlahan-lahan kemudian mengambil pakaian (yang biasa dipakai saat) haidl. Rasulullah shallallahu 'alaihi wasallam bertanya, 'Apakah kamu sedang haidl? ' Aku menjawab, 'Ya'. Beliau lalu memanggilku dan tidur bersama dalam satu selimut.\" Lafazh ini dari Abdullah bin Sa'id.</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "23",
    "matchingArabicURN": "1103720",
    "last_updated": null
  },
  {
    "indonesianURN": "3203690",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "145",
    "babName": "Berselimut dengan isteri haidh",
    "hadithNumber": "369",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Mutsanna dia berkata; Telah menceritakan kepada kami Yahya dari Jabir bin Shubhi dia berkata; Saya mendengar Khilas berkata; dari Aisyah Radliyallahu'anha berkata; \"Aku pernah tidur bersama Rasulullah shallallahu 'alaihi wasallam dalam satu selimut, sedang aku sedang haidl. Jika beliau terkena sesuatu dariku, maka beliau membasuh tempat yang terkena tadi dan tidak melebihinya, kemudian beliau shalat dengan selimut tadi, dan beliau kembali lagi. Jika beliau terkena sesuatu dariku, maka dia melakukan seperti tadi dan tidak melebihinya, lalu shalat dengan selimut tersebut.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "24",
    "matchingArabicURN": "1103730",
    "last_updated": null
  },
  {
    "indonesianURN": "3203700",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "146",
    "babName": "Mencumbui wanita haidh",
    "hadithNumber": "370",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; Telah menceritakan kepada kami Abu Ahwash dari Abu Ishaq dari Amr bin Surahbil dari Aisyah Radliyallahu'anha dia berkata; bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan salah satu dari kami yang sedang haidl mengikat kainnya, kemudian beliau mempergaulinya (selain hubungan intim).</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "25",
    "matchingArabicURN": "1103740",
    "last_updated": null
  },
  {
    "indonesianURN": "3203710",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "146",
    "babName": "Mencumbui wanita haidh",
    "hadithNumber": "371",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dia berkata; Telah memberitakan kepada kami Jarir dari Manshur dari Ibrahim dari Al Aswad dari Aisyah Radliyallahu'anha dia berkata; \"Salah satu dari kami sedang haidl, maka Rasulullah shallallahu 'alaihi wasallam memerintahkannya untuk memakai kain, kemudian beliau mempergaulinya (selain hubungan intim).\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "26",
    "matchingArabicURN": "1103750",
    "last_updated": null
  },
  {
    "indonesianURN": "3203720",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "147",
    "babName": "Bagaimana nabi menggauli isterinya ketika haidh",
    "hadithNumber": "372",
    "hadithText": "Telah mengabarkan kepada kami Hannad bin As-Sariy dari Ibnu Ayyas yaitu Abu Bakr dari Shadaqah bin Sa'id kemudian dia menyebutkan satu kalimat yang maksudnya adalah Telah menceritakan kepada kami Jumai' bin 'Umair dia berkata; Saya, Ibuku dan bibiku menemui Aisyah maka Ibuku dan bibiku bertanya kepada Aisyah; \"Apa yang diperbuat oleh Rasulullah shallallahu 'alaihi wasallam kepada salah seorang diantara kalian -istri-istrinya- ketika sedang haidl? Aisyah menjawab; \"Jika di antara kami sedang haidl, maka beliau menyuruh salah seorang di antara kami -yang haidl- agar memakai kain yang longgar kemudian beliau menggauli dada dan kedua susunya.</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "27",
    "matchingArabicURN": "1103760",
    "last_updated": null
  },
  {
    "indonesianURN": "3203730",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "147",
    "babName": "Bagaimana nabi menggauli isterinya ketika haidh",
    "hadithNumber": "373",
    "hadithText": "Telah mengabarkan kepada kami Al Harits bin Miskin telah dibacakan kepadanya dan saya mendengarnya dari Ibnu Wahab dari Yunus dan Al-Laits dari Ibnu Syihab dari Habib -budak Urwah- dari Budayyah dan Al-Laits menyebutnya budak Maimunah yang fasih, dari Maimunah dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mencumbui salah satu istrinya yang sedang haidl bila di atasnya ada kain yang sampai ke tengah-tengah kedua pahanya dan kedua lututnya, sebagai penghalang.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "28",
    "matchingArabicURN": "1103770",
    "last_updated": null
  },
  {
    "indonesianURN": "3203740",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "148",
    "babName": "Mengajak wanita haidh makan bersama dan meminum dari jilatannya",
    "hadithNumber": "374",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id bin Jamil bin Tharif dia berkata; Telah memberitakan kepada kami; Yazid bin Miqdam bin Syuraih bin Hani dari Bapaknya - Syuraih - bahwa dia pernah bertanya kepada Aisyah Radliyallahu'anha 'Apakah perempuan boleh makan bersama suaminya jika dia sedang haidl? ' Dia (Aisyah) berkata, 'Ya, boleh. Rasulullah shallallahu 'alaihi wasallam pernah memanggilku, lalu aku makan bersama beliau, padahal aku sedang haidl. Beliau shallallahu 'alaihi wasallam mengambil daging, kemudian membaginya kepadaku, dan aku segera memakannya. Kemudian aku menaruhnya, lalu Rasulullah shallallahu 'alaihi wasallam mengambil dan memakannya. Beliau meletakkan mulutnya pada daging di tempat aku meletakkan mulutku tadi. Lalu beliau meminta air minum dan membaginya kepadaku, sebelum beliau meminumnya, maka aku mengambil dan meminumnya, lalu meletakkannya. Kemudian beliau mengambilnya dan meminumnya, dan beliau meletakkan mulutnya ditempat aku meletakkan mulutku di gelas tadi.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "29",
    "matchingArabicURN": "1103780",
    "last_updated": null
  },
  {
    "indonesianURN": "3203750",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "148",
    "babName": "Mengajak wanita haidh makan bersama dan meminum dari jilatannya",
    "hadithNumber": "375",
    "hadithText": "Telah mengabarkan kepada kami Ayyub bin Muhammad Al Wazzan dia berkata; Telah menceritakan kepada kami Abdullah bin Ja'far dia berkata; Ubaidullah bin Amr dari Al A'masy dari Miqdam bin Syuraih dari Bapaknya dari Aisyah Radliyallahu'anha dia berkata; \"Rasulullah shallallahu 'alaihi wasallam meletakkan mulutnya di tempat aku meminumnya, dan beliau meminum sisa minumku, padahal aku sedang haidl.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "30",
    "matchingArabicURN": "1103790",
    "last_updated": null
  },
  {
    "indonesianURN": "3203760",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "149",
    "babName": "Menggunakan sisa air wanita haidh",
    "hadithNumber": "376",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur dia berkata; Telah menceritakan kepada kami Sufyan dari Mis'ar dari Miqdam bin Suraih dari Bapaknya dia berkata; Saya mendengar Aisyah Radliyallahu'anha berkata; \"Rasulullah shallallahu 'alaihi wasallam memberi gelas kepadaku, lalu aku minum darinya, sementara aku sedang haidl. Kemudian aku berikan kepadanya -gelas itu- maka beliau mencari bekas tempat mulutku, lalu meletakkan mulutnya di situ.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "31",
    "matchingArabicURN": "1103800",
    "last_updated": null
  },
  {
    "indonesianURN": "3203770",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "149",
    "babName": "Menggunakan sisa air wanita haidh",
    "hadithNumber": "377",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan dia berkata; telah menceritakan kepada kami Waki' dia berkata; telah menceritakan kepada kami Mis'ar dan Syufyan dari Al-Miqdam bin syuraih dari bapaknya dari Aisyah Radliyallahu'anha dia berkata, \"Aku pernah minum dari sebuah gelas, sementara aku sedang haidl. Lalu aku berikan gelas itu kepada Nabi shallallahu 'alaihi wasallam, maka beliau meletakkan mulutnya di tempat bekas mulutku, lalu meminumnya. Aku juga pernah menggigit sepotong daging saat sedang haidl, lalu daging itu aku berikan kepada Nabi shallallahu 'alaihi wasallam, maka beliau meletakkan mulutnya di tempat bekas mulutku tadi.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "32",
    "matchingArabicURN": "1103810",
    "last_updated": null
  },
  {
    "indonesianURN": "3203780",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "150",
    "babName": "Membaca alquran dan kepalanya di pangkuan isteri yang haidh",
    "hadithNumber": "378",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dan Ali bin Hujr lafazhnya dari dia, keduanya berkata; telah menceritakan kepada kami Syufyan dari Manshur dari ibunya dari Aisyah Radliyallahu'anha dia berkata; \"Kepala Rasulullah shallallahu 'alaihi wasallam di pangkuan salah satu dari kami (istri-istri Nabi) yang sedang haidl, sementara beliau membaca Al Qur'an.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "33",
    "matchingArabicURN": "1103820",
    "last_updated": null
  },
  {
    "indonesianURN": "3203790",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "151",
    "babName": "Wanita haidh tidak terkena kewajiban shalat",
    "hadithNumber": "379",
    "hadithText": "Telah mengabarkan kepada kami Amr bin Zurarah dia berkata; telah menceritakan kepada kami Isma'il dari Ayyub dari Abu Qilabah dari Mu'adzah Al 'Adawiyah dari dia berkata; \"Seorang perempuan bertanya kepada Aisyah, 'Apakah orang haidl harus mengqadla shalat? ' dia menjawab, 'Apakah kamu orang Haruriyah? Kita dahulu mengalami haidl pada zaman Rasulullah shallallahu 'alaihi wasallam, dan kita tidak mengqadlanya, dan juga tidak disuruh mengqadlanya.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "34",
    "matchingArabicURN": "1103830",
    "last_updated": null
  },
  {
    "indonesianURN": "3203800",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "152",
    "babName": "Meminta pelayanan wanita haidh",
    "hadithNumber": "380",
    "hadithText": "Telah mengabarkan kepada kami Muhammad Al-Mutsana dia berkata; telah menceritakan kepada kami Yahya bin Sa'id dari Yazid bin Kaisan dia berkata; telah menceritakan kepadaku Abu Hazim dia berkata; Abu Hurairah berkata; \"Tatkala Rasulullah shallallahu 'alaihi wasallam berada di masjid, tiba-tiba beliau bersabda; 'Wahai Aisyah, ambilkan baju'. Aisyah menjawab, 'Aku sedang tidak suci'. Beliau bersabda, 'Haidl itu tidak di tanganmu'. Lalu dia pun mengambilkannya.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "35",
    "matchingArabicURN": "1103840",
    "last_updated": null
  },
  {
    "indonesianURN": "3203820",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "153",
    "babName": "Wanita haidh menggelar kain (tikar) di masjid",
    "hadithNumber": "382",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur dari Syufyan dari Manbudz dari Ibunya bahwasanya Maimunah berkata; \"Rasulullah shallallahu 'alaihi wasallam meletakkan kepalanya di pangkuan salah seorang dari kami (istri-istri Nabi shallallahu 'alaihi wasallam), dan beliau membaca Al Qur'an, sedangkan ia sedang haidl. Salah seorang dari kami (istri-istri Nabi shallallahu 'alaihi wasallam) bangkit menggelar untuk tikar di masjid, padahal ia sedang haidl.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "38",
    "matchingArabicURN": "1103870",
    "last_updated": null
  },
  {
    "indonesianURN": "3203830",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "154",
    "babName": "Isteri haidh menyisiri suami yang beri'tikaf di  masjid",
    "hadithNumber": "383",
    "hadithText": "Telah mengabarkan kepada kami Nashr bin Ali dia berkata; Telah menceritakan kepada kami Abdul A'la dia berkata; Telah menceritakan kepada kami Ma'mar dari Az-Zuhri dari Urwah dari Aisyah Radliyallahu'anha bahwa ia pernah menyisir rambut Rasulullah shallallahu 'alaihi wasallam, padahal ia sedang haidl, sementara Rasulullah shallallahu 'alaihi wasallam sedang i'tikaf, maka Rasulullah shallallahu 'alaihi wasallam memberikan (menyodorkan) kepalanya sementara ia berada di kamarnya.</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "39",
    "matchingArabicURN": "1103880",
    "last_updated": null
  },
  {
    "indonesianURN": "3203840",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "155",
    "babName": "Wanita haidh mengeramasi kepala suaminya",
    "hadithNumber": "384",
    "hadithText": "Telah mengabarkan kepada kami Amru bin Ali dia berkata; telah menceritakan kepada kami Yahya dia berkata; telah menceritakan kepadaku Syufyan dia berkata; telah menceritakan kepadaku Manshur dari Ibrahim dari Al-Aswad dari Aisyah Radliyallahu'anha dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mendekatkan kepalanya kepadaku, padahal ia sedang i'tikaf di masjid, maka aku membasuhnya sedangkan aku dalam keadaan haidl.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "40",
    "matchingArabicURN": "1103890",
    "last_updated": null
  },
  {
    "indonesianURN": "3203850",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "155",
    "babName": "Wanita haidh mengeramasi kepala suaminya",
    "hadithNumber": "385",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dia berkata; Telah menceritakan kepada kami Al-fudhail yaitu Ibnu Iyadl dari dia berkata; Al-A'masy dari Tamim bin Salamah dari Urwah dari Aisyah Radliyallahu'anha dia berkata: \"Rasulullah shallallahu 'alaihi wasallam pernah mengeluarkan kepalanya kepadaku, dan beliau sedang I'tikaf di masjid, maka aku membasuhnya, sedangkan aku sedang haidl.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "41",
    "matchingArabicURN": "1103900",
    "last_updated": null
  },
  {
    "indonesianURN": "3203860",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "155",
    "babName": "Wanita haidh mengeramasi kepala suaminya",
    "hadithNumber": "386",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Hisyam bin Urwah dari Bapaknya dari Aisyah, dia berkata: \"Aku pernah menyisir rambut Rasulullah shallallahu 'alaihi wasallam, padahal aku sedang haidl.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "42",
    "matchingArabicURN": "1103910",
    "last_updated": null
  },
  {
    "indonesianURN": "3203870",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "156",
    "babName": "Wanita haidh turut menghadiri idul adha-fitri dan dakwah muslimin",
    "hadithNumber": "387",
    "hadithText": "Telah mengabarkan kepada kami Amr bin Zurarah dia berkata; telah memberitakan kepada kami Ismail dari Ayub dari Hafshah dia berkata; \" Ummu Athiyyah berkata kepada Rasulullah shallallahu 'alaihi wasallam, 'Ayahku menjadi jaminanku'. Aku berkata, 'Apakah kamu mendengar Rasulullah shallallahu 'alaihi wasallam bersabda begini dan begitu? ' Ia menjawab, 'Ya, ayahku menjadi jaminanku. Beliau shallallahu 'alaihi wasallam bersabda, \"Hendaklah para budak dan gadis-gadis pingitan, serta perempuan-perempuan yang sedang haidl keluar untuk menyaksikan kebaikan dan dakwah kaum muslimin. Perempuan-perempuan yang sedang haidl hendaknya menjauh dari tempat shalat.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "43",
    "matchingArabicURN": "1103920",
    "last_updated": null
  },
  {
    "indonesianURN": "3203880",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "157",
    "babName": "Wanita haidh setelah Thawaf",
    "hadithNumber": "388",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dia berkata; Telah menceritakan kepada kami Abdurrahman bin Al Qasim dia berkata; Telah mengabarkan kepadaku Malik dari Abdullah bin Abu Bakar dari Bapaknya dari 'Amrah dari Aisyah Radliyallahu'anha, dia berkata kepada Rasulullah shallallahu 'alaihi wasallam bahwa Shafiyyah binti Huyay telah haidl. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangkalikah dia membuat kita tertahan? Bukankah dia sudah thawaf di Ka'bah bersama kalian?\" Aisyah berkata, \"Ya\" Rasulullah shallallahu 'alaihi wasallam bersabda, \"Keluarlah kalian.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "44",
    "matchingArabicURN": "1103930",
    "last_updated": null
  },
  {
    "indonesianURN": "3203890",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "158",
    "babName": "Apa yang dilakukan wanita nifas ketika ihram",
    "hadithNumber": "389",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Qudamah dia berkata; telah menceritakan kepada kami Jarir dari Yahya bin Sa'id dari Ja'far bin Muhammad dari Bapaknya dari Jabir bin Abdullah dalam hadis Asma' binti Umais ketika dia nifas (haidl) di Dzul Hulaifah, bahwa Rasulullah shallallahu 'alaihi wasallam pernah berkata kepada Abu Bakar, \"Suruh dia mandi lalu berihram.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "45",
    "matchingArabicURN": "1103940",
    "last_updated": null
  },
  {
    "indonesianURN": "3203900",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "159",
    "babName": "Kewajiban shalat untuk wanita nifas",
    "hadithNumber": "390",
    "hadithText": "Telah mengabarkan kepada kami Humaid bin Mas'adah dari Abdul Warits dari Husain yaitu Al-Mu'allim dari Ibnu Buraidah dari Samurah dia berkata; \"Aku shalat (jenazah) bersama Rasulullah shallallahu 'alaihi wasallam atas mayit Ummu Ka'ab -yang meninggal dunia dalam keadaan nifas (haidl) - maka Rasulullah shallallahu 'alaihi wasallam berdiri shalat (menghadap) di tengah-tengahnya.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "46",
    "matchingArabicURN": "1103950",
    "last_updated": null
  },
  {
    "indonesianURN": "3203910",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "160",
    "babName": "Darah haidh mengenai pakaian",
    "hadithNumber": "391",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Habib bin 'Arabi dia berkata; telah menceritakan kepada kami Hamad dari Hisyam bin Urwah dari Fathimah binti Mundzir dari Asma' binti Abu Bakar -dan dia berada di kamarnya- bahwa ada seorang perempuan meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam tentang darah haidl yang mengenai pakaian, Beliau bersabda: \"Gosoklah dengan ujung jari, kemudian cucilah dengan air. Lalu shalatlah dengan kain tersebut.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "47",
    "matchingArabicURN": "1103960",
    "last_updated": null
  },
  {
    "indonesianURN": "3203920",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "160",
    "babName": "Darah haidh mengenai pakaian",
    "hadithNumber": "392",
    "hadithText": "Telah mengabarkan kepada kami Ubaidullah bin Sa'id dia berkata; telah menceritakan kepada kami Yahya dari Syufyan dia berkata; telah menceritakan kepadaku Abu Miqdam Tsabit Al-Haddad dari Adi bin Dinar dia berkata; saya mendengar Ummu Qais bin Mihshan, bahwa dia pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang darah haidl yang mengenai pakaian, Maka beliau menjawab.\"Gosoklah dengan kayu, lalu cuci dengan air dan sidr (daun Bidara).\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "48",
    "matchingArabicURN": "1103970",
    "last_updated": null
  },
  {
    "indonesianURN": "3203811",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "152",
    "babName": "Meminta pelayanan wanita haidh",
    "hadithNumber": "381",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari 'Abidah dari Al-A'masy dan dalam jalur periwayatan yang lain disebutkan; telah menceritakan kepada kami Ishaq bin Ibrahim telah mengabarkan kepada kami Jarir dari Al A'masy dari Tsabit bin Ubaid dari Al Qasim bin Muhammad dia berkata; Aisyah Radliyallahu'anha berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ambilkan tikar kecil dari masjid'. Aisyah berkata, 'Aku sedang haidl'. Rasulullah shallallahu 'alaihi wasallam bersabda: 'Haidlmu itu bukan di tanganmu.\"</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "36",
    "matchingArabicURN": "1103850",
    "last_updated": null
  },
  {
    "indonesianURN": "3203812",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "3",
    "bookName": "Haidh dan Istihadhoh",
    "babNumber": "152",
    "babName": "Meminta pelayanan wanita haidh",
    "hadithNumber": "381",
    "hadithText": "Ishaq mengatakan; Abu Mu'awiyah telah memberitakan kepada kami dari A'masy dengan isnad ini semisalnya.</b>",
    "bookID": "3.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "37",
    "matchingArabicURN": "1103860",
    "last_updated": null
  }
]