[
  {
    "indonesianURN": "3235530",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1669",
    "babName": "Dimakruhkan menunda-nunda washiat",
    "hadithNumber": "3553",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Harb berkata; telah menceritakan kepada kami Muhammad bin Fudlail dari 'Umarah dari Abu Zur'ah dari Abu Hurairah ia berkata, \"Seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam kemudian berkata, \"Wahai Rasulullah, sedekah apakah yang paling besar pahalanya?\" Beliau bersabda: \"Engkau bersedekah sedang engkau dalam keadaan sehat, pelit dan takut miskin dan ingin hidup kekal, engkau tidak menunda (untuk sedekah) hingga nyawa telah sampai pada leher. Engkau katakan 'Ini untuk fulan sekian dan ini untuk si fulan sekian'.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "1136240",
    "last_updated": null
  },
  {
    "indonesianURN": "3235540",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1669",
    "babName": "Dimakruhkan menunda-nunda washiat",
    "hadithNumber": "3554",
    "hadithText": "Telah mengabarkan kepada kami Hannad bin As Sari dari Abu Mu'awiyah dari Al A'masy dari Ibrahim At Taimi dari Al Harits bin Suwaid dari Abdullah ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapakah di antara kalian yang harta pewarisnya lebih ia cintai daripada hartanya?\" Mereka berkata, \"Wahai Rasulullah, tidaklah di antara kami seorang pun kecuali hartanya lebih ia sukai daripada harta pewarisnya.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Ketahuilah, sesungguhnya tidak ada seorangpun di antara kalian melainkan harta pewarisnya lebih ia cintai daripada hartanya. Hartamu adalah apa yang telah engkau dahulukan sedang harta pewarismu adalah apa yang engkau tunda.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "1136250",
    "last_updated": null
  },
  {
    "indonesianURN": "3235550",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1669",
    "babName": "Dimakruhkan menunda-nunda washiat",
    "hadithNumber": "3555",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Ali berkata; telah menceritakan kepada kami Yahya berkata; telah menceritakan kepada kami Syu'bah dari Qatadah dari Mutharrif dari ayahnya dari Nabi shallallahu 'alaihi wasallam, beliau membaca ayat: '(Bermegah-megahan telah melalaikan kamu sampai kamu masuk ke dalam kubur) ' (Qs. At Takaatsur: 1-2). Beliau bersabda: \"Anak Adam berkata, 'Hartaku, hartaku'. Sesungguhnya hartamu adalah apa yang telah engkau makan hingga engkau habiskan, atau engkau pakai hingga engkau hancurkan, atau engkau sedekahkan sehingga habis.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "1136260",
    "last_updated": null
  },
  {
    "indonesianURN": "3235560",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1669",
    "babName": "Dimakruhkan menunda-nunda washiat",
    "hadithNumber": "3556",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar berkata; telah menceritakan kepada kami Muhammad berkata; telah menceritakan kepada kami Syu'bah berkata; aku mendengar Abu Ishaq mendengar Abu Habibah Ath Thai berkata, \"Seseorang telah berwasiat dengan beberapa dinar di jalan Allah. Kemudian Abu Ad Darda ditanya (tentang hal tersebut), kemudian ia menceritakan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Permisalan orang memerdekakan budak atau bersedekah di saat akan meninggal seperti orang yang memberikan hadiah setelah ia Kenyang.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "1136270",
    "last_updated": null
  },
  {
    "indonesianURN": "3235570",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1669",
    "babName": "Dimakruhkan menunda-nunda washiat",
    "hadithNumber": "3557",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id berkata; telah menceritakan kepada kami Al Fudlail dari 'Ubaidullah dari Nafi' dari Ibnu Umar berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada hak atas seorang muslim yang mempunyai sesuatu untuk diwasiatkan, untuk bermalam selama dua malam kecuali wasiatnya telah tertulis di sisinya.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "1136280",
    "last_updated": null
  },
  {
    "indonesianURN": "3235590",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1669",
    "babName": "Dimakruhkan menunda-nunda washiat",
    "hadithNumber": "3559",
    "hadithText": "Telah mengabarkan kepada kami Yunus bin Abdul A'la berkata; telah memberitakan kepada kami Ibnu Wahb berkata; telah mengabarkan kepadaku Yunus dari Ibnu Syihab berkata; bahwa Salim mengabarkan kepadaku dari Abdullah bin Umar bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada hak atas seorang muslim (untuk bermalam) lebih dari tiga malam kecuali wasiatnya telah tertulis di sisinya.\" Abdullah bin Umar berkata, \"Semenjak aku mendengar sabda Rasulullah shallallahu 'alaihi wasallam tersebut, tidak pernah terlewatkan olehku untuk menulis wasiatku.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "1136310",
    "last_updated": null
  },
  {
    "indonesianURN": "3235600",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1669",
    "babName": "Dimakruhkan menunda-nunda washiat",
    "hadithNumber": "3560",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Yahya bin Az Zubair bin Sulaiman berkata; aku mendengar Ibnu Wahb berkata; telah mengabarkan kepadaku Yunus dan 'Amru bin Al Harits dari Ibnu Syihab dari Salim bin Abdullah dari ayahnya dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak berhak bagi seorang muslim yang memiliki sesuatu untuk diwasiatkan, untuk bermalam selama tiga malam, melainkan wasiatnya telah tertulis di sisinya.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "1136320",
    "last_updated": null
  },
  {
    "indonesianURN": "3235610",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1670",
    "babName": "Apakah Nabi Shallallahu'alaihiwasallam meninggalkan wasiat?",
    "hadithNumber": "3561",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud berkata; telah menceritakan kepada kami Khalid bin Al Harits berkata; telah menceritakan kepada kami Malik bin Mighwal berkata; telah menceritakan kepada kami Thalhah berkata; aku bertanya kepada Ibnu Abu Aufa, \"Apakah Rasulullah shallallahu 'alaihi wasallam memberikan wasiat?\" Ia menjawab, \"Tidak.\" Aku lalu katakan, \"Bagaimana beliau mewajibkan wasiat terhadap orang-orang Muslim!\" Ia menjawab, \"Beliau berwasiat dengan Kitab Allah.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "1136330",
    "last_updated": null
  },
  {
    "indonesianURN": "3235620",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1670",
    "babName": "Apakah Nabi Shallallahu'alaihiwasallam meninggalkan wasiat?",
    "hadithNumber": "3562",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Rafi' berkata; telah menceritakan kepada kami Yahya bin Adam berkata; telah menceritakan kepada kami Mufadldlal dari Al A'masy, dan telah memberitakan kepada kami Muhammad bin Al A'la dan Ahmad bin Harb mereka berkata; telah menceritakan kepada kami Abu Mu'awiyah dari Al A'masy dari Syaqiq dari Masruq dari Aisyah ia berkata, \"Rasulullah shallallahu 'alaihi wasallam tidak meninggalkan uang dinar, dirham, kambing atau unta, beliau tidak berwasiat dengan sesuatu.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "1136340",
    "last_updated": null
  },
  {
    "indonesianURN": "3235630",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1670",
    "babName": "Apakah Nabi Shallallahu'alaihiwasallam meninggalkan wasiat?",
    "hadithNumber": "3563",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Rafi' telah menceritakan kepada kami Mush'ab telah menceritakan kepada kami Daud dari Al A'masy dari Syaqiq dari Masruq dari Aisyah, ia berkata; Rasulullah shallallahu 'alaihi wasallam tidak meninggalkan uang dirham, dinar, kambing serta unta, dan beliau tidak berwasiat.</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "1136350",
    "last_updated": null
  },
  {
    "indonesianURN": "3235640",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1670",
    "babName": "Apakah Nabi Shallallahu'alaihiwasallam meninggalkan wasiat?",
    "hadithNumber": "3564",
    "hadithText": "Telah mengabarkan kepada kami Ja'far bin Muhammad bin Al Hudzail dan Ahmad bin Yusuf mereka berkata; telah menceritakan kepada kami 'Ashim bin Yusuf berkata; telah menceritakan kepada kami Hasan bin 'Ayyasy dari Al A'masy dari Ibrahim dari Al Aswad dari Aisyah ia berkata, \"Rasulullah shallallahu 'alaihi wasallam tidak meninggalkan uang dirham, dinar, kambing atau unta, dan beliau tidak berwasiat.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "1136360",
    "last_updated": null
  },
  {
    "indonesianURN": "3235650",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1670",
    "babName": "Apakah Nabi Shallallahu'alaihiwasallam meninggalkan wasiat?",
    "hadithNumber": "3565",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Ali berkata; telah menceritakan kepada kami Azhar berkata; telah memberitakan kepada kami Ibnu 'Aun dari Ibrahim dari Al Aswad dari Aisyah berkata, \"Mereka berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah berwasiat kepada Ali radliallahu 'anhu, beliau minta diambilkan bejana untuk buang air kecil, kemudian beliau bergetar (akan meninggal) dan aku tidak merasakan. Maka kepada siapa beliau berwasiat?\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "1136370",
    "last_updated": null
  },
  {
    "indonesianURN": "3235660",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1670",
    "babName": "Apakah Nabi Shallallahu'alaihiwasallam meninggalkan wasiat?",
    "hadithNumber": "3566",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman berkata; telah menceritakan kepada kami 'Arim berkata; telah menceritakan kepada kami Hammad bin Zaid dari Ibnu 'Aun dari Ibrahim dari Al Aswad dari Aisyah ia berkata, \"Rasulullah shallallahu 'alaihi wasallam meninggal dan tidak ada seorangpun di sisinya selain diriku, beliau meminta dibawakan baskom.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "1136380",
    "last_updated": null
  },
  {
    "indonesianURN": "3235670",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1671",
    "babName": "Wasiat sepertiga",
    "hadithNumber": "3567",
    "hadithText": "Telah mengabarkan kepadaku 'Amru bin Utsman bin Sa'id berkata; telah menceritakan kepada kami Sufyan dari Az Zuhri dari 'Amir bin Sa'd dari ayahnya ia berkata, \"Aku menderita sakit kemudian Rasulullah shallallahu 'alaihi wasallam mengunjungiku. Aku berkata, \"Wahai Rasulullah, sesungguhnya aku memiliki harta yang banyak dan tidak ada yang mewarisiku kecuali anak wanitaku, bolehkah aku bersedekah dengan dua pertiga hartaku?\" Beliau bersabda: \"Tidak.\" Aku lalu bertanya lagi, \"bagaimana jika setengah?\" Beliau menjawab: \"Tidak.\" Aku bertanya lagi, \"Bagaimana jika sepertiga?\" Beliau bersabda: \"Sepertiga, dan sepertiga itu banyak. Sesungguhnya engkau meninggalkan para pewarismu dalam keadaan kaya lebih baik bagimu daripada engkau meninggalkan mereka dalam keadaan miskin, dan meminta-minta kepada manusia.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "1136390",
    "last_updated": null
  },
  {
    "indonesianURN": "3235680",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1671",
    "babName": "Wasiat sepertiga",
    "hadithNumber": "3568",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Manshur dan Ahmad bin Sulaiman dan lafazhnya adalah lafazh Ahmad. Mereka berkata; telah menceritakan kepada kami Abu Nu'aim berkata; telah menceritakan kepada kami Sufyan dari Sa'd bin Ibrahim dari 'Amir bin Sa'd dari Sa'd ia berkata, \"Nabi shallallahu 'alaihi wasallam datang menjengukku saat aku di Makkah, lalu aku katakan, \"Wahai Rasulullah, bolehkah aku berwasiat dengan seluruh hartaku?\" Beliau menjawab: \"Jangan.\" Aku tanyakan lagi, \"Bagaimana jika setengah?\" Beliau menjawab: \"Jangan.\" Aku tanyakan lagi, \"Bagaimana jika sepertiga?\" Beliau menjawab: \"Sepertiga, dan sepertiga itu banyak. Sesungguhnya engkau meninggalkan pewarismu dalam keadaan kaya lebih baik daripada engkau meninggalkan mereka dalam keadaan miskin dan meminta-minta kepada manusia dengan tangan mereka.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "17",
    "matchingArabicURN": "1136400",
    "last_updated": null
  },
  {
    "indonesianURN": "3235700",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1671",
    "babName": "Wasiat sepertiga",
    "hadithNumber": "3570",
    "hadithText": "Telah mengabarkan kepada kami Al Abbas bin Abdul 'Azhim Al 'Anbari berkata; telah menceritakan kepada kami Abdul Kabir bin Abdul Majid berkata; telah menceritakan kepada kami Bukair bin Mismar berkata; aku mendengar 'Amir bin Sa'd dari ayahnya, bahwa ia mengalami sakit di Makkah, kemudian Rasulullah shallallahu 'alaihi wasallam datang kepadanya. Kemudian setelah Sa'd melihatnya, ia menangis dan berkata, \"Wahai Rasulullah, apakah aku akan meninggal di negeri yang darinya aku berhijrah?\" Beliau menjawab: \"Tidak, insya Allah.\" Sa'd lalu berkata, \"Wahai Rasulullah, bolehkah aku berwasiat dengan seluruh hartaku di jalan Allah?\" Beliau menjawab: \"Jangan.\" Sa'd berkata lagi, \"Bagaimana jika dua pertiganya?\" Beliau menjawab: \"Jangan.\" Sa'd berkata lagi, \"Bagaimana jika setengahnya?\" Beliau menjawab: \"Jangan.\" Sa'd berkata lagi, \"Bagaimana jika sepertiganya?\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sepertiga, dan sepertiga itu banyak. Sesungguhnya engkau meninggalkan anak-anakmu dalam keadaan kaya lebih baik daripada engkau meninggalkan mereka dalam keadaan miskin dan meminta-minta kepada manusia.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "20",
    "matchingArabicURN": "1136430",
    "last_updated": null
  },
  {
    "indonesianURN": "3235710",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1671",
    "babName": "Wasiat sepertiga",
    "hadithNumber": "3571",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim berkata; telah memberitakan kepada kami Jarir dari 'Atha bin As Saib dari Abu 'Abdurrahman dari Sa'd bin Abu Waqqash ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengunjungiku ketika aku sedang sakit. Beliau bersabda: \"Apakah engkau telah berwasiat?\" Aku menjawab, \"Ya.\" Beliau bertanya: \"Berapa?\" Aku jawab, \"Semuanya untuk di jalan Allah.\" Beliau bersabda: \"Apakah engkau tidak meninggalkan untuk anakmu?\" Aku jawab, \"Mereka orang-orang kaya.\" Beliau lalu bersabda: \"Berwasiatlah dengan sepersepuluh.\" Beliau terus saja bersabda dan aku menimpalinya hingga beliau pun bersabda: \"Berwasiatlah dengan sepertiga, dan sepertiga itu banyak atau besar.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "21",
    "matchingArabicURN": "1136440",
    "last_updated": null
  },
  {
    "indonesianURN": "3235720",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1671",
    "babName": "Wasiat sepertiga",
    "hadithNumber": "3572",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim berkata; telah menceritakan kepada kami Waki' berkata; telah menceritakan kepada kami Hisyam bin 'Urwah dari ayahnya dari Sa'd, bahwa Nabi shallallahu 'alaihi wasallam mengunjunginya ketika ia sedang sakit. Ia lalu berkata, \"Wahai Rasulullah, bolehkah aku berwasiat dengan seluruh hartaku?\" Beliau menjawab: \"Tidak.\" Ia berkata lagi, \"Bagaimana jika setengah?\" Beliau menjawab: \"Tidak.\" Ia berkata lagi, \"Bagaimana jika sepertiga?\" Beliau menjawab: \"Sepertiga, dan sepertiga itu banyak atau besar.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "22",
    "matchingArabicURN": "1136450",
    "last_updated": null
  },
  {
    "indonesianURN": "3235730",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1671",
    "babName": "Wasiat sepertiga",
    "hadithNumber": "3573",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Walid Al Fahham berkata; telah menceritakan kepada kami Muhammad bin Rabi'ah berkata; telah menceritakan kepada kami Hisyam bin 'Urwah dari ayahnya dari 'Aisyah, bahwa Rasulullah shallallahu 'alaihi wasallam menjenguk Sa'd, lalu ia berkata kepada beliau, \"Wahai Rasulullah, bolehkah aku berwasiat dengan dua pertiga hartaku?\" beliau menjawab: \"Jangan.\" Ia bertanya lagi, \"Bagaimana jika setengah hartaku?\" Beliau menjawab: \"Jangan.\" Ia bertanya lagi, \"Bagaimana dengan sepertiganya?\" Beliau menjawab: \"Ya. Sepertiga, dan sepertiga itu banyak atau besar. Sesungguhnya jika engkau tinggalkan pewarismu dengan kekayaan itu lebih baik daripada engkau tinggalkan mereka fakir dan meminta-minta.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "23",
    "matchingArabicURN": "1136460",
    "last_updated": null
  },
  {
    "indonesianURN": "3235740",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1671",
    "babName": "Wasiat sepertiga",
    "hadithNumber": "3574",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id berkata; telah menceritakan kepada kami Sufyan dari Hisyam bin 'Urwah dari ayahnya dari Ibnu Abbas berkata, \"Orang-orang mengurangi wasiat hingga seperempat karena Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sepertiga, dan sepertiga itu banyak atau besar.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "24",
    "matchingArabicURN": "1136470",
    "last_updated": null
  },
  {
    "indonesianURN": "3235750",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1671",
    "babName": "Wasiat sepertiga",
    "hadithNumber": "3575",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna berkata; telah menceritakan kepada kami Hajjaj bin Al Minhal berkata; telah menceritakan kepada kami Hammam dari Qatadah dari Yunus bin Jubair dari Muhammad bin Sa'd dari ayahnya dari Sa'd bin Malik, bahwa Nabi shallallahu 'alaihi wasallam datang kepadanya dan ia dalam keadaan sakit, kemudian ia berkata, \"Sesungguhnya aku tidak memiliki anak kecuali seorang anak wanita, maka apakah boleh aku berwasiat dengan seluruh hartaku?\" Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak.\" Ia bertanya lagi, \"Bolehkan aku berwasiat dengan setengah?\" Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak.\" Ia bertanya lagi, \"Bagaimana jika dengan sepertiga?\" Beliau bersabda: \"Sepertiga, dan sepertiga itu banyak.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "25",
    "matchingArabicURN": "1136480",
    "last_updated": null
  },
  {
    "indonesianURN": "3235760",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1671",
    "babName": "Wasiat sepertiga",
    "hadithNumber": "3576",
    "hadithText": "Telah mengabarkan kepada kami Al Qasim bin Zakaria bin Dinar berkata; telah menceritakan kepada kami 'Ubaidullah dari Syaiban dari Firas dari Asy Sya'bi ia berkata; telah menceritakan kepadaku Jabir bin Abdullah, bahwa ayahnya syahid ketika perang Uhud dan meninggalkan enam anak perempuan dan tanggungan hutang. Ketika datang masa panen kurma, aku menemui Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, anda mengetahui bahwa ayahku syahid pada perang Uhud dan ia meninggalkan hutang yang banyak, dan aku ingin agar orang-orang yang memberi hutang melihatmu, beliau bersabda: \"Pergilah dan kumpulkan kurma-kurma di setiap ujungnya, \" setelah melakukannya kemudian aku memanggil beliau, ketika mereka melihat beliau seakan-akan mereka terus memintaku saat itu, ketika beliau melihat apa yang mereka perbuat beliau mengelilingkan tempat menebah di sekitar kumpulan kurma yang paling banyak, sebanyak tiga kali, lalu beliau duduk di atasnya dan bersabda: \"Panggillah para sahabatmu, \" maka beliau masih menakar untuk mereka hingga Allah menunaikan amanat ayahku dan aku ridla jika Allah menunaikan amanat ayahku, dan tidak mengurangi satu kurma pun.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "26",
    "matchingArabicURN": "1136490",
    "last_updated": null
  },
  {
    "indonesianURN": "3235770",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1672",
    "babName": "Melunasi hutang sebelum warisan dibagi dan perbedaan redaksi pengutip",
    "hadithNumber": "3577",
    "hadithText": "Telah mengabarkan kepada kami 'Abdurrahman bin Muhammad bin Sallam berkata; telah menceritakan kepada kami Ishaq -yaitu Al Azraq- berkata; telah menceritakan kepada kami Zakaria dari Asy Sya'bi dari Jabir, bahwa ayahnya meninggal dan memiliki hutang. Kemudian aku datang kepada Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, sesungguhnya ayahku meninggal dan memiliki hutang. Dan ia tidak meninggalkan kecuali apa yang dihasilkan oleh pohon kurma, dan apa yang dihasilkan oleh pohon kurma itu tidak mencukupi untuk membayar hutangnya, kecuali hanya enam puluh sha'. Maka pergilah bersamaku wahai Rasulullah, agar para pemilik piutang tidak bertindak keji kepadaku.\" Maka Rasulullah shallallahu 'alaihi wasallam datang dan memutar satu demi satu tempat menebah. Lalu beliau mengucapkan salam di sekitarnya dan berdoa untuknya, kemudian beliau duduk di atasnya serta memanggil para pemilik piutang dan tersisa seperti apa yang telah mereka ambil.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "27",
    "matchingArabicURN": "1136500",
    "last_updated": null
  },
  {
    "indonesianURN": "3235780",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1672",
    "babName": "Melunasi hutang sebelum warisan dibagi dan perbedaan redaksi pengutip",
    "hadithNumber": "3578",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr berkata; telah menceritakan kepada kami Jarir dari Mughirah dari Asy Sya'bi dari Jabir berkata, \"Abdullah bin 'Amru bin Haran meninggal dan meninggalkan hutang, kemudian aku meminta bantuan Rasulullah shallallahu 'alaihi wasallam menghadapi para pemilik piutang agar mereka menggugurkan sebagian hutangnya. Kemudian Jabir meminta dari mereka namun mereka menolak. Kemudian Nabi shallallahu 'alaihi wasallam bersabda kepadaku: \"Pergilah kemudian kelompokkan kurmamu menjadi beberapa jenis, 'Ajwa` tersendiri, 'Idzq bin Zaid tersendiri dan jenis-jenisnya. Kemudian kirimkan kepadaku utusan kepadaku.\" Jabir berkata, \"Kemudian aku melakukannya, dan Rasulullah shallallahu 'alaihi wasallam datang dan duduk di atasnya atau di tengahnya kemudian bersabda: \"Takarlah untuk orang-orang tersebut.\" Jabir berkata, \"Kemudian aku menakar untuk mereka hingga memenuhi hak mereka, kemudian tersisa kurmaku dan seakan-akan tidak berkurang sedikitpun.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "28",
    "matchingArabicURN": "1136510",
    "last_updated": null
  },
  {
    "indonesianURN": "3235790",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1672",
    "babName": "Melunasi hutang sebelum warisan dibagi dan perbedaan redaksi pengutip",
    "hadithNumber": "3579",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Yunus bin Muhammad Harami berkata; telah menceritakan kepada kami Bapakku berkata; telah menceritakan kepada kami Hammad dari 'Ammar bin Abu 'Ammar dari Jabir bin Abdullah berkata, \"Dahulu seorang Yahudi memiliki piutang atas ayahku, kemudian ayahku terbunuh pada perang Uhud dan meninggalkan dua kebun. Sedangkan (untuk membayar) kurma orang Yahudi menghabiskan apa yang ada di dalam kedua kebun tersebut. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Apakah engkau bisa mengambil pada tahun ini setengahnya dan menunda setengahnya.\" Lalu orang Yahudi tersebut menolak, kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Apakah engkau bisa mengambil potongan pohon kurma kemudian memberitahuku?\" Kemudian aku memberitahukan kepada beliau hingga beliau pun datang bersama Abu Bakr. Kemudian mulailah dipotong dan ditakar dari bawah pohon kurma, sedang Rasulullah shallallahu 'alaihi wasallam mendoakan agar mendapatkan berkah hingga kami dapat memenuhi seluruh haknya dari kebun yang paling kecil (sebagaimana yang diperkirakan oleh 'Ammar), kemudian aku menemui mereka dengan membawa ruthab (kurma segar) dan air, lalu mereka makan dan minum. Kemudian beliau bersabda: \"Ini adalah kenikmatan yang (akan) ditanyakan kepada kalian.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "29",
    "matchingArabicURN": "1136520",
    "last_updated": null
  },
  {
    "indonesianURN": "3235800",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1672",
    "babName": "Melunasi hutang sebelum warisan dibagi dan perbedaan redaksi pengutip",
    "hadithNumber": "3580",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dari Abdul Wahhab berkata; telah menceritakan kepada kami 'Ubaidullah dari Wahb bin Kaisan dari Jabir bin Abdullah berkata, \"Ayahku meninggal dan beliau memiliki hutang. Kemudian aku menawarkan kepada para pemilik piutang agar mengambil buah sesuai yang ada padanya. Namun mereka tidak melihat hal itu dapat memenuhi hutang. Kemudian aku datang kepada Rasulullah shallallahu 'alaihi wasallam dan menyebutkan hal tersebut kepada beliau. Beliau bersabda: \"Apabila engkau telah memotong kurma dan meletakkannya pada tempat menebah kurma, maka beritahu aku.\" Kemudian, setelah aku memotongnya dan meletakkannya pada tempat penebahan kurma, aku datang kepada Rasulullah shallallahu 'alaihi wasallam. Beliau lantas datang bersama dengan Abu Bakr dan Umar. Lalu beliau duduk di atasnya dan mendoakan agar mendapatkan berkah. Kemudian beliau bersabda: \"Panggillah para pemilik piutangmu, dan penuhi hak mereka.\" Aku tidak meninggalkan seorangpun yang memiliki hak atas ayahku kecuali telah aku bayar haknya dan tersisa untukku tiga belas wasaq. Kemudian aku sebutkan hal tersebut kepada beliau, maka beliau tertawa dan bersabda: \"Datanglah kepada Abu Bakr dan Umar, kemudian kabarkan hal tersebut kepada mereka.\" Kemudian aku mendatangi Abu Bakr dan Umar dan mengabarkan hal tersebut kepada mereka. Lalu mereka berkata, \"Sungguh, kami telah mengetahui ketika Rasulullah shallallahu 'alaihi wasallam melakukan apa yang beliau lakukan bahwa hal tersebut akan terjadi.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "30",
    "matchingArabicURN": "1136530",
    "last_updated": null
  },
  {
    "indonesianURN": "3235810",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1673",
    "babName": "Wasiat tak berlaku bagi orang yang memperoleh warisan",
    "hadithNumber": "3581",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id berkata; telah menceritakan kepada kami Abu 'Awanah dari Qatadah dari Syahr bin Hausyab dari 'Abdurrahman bin Ghunm dan 'Amru bin Kharijah berkata, \"Rasulullah shallallahu 'alaihi wasallam berkhutbah kemudian bersabda: \"Sungguh, Allah telah memberikan hak kepada setiap yang berhak menerimanya, dan tidak ada wasiat bagi pewaris.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "31",
    "matchingArabicURN": "1136540",
    "last_updated": null
  },
  {
    "indonesianURN": "3235820",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1673",
    "babName": "Wasiat tak berlaku bagi orang yang memperoleh warisan",
    "hadithNumber": "3582",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud berkata; telah menceritakan kepada kami Khalid berkata; telah menceritakan kepada kami Syu'bah berkata; telah menceritakan kepada kami Qatadah dari Syahr bin Hausyab bahwa Ibnu Ghunm menyebutkan bahwa Ibnu Kharijah menyebutkan kepadanya, bahwa ia telah menyaksikan Rasulullah shallallahu 'alaihi wasallam berkhutbah kepada manusia di atas kendaraan beliau, dan sungguh binatang tersebut menelan makanan yang keluar dari perutnya dan air liurnya mengalir. Kemudian dalam khutbahnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh, Allah telah memberikan hak kepada setiap yang berhak menerimanya, dan tidak ada wasiat bagi pewaris.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "32",
    "matchingArabicURN": "1136550",
    "last_updated": null
  },
  {
    "indonesianURN": "3235830",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1673",
    "babName": "Wasiat tak berlaku bagi orang yang memperoleh warisan",
    "hadithNumber": "3583",
    "hadithText": "Telah mengabarkan kepada kami 'Utbah bin Abdullah Al Marwazi berkata; telah memberitakan kepada kami Abdullah bin Al Mubarak berkata; telah memberitakan kepada kami Isma'il bin Abu Khalid dari Qatadah dari 'Amru bin Kharijah ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh, Allah telah memberikan hak kepada setiap yang berhak menerimanya, dan tidak ada wasiat bagi pewaris.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "33",
    "matchingArabicURN": "1136560",
    "last_updated": null
  },
  {
    "indonesianURN": "3235840",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1674",
    "babName": "Jika berwasiat untuk kerabat yang paling dekat",
    "hadithNumber": "3584",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim berkata; telah menceritakan kepada kami Jarir dari Abdul Malik bin 'Umair dari Musa bin Thalhah dari Abu Hurairah berkata, \"Tatkala turun ayat: '(dan peringatkan keluargamu yang paling dekat) ' (Qs. Asy Syu'araa': 214), Rasulullah shallallahu 'alaihi wasallam menyeru kepada orang-orang Quraisy kemudian mereka berkumpul, lalu beliau berbicara kepada orang umum dan khusus. Beliau bersabda: \"Wahai Bani Abdul Muththalib, selamatkan diri kalian dari Neraka. Wahai Fatimah, selamatkan dirimu dari Neraka, sesungguhnya aku tidak dapat menolong kalian sedikitpun dari Allah, hanya saja kalian memiliki kekerabatan yang akan aku sambung.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "34",
    "matchingArabicURN": "1136570",
    "last_updated": null
  },
  {
    "indonesianURN": "3235850",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1674",
    "babName": "Jika berwasiat untuk kerabat yang paling dekat",
    "hadithNumber": "3585",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman berkata; telah menceritakan kepada kami 'Ubaidullah bin Musa berkata; telah memberitakan kepada kami Isra'il dari Mu'awiyah -yaitu Ibnu Ishaq- dari Musa bin Thalhah berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Bani Abdu Manaf, belilah diri kalian dari Tuhan kalian, sesungguhnya aku tidak mampu menolong kalian sedikitpun dari Allah. Wahai Bani Abdul Muththalib, belilah diri kalian dari Tuhan kalian, sesungguhnya aku tidak mampu menolong kalian sedikitpun dari Allah. Akan tetapi antara diriku dan kalian terdapat hubungan kekerabatan dan aku akan menyambungnya.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "35",
    "matchingArabicURN": "1136580",
    "last_updated": null
  },
  {
    "indonesianURN": "3235860",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1674",
    "babName": "Jika berwasiat untuk kerabat yang paling dekat",
    "hadithNumber": "3586",
    "hadithText": "Telah mengabarkan kepada kami Sulaiman bin Daud dari Ibnu Wahb berkata; telah mengabarkan kepadaku Yunus dari Ibnu Syihab berkata; telah mengabarkan kepadaku Sa'id bin Al Musayyab dan Abu Salamah bin 'Abdurrahman dari Abu Hurairah berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda ketika diturunkan kepadanya ayat: '(dan peringatkanlah keluargamu yang terdekat) ' (Qs. Asy Syu'araa': 214), beliau katakan: \"Wahai orang-orang Quraisy, belilah diri kalian dari Allah, aku tidak mampu menolong kalian sedikitpun dari Allah. Wahai Bani Abdul Muththalib, aku tidak mampu menolong kalian sedikitpun dari Allah. Wahai Abbas bin Abdul Muththalib, aku tidak mampu menolong kamu sedikitpun dari Allah. Wahai Shafiyah bibi Rasulullah, aku tidak mampu menolong kamu sedikitpun dari Allah. Wahai Fatimah binti Muhammad, mintalah kepadaku apa yang engkau inginkan, aku tidak mampu menolong kamu sedikitpun dari Allah.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "36",
    "matchingArabicURN": "1136590",
    "last_updated": null
  },
  {
    "indonesianURN": "3235870",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1674",
    "babName": "Jika berwasiat untuk kerabat yang paling dekat",
    "hadithNumber": "3587",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Khalid berkata; telah menceritakan kepada kami Bisyr bin Syu'aib dari ayahnya dari Az Zuhri berkata; telah mengabarkan kepadaku Sa'id bin Al Musayyab dan Abu Salamah bin 'Abdurrahman bahwa Abu Hurairah berkata, \"Rasulullah shallallahu 'alaihi wasallam berdiri ketika diturunkan kepadanya ayat: '(dan peringatkan keluargamu yang terdekat) ' (Qs. Asy Syu'araa': 214), kemudian bersabda: \"Wahai orang-orang Quraisy, belilah diri kalian dari Allah, aku tidak mampu menolong kalian sedikitpun dari Allah. Wahai Bani Abdul Muththalib, aku tidak mampu menolong kalian sedikitpun dari Allah. Wahai Abbas bin Abdul Muththalib, aku tidak mampu menolong kamu sedikitpun dari Allah. Wahai Shafiyah bibi Rasulullah, aku tidak mampu menolong kamu sedikitpun dari Allah. wahai Fatimah binti Muhammad mintalah kepadaku apa yang engkau inginkan, aku tidak mampu menolong kamu sedikitpun dari Allah.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "37",
    "matchingArabicURN": "1136600",
    "last_updated": null
  },
  {
    "indonesianURN": "3235880",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1674",
    "babName": "Jika berwasiat untuk kerabat yang paling dekat",
    "hadithNumber": "3588",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim berkata; telah memberitakan kepada kami Abu Mu'awiyah berkata; telah menceritakan kepada kami Hisyam -yaitu Ibnu 'Urwah- dari ayahnya dari Aisyah berkata, \"Tatkala turun ayat ini: '(dan peringatkan keluargamu terdekat) ' (Qs. Asy Syu'araa': 214), Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Fatimah binti Muhammad, wahai Shafiyah binti Abdul Muththalib, wahai Abdul Muththalib, aku tidak mampu menolong kalian sedikitpun dari Allah, mintalah dari hartaku apa yang kalian suka.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "38",
    "matchingArabicURN": "1136610",
    "last_updated": null
  },
  {
    "indonesianURN": "3235890",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1675",
    "babName": "Jika seseorang meninggal secara mendadak, apakah disunnahkan keluarganya menyedekahkan atas namanya?",
    "hadithNumber": "3589",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah berkata; telah menceritakan kepada kami Ibnu Al Qasim dari Malik dari Hisyam bin 'Urwah dari ayahnya dari Aisyah, bahwa seorang laki-laki berkata kepada Rasulullah shallallahu 'alaihi wasallam, \"Sesungguhnya ibuku telah meninggal secara tiba-tiba, sekiranya dapat bicara niscaya ia akan bersedekah. Apakah aku boleh bersedekah untuknya?\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya, bersedekahlah untuknya.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "39",
    "matchingArabicURN": "1136620",
    "last_updated": null
  },
  {
    "indonesianURN": "3235900",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1675",
    "babName": "Jika seseorang meninggal secara mendadak, apakah disunnahkan keluarganya menyedekahkan atas namanya?",
    "hadithNumber": "3590",
    "hadithText": "Telah memberitakan kepada kami Al Harits bin Miskin dia membacakannya dan aku yang mendengar, dari Ibnu Al Qasim dari Malik dari Sa'id bin 'Amru bin Syurahbil bin Sa'id bin Sa'd bin 'Ubadah dari ayahnya dari kakeknya berkata, \"Sa'd bin 'Ubadah keluar bersama Nabi shallallahu 'alaihi wasallam pada sebagian peperangan, dan ibunya menghadapi kematian di Madinah. Lalu dikatakan kepadanya, \"Berwasiatlah.\" Kemudian ia balik bertanya, \"Apa yang aku wasiatkan? Harta adalah hartanya Sa'd.\" Kemudian ia meninggal sebelum Sa'd datang, maka tatkala Sa'd datang hal tersebut diceritakan kepadanya, Sa'd pun berkata, \"Wahai Rasulullah, apakah bermanfaat baginya apabila aku bersedekah untuknya?\" Nabi shallallahu 'alaihi wasallam lantas bersabda: \"Ya.\" Kemudian Sa'd berkata, \"Kebun ini dan ini adalah sedekah untuknya.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "40",
    "matchingArabicURN": "1136630",
    "last_updated": null
  },
  {
    "indonesianURN": "3235910",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1676",
    "babName": "Keutamaan sedekah atas nama mayyit",
    "hadithNumber": "3591",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr berkata; telah menceritakan kepada kami Isma'il berkata; telah menceritakan kepada kami Al 'Ala dari ayahnya dari Abu Hurairah, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila manusia meninggal maka amalnya terputus kecuali dari tiga perkara; sedekah jariyah, ilmu yang bermanfaat dan anak Shalih yang mendoakannya.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "41",
    "matchingArabicURN": "1136640",
    "last_updated": null
  },
  {
    "indonesianURN": "3235920",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1676",
    "babName": "Keutamaan sedekah atas nama mayyit",
    "hadithNumber": "3592",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr berkata; telah memberitakan kepada kami Isma'il dari Al 'Ala dari ayahnya dari Abu Hurairah, bahwa seseorang berkata kepada Nabi shallallahu 'alaihi wasallam, \"Sesungguhnya ayahku wafat dengan meninggalkan harta dan belum berwasiat. Apakah aku dapat menutupinya dengan bersedekah untuknya?\" Maka beliau bersabda: \"Ya.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "42",
    "matchingArabicURN": "1136650",
    "last_updated": null
  },
  {
    "indonesianURN": "3235930",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1676",
    "babName": "Keutamaan sedekah atas nama mayyit",
    "hadithNumber": "3593",
    "hadithText": "Telah mengabarkan kepada kami Musa bin Sa'id berkata; telah menceritakan kepada kami Hisyam bin Abdul Malik berkata; telah menceritakan kepada kami Hammad bin Salamah dari Muhammad bin 'Amru dari Abu Salamah dari Asy Syarid bin Suwaid Ats Tsaqafi berkata, \"Aku datang kepada Rasulullah shallallahu 'alaihi wasallam kemudian berkata, \"Sesungguhnya ibuku telah berwasiat untuk membebaskan budak, dan aku memiliki seorang budak wanita berasal dari An Nub, apakah sah bagiku untuk membebaskannya?\" Beliau menjawab: \"Datangkanlah ia kepadaku.\" Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Siapakah Tuhanmu?\" Budak wanita itu menjawab, \"Allah.\" Beliau bersabda lagi: \"Siapakah aku?\" Budak itu menjawab, \"Anda adalah Rasulullah.\" Beliau lalu bersabda: \"Bebaskanlah dia, sesungguhnya ia seorang mukminah.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "43",
    "matchingArabicURN": "1136660",
    "last_updated": null
  },
  {
    "indonesianURN": "3235940",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1676",
    "babName": "Keutamaan sedekah atas nama mayyit",
    "hadithNumber": "3594",
    "hadithText": "Telah mengabarkan kepada kami Al Husain bin Isa berkata; telah memberitakan kepada kami Sufyan dari 'Amru dari 'Ikrimah dari Ibnu Abbas bahwa Sa'd bertanya kepada Nabi shallallahu 'alaihi wasallam, \"Sesungguhnya ibuku telah meninggal dan belum berwasiat, bolehkah aku bersedekah untuknya?\" Beliau menjawab: \"Ya.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "44",
    "matchingArabicURN": "1136670",
    "last_updated": null
  },
  {
    "indonesianURN": "3235950",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1676",
    "babName": "Keutamaan sedekah atas nama mayyit",
    "hadithNumber": "3595",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Al Azhar berkata; telah menceritakan kepada kami Rauh bin 'Ubadah berkata; telah menceritakan kepada kami Zakaria bin Ishaq berkata; telah menceritakan kepada kami 'Amru bin Dinar dari 'Ikrimah dari Ibnu Abbas, bahwa seseorang berkata, \"Wahai Rasulullah, ibunya telah meninggal, apakah bermanfaat baginya apabila aku bersedekah untuknya?\" Beliau menjawab: \"Ya.\" Orang itu berkata lagi, \"Sesungguhnya aku memiliki kebun kurma, maka aku meminta persaksian anda bahwa aku telah mensedekahkannya untuknya.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "45",
    "matchingArabicURN": "1136680",
    "last_updated": null
  },
  {
    "indonesianURN": "3235960",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1676",
    "babName": "Keutamaan sedekah atas nama mayyit",
    "hadithNumber": "3596",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Abdullah berkata; telah menceritakan kepada kami 'Affan berkata; telah menceritakan kepada kami Sulaiman bin Katsir dari Az Zuhri dari 'Ubaidullah bin Abdullah dari Ibnu Abbas dari Sa'd bin Ubadah, bahwa ia datang kepada Nabi shallallahu 'alaihi wasallam kemudian berkata, \"Sesungguhnya ibuku telah meninggal dan ia memiliki hutang nadzar. Maka apakah sah jika aku membebaskan budak untuknya?\" Beliau menjawab: \"Bebaskanlah budak untuk ibumu.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "46",
    "matchingArabicURN": "1136690",
    "last_updated": null
  },
  {
    "indonesianURN": "3235970",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1676",
    "babName": "Keutamaan sedekah atas nama mayyit",
    "hadithNumber": "3597",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Ahmad Abu Yusuf Ash Shaidalani dari Isa -yaitu Ibnu Yunus- dari Al Auza'I dari Az Zuhri ia mengabarkan kepadanya dari 'Ubaidullah bin Abdullah dari Ibnu Abbas dari Sa'd bin 'Ubadah, bahwa ia meminta fatwa kepada Nabi shallallahu 'alaihi wasallam mengenai nadzar yang menjadi kewajiban ibunya, dan ibunya meninggal sebelum menunaikannya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tunaikanlah untuknya.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "47",
    "matchingArabicURN": "1136700",
    "last_updated": null
  },
  {
    "indonesianURN": "3235980",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1676",
    "babName": "Keutamaan sedekah atas nama mayyit",
    "hadithNumber": "3598",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Shadaqah Al Himshi berkata; telah menceritakan kepada kami Muhammad bin Syu'aib dari Al Auza'i dari Az Zuhri, ia telah mengabarkan kepadanya dari 'Ubaidullah bin Abdullah dari Ibnu Abbas dari Sa'd bin 'Ubadah bahwa ia telah meminta fatwa kepada Nabi shallallahu 'alaihi wasallam mengenai nadzar yang menjadi kewajiban atas ibunya, kemudian ia meninggal sebelum menunaikannya. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tunaikanlah untuknya.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "48",
    "matchingArabicURN": "1136710",
    "last_updated": null
  },
  {
    "indonesianURN": "3235990",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1676",
    "babName": "Keutamaan sedekah atas nama mayyit",
    "hadithNumber": "3599",
    "hadithText": "Telah mengabarkan kepada kami Al Abbas bin Al Walid bin Mazyad berkata; telah mengabarkan kepadaku ayahku berkata; telah menceritakan kepada kami Al Auza'i berkata; telah mengabarkan kepadaku Az Zuhri bahwa 'Ubaidullah bin Abdullah telah mengabarkan kepadanya dari Ibnu Abbas ia berkata, \"Sa'd meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam mengenai nadzar yang menjadi kewajiban ibunya, dan ibunya meninggal sebelum ia menunaikannya. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tunaikanlah untuknya.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "49",
    "matchingArabicURN": "1136720",
    "last_updated": null
  },
  {
    "indonesianURN": "3236000",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1677",
    "babName": "Perbedaan pada Sofyan",
    "hadithNumber": "3600",
    "hadithText": "Telah mengabarkan kepada kami Al Harits bin Miskin dia membacakan riwayat dan aku yang mendengar, dari Sufyan dari Az Zuhri dari 'Ubaidullah bin Abdullah dari Ibnu Abbas, bahwa Sa'd bin 'Ubadah meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam mengenai nadzar yang menjadi kewajiban ibunya, dan ibunya meninggal sebelum ia menunaikannya. Lalu beliau bersabda: \"Tunaikanlah untuknya.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "50",
    "matchingArabicURN": "1136730",
    "last_updated": null
  },
  {
    "indonesianURN": "3236010",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1677",
    "babName": "Perbedaan pada Sofyan",
    "hadithNumber": "3601",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Yazid ia berkata; telah menceritakan kepada kami Sufyan dari Az Zuhri dari 'Ubaidullah bin Abdullah dari Ibnu Abbas dari Sa'd bahwa ia berkata, \"Ibuku meninggal dan ia mempunyai kewajiban nadzar, kemudian aku menanyakan hal itu kepada Nabi shallallahu 'alaihi wasallam. Beliau lalu memerintahkan agar aku melakukan untuknya.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "51",
    "matchingArabicURN": "1136740",
    "last_updated": null
  },
  {
    "indonesianURN": "3236020",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1677",
    "babName": "Perbedaan pada Sofyan",
    "hadithNumber": "3602",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id berkata; telah menceritakan kepada kami Al Laits dari Az Zuhri dari 'Ubaidullah bin Abdullah dari Ibnu Abbas berkata, \"Sa'd bin 'Ubadah Al Anshari meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam mengenai nadzar yang menjadi kewajiban atas ibunya, dan ibunya meninggal sebelum ia menunaikannya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tunaikanlah untuknya.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "52",
    "matchingArabicURN": "1136750",
    "last_updated": null
  },
  {
    "indonesianURN": "3236030",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1677",
    "babName": "Perbedaan pada Sofyan",
    "hadithNumber": "3603",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Ishaq Al Hamdani dari 'Abdah dari Hisyam -yaitu Ibnu 'Urwah- dari Bakr bin Wail dari Az Zuhri dari 'Ubaidullah bin Abdullah dari Ibnu Abbas berkata, \"Sa'd bin 'Ubadah datang kepada Nabi shallallahu 'alaihi wasallam lalu berkata, \"Sesungguhnya ibuku meninggal dan ia memiliki kewajiban nadzar dan belum menunaikannya? ' Beliau bersabda: \"Tunaikanlah untuknya.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "53",
    "matchingArabicURN": "1136760",
    "last_updated": null
  },
  {
    "indonesianURN": "3236040",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1677",
    "babName": "Perbedaan pada Sofyan",
    "hadithNumber": "3604",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Al Mubarak berkata; telah menceritakan kepada kami Waki' dari Hisyam dari Qatadah dari Sa'id bin Al Musayyab dari Sa'd bin 'Ubadah berkata, \"Aku berkata, \"Wahai Rasulullah, sesungguhnya ibuku meninggal, bolehkah aku bersedekah untuknya?\" Beliau menjawab: \"Ya.\" Aku lalu bertanya, \"Sedekah apakah yang paling utama?\" Beliau menjawab: \"Memberi minum air.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "54",
    "matchingArabicURN": "1136770",
    "last_updated": null
  },
  {
    "indonesianURN": "3236050",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1677",
    "babName": "Perbedaan pada Sofyan",
    "hadithNumber": "3605",
    "hadithText": "Telah mengabarkan kepada kami Abu 'Ammar Al Husaini bin Huraits dari Waki' dari Hisyam dari Qatadah dari Sa'id bin Al Musayyab dari Sa'd bin 'Ubadah ia berkata, \"Aku bertanya, \"Wahai Rasulullah, sedekah apakah yang paling utama?\" Beliau menjawab: \"Memberi minum air.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "55",
    "matchingArabicURN": "1136780",
    "last_updated": null
  },
  {
    "indonesianURN": "3236060",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1677",
    "babName": "Perbedaan pada Sofyan",
    "hadithNumber": "3606",
    "hadithText": "Telah mengabarkan kepadaku Ibrahim bin Al Hasan dari Hajjaj ia berkata; aku mendengar Syu'bah menceritakan dari Qatadah berkata; aku mendengar Al Hasan menceritakan dari Sa'd bin 'Ubadah, bahwa ibunya meninggal kemudian berkata, \"Wahai Rasulullah, sedekah apakah yang paling utama?\" Beliau menjawab: \"Memberi minum air.\" Itulah pemberian minum Sa'd di Madinah.</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "56",
    "matchingArabicURN": "1136790",
    "last_updated": null
  },
  {
    "indonesianURN": "3236070",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1678",
    "babName": "Larangan mengeksploitasi harta anak yatim",
    "hadithNumber": "3607",
    "hadithText": "Telah mengabarkan kepada kami Al Abbas bin Muhammad berkata; telah menceritakan kepada kami Abdullah bin Yazid dari Sa'id bin Abu Ayyub dari 'Ubaidullah bin Abi Ja'far dari Salim bin Abu Salim Al Jaisyani dari ayahnya dari Abu Dzar ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Wahai Abu Dzar, aku melihatmu orang yang lemah, namun aku mencintaimu sebagaimana aku mencintai diriku, janganlah engkau mengangkat dirimu sebagai pemimpin atas dua orang, dan janganlah engkau menjadi wali anak yatim.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "57",
    "matchingArabicURN": "1136800",
    "last_updated": null
  },
  {
    "indonesianURN": "3236080",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1679",
    "babName": "Yang dibolehkan bagi yang diwasiati harta anak yatim jika mengelolanya",
    "hadithNumber": "3608",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud berkata; telah menceritakan kepada kami Khalid dari Husain dari 'Amru bin Syu'aib dari ayahnya dari kakeknya, bahwa seseorang datang kepada Nabi shallallahu 'alaihi wasallam kemudian berkata, \"Sesungguhnya aku orang yang fakir, aku tidak memiliki apa-apa namun aku mempunyai anak yatim?\" Beliau bersabda: \"Makanlah dari harta anak yatimmu tanpa berlebih-lebihan, tidak boros dan tidak menjadikannya sebagai pokok harta.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "58",
    "matchingArabicURN": "1136810",
    "last_updated": null
  },
  {
    "indonesianURN": "3236090",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1679",
    "babName": "Yang dibolehkan bagi yang diwasiati harta anak yatim jika mengelolanya",
    "hadithNumber": "3609",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Utsman bin Hakim berkata; telah menceritakan kepada kami Muhammad bin Ash Shalt berkata; telah menceritakan kepada kami Abu Kudainah dari 'Atha -yaitu Ibnu As Saib- dari Sa'id bin Jubair dari Ibnu Abbas berkata, \"Tatkala turun ayat: '(Dan janganlah kamu dekati harta anak yatim, kecuali dengan cara yang lebih bermanfaat) ' (Qs. Al Israa': 34), serta '(sesungguhnya orang-orang yang memakan harta orang yatim secara zhalim) ' (Qs. An Nisaa: 10). Ibnu Abbas berkata, \"Maka orang-orang menjauhi harta anak yatim dan makanannya, sehingga hal tersebut terasa berat atas orang-orang muslim. Maka mereka mengadukan hal tersebut kepada Nabi shallallahu 'alaihi wasallam, kemudian Allah menurunkan ayat: '(Dan mereka bertanya kepadamu tentang anak yatim, katakalah: \"Mengurus urusan mereka secara patut adalah baik, dan jika kamu bergaul dengan mereka, maka mereka adalah saudaramu; dan Allah mengetahui siapa yang membuat kerusakan dari yang mengadakan perbaikan. Dan jikalau Allah menghendaki, niscaya Dia dapat mendatangkan kesulitan kepadamu) ' (Qs. Al Baqarah: 220).</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "59",
    "matchingArabicURN": "1136820",
    "last_updated": null
  },
  {
    "indonesianURN": "3236100",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1679",
    "babName": "Yang dibolehkan bagi yang diwasiati harta anak yatim jika mengelolanya",
    "hadithNumber": "3610",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Ali berkata; telah menceritakan kepada kami Imran bin 'Uyainah berkata; telah menceritakan kepada kami 'Atha bin As Saib dari Sa'id bin Jubair dari Ibnu Abbas mengenaii firman Allah: '(sesungguhnya orang-orang yang memakan harta orang yatim secara zhalim) ' (Qs. An Nisaa: 10). Ia berkata, \"Dahulu terdapat seorang anak yatim dalam pemeliharaan seorang laki-laki, kemudian laki-laki tersebut menjauhi makanan serta minuman dan bejananya, sehingga hal tersebut terasa berat bagi orang-orang muslim. Kemudian Allah 'azza wajalla menurunkan ayat: '(dan jika kamu bergaul dengan mereka, maka mereka adalah saudaramu) ' (Qs. Al Baqarah: 220), yaitu seagama, maka Allah pun menghalalkan bagi mereka untuk bergaul dengan mereka.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "60",
    "matchingArabicURN": "1136830",
    "last_updated": null
  },
  {
    "indonesianURN": "3236110",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1680",
    "babName": "Menjauhi memakan  harta anak yatim",
    "hadithNumber": "3611",
    "hadithText": "Telah mengabarkan kepada kami Ar Rabi' bin Sulaiman berkata; telah menceritakan kepada kami Ibnu Wahb dari Sulaiman bin Bilal dari Tsaur bin Zaid dari Abu Al Ghaits dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jauhilah tujuh perkara yang membinasakan, \" dikatakan, \"Wahai Rasulullah, apakah perkara yang membinasakan itu?\" Beliau menjawab: \"Berbuat syirik kepada Allah, kikir, membunuh jiwa yang Allah haramkan kecuali dengan hak, makan riba, makan harta anak yatim, lari dari peperangan dan menuduh seorang wanita mukmin yang suci dan baik berbuat zina.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "61",
    "matchingArabicURN": "1136840",
    "last_updated": null
  },
  {
    "indonesianURN": "3235581",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1669",
    "babName": "Dimakruhkan menunda-nunda washiat",
    "hadithNumber": "3558",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah berkata; telah menceritakan kepada kami Ibnu Alqasim dari Malik dari Nafi' dari Ibnu Umar, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada hak atas seorang muslim yang mempunyai sesuatu untuk diwasiatkan, untuk bermalam selama dua malam kecuali wasiatnya telah tertulis di sisinya.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "1136290",
    "last_updated": null
  },
  {
    "indonesianURN": "3235582",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1669",
    "babName": "Dimakruhkan menunda-nunda washiat",
    "hadithNumber": "3558",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Hatim bin Nu'aim berkata; telah menceritakan kepada kami Hibban berkata; telah memberitakan kepada kami Abdullah dari Ibnu 'Aun dari Nafi' dari Ibnu Umar, hadits senada.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "1136300",
    "last_updated": null
  },
  {
    "indonesianURN": "3235691",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1671",
    "babName": "Wasiat sepertiga",
    "hadithNumber": "3569",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Ali berkata; telah menceritakan kepada kami 'Abdurrahman berkata; telah menceritakan kepada kami Sufyan dari Sa'd bin Ibrahim dari 'Amir bin Sa'd dari ayahnya berkata, \"Nabi shallallahu 'alaihi wasallam menjenguknya dan saat beliau berada di Makkah. Dan ia tidak ingin meninggal di tanah yang darinya ia berhijrah. Nabi shallallahu 'alaihi wasallam lalu bersabda: 'Semoga Allah merahmati Sa'd bin 'Afra', dan ia hanya memiliki satu anak wanita. Ia berkata, \"Wahai Rasulullah, bolehkah aku berwasiat dengan seluruh hartaku?\" Beliau menjawab: \"Jangan.\" Aku tanyakan lagi, \"Bagaimana jika setengah?\" Beliau menjawab: \"Jangan.\" Aku tanyakan lagi, \"Bagaimana jika sepertiga?\" Beliau menjawab: \"Sepertiga, dan sepertiga itu banyak. Sesungguhnya engkau meninggalkan pewarismu dalam keadaan kaya lebih baik daripada engkau meninggalkan mereka dalam keadaan miskin dan meminta-minta kepada manusia apa yang ada di tangan mereka.\"</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "18",
    "matchingArabicURN": "1136410",
    "last_updated": null
  },
  {
    "indonesianURN": "3235692",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "30",
    "bookName": "Wasiat",
    "babNumber": "1671",
    "babName": "Wasiat sepertiga",
    "hadithNumber": "3569",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman berkata; telah menceritakan kepada kami Abu Nu'aim berkata; telah menceritakan kepada kami Mis'ar bin Ibrahim berkata; telah menceritakan kepadaku sebagian keluarga Sa'd ia berkata, \"Saat Sa'd sakit, Rasulullah shallallahu 'alaihi wasallam masuk menjenguknya, Sa'd lalu berkata, \"Wahai Rasulullah, bolehkah aku berwasiat dengan seluruh hartaku?\" Beliau menjawab: 'Jangan.' Lalu ia menyebutkan hadits tersebut.</b>",
    "bookID": "30.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "19",
    "matchingArabicURN": "1136420",
    "last_updated": null
  }
]