[
  {
    "indonesianURN": "3236120",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Pemberian",
    "babNumber": "1681",
    "babName": "Perbedaan lafadz pengutip berita Nu'man bin Basyir",
    "hadithNumber": "3612",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id berkata; telah menceritakan kepada kami Sufyan dari Az Zuhri dari Humaid. (dalam jalur lain disebutkan) Telah memberitakan kepada kami Muhammad bin Manshur dari Sufyan berkata; kami mendengarnya dari Az Zuhri telah mengabarkan kepadaku Humaid bin 'Abdurrahman dan Muhammad bin An Nu'man dari An Nu'man bin Basyir, bahwa ayahnya memberinya seorang budak kecil, kemudian ia datang kepada Nabi shallallahu 'alaihi wasallam meminta persaksian beliau, kemudian beliau bertanya: \"Apakah engkau memberi seluruh anakmu?\" Ia berkata, \"Tidak.\" Beliau lalu bersabda: \"Kembalikan dia.\" Lafazh hadits tersebut adalah lafazh Muhammad.</b>",
    "bookID": "31.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "1136850",
    "last_updated": null
  },
  {
    "indonesianURN": "3236130",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Pemberian",
    "babNumber": "1681",
    "babName": "Perbedaan lafadz pengutip berita Nu'man bin Basyir",
    "hadithNumber": "3613",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dan Al Harits bin Miskin dia membacakannya dan aku mendengar, dari Ibnu Al Qasim dari Malik dari Ibnu Syihab dari Humaid bin 'Abdurrahman dan Muhammad bin An Nu'man mereka menceritakan kepadanya, dari An Nu'man bin Basyir, bahwa ayahnya datang membawanya kepada Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Sesungguhnya aku telah memberikan seorang budak kepada anakku ini.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah engkau memberi seluruh anakmu?\" Ia menjawab, \"Tidak.\" Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Ambillah dia kembali.\"</b>",
    "bookID": "31.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "1136860",
    "last_updated": null
  },
  {
    "indonesianURN": "3236140",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Pemberian",
    "babNumber": "1681",
    "babName": "Perbedaan lafadz pengutip berita Nu'man bin Basyir",
    "hadithNumber": "3614",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Hisyam berkata; telah menceritakan kepada kami Al Walid bin Muslim berkata; telah menceritakan kepada kami Al Auza'i dari Az Zuhri dari Humaid bin 'Abdurrahman dan Muhammad bin An Nu'man dari An Nu'man bin Basyir, bahwa ayahnya, Basyir bin Sa'd, datang membawa anaknya, An Nu'man, dan berkata, \"Wahai Rasulullah, sesungguhnya aku telah memberikan seorang budak kepada anakku ini.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah engkau memberi seluruh anakmu?\" Ia menjawab, \"Tidak.\" Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Ambillah dia kembali.\"</b>",
    "bookID": "31.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "1136870",
    "last_updated": null
  },
  {
    "indonesianURN": "3236150",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Pemberian",
    "babNumber": "1681",
    "babName": "Perbedaan lafadz pengutip berita Nu'man bin Basyir",
    "hadithNumber": "3615",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Utsman bin Sa'id berkata; telah menceritakan kepada kami Al Walid dari Al Auza'i dari Az Zuhri bahwa Muhammad bin An Nu'man dan Humaid bin 'Abdurrahman telah menceritakan kepadanya dari Basyir bin Sa'd, bahwa ia datang kepada Nabi shallallahu 'alaihi wasallam dengan membawa An Nu'man bin Basyir. Lalu ia berkata, \"Sesungguhnya aku telah memberikan budak kepada anakku ini, maka apabila anda berpendapat untuk anda laksanakan maka aku akan melaksanakannya. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah engkau memberi seluruh anakmu?\" Ia menjawab, \"Tidak.\" Maka beliau bersabda: \"Kembalikanlah dia.\"</b>",
    "bookID": "31.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "1136880",
    "last_updated": null
  },
  {
    "indonesianURN": "3236160",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Pemberian",
    "babNumber": "1681",
    "babName": "Perbedaan lafadz pengutip berita Nu'man bin Basyir",
    "hadithNumber": "3616",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Harb berkata; telah menceritakan kepada kami Abu Mu'awiyah dari Hisyam dari ayahnya dari An Nu'man bin Basyir, bahwa ayahnya telah memberikan pemberian kepadanya, kemudian isterinya (ibunya) berkata, \"Persaksikanlah kepada Nabi shallallahu 'alaihi wasallam atas apa yang telah engkau berikan kepada anakmu.\" Kemudian ia pergi kepada Nabi shallallahu 'alaihi wasallam dan menceritakan hal tersebut. Maka Nabi shallallahu 'alaihi wasallam pun enggan untuk memberikan saksi kepadanya.\"</b>",
    "bookID": "31.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "1136890",
    "last_updated": null
  },
  {
    "indonesianURN": "3236170",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Pemberian",
    "babNumber": "1681",
    "babName": "Perbedaan lafadz pengutip berita Nu'man bin Basyir",
    "hadithNumber": "3617",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Ma'mar berkata; telah menceritakan kepada kami Abu 'Amir berkata; telah menceritakan kepada kami Syu'bah dari Sa'd -yaitu Ibnu Ibrahim- dari 'Urwah dari Basyir, bahwa ia telah memberikan budak kepada anaknya, kemudian ia datang kepada Nabi shallallahu 'alaihi wasallam untuk minta persaksian kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apakah engkau memberi kepada seluruh anakmu seperti ini?\" ia menjawab, \"Tidak.\" Beliau lalu bersabda: \"Kembalikanlah dia.\"</b>",
    "bookID": "31.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "1136900",
    "last_updated": null
  },
  {
    "indonesianURN": "3236180",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Pemberian",
    "babNumber": "1681",
    "babName": "Perbedaan lafadz pengutip berita Nu'man bin Basyir",
    "hadithNumber": "3618",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Hatim berkata; telah menceritakan kepada kami Hibban berkata; telah menceritakan kepada kami Abdullah dari Hisyam bin 'Urwah dari ayahnya, bahwa Basyir datang kepada Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Nabi Allah, aku telah memberikan pemberian kepada An Nu'man?\" Maka beliau bertanya: \"Apakah engkau memberi saudara-saudaranya juga?\" Basyir menjawab, \"Tidak.\" Beliau lalu bersabda: \"Kembalikanlah dia.\"</b>",
    "bookID": "31.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "1136910",
    "last_updated": null
  },
  {
    "indonesianURN": "3236190",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Pemberian",
    "babNumber": "1681",
    "babName": "Perbedaan lafadz pengutip berita Nu'man bin Basyir",
    "hadithNumber": "3619",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul Malik bin Abu Asy Syawarib berkata; telah menceritakan kepada kami Yazid -yaitu Ibnu Zurai'- berkata; telah menceritakan kepada kami Daud dari Asy Sya'bi dari An Nu'man berkata, \"Ayahnya pergi membawanya menemui Nabi shallallahu 'alaihi wasallam, lalu bapaknya berkata, \"Saksikanlah bahwa aku telah memberi An Nu'man sebagian dari hartaku sekian dan sekian.\" Beliau lalu bertanya: \"Apakah seluruh anakmu engkau beri seperti yang engkau berikan kepada An Nu'man?\"</b>",
    "bookID": "31.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "1136920",
    "last_updated": null
  },
  {
    "indonesianURN": "3236200",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Pemberian",
    "babNumber": "1681",
    "babName": "Perbedaan lafadz pengutip berita Nu'man bin Basyir",
    "hadithNumber": "3620",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dari Abdull Wahhab berkata; telah menceritakan kepada kami Daud dari 'Amir dari An Nu'man, bahwa ayahnya datang bersamanya kepada Nabi shallallahu 'alaihi wasallam meminta persaksian terhadap pemberian yang telah ia berikan kepadanya. Kemudian beliau bersabda: \"Apakah engkau memberikan kepada seluruh anakmu seperti yang engkau berikan kepadanya?\" Ia menjawab, \"Tidak.\" Maka beliau bersabda: \"Aku tidak akan bersaksi terhadap sesuatupun, bukankah engkau senang jika mereka dalam berbuat baik kepadamu juga sama?\" Ia menjawab, \"Ya.\" Beliau lalu bersabda: \"Kalau demikian maka tidak boleh.\"</b>",
    "bookID": "31.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "1136930",
    "last_updated": null
  },
  {
    "indonesianURN": "3236210",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Pemberian",
    "babNumber": "1681",
    "babName": "Perbedaan lafadz pengutip berita Nu'man bin Basyir",
    "hadithNumber": "3621",
    "hadithText": "Telah mengabarkan kepada kami Musa bin 'Abdurrahman berkata; telah menceritakan kepada kami Abu Usamah berkata; telah menceritakan kepada kami Abu Hibban dari Asy Sya'bi berkata; telah menceritakan kepadaku An Nu'man bin Basyir Al Anshari, bahwa ibunya, binti Rawahah, meminta kepada ayahnya sebagian pemberian dari hartanya untuk anaknya. Lalu ia menundanya selama satu tahun sebelum ia berikan kepada anaknya tersebut. Lalu ibunya berkata, \"Aku tidak ridla hingga engkau mempersaksikannya kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian ia (bapaknya) berkata, \"Wahai Rasulullah, sesungguhnya ibu anak ini, binti Rawahah, menentangku atas sesuatu yang aku berikan kepada anak ini.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Basyir, apakah engkau memiliki anak selain ini?\" Ia menjawab, \"Ya.\" Rasulullah shallallahu 'alaihi wasallam lalu bertanya lagi: \"Apakah seluruh mereka engkau beri seperti yang engkau berikan kepada anakmu ini?\" Ia menjawab, \"Tidak.\" Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Kalau demikian maka jangan meminta persaksian kepadaku. Sesungguhnya aku tidak bersaksi terhadap ketidak adilan.\"</b>",
    "bookID": "31.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "1136940",
    "last_updated": null
  },
  {
    "indonesianURN": "3236220",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Pemberian",
    "babNumber": "1681",
    "babName": "Perbedaan lafadz pengutip berita Nu'man bin Basyir",
    "hadithNumber": "3622",
    "hadithText": "Telah mengabarkan kepada kami Abu Daud berkata; telah menceritakan kepada kami Ya'la berkata; telah menceritakan kepada kami Abu Hayyan dari Asy Sya'bi dari An Nu'man berkata, \"Ibuku meminta kepada ayahku sebagian pemberian, kemudian beliau memberikannya untukku. Ibuku lalu berkata, \"Aku tidak akan ridla hingga aku meminta persaksian Rasulullah shallallahu 'alaihi wasallam.\" An Nu'man berkata, \"Kemudian ayahku membawaku sedang aku masih kecil. Ia datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, sesungguhnya ibu anak ini, yaitu binti Rawahah, meminta dariku sebagian pemberian dan ia ingin agar aku meminta persaksian kepadamu terhadap hal tersebut!\" Beliau lalu bertanya: \"Wahai Basyir, apakah engkau memiliki anak selain ini?\" ia menjawab, \"Ya.\" Beliau bertanya lagi: \"Apakah engkau memberinya seperti apa yang engkau berikan kepada anak ini?\" Ia menjawab, \"Tidak.\" Maka beliau pun bersabda: \"Kalau demikian maka jangan meminta persaksian kepadaku. Sesungguhnya aku tidak bersaksi terhadap ketidak adilan.\"</b>",
    "bookID": "31.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "1136950",
    "last_updated": null
  },
  {
    "indonesianURN": "3236230",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Pemberian",
    "babNumber": "1681",
    "babName": "Perbedaan lafadz pengutip berita Nu'man bin Basyir",
    "hadithNumber": "3623",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman berkata; telah menceritakan kepada kami Muhammad bin 'Ubaid berkata; telah menceritakan kepada kami Isma'il dari 'Amir berkata, \"Aku telah diberitahu bahwa Basyir bin Sa'd datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, sesungguhnya isteriku, 'Amrah binti Rawahah, menyuruhku untuk bersedekah kepada anaknya, yaitu Nu'man, dengan suatu sedekah. Dan ia memerintahkan aku agar meminta persaksian kepadamu terhadap hal tersebut!\" Maka Nabi shallallahu 'alaihi wasallam pun bertanya kepadanya: \"Apakah engkau memiliki anak-anak selainnya?\" Ia menjawab, \"Ya.\" Beliau bertanya lagi: \"Engkau memberi mereka seperti apa yang engkau berikan kepada anak ini?\" Ia menjawab, \"Tidak.\" Maka beliau pun bersabda: \"Janganlah engkau meminta persaksian kepadaku terhadap ketidak adilan.\"</b>",
    "bookID": "31.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "1136960",
    "last_updated": null
  },
  {
    "indonesianURN": "3236240",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Pemberian",
    "babNumber": "1681",
    "babName": "Perbedaan lafadz pengutip berita Nu'man bin Basyir",
    "hadithNumber": "3624",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman berkata; telah menceritakan kepada kami Abu Nu'aim berkata; telah menceritakan kepada kami Zakaria dari 'Amir berkata; telah menceritakan kepadaku Abdullah bin 'Utbah bin Mas'ud. (dalam jalur lain disebutkan) Telah memberitakan kepada kami Muhammad bin Hatim berkata; telah memberitakan kepada kami Hibban berkata; telah memberitakan kepada kami Abdullah dari Zakaria dari Asy Sya'bi dari Abdullah bin 'Utbah bin Mas'ud, bahwa seseorang mendatangi Nabi shallallahu 'alaihi wasallam… dan Muhammad menyebutkan, \"Ia mendatangi Nabi shallallahu 'alaihi wasallam dan berkata, \"Aku bersedekah kepada anakku dengan suatu sedekah, maka saksikanlah!\" Beliau lalu bertanya: \"Apakah engkau memiliki anak selainnya, \" ia menjawab, \"Ya.\" Beliau bertanya lagi: \"Apakah engkau memberi mereka seperti engkau memberinya.\" Ia menjawab, \"Tidak.\" Maka beliau pun bersabda: \"Apakah aku akan bersaksi atas ketidak adilan?\"</b>",
    "bookID": "31.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "1136970",
    "last_updated": null
  },
  {
    "indonesianURN": "3236250",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Pemberian",
    "babNumber": "1681",
    "babName": "Perbedaan lafadz pengutip berita Nu'man bin Basyir",
    "hadithNumber": "3625",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id dari Yahya dari Fithr berkata; telah menceritakan kepada kami Muslim bin Shubaih berkata; aku mendengar An Nu'man bin Basyir berkata, \"Ayahku pergi membawa aku menemui Nabi shallallahu 'alaihi wasallam, ia meminta Rasulullah untuk bersaksi terhadap sesuatu yang ia berikan kepadaku. Kemudian beliau bertanya: \"Apakah engkau memiliki anak selainnya?\" Ia menjawab, \"Ya.\" Lalu -seraya membariskan seluruh telapaknya demikian- beliau bersabda: \"Tidakkah engkau samakan antara mereka (seperti ini)?\"</b>",
    "bookID": "31.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "1136980",
    "last_updated": null
  },
  {
    "indonesianURN": "3236260",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Pemberian",
    "babNumber": "1681",
    "babName": "Perbedaan lafadz pengutip berita Nu'man bin Basyir",
    "hadithNumber": "3626",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Hatim berkata; telah memberitakan kepada kami Hibban berkata; telah memberitakan kepada kami Abdullah dari Fithr dari Muslim bin Shubaih berkata; aku mendengar An Nu'man berkata ketika sedang berkhutbah, \"Ayahku pergi membawaku kepada Rasulullah shallallahu 'alaihi wasallam meminta persaksiannya terhadap pemberian yang ia berikan kepadanya. Beliau bersabda: \"Apakah engkau memiliki anak-anak selainnya?\" Ia (bapaknya) menjawab, \"Tidak.\" Beliau lalu bersabda: \"Samakanlah antara mereka.\"</b>",
    "bookID": "31.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "1136990",
    "last_updated": null
  },
  {
    "indonesianURN": "3236270",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "31",
    "bookName": "Pemberian",
    "babNumber": "1681",
    "babName": "Perbedaan lafadz pengutip berita Nu'man bin Basyir",
    "hadithNumber": "3627",
    "hadithText": "Telah mengabarkan kepada kami Ya'qub bin Sufyan berkata; telah menceritakan kepada kami Sulaiman bin Harb berkata; telah menceritakan kepada kami Hammad bin Yazid dari Hajib bin Al Mufadldlal bin Al Muhallab dari ayahnya ia berkata, \"Aku mendengar An Nu'man bin Basyir berkhutbah, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berlaku adillah di antara anak-anak kalian.\"</b>",
    "bookID": "31.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "1137000",
    "last_updated": null
  }
]