[
  {
    "indonesianURN": "3238780",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1740",
    "babName": "Mencintai wanita",
    "hadithNumber": "3878",
    "hadithText": "Telah mengabarkan kepada kami Syekh Imam Abu Abdur Rahman An Nasai telah mengabarkan kepada kami Al Husain bin Isa Al Qumasi telah menceritakan kepada kami 'Affan bin Muslim telah menceritakan kepada kami Sallam Abu Al Mundzir dari Tsabit dari Anas, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dijadikan kesenanganku dari dunia ada pada wanita dan minyak wangi, dan dijadikan penyejuk hatiku ada dalam shalat.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "1139540",
    "last_updated": null
  },
  {
    "indonesianURN": "3238790",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1740",
    "babName": "Mencintai wanita",
    "hadithNumber": "3879",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Muslim Ath Thusi telah menceritakan kepada kami Sayyar telah menceritakan kepada kami Ja'far telah menceritakan kepada kami Tsabit dari Anas, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dijadikan kesenanganku dari dunia ada pada wanita dan minyak wangi, dan dijadikan penyejuk hatiku ada dalam shalat.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "1139550",
    "last_updated": null
  },
  {
    "indonesianURN": "3238800",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1740",
    "babName": "Mencintai wanita",
    "hadithNumber": "3880",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Hafsh bin Abdullah telah menceritakan kepadaku ayahku telah menceritakan kepadaku Ibarahim bin Thahman dari Sa'id bin Abi 'Arubah dari Qatadah dari Anas bin Malik, dia berkata; \"Tidak ada sesuatu yang lebih disukai Rasulullah shallallahu 'alaihi wasallam setelah para isteri daripada kuda perang.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "1139560",
    "last_updated": null
  },
  {
    "indonesianURN": "3238810",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1741",
    "babName": "Mencintai sebagian isteri dengan menelantarkan lainnya",
    "hadithNumber": "3881",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Ali telah menceritakan kepada kami Abdur Rahman telah menceritakan kepada kami Hammam dari Qatadah dari An Nadhr bin Anas dari Basyir bin Nahik dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barang siapa yang memiliki dua orang isteri dan dia lebih condong kepada salah seorang di antara mereka maka dia akan datang pada Hari Kiamat dalam keadaan salah satu sisinya miring.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "1139570",
    "last_updated": null
  },
  {
    "indonesianURN": "3238820",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1741",
    "babName": "Mencintai sebagian isteri dengan menelantarkan lainnya",
    "hadithNumber": "3882",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Isma'il bin Ibrahim telah menceritakan kepada kami Yazid telah memberitakan kepada kami Hammad bin Salamah dari Ayyub dari Abu Qilabah dari Abdullah bin Yazid dari 'Aisyah, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam membagi di antara isteri-isteri beliau kemudian beliau berbuat adil dan bersabda: \"Ya Allah, inilah yang bisa saya lakukan dalam perkara yang saya mampu dan janganlah Engkau cela diriku dalam perkara yang Engkau mampu dan tidak saya mampu.\" Hadits tersebut dimursalkan oleh Hammad bin Zaid.</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "1139580",
    "last_updated": null
  },
  {
    "indonesianURN": "3238840",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1742",
    "babName": "Mencintai sebagian isteri melebihi cintanya terhadap lainnya",
    "hadithNumber": "3884",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Rafi' An Naisaburi Ats Tsiqqah Al Makmun telah menceritakan kepada kami Abdur Razzaq dari Ma'mar dari Az Zuhri dari 'Urwah dari Aisyah, dia berkata; \"Isteri-isteri Nabi shallallahu 'alaihi wasallam berkumpul dan mengirim Fathimah kepada Nabi shallallahu 'alaihi wasallam. Mereka berkata; \"Sesungguhnya isteri-isterimu..dan Az Zuhri menyebutkan suatu kalimat yang maknanya adalah; meminta keadilan mengenai anak Abi Quhafah. Aisyah berkata; kemudian Fathimah menemui Nabi shallallahu 'alaihi wasallam ketika beliau tengah bersama Aisyah dalam pakaian bulunya, kemudian dia berkata; \"Sesungguhnya para isteri Tuan mengirimku kepada Tuan, mereka meminta keadilan mengenai anak Abu Quhafah.\" Kemudian beliau bersabda kepadanya: \"Apakah engkau mencintaiku?\" Dia berkata; \"Ya.\" Beliau bersabda: \"Maka cintailah dia.\" Aisyah berkata; \"Kemudian Fathimah kembali kepada para isteri Nabi shallallahu 'alaihi wasallam dan mengabarkan kepada mereka apa yang beliau sabdakan. Kemudian mereka berkata; \"Sesungguhnya engkau belum melakukan apa-apa, maka kembalilah kepadanya.\" Fathimah berkata; \"Demi Allah, saya tidak akan kembali kepada beliau mengadukan tentang hal ini selamanya.\" dia adalah benar-benar puteri Nabi shallallahu 'alaihi wasallam yang sejati. Kemudian mereka mengirim Zainab binti Jahsy. Aisyah berkata; \"Dia adalah orang yang menjadi sainganku di antara isteri-isteri Nabi shallallahu 'alaihi wasallam. Kemudian dia berkata; \"Sesungguhnya isteri-isteri Tuan mengirimku, mereka meminta keadilan mengenai anak Abu Quhafah. Kemudian dia menghadap kepadaku dan mencelaku, saya memperhatikan Rasulullah shallallahu 'alaihi wasallam dan memperhatikan sudut matanya, apakah beliau mengizinkan saya untuk menanggapinya? Aisyah berkata; kemudian dia mencelaku hingga saya yakin bahwa beliau tidak membenci saya ketika saya menanggapinya. Kemudian saya menghadapinya dan tidak lama sayapun membuatnya tak berkutik. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya dia adalah anak Abu Bakar.\" Aisyah berkata; \"Saya belum melihat wanita yang lebih baik dan lebih banyak bersedekah, lebih sering menyambung hubungan kekerabatan, dan merendahkan diri dalam segala sesuatu untuk mendekatkan diri kepada Allah ta'ala dari Zainab selain sikap cepat marah karena kerasnya budi pekertinya, dan dia bersegera menarik diri darinya. Abu Abdur Rahman berkata; \"Ini adalah suatu kesalahan dan yang benar adalah yang sebelumnya.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "1139610",
    "last_updated": null
  },
  {
    "indonesianURN": "3238850",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1742",
    "babName": "Mencintai sebagian isteri melebihi cintanya terhadap lainnya",
    "hadithNumber": "3885",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud telah menceritakan kepada kami Bisyr yaitu Ibnu Al Mufadhdhal telah menceritakan kepada kami Syu'bah dari 'Amru bin Murrah dari Murrah Al Juhani dari Abu Musa dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \" Keutamaan Aisyah atas wanita yang lain seperti keutamaan bubur atas makanan yang lain.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "1139620",
    "last_updated": null
  },
  {
    "indonesianURN": "3238860",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1742",
    "babName": "Mencintai sebagian isteri melebihi cintanya terhadap lainnya",
    "hadithNumber": "3886",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Khasyram telah memberitakan kepada kami Isa bin Yunus dari Ibnu Abu Dzi`b dari Al Harits bin Abdur Rahman dari Abu Salamah dari Aisyah bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Keutamaan Aisyah atas wanita yang lain seperti keutamaan bubur atas makanan yang lain.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "1139630",
    "last_updated": null
  },
  {
    "indonesianURN": "3238870",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1742",
    "babName": "Mencintai sebagian isteri melebihi cintanya terhadap lainnya",
    "hadithNumber": "3887",
    "hadithText": "Telah mengabarkan kepada kami Abu Bakar bin Ishaq Ash Shaghani telah menceritakan kepada kami Syadzan telah menceritakan kepada kami Hammad bin Zaid dari Hisyam bin 'Urwah dari ayahnya dari Aisyah, dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" wahai Ummu Salamah, janganlah engkau menyakitiku mengenai diri Aisyah, karena demi Allah, sesungguhnya tidaklah datang kepadaku wahyu dalam selimut seorang wanita diantara kalian kecuali dia.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "1139640",
    "last_updated": null
  },
  {
    "indonesianURN": "3238880",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1742",
    "babName": "Mencintai sebagian isteri melebihi cintanya terhadap lainnya",
    "hadithNumber": "3888",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Adam dari 'Abdah dari Hisyam dari 'Auf bin Al Harits dari Rumaitsah dari Ummu Salamah bahwa para isteri Nabi shallallahu 'alaihi wasallam berbicara kepadanya agar dia berbicara kepada Nabi shallallahu 'alaihi wasallam bahwa orang-orang mengkhususkan hadiah mereka pada hari giliran Aisyah dan berkata kepada beliau; \"Sesungguhnya kami mencintai kebaikan sebagaimana Tuan mencintai Aisyah.\" Kemudian Ummu Salamah berbicara kepada beliau tetapi beliau tidak menjawabnya. Kemudian ketika tiba hari gilirannya, Ummu Salamah mengatakannya kembali kepada beliau, tetapi beliau tidak menjawabnya. Para isteri beliau berkata; \"Beliau tidak menjawabmu.\" Dia berkata; \"Beliau tidak menjawabku.\" Mereka berkata; \"Janganlah engkau tinggalkan beliau hingga beliau menjawabmu atau engkau melihat apa yang beliau katakan. Kemudian tatkala tiba hari gilirannya dia mengatakannya lagi kepada beliau. Kemudian beliau bersabda: \"Janganlah engkau menyakitiku mengenai diri Aisyah, demi Allah tidaklah datang kepadaku wahyu dalam selimut seorang wanita diantara kalian kecuali dia.\" Abu Abdur Rahman berkata; \"Ini adalah dua hadits shohih dari 'Abdah.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "1139650",
    "last_updated": null
  },
  {
    "indonesianURN": "3238890",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1742",
    "babName": "Mencintai sebagian isteri melebihi cintanya terhadap lainnya",
    "hadithNumber": "3889",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim telah memberitakan kepada kami 'Abdah bin Sulaiman telah menceritakan kepada kami Hisyam dari ayahnya dari 'Aisyah, dia berkata; \"Orang-orang mengkhususkan hadiah mereka ketika hari giliran 'Aisyah, mereka mengharapkan keridhaan Rasulullah shallallahu 'alaihi wasallam.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "1139660",
    "last_updated": null
  },
  {
    "indonesianURN": "3238900",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1742",
    "babName": "Mencintai sebagian isteri melebihi cintanya terhadap lainnya",
    "hadithNumber": "3890",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Adam dari 'Abdah dari Hisyam dari Shalih bin Rabi'ah bin Hudair dari Aisyah, dia berkata; \"Allah mewahyukan kepada Nabi shallallahu 'alaihi wasallam ketika saya tengah bersama beliau kemudian saya berdiri dan menutup pintu antara diriku dan beliau, kemudian tatkala beliau beristirahat darinya (selesai menerima wahyu) beliau bersabda kepadaku: \"Wahai Aisyah, sesungguhnya Jibril mengucapkan salam kepadamu.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "1139670",
    "last_updated": null
  },
  {
    "indonesianURN": "3238910",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1742",
    "babName": "Mencintai sebagian isteri melebihi cintanya terhadap lainnya",
    "hadithNumber": "3891",
    "hadithText": "Telah mengabarkan kepada kami Nuh bin Habib telah menceritakan kepada kami Abdurrazzaq telah menceritakan kepada kami Ma'mar dari Az Zuhri dari 'Urwah dari Aisyah bahwa Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"sesungguhnya Jibril mengucapkan salam kepadamu.\" 'Aisyah berkata; wa 'alaihis salaam wa rahmatullaahi wa barakaatuh. Tuan melihat apa yang tidak kami lihat.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "1139680",
    "last_updated": null
  },
  {
    "indonesianURN": "3238920",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1742",
    "babName": "Mencintai sebagian isteri melebihi cintanya terhadap lainnya",
    "hadithNumber": "3892",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Manshur telah menceritakan kepada kami Al Hakam bin Nafi' telah memberitakan kepada kami Syu'aib dari Az Zuhri telah memberitakan kepada kami Abu Salamah dari 'Aisyah, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Aisyah, ini Jibril dia mengucapkan salam kepadamu.\" sama seperti hadits sebelumnya. Abu Abdurrahman berkata; \"Ini adalah yang benar dan yang sebelumnya adalah salah.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "1139690",
    "last_updated": null
  },
  {
    "indonesianURN": "3238930",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1743",
    "babName": "Cemburu",
    "hadithNumber": "3893",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna telah menceritakan kepada kami Khalid telah menceritakan kepada kami Humaid telah menceritakan kepada kami Anas, dia berkata; \"Nabi shallallahu 'alaihi wasallam pernah berada pada salah satu Ummul mukminin, kemudian ummul mukminin yang lain mengirimkan nampan yang berisi makanan. Kemudian dia memukul tangan Rasulullah shallallahu 'alaihi wasallam sehingga nampan tersebut terjatuh dan pecah. Lalu Nabi shallallahu 'alaihi wasallam mengambil dua pecahan tersebut dan menggabungkan satu dengan yang lainnya. Kemudian beliau mengumpulkan makanan yang ada dalamnya dan bersabda: \"Ibu kalian telah cemburu, makanlah, makanlah.\" Kemudian beliau memegang hingga ummul mukminin datang membawa nampan yang ada di rumahnya. Kemudian beliau menyerahkan nampan yang baik kepada seorang utusan dan meninggalkan nampan yang pecah di rumah isteri beliau yang memecahkannya.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "17",
    "matchingArabicURN": "1139700",
    "last_updated": null
  },
  {
    "indonesianURN": "3238940",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1743",
    "babName": "Cemburu",
    "hadithNumber": "3894",
    "hadithText": "Telah mengabarkan kepada kami Ar Rabi' bin Sulaiman telah menceritakan kepada kami Asad bin Musa telah menceritakan kepada kami Hammad bin Salamah dari Tsabit dari Abu Al Mutawakkil dari Ummu Salamah bahwa dia datang dengan membawa makanan di atas piringnya kepada Rasulullah shallallahu 'alaihi wasallam dan para sahabat beliau, lalu datanglah 'Aisyah dengan bersarungkan pakaian, dia datang membawa batu, lalu memecah piring itu dengannya, kemudian Nabi shallallahu 'alaihi wasallam mengumpulkan dua pecahan piring dan bersabda: \" Makanlah, ibu kalian telah cemburu, \" dua kali, lalu Rasulullah shallallahu 'alaihi wasallam mengambil piring 'Aisyah dan mengirimnya kepada Ummu Salamah dan memberikan piring Ummu Salamah kepada 'Aisyah.</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "18",
    "matchingArabicURN": "1139710",
    "last_updated": null
  },
  {
    "indonesianURN": "3238950",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1743",
    "babName": "Cemburu",
    "hadithNumber": "3895",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dari Abdurrahman dari Sufyan dari Fulait dari Jasrah binti Dajajah dari Aisyah, dia berkata; \"Saya tidak melihat seorang wanita pembuat makanan seperti Shafiyah, dia memberikan hadiah kepada Nabi shallallahu 'alaihi wasallam bejana yang berisi makanan, kemudian saya tidak dapat menahan diriku untuk memecahkannya. Lalu saya bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai kafarah hal tersebut maka beliau bersabda: \"Bejana seperti bejana dan makanan seperti makanan.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "19",
    "matchingArabicURN": "1139720",
    "last_updated": null
  },
  {
    "indonesianURN": "3238960",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1743",
    "babName": "Cemburu",
    "hadithNumber": "3896",
    "hadithText": "Telah mengabarkan kepada kami Al Hasan bin Muhammad Az Za'farani telah menceritakan kepada kami Hajjaj dari Ibnu Juraij dari 'Atho` bahwa dia mendengar 'Ubaid bin 'Umair berkata; \"Saya mendengar Aisyah mengaku bahwa Rasulullah shallallahu 'alaihi wasallam pernah tinggal di rumah Zainab binti Jahsy dan beliau minum madu di rumahnya. Kemudian saya dan Hafshah bersepakat bahwa siapapun diantara kami yang ditemui Nabi shallallahu 'alaihi wasallam hendaknya dia mengatakan; \"Sesungguhnya saya mendapatkan bau maghafir (tumbuhan bergetah yang manis rasanya tapi baunya tak sedap), Tuan telah memakan maghafir. Kemudian beliau menemui salah seorang dari mereka, kemudian dia mengatakan hal tersebut kepada beliau. Kemudian beliau bersabda: \"Tidak, melainkan saya minum madu di rumah Zainab binti Jahsy, dan saya tidak akan mengulanginya lagi.\" Kemudian turunlah ayat: \"Hai Nabi, mengapa kamu mengharamkan apa yang Allah halalkan bagimu' dan ayat 'Jika kamu berdua bertaubat kepada Allah..' untuk Aisyah dan Hafshah, serta ayat: 'Dan ingatlah ketika Nabi membicarakan secara rahasia kepada salah seorang isterinya (Hafsah) suatu peristiwa. Karena sabda beliau: melainkan saya minum madu.</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "20",
    "matchingArabicURN": "1139730",
    "last_updated": null
  },
  {
    "indonesianURN": "3238970",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1743",
    "babName": "Cemburu",
    "hadithNumber": "3897",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Yunus bin Muhammad Harami itu adalah julukannya, ia berkata; telah menceritakan kepada kami ayahku, ia berkata; telah menceritakan kepada kami Hammad bin Salamah dari Tsabit dari Anas bahwa Rasulullah shallallahu 'alaihi wasallam memiliki budak yang beliau gauli, dan 'Aisyah serta Hafshoh masih berada bersama beliau hingga beliau mengharamkan atas diri beliau, kemudian Allah Azza wa jalla menurunkan ayat: Hai Nabi, mengapa kamu mengharamkan apa yang Allah halalkan bagimu... sampai akhir ayat.</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "21",
    "matchingArabicURN": "1139740",
    "last_updated": null
  },
  {
    "indonesianURN": "3238980",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1743",
    "babName": "Cemburu",
    "hadithNumber": "3898",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Al Laits dari Yahya bin Sa'id Al Anshari dari 'Ubadah bin Al Walid bin 'Ubadah bin Ash Shamit bahwa Aisyah berkata; saya mencari Rasulullah shallallahu 'alaihi wasallam kemudian memasukkan tanganku pada rambutnya, kemudian beliau bersabda: \"Telah datang kepadamu syetanmu.\" Kemudian saya katakan; apakah engkau memilki syetan? Beliau bersabda: \"Benar, akan tetapi Allah telah membantuku untuk menundukkannya sehingga ia masuk Islam.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "22",
    "matchingArabicURN": "1139750",
    "last_updated": null
  },
  {
    "indonesianURN": "3238990",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1743",
    "babName": "Cemburu",
    "hadithNumber": "3899",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Al Hasan Al Miqsami dari Hajjaj dari Ibnu Juraij dari 'Atho`, telah mengabarkan kepadaku Ibnu Abi Mulaikah dari Aisyah, ia berkata; saya kehilangan Rasulullah shallallahu 'alaihi wasallam pada suatu malam, dan saya mengira bahwa beliau pergi kepada sebagian isterinya kemudian saya meraba-raba, ternyata beliau sedang melakukan ruku' atau sujud. Beliau mengucapkan: Subhaanaka wa bihamdika laa ilaaha illaa anta.\" Dan saya katakan; dengan ayah dan ibuku, sesungguhnya engkau berada dalam suatu keadaan dan saya dalam keadaan yang lain.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "23",
    "matchingArabicURN": "1139760",
    "last_updated": null
  },
  {
    "indonesianURN": "3239000",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1743",
    "babName": "Cemburu",
    "hadithNumber": "3900",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Manshur, ia berkata; telah menceritakan kepada kami Abdur Razzaq, ia berkata; telah memberitakan kepada kami Ibnu Juraij, ia berkata; telah mengabarkan kepadaku Ibnu Mulaikah bahwa Aisyah berkata; saya mencari-cari Rasulullah shallallahu 'alaihi wasallam pada suatu malam, dan saya mengira bahwa beliau pergi kepada sebagian isterinya kemudian saya meraba-raba kemudian kembali, ternyata beliau sedang melakukan ruku' atau sujud. Beliau mengucapkan: Subhaanaka wa bihamdika laa ilaaha illaa anta.\" Dan saya katakan; dengan ayah dan ibuku, sesungguhnya engkau berada dalam suatu keadaan dan saya dalam keadaan yang lain.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "24",
    "matchingArabicURN": "1139770",
    "last_updated": null
  },
  {
    "indonesianURN": "3239010",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1743",
    "babName": "Cemburu",
    "hadithNumber": "3901",
    "hadithText": "Telah mengabarkan kepada kami Sulaiman bin Daud, ia berkata; telah memberitakan kepada kami Ibnu Wahb, ia berkata; telah mengabarkan kepadaku Ibnu Juraij dari Abdullah bin Katsir bahwa ia mendengar Muhammad bin Qais berkata; saya mendengar Aisyah berkata; maukah saya ceritakan kepada kalian mengenai Nabi shallallahu 'alaihi wasallam dan dariku? Kami mengatakan; ya. Ia berkata; ketika datang malam giliranku beliau berbalik kemudian beliau meletakkan kedua sandalnya di kedua kakinya, dan meletakkan selendangnya di tengah sarungnya di atas kasurnya. Dan tidak lama kemudian beliau menyangka bahwa saya telah tertidur kemudian beliau memakai sandalnya perlahan dan mengambil selendangnya kemudian membuka pintu perlahan, dan keluar dan menutupnya perlahan. Dan saya meletakkan bajuku di kepala dan menutupi kepalaku dengan sarungku, dan pergi menikuti beliau hingga beliau sampai di Baqi' kemudian mengangkat kedua tangannya tiga kali dan beliau berdiri lama. Kemudian beliau pergi dan berjalan cepat dan saya berjalan cepat, beliau berlari-lari kecil dan sayapun berlari-lari kecil. Kemudian sampai rumah dan sayapun telah sampai dan mendahului beliau. Beliau bersabda: \"Engkau terengah-engah, sungguh engkau memberitahuku atau Allah yang Maha Lembut dan Mengetahui akan memberitahuku?\" saya katakan; wahai Rasulullah, tebusanmu dengan ayah dan ibuku.... kemudian saya beritahu beliau. Beliau bersabda: \"Apakah engkau bayangan hitam yang saya lihat di depanku?\" saya katakan; ya. Aisyah berkata; kemudian beliau dadaku dengan pulukan yang membuatku merasa sakit. Beliau bersabda: \"Engkau menyangka bahwa Allah dan RasulullahNya akan berlaku sewenang-wenang kepadamu?\" Aisyah berkata; bagaimanapun orang menyembunyikan sungguh Allah 'azza wajalla telah mengetahuinya. Beliau bersabda: \"Ya, sesungguhnya Jibril 'alaihis salam telah datang kepadaku ketika engkau melihat dan ia tidak menemuimu sedang engkau telah meletakkan pakaianmu. Kemudian ia memanggilku dan menyembunyikannya darimu. Kemudian saya menjawabnya dan menyembunyikannya darimu. Saya mengira bahwa engkau telah tertidur, sehingga tidak inggin membangunkanmu karena khawatir engkau merasa kesepian. Kemudian ia memerintahkanku agar mendatangi penghuni Baqi' dan memintakan ampunan untuk mereka.\" Hajjaj bin Muhammad telah menyelisihinya, ia berkata; dari Ibnu Juraij dari Ibnu Mulaikah dari Muhammad bin Qais.....</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "25",
    "matchingArabicURN": "1139780",
    "last_updated": null
  },
  {
    "indonesianURN": "3238831",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1742",
    "babName": "Mencintai sebagian isteri melebihi cintanya terhadap lainnya",
    "hadithNumber": "3883",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'd bin Ibrahim bin Sa'd telah menceritakan kepada kami pamanku telah menceritakan kepada kami ayahku dari Shalih dari Ibnu Syihab telah mengabarkan kepadaku Muhammad bin Abdur Rahman bin Al Harits bin Hisyam bahwa Aisyah berkata; \"Para isteri Nabi shallallahu 'alaihi wasallam mengirim Fathimah binti Rasulullah shallallahu 'alaihi wasallam kepada Rasulullah shallallahu 'alaihi wasallam, kemudian dia meminta izin kepada beiau sedang beliau dalam keadaan berbaring bersamaku dalam pakaian buluku. Kemudian beliau memberikan izin kepadanya, lalu Fatimah berkata; \"Wahai Rasulullah, sesungguhnya para isteri Tuan mengirimku kepada Tuan, mereka meminta keadilan mengenai anak Abu Quhafah. Dan saya dalam keadaan diam, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Wahai anakku, bukankah engkau mencintai orang yang saya cintai?\" Dia berkata; \"Ya.' Beliau bersabda: \"Maka cintailah orang ini.\" Kemudian Fathimah bangkit ketika dia mendengar hal tersebut dari Rasulullah shallallahu 'alaihi wasallam. Kemudian dia kembali kepada para isteri Nabi shallallahu 'alaihi wasallam dan mengabarkan kepada mereka apa yang telah dia katakan dan apa yang beliau sabdakan kepadanya. Kemudian mereka berkata; kami tidak melihat dirimu memuaskan kami sedikitpun, maka kembalilah kepada Rasulullah shallallahu 'alaihi wasallam dan katakan kepada beliau; sesungguhnya isteri-isteri Tuan menuntut keadilan mengenai anak Abu Quhafah.\" Fathimah berkata; \"Tidak. Demi Allah saya tidak akan berbicara dengan beliau mengenainya selamanya. 'Aisyah berkata; \"Kemudian isteri-isteri Nabi shallallahu 'alaihi wasallam mengirim Zainab binti Jahsy kepada Rasulullah shallallahu 'alaihi wasallam dan dia adalah orang yang menjadi sainganku di antara isteri-isteri Nabi shallallahu 'alaihi wasallam di dalam kedudukan di sisi Rasulullah shallallahu 'alaihi wasallam, saya tidak melihat seorang wanita yang paling baik dalam agama lebih baik daripada Zainab dan lebih bertakwa kepada Allah 'azza wajalla, lebih jujur perkataannya, lebih sering menyambung ikatan kekerabatan, lebih besar sedekahnya, dan lebih rendah diri dalam hal amalan yang dia sedekahkan dan dia gunakan untuk mendekatkan diri kepada Allah selain cepat marah karena keras budi pekertinya, namun dia cepat menarik diri dari kemarahan. Dia meminta izin kepada Rasulullah shallallahu 'alaihi wasallam, sedang Rasulullah shallallahu 'alaihi wasallam tengah bersama Aisyah dalam baju bulunya sebagaimana ketika Fathimah menemui beliau. Kemudian Rasulullah shallallahu 'alaihi wasallam memberikan izin kepadanya, kemudian dia berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, sesungguhnya isteri-isteri Tuan mengirimku, mereka meminta keadilan mengenai anak Abu Quhafah.\" Dan dia mencelaku, dia berbicara lama sedang saya memperhatikan Rasulullah shallallahu 'alaihi wasallam dan memperhatikan ujung matanya, apakah beliau mengizinkan saya (membalas) ucapannya. Zainab tidak kunjung pergi hingga saya mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam tidak membenci saya jika saya membalasnya Kemudian tatkala saya mencelanya saya tidak diam begitu saja (mendengar celaannya) hingga (kemudian) saya menyerangnya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya dia adalah anak Abu Bakar.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "1139590",
    "last_updated": null
  },
  {
    "indonesianURN": "3238832",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1742",
    "babName": "Mencintai sebagian isteri melebihi cintanya terhadap lainnya",
    "hadithNumber": "3883",
    "hadithText": "Imran bin Bakkar Al Himshi telah mengabarkan kepadaku, dia berkata; telah menceritakan kepada kami Abu Al Yaman telah memberitakan kepada kami Syu'aib dari Az Zuhri telah mengabarkan kepadaku Muhammad bin Abdur Rahman bin Al Harits bin Hisyam bahwa Aisyah berkata;...(dia menyebutkan seperti di atas). Dan dia berkata; \"Para isteri Nabi shallallahu 'alaihi wasallam mengirim Zainab kemudian dia meminta izin dan beliau mengizinkannya kemudian dia masuk dan berkata seperti itu. Ma'mar menyelisihi keduanya, dia meriwayatkannya dari Az Zuhri dari 'Urwah dari 'Aisyah.\"</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "1139600",
    "last_updated": null
  },
  {
    "indonesianURN": "3239021",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1743",
    "babName": "Cemburu",
    "hadithNumber": "3902",
    "hadithText": "Telah mengabarkan kepada kami Yusuf bin Sa'id bin Muslim Al Mishshishi, ia berkata; telah menceritakan kepada kami Hajjaj dari Ibnu Juraij telah mengabarkan kepadaku Abdullah bin Abi Mulaikah bahwa ia mendengar Muhammad bin Qais bin Makhramah berkata; saya mendengar Aisyah menceritakan, ia berkata; maukah kalian saya ceritakan kepada kalian mengenai diriku dan Rasulullah shallallahu 'alaihi wasallam? Kami mengatakan; ya. Ia berkata; di saat malamku yang mana beliau ada di sisiku yaitu Nabi shallallahu 'alaihi wasallam, beliau berbalik dan meletakkan kedua sandalnya di kedua kakinya dan meletakkan selendangnya di tengah ujung sarungnya di atas kasurnya. Dan tidak lama kemudian beliau menyangka bahwa saya telah tertidur kemudian beliau memakai sandalnya perlahan dan mengambil selendangnya kemudian membuka pintu perlahan, dan keluar dan menutupnya perlahan. Dan saya meletakkan bajuku di kepala dan menutupi kepalaku dengan sarungku, dan pergi menikuti beliau hingga beliau sampai di Baqi' kemudian mengangkat kedua tangannya tiga kali dan beliau berdiri lama. Kemudian beliau pergi dan berjalan cepat dan saya berjalan cepat, beliau berlari-lari kecil dan sayapun berlari-lari kecil. Kemudian sampai rumah dan sayapun telah sampai dan mendahului beliau. Beliau bersabda: \"Engkau terengah-engah, sungguh engkau memberitahuku atau Allah yang Maha Lembut dan Mengetahui akan memberitahuku?\" saya katakan; wahai Rasulullah, tebusanmu dengan ayah dan ibuku.... kemudian saya beritahu beliau. Beliau bersabda: \"Apakah engkau bayangan hitam yang saya lihat di depanku?\" saya katakan; ya. Aisyah berkata; kemudian beliau dadaku dengan pulukan yang membuatku merasa sakit. Beliau bersabda: \"Engkau menyangka bahwa Allah dan RasulullahNya akan berlaku sewenang-wenang kepadamu?\" Aisyah berkata; bagaimanapun orang menyembunyikan sungguh Allah 'azza wajalla telah mengetahuinya. Beliau bersabda: \"Ya, sesungguhnya Jibril 'alaihis salam telah datang kepadaku ketika engkau melihat dan ia tidak menemuimu sedang engkau telah meletakkan pakaianmu. Kemudian ia memanggilku dan menyembunyikannya darimu. Kemudian saya menjawabnya dan menyembunyikannya darimu. Saya mengira bahwa engkau telah tertidur, sehingga tidak inggin membangunkanmu karena khawatir engkau merasa kesepian. Kemudian ia memerintahkanku agar mendatangi penghuni Baqi' dan memintakan ampunan untuk mereka.\" Ashim telah meriwayatkannya dari Abdullah bin 'Amir bin Rabi'ah dari Aisyah dengan lafadz yang lain.</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "26",
    "matchingArabicURN": "1139790",
    "last_updated": null
  },
  {
    "indonesianURN": "3239022",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "36",
    "bookName": "Menggauli wanita",
    "babNumber": "1743",
    "babName": "Cemburu",
    "hadithNumber": "3902",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr dia berkata; telah memberitakan kepada kami Syarik dari Ashim dari Abdullah bin Amir bin Rabi'ah dari Aisyah, ia berkata; saya kehilangan beliau pada suatu malam....dan ia menyebutkan hadits tersebut.</b>",
    "bookID": "36.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "27",
    "matchingArabicURN": "1139800",
    "last_updated": null
  }
]