[
  {
    "indonesianURN": "3239030",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3903",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Muhammad bin Bakkar bin Bilal dari Muhammad bin Isa yaitu Ibu Sa'id, ia berkata; telah menceritakan kepada kami Humaid Ath Thawil dari Anas bin Malik dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \" Aku diperintah untuk memerangi kaum musyrikin hingga mereka bersaksi bahwa tiada Tuhan yang patut disembah kecuali hanya Allah dan bahwa Muhammad adalah hamba dan rasulNya, jika mereka bersaksi bahwa tiada tuhan yang patut disembah kecuali hanya Allah dan bahwa Muhammad adalah hamba dan rasulNya, mereka sholat dengan sholat kita menghadap kiblat kita, makan hewan sembelihan kami maka darah dan harta mereka haram atas kita kecuali dengan haq.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "1139810",
    "last_updated": null
  },
  {
    "indonesianURN": "3239040",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3904",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Hatim bin Nu'aim, ia berkata; telah memberitakan kepada kami Habban, ia berkata; telah menceritakan kepada kami Abdullah dari Humaid bin Ath Thawil dari Anas bin Malik bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya diperintahkan untuk memerangi manusia hingga mereka bersaksi bahwa tidak ada Tuhan yang berhak disembah kecuali Allah dan Muhammad adalah Rasulullah, maka apabila bersaksi bahwa tidak ada Tuhan yang berhak disembah kecuali Allah dan Muhammad adalah Rasulullah, menghadap ke kiblat kita, memakan sembelihan kita, dan melakukan shalat kita maka sungguh telah haram atas kita darah mereka dan harta mereka kecuali dengan haknya, bagi mereka apa yang menjadi hak orang-orang muslimin dan kewajiban mereka apa yang menjadi kewajiban atas orang-orang muslimin.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "1139820",
    "last_updated": null
  },
  {
    "indonesianURN": "3239050",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3905",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna, ia berkata; telah menceritakan kepada kami Muhammad bin Abdullah Al Anshari, ia berkata; telah memberitakan kepada kami Humaid, ia berkata; Maimun bin Siyah bertanya kepada Anas bin Malik, ia berkata; wahai Abu Hamzah, apakah yang mengharamkan darah seorang muslim dan darahnya? Kemudian ia berkata; orang yang bersyahadat bahwa tidak ada Tuhan yang berhak disembah kecuali Allah dan Muhammad adalah Rasulullah, menghadap kiblat kita, melakukan shalat kita, dan memakan sembelihan kita maka ia adalah seorang muslim, baginya apa yang menjadi hak orang-orang muslim dan kewajibannya adalah apa yang menjadi kewajiban atas orang-orang muslim.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "1139830",
    "last_updated": null
  },
  {
    "indonesianURN": "3239060",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3906",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar, ia berkata; telah menceritakan kepada kami 'Amr bin 'Ashim, ia berkata; telah menceritakan kepada kami Imran Abu Al 'Awwam, ia berkata; telah menceritakan kepada kami Ma'mar dari Az Zuhri dari Anas bin Malik, ia berkata; tatkala Rasulullah shallallahu 'alaihi wasallam wafat orang-orang Arab keluar dari agama Islam, kemudian Umar berkata; wahai Abu Bakar, bagaimana engkau memerangi orang-orang Arab? Maka Abu Bakar berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya diperintahkan untuk memerangi manusia hingga mereka bersaksi bahwa tidak Tuhan Yang berhak disembah kecuali Allah dan dan saya adalah Rasulullah, menegakkan shalat dan menunaikan zakat.\" Demi Allah seandainya mereka menahanku mengambil satu anak kambing saja diantara apa yang dahulunya mereka berikan kepada Rasulullah shallallahu 'alaihi wasallam niscaya saya akan memerangi mereka karenanya. Umar berkata; tatkala saya melihat pendapat Abu Bakar telah diberi kelapangan maka saya melihat bahwa dia adalah yang benar.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "1139840",
    "last_updated": null
  },
  {
    "indonesianURN": "3239070",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3907",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Al Laits dari 'Uqail dari Az Zuhri telah mengabarkan kepadaku 'Ubaidullah bin Abdullah bin 'Utbah dari Abu Hurairah, ia berkata; tatkala Rasulullah shallallahu 'alaihi wasallam wafat dan Abu Bakar dipilih menjadi penggantinya, telah kafirlah orang yang kafir dari kalangan orang-orang Arab. Umar berkata kepada Abu Bakar; bagaimana engkau memerangi manusia sedangkan Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Saya diperintahkan untuk memerangi manusia hingga mereka mengucapkan LAA ILAAHA ILLALLAAH, barang siapa yang mengucapkan LAA ILAAHA ILLALLAAH, maka ia telah melindungi jiwa dan hartanya dariku kecuali dengan haknya dan perhitungannya kepada Allah.\" Maka Abu Bakar berkata; sungguh saya akan memerangi orang yang memisahkan antara shalat dan zakat, karena sesungguhnya zakat adalah haknya harta. Demi Allah seandainya mereka menahanku mengambil satu tali pengikat unta saja yang dahulunya mereka menunaikannya kepada Rasulullah shallallahu 'alaihi wasallam niscaya saya akan memerangi mereka karena menolak untuk memberikannya. Umar berkata; Demi Allah tidak lain kecuali saya melihat Allah 'azza wajalla telah melapangkan hati Abu Bakar untuk memerangi mereka dan saya tahu bahwa ia adalah yang benar.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "1139850",
    "last_updated": null
  },
  {
    "indonesianURN": "3239080",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3908",
    "hadithText": "Telah mengabarkan kepada kami Ziyad bin Ayyub, ia berkata; telah menceritakan kepada kami Muhammad bin Yazid, ia berkata; telah menceritakan kepada kami Sufyan dari Az Zuhri dari 'Ubaidullah bin Abdullah bin 'Utbah dari Abu Hurairah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"\"Saya diperintahkan untuk memerangi manusia hingga mereka mengucapkan LAA ILAAHA ILLALLAAH apabila mereka telah mengucapkannya maka sungguh mereka telah melindungi jiwa dan harta mereka dariku kecuali dengan haknya dan perhitungannya kepada Allah.\" Kemudian tatkala terjadi kemurtadan Umar berkata kepada Abu Bakar; apakah engkau akan memerangi mereka sedang saya telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \" demikian dan demikian? Maka Abu Bakar berkata; demi Allah saya tidak akan memisahkan antara shalat dan zakat. Dan sungguh saya akan memerangi orang yang memisahkan antara keduanya. Kemudian kami memerangi bersamanya, dan kami melihat hal tersebut sebagai petunjuk. Abu Abdurrahman berkata; Sufyan dalam riwayat Az Zuhri tidaklah kuat dan ia adalah Sufyan bin Husain.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "1139860",
    "last_updated": null
  },
  {
    "indonesianURN": "3239090",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3909",
    "hadithText": "Telah mengabarkan kepada kami Al Harits bin Miskin dengan membacakan riwayat dan saya mendengar, dari Ibnu Wahb, ia berkata; telah mengabarkan kepadaku Yunus dari Ibnu Syihab, ia berkata; telah menceritakan kepadaku Sa'id bin Al Musayyab bahwa Abu Hurairah telah mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"\"Saya diperintahkan untuk memerangi manusia hingga mereka mengucapkan LAA ILAAHA ILLALLAAH, barang siapa yang mengucapkan LAA ILAAHA ILLALLAAH, maka ia telah melindungi harta dan jiwanya dariku kecuali dengan haknya dan perhitungannya kepada Allah 'azza wajalla.\" Syu'ib bin Hamzah telah menggabungkan antara dua hadits tersebut.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "1139870",
    "last_updated": null
  },
  {
    "indonesianURN": "3239100",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3910",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Muhammad bin Al Mughirah, ia berkata; telah menceritakan kepada kami Utsman dari Syu'aib dari Az Zuhri, ia berkata; telah menceritakan kepada kami 'Ubaidullah bin Abdullah bin 'Utbah bahwa Abu Hurairah berkata; tatkala Rasulullah shallallahu 'alaihi wasallam wafat dan Abu Bakar menggantikan setelahnya serta telah kafir orang yang kafir dari kalangan orang-orang Arab, Umar berkata; wahai Abu Bakar, bagaimana engkau memerangi manusia sedangkan Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Saya diperintahkan untuk memerangi manusia hingga mereka mengucapkan LAA ILAAHA ILLALLAAH barang siapa yang mengucapkan LAA ILAAHA ILLALLAAH, maka ia telah melindungi harta dan jiwanya kecuali dengan haknya dan perhitungannya kepada Allah 'azza wajalla.\" Maka Abu Bakar berkata; sungguh saya akan memerangi orang yang memisahkan antara shalat dan zakat, karena sesungguhnya zakat adalah haknya harta. Demi Allah seandainya mereka menolak memberikan kepadaku satu anak kambing saja yang dahulunya mereka menunaikannya kepada Rasulullah shallallahu 'alaihi wasallam niscaya saya akan memerangi mereka karena penolakan tersebut. Demi Allah tidak lain kecuali saya melihat Allah telah melapangkan hati Abu Bakar untuk memerangi mereka dan saya tahu bahwa ia adalah yang benar.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "1139880",
    "last_updated": null
  },
  {
    "indonesianURN": "3239110",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3911",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Muhammad bin Al Mughirah, ia berkata; telah menceritakan kepada kami Utsman, dari Syu'aib dari Az Zuhri, ia berkata; telah menceritakan kepadaku Sa'id bin Al Musayyab bahwa Abu Hurairah telah mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya diperintahkan untuk memerangi manusia hingga mereka mengucapkan; LAA ILAAHA ILLALLAAH barang siapa yang mengucapkannya maka ia telah melindungi jiwa dan hartanya dariku kecuali dengan haknya dan perhitungannya kepada Allah.\" Al Walid bin Muslim telah menyelisihinya.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "1139890",
    "last_updated": null
  },
  {
    "indonesianURN": "3239120",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3912",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman, ia berkata; telah menceritakan kepada kami Muammal bin Al Fadhl, ia berkata; telah menceritakan kepada kami Al Walid, ia berkata; telah menceritakan kepadaku Syu'aib bin Abu Hamzah dan Sufyan bin 'Uyainah..dan ia menyebutkan yang lain dari Az Zuhri dari Sa'id bin Al Musayyab dari Abu Hurairah, ia berkata;...kemudian Abu Bakar telah bertekad untuk memerangi mereka. Kemudian Umar berkata; bagaimana engkau memerangi manusia sedangkan Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Saya diperintahkan untuk memerangi manusia hingga mereka mengucapkan LAA ILAAHA ILLALLAAH, apabila mereka mengucapkannya maka mereka telah melindungi jiwa dan harta mereka kecuali dengan haknya.\" Maka Abu Bakar berkata; sungguh saya akan memerangi orang yang memisahkan antara shalat dan zakat. Demi Allah seandainya mereka menolak memberikan kepadaku satu anak kambing saja yang dahulunya mereka menunaikannya kepada Rasulullah shallallahu 'alaihi wasallam niscaya saya akan memerangi mereka karena penolakan tersebut. Demi Allah tidak lain kecuali saya melihat Allah telah melapangkan hati Abu Bakar untuk memerangi mereka dan saya tahu bahwa ia adalah yang benar.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "1139900",
    "last_updated": null
  },
  {
    "indonesianURN": "3239130",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3913",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Mubarak, ia berkata; telah memberitakan kepada kami Abu Mu'awiyah. Diriwayatkan dari jalur lainnya, telah memberitakan kepada kami Ahmad bin Harb dari Abu Mu'awiyah dari Al A'masy dari Abu Shalih dari Abu Hurairah mereka berdua berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Saya diperintahkan untuk memerangi manusia hingga mereka mengucapkan LAA ILAAHA ILLALLAAH, apabila mereka mengucapkannya maka mereka telah melindungi darah dan harta mereka dariku kecuali dengan haknya dan perhitungannya kepada Allah 'azza wajalla.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "1139910",
    "last_updated": null
  },
  {
    "indonesianURN": "3239140",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3914",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah memberitakan kepada kami Ya'la bin 'Ubaid dari Al A'masy dari Abu Sufyan dari Jabir dan dari Abu Shalih dari Abu Hurairah mereka berdua berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya diperintahkan untuk memerangi manusia hingga mereka mengucapkan LAA ILAAHA ILLALLAAH, apabila mereka mengucapkannya maka mereka telah melindungi darah dan harta mereka dariku kecuali dengan haknya dan perhitungannya kepada Allah 'azza wajalla.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "1139920",
    "last_updated": null
  },
  {
    "indonesianURN": "3239150",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3915",
    "hadithText": "Telah mengabarkan kepada kami Al Qasim bin Zakariya bin Dinar, ia berkata; telah menceritakan kepada kami 'Ubaidullah bin Musa, ia berkata; telah menceritakan kepada kami Syaiban dari 'Ashim dari Ziyad bin Qais dari Abu Hurairah dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Kami memerangi manusia hingga mereka mengucapkan LAA ILAAHA ILLALLAAH, apabila mereka mengucapkan LAA ILAAHA ILLALLAAH maka diharamkan atas kami darah dan harta mereka kecuali dengan haknya dan perhitungannya kepada Allah.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "1139930",
    "last_updated": null
  },
  {
    "indonesianURN": "3239170",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3917",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar, ia berkata; telah menceritakan kepada kami Muhammad, ia berkata; telah menceritakan kepada kami Syu'bah dari An Nu'man bin Salim, ia berkata; saya mendengar Aus berkata; saya datang kepada Rasulullah shallallahu 'alaihi wasallam diantara utusan dari Tsaqif, dan saya bersama beliau di dalam sebuah kemah. Kemudian orang yang ada dalam kemah tertidur selain diriku dan beliau. Kemudian datang seorang laki-laki dan membisikkan kepada beliau, kemudian beliau bersabda: \"Pergilah dan bunuhlah dia.\" Kemudian beliau bersabda: \"Bukankah ia bersaksi bahwa tidak ada Tuhan yang berhak disembah kecuali Allah dan saya adalah Rasulullah?\" Orang tersebut berkata; ia bersaksi. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Biarkanlah dia.\" Kemudian beliau bersabda: \"Saya diperintahkan untuk memerangi manusia hingga mereka mengucapkan LAA ILAAHA ILLALLAAH, apabila mereka mengucapkannya maka telah diharamkan darah dan harta mereka kecuali dengan haknya.\" Muhammad berkata; kemudian saya katakan kepada Syu'bah; bukankah dalam hadits disebutkan: \"Bukankah ia bersaksi bahwa tidak ada Tuhan yang berhak disembah kecuali Allah dan saya adalah Rasulullah?\" Ia berkata; saya mengiranya bersamanya, dan saya tidak mengetahui.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "17",
    "matchingArabicURN": "1139970",
    "last_updated": null
  },
  {
    "indonesianURN": "3239180",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3918",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Abdullah, ia berkata; telah menceritakan kepada kami Abdullah bin Bakr, ia berkata; telah menceritakan kepada kami Hatim bin Abu Shaghirah dari An Nu'man bin Salim bahwa 'Amr bin Aus telah mengabarkan kepadanya bahwa ayahnya yaitu Aus berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya diperintahkan untuk memerangi manusia hingga mereka mengucapkan LAA ILAAHA ILLALLAAH, kemudian haram darah dan harta mereka kecuali dengan haknya.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "18",
    "matchingArabicURN": "1139980",
    "last_updated": null
  },
  {
    "indonesianURN": "3239190",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3919",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna, ia berkata; telah menceritakan kepada kami Shafwan bin Isa dari Tsaur dari Abu 'Aun dari Abu Idris, ia berkata; saya mendengar Mu'awiyah berkhutbah dan ia sedikit berbicara, dari Rasulullah shallallahu 'alaihi wasallam. Abu Idris berkata; saya mendengarnya sedang berkhutbah, ia mengatakan; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \" Seluruh dosa semoga Allah mengampuninya kecuali seorang laki-laki membunuh seorang mukmin secara sengaja, atau serang laki-laki yang meninggal sebagai orang kafir.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "19",
    "matchingArabicURN": "1139990",
    "last_updated": null
  },
  {
    "indonesianURN": "3239200",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3920",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali dari Abdurrahman, ia berkata; telah menceritakan kepada kami Sufyan dari Al A'masy dari Abdullah bin Murrah dari Masruq dari Abdullah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada jiwa yang terbunuh secara zhalim kecuali anak Adam yang pertama menanggung darahnya, dan hal tersebut karena ia adalah orang pertama yang melakukan pembunuhan.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "20",
    "matchingArabicURN": "1140000",
    "last_updated": null
  },
  {
    "indonesianURN": "3239210",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3921",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Mu'awiyah bin Malij, ia berkata; telah menceritakan kepada kami Muhammad bin Salamah Al Harrani dari Ibnu Ishaq dari Ibrahim bin Muhajir dari Isma'il mantan budak Abdullah bin Amru, dari Abdullah bin Amru bin Al 'Ash, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada ditanganNya, sungguh terbunuhnya seorang mukmin lebih besar disisi Allah daripada hilangnya dunia, \" Abu abdurrahman berkata; Ibrahim bin Al Muhajir tidak kuat.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "21",
    "matchingArabicURN": "1140010",
    "last_updated": null
  },
  {
    "indonesianURN": "3239220",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3922",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Hakim Al Bashri, ia berkata; telah menceritakan kepada kami Ibnu Adi dari Syu'bah dari Ya'la bin 'Atho` dari ayahnya dari Abdullah bin 'Amr dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \" Sungguh hilangnya dunia lebih ringan bagi Allah daripada terbunuhnya seorang muslim.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "22",
    "matchingArabicURN": "1140020",
    "last_updated": null
  },
  {
    "indonesianURN": "3239230",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3923",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar, ia berkata; telah menceritakan kepada kami Muhammad dari Syu'bah dari Ya'la dari ayahnya dari Abdullah bin 'Amr, ia berkata; terbunuhnya seorang mukmin lebih besar bagi Allah daripada hilangnya dunia.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "23",
    "matchingArabicURN": "1140030",
    "last_updated": null
  },
  {
    "indonesianURN": "3239240",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3924",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Hisyam, ia berkata; telah menceritakan kepada kami Makhlad bin Yazid dari Sufyan dari Manshur dari Ya'la bin 'Atho` dari ayahnya dari Abdullah bin 'Amr, ia berkata; terbunuhnya seorang mukmin lebih besar bagi Allah daripada hilangnya dunia.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "24",
    "matchingArabicURN": "1140040",
    "last_updated": null
  },
  {
    "indonesianURN": "3239250",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3925",
    "hadithText": "Telah mengabarkan kepada kami Al Hasan bin Ishaq Al Marwazi ia adalah orang yang tsiqah, telah menceritakan kepadaku Khalid bin Khidasy, ia berkata; telah menceritakan kepada kami Hatim bin Isma'il dari Basyir bin Al Muhajir dari Abdullah bin Buraidah dari ayahnya ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Terbunuhnya seorang mukmin lebih besar bagi Allah daripada hilangnya dunia.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "25",
    "matchingArabicURN": "1140050",
    "last_updated": null
  },
  {
    "indonesianURN": "3239260",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3926",
    "hadithText": "Telah mengabarkan kepada kami Sari' bin Abdullah Al Wasithi Al Khishi, ia berkata; telah menceritakan kepada kami Ishaq bin Yusuf Al Azraq dari Syarik dari 'Ashim dari Abu Wail dari Abdullah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Sesuatu pertama yang dengannya seorang hamba dihisab adalah shalat dan sesuatu pertama yang diputuskan diantara para manusia adalah mengenai darah.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "26",
    "matchingArabicURN": "1140060",
    "last_updated": null
  },
  {
    "indonesianURN": "3239270",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3927",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la dari Khalid telah menceritakan kepada kami Syu'bah dari Sulaiman, ia berkata; saya mendengar Abu Wail menceritakan dari Abdullah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesuatu pertama yang diputuskan diantara manusia adalah mengenai darah.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "27",
    "matchingArabicURN": "1140070",
    "last_updated": null
  },
  {
    "indonesianURN": "3239280",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3928",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman, ia berkata; telah menceritakan kepada kami Abu Daud dari Sufyan dari Al A'masy dari Abu Wail, ia berkata; Abdullah berkata; \"Sesuatu pertama yang diputuskan diantara manusia adalah mengenai darah.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "28",
    "matchingArabicURN": "1140080",
    "last_updated": null
  },
  {
    "indonesianURN": "3239290",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3929",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Hafsh, ia berkata; telah menceritakan kepadaku ayahku, ia berkata; telah menceritakan kepadaku Ibrahim bin Thahman dari Al A'masy dari Syaqiq kemudian ia menyebutkan satu kalimat yang maknanya adalah; dari 'Amr bin Syurahbil dari Abdullah, ia berkata; Sesuatu pertama yang diputuskan diantara manusia adalah mengenai darah.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "29",
    "matchingArabicURN": "1140090",
    "last_updated": null
  },
  {
    "indonesianURN": "3239300",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3930",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Harb, ia berkata; telah menceritakan kepada kami Abu Mu'awiyah dari Al A'masy dari Abu Wail dari 'Amr bin Syurahbil, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesuatu pertama yang diputuskan diantara manusia pada Hari Kiamat adalah mengenai darah.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "30",
    "matchingArabicURN": "1140100",
    "last_updated": null
  },
  {
    "indonesianURN": "3239310",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3931",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al 'Ala`, ia berkata; telah menceritakan kepada kami Abu Mu'awiyah, ia berkata; telah menceritakan kepada kami Al A'masy dari Syaqiq dari Abdullah, ia berkata; \"Sesuatu pertama yang diputuskan diantara manusia adalah mengenai darah.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "31",
    "matchingArabicURN": "1140110",
    "last_updated": null
  },
  {
    "indonesianURN": "3239320",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3932",
    "hadithText": "Telah mengabarkan kepada kami Ibaraim bin Al Mustamir, ia berkata; telah menceritakan kepada kami 'Amr bin 'Ashim, ia berkata; telah menceritakan kepada kami Mu'tamir dari ayahya dari Al A'masy dari Syaqiq bin Salamah dari 'Amr bin Syurahbil, dari Abdullah bin Mas'ud dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \" Seseorang datang dengan menggandeng tangan orang lain, lalu ia berkata; wahai Tuhanku, ia yang telah membunuhku. Kemudian Allah berfirman kepadanya; kenapa engkau membunuhnya? Ia menjawab; saya membunuhnya agar kemuliaan menjadi milikMu. Lalu Allah berfirman; sesungguhnya kemuliaan itu milikKu. Lalu seseorang datang dengan menggandeng orang lain dan berkata; sesungguhnya orang ini membunuhku. Kemudian Allah berfirman kepadanya; Kenapa engkau membunuhnya? Ia menjawab agar kemuliaan itu menjadi milik Fulan, lalu Allah berfirman: \"Sesungguhnya ia bukan milik Fulan.\" Maka ia kembali membawa dosanya.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "32",
    "matchingArabicURN": "1140120",
    "last_updated": null
  },
  {
    "indonesianURN": "3239330",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3933",
    "hadithText": "Telah mengabarkan kepada kami Abdullah bin Muhammad bin Tamim, ia berkata; telah menceritakan kepada kami Hajjaj, ia berkata; telah mengabarkan kepadaku Syu'bah dari Abu Imran Al Jauni, ia berkata; Jundab berkata; telah menceritakan kepadaku Fulan bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang dibunuh akan datang bersama orang yang membunuhnya kemudian berkata; tanyakan kepada orang ini, kenapa ia membunuhku! Kemudian orang yang membunuh mengatakan; saya membunuhnya karena kekuasaan Fulan.\" Jundab berkata; maka berhati-hatilah terhadapnya.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "33",
    "matchingArabicURN": "1140130",
    "last_updated": null
  },
  {
    "indonesianURN": "3239340",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3934",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Sufyan dari 'Amar Ad Duhni dari Salim bin Abu Al Ja'd bahwa Ibnu Abbas ditanya mengenai orang yang membunuh seorang mukmin secara sengaja kemudian ia bertaubat dan beriman serta beramal Shalih lalu ia mendapat petunjuk. Maka Ibn Abbas berkata; darimana datang taubatnya, saya mendengar Nabi kalian shallallahu 'alaihi wasallam bersabda: \"Ia akan datang bergantung kepada orang yang membunuh dan urat lehernya mengalirkan darah, ia berkata; wahai Tuhanku, tanyakan kepada orang ini kenapa ia membunuhku!\" Kemudian beliau bersabda: \"Demi Allah, sungguh Allah telah menurunkannya kemudian tidak menghapusnya.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "34",
    "matchingArabicURN": "1140140",
    "last_updated": null
  },
  {
    "indonesianURN": "3239350",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3935",
    "hadithText": "Telah berkata dan mengabarkan kepadaku Azhar bin Jamil Al Bashri, ia berkata; telah menceritakan kepada kami Khalid bin Al Harits, ia berkata; telah menceritakan kepada kami Syu'bah dari Al Mughirah bin An Mu'man dari Sa'id bin Jubair, ia berkata; penduduk Kufah berselisih mengenai ayat ini: Dan barangsiapa yang membunuh seorang mukmin dengan sengaja kemudian saya pergi kepada Ibnu Abbas dan bertanya kepadanya, maka ia berkata; sungguh ayat tersebut telah diturunkan di akhir sesuatu yang diturunkan kemudian tidak ada sesuatupun yang menghapusnya.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "35",
    "matchingArabicURN": "1140150",
    "last_updated": null
  },
  {
    "indonesianURN": "3239360",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3936",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Yahya, ia berkata; telah menceritakan kepada kami Ibnu Juraij, ia berkata; telah menceritakan kepadaku Al Qasim bin Abu Bazzah dari Sa'id bin Jubair, ia berkata; saya berkata kepada Ibnu Abbas; apakah orang yang membunuh seorang mukmin dengan sengaja memiliki taubat? Ia berkata; tidak. Dan saya membacakan kepadanya ayat yang terdapat dalam Surat Al Furqan: Dan orang-orang yang tidak menyembah tuhan yang lain beserta Allah dan tidak membunuh jiwa yang diharamkan Allah (membunuhnya) kecuali dengan (alasan) yang benar. Ia berkata; ayat ini adalah ayat Makiyah, telah dihapus oleh ayat Madaniyah: Dan barangsiapa yang membunuh seorang mukmin dengan sengaja maka balasannya ialah Jahannam.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "36",
    "matchingArabicURN": "1140160",
    "last_updated": null
  },
  {
    "indonesianURN": "3239370",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3937",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna, ia berkata; telah menceritakan kepada kami Muhammad, ia berkata; telah menceritakan kepada kami Syu'bah dari Manshur dari Sa'id bin Jubair, ia berkata; Abdurrahman bin Abi Laila telah memerintahkanku agar bertanya kepada Ibnu Abbas mengenai kedua ayat ini, yaitu: Dan barangsiapa yang membunuh seorang mukmin dengan sengaja maka balasannya ialah Jahannam dan ayat ini: Dan orang-orang yang tidak menyembah tuhan yang lain beserta Allah dan tidak membunuh jiwa yang diharamkan Allah (membunuhnya) kecuali dengan (alasan) yang benar. Ia berkata; ayat tersebut turuk mengenai ahli syirik.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "37",
    "matchingArabicURN": "1140170",
    "last_updated": null
  },
  {
    "indonesianURN": "3239380",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3938",
    "hadithText": "Telah mengabarkan kepada kami Hajib bin Sulaiman Al Manbiji, ia berkata; telah menceritakan kepada kami Ibnu Abu Rawwad, ia berkata; telah menceritakan kepada kami Ibnu Juraij dari Abdul A'la Ats Tsaqafi dari Sa'id bin Jubair dari Ibnu Abbas bahwa suatu kaum dahulu mereka sering membunuh, sering berzina dan memperkosa, lalu mereka mendatangi Nabi shallallahu 'alaihi wasallam dan berkata; wahai Muhammad, sesungguhnya apa yang engkau katakan dan engkau serukan adalah baik jika engkau mengabarkan kepada kami bahwa apa yang telah kami perbuat ada kafarahnya, lalu Allah Azza wa jalla menurunkan ayat: Dan orang-orang yang tidak menyembah tuhan yang lain beserta Allah sampai ayat maka itu kejahatan mereka diganti Allah dengan kebajikan. Ia berkata Allah menggantikan kesyirikan mereka dengan keimanan, perzinahan mereka dengan kesucian, dan turunlah ayat: Katakanlah: \"Hai hamba-hamba-Ku yang malampaui batas terhadap diri mereka sendiri, janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni dosa-dosa semuanya. Sesungguhnya Dia-lah Yang Maha Pengampun lagi Maha Penyayang.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "38",
    "matchingArabicURN": "1140180",
    "last_updated": null
  },
  {
    "indonesianURN": "3239390",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3939",
    "hadithText": "Telah mengabarkan kepada kami Al Hasan Az Za'farani, ia berkata; telah menceritakan kepada kami Hajjaj bin Muhammad, berkata Ibnu Juraij; telah mengabarkan kepadaku Ya'la dari Sa'id bin Jubair dari Ibnu Abbas bahwa beberapa orang dari kalangan ahli syirik datang kepada Muhammad shallallahu 'alaihi wasallam kemudian berkata; sesungguhnya apa yang engkau katakan dan engkau serukan adalah baik jika engkau mengabarkan kepada kami bahwa apa yang telah kami perbuat ada kafarahnya, lalu Allah Azza wa jalla menurunkan ayat: Dan orang-orang yang tidak menyembah tuhan yang lain beserta Allah dan turun ayat: Katakanlah: \"Hai hamba-hamba-Ku yang malampaui batas terhadap diri mereka sendiri.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "39",
    "matchingArabicURN": "1140190",
    "last_updated": null
  },
  {
    "indonesianURN": "3239400",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3940",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Rafi', ia berkata; telah menceritakan kepada kami Syababah bin Sawwar, ia berkata; telah menceritakan kepadaku Warqa` dari 'Amr dari Ibnu Abbas dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Akan datang orang yang dibunuh bersama orang yang membunuh pada Hari Kiamat, ubun-ubun dan kepalanya berada di tangannya, dan urat lehernya mengucurkan darah, ia berkata; wahai Tuhanku, ia membunuhku. Hingga Allah mendekatkannya dari 'Arsy.\" 'Amr berkata; kemudian orang-orang menyebutkan taubat kepada Ibnu Abbas, kemudian ia membaca ayat: Dan barang siapa yang membunh orang mukmin dengan sengaja. Ia berkata; ayat tersebut tidak dihapus semenjak diturunkan, darimana ia memdapatkan taubat?</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "40",
    "matchingArabicURN": "1140200",
    "last_updated": null
  },
  {
    "indonesianURN": "3239410",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3941",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna, ia berkata; telah menceritakan kepada kami Al Anshari, ia berkata; telah menceritakan kepada kami Muhammad bin 'Amr dari Ibnu Az Zinad dari Kharijah bin Zaid dari Zaid bin Tsabit, ia berkata; telah turun ayat ini: Dan barangsiapa yang membunuh seorang mukmin dengan sengaja maka balasannya ialah Jahannam, kekal ia di dalamnya ayat tersebut semuanya setelah ayat yang turun pada Surat Al Furqan berjarak enam bulan. Abu Abdurrahman berkata; Muhammad bin 'Amr tidak mendengarnya dari Abu Az Zinad.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "41",
    "matchingArabicURN": "1140210",
    "last_updated": null
  },
  {
    "indonesianURN": "3239420",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3942",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dari Abdul Wahhab, ia berkata; telah menceritakan kepada kami Muhammad bin 'Amr dari Musa bin 'Uqbah dari Abu Az Zinad dari Kharijah bin Zaid dari Zaid mengenai firman Allah: Dan barangsiapa yang membunuh seorang mukmin dengan sengaja maka balasannya ialah Jahannam, kekal ia di dalamnya ayat tersebut semuanya setelah ayat yang turun pada Surat Al Furqan berjarak delapan bulan dan ayat: Dan orang-orang yang tidak menyembah tuhan yang lain beserta Allah dan tidak membunuh jiwa yang diharamkan Allah (membunuhnya) kecuali dengan (alasan) yang benar. Abu Abdurrahman berkata; Abu Az Zinad telah memasukkan Mujalid bin 'Auf di antara dirinya dan Kharijah.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "42",
    "matchingArabicURN": "1140220",
    "last_updated": null
  },
  {
    "indonesianURN": "3239430",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1745",
    "babName": "Menghormati darah",
    "hadithNumber": "3943",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali dari Muslim bin Ibrahim, ia berkata; telah menceritakan kepada kami Hammad bin Salamah dari Abdurrahman bin Ishaq dari Abu Az Zinad dari Mujalid bin 'Auf, ia berkata; saya mendengar Kharijah bin Zaid bin Tsabit menceritakan dari ayahnya bahwa, ia berkata; telah turun ayat: Dan barangsiapa yang membunuh seorang mukmin dengan sengaja maka balasannya ialah Jahannam, kekal ia di dalamnya kami merasa khawatir kemudian turunlah ayat yang ada dalam Surat Al Furqan: Dan orang-orang yang tidak menyembah tuhan yang lain beserta Allah dan tidak membunuh jiwa yang diharamkan Allah (membunuhnya) kecuali dengan (alasan) yang benar.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "43",
    "matchingArabicURN": "1140230",
    "last_updated": null
  },
  {
    "indonesianURN": "3239440",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1746",
    "babName": "Dosa besar",
    "hadithNumber": "3944",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah memberitakan kepada kami Baqiyah, ia berkata; telah menceritakan kepadaku Bahir bin Sa'd dari Khalid bin Ma'dan bahwa Abu Ruhm As Sama'i menceritakan kepada mereka bahwa Abu Ayyub Al Anshari telah menceritakan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang datang dalam keadaan menyembah Allah dan tidak menyekutukan sesuatupun denganNya, mendirikan shalat, menunaikan zakat, dan menjauhi dosa-dosa besar maka baginya Surga.\" Kemudian para sahabat bertanya kepadanya mengenai dosa-dosa besar, maka beliau bersabda: \"Mensekutukan Allah, membunuh jiwa muslimah serta lari pada saat perang.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "44",
    "matchingArabicURN": "1140240",
    "last_updated": null
  },
  {
    "indonesianURN": "3239450",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1746",
    "babName": "Dosa besar",
    "hadithNumber": "3945",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Abdul A'la, ia berkata; telah menceritakan kepada kami Khalid, ia berkata; telah menceritakan kepada kami Syu'bah dari 'Ubaidullah bin Abu Bakar dari Anas dari Nabi shallallahu 'alaihi wasallam. Telah menceritakan dan memberitakan kepada kami Ishaq bin Ibrahim, ia berkata; telah memberitakan kepada kami An Nadhr bin Syumail, ia berkata; telah menceritakan kepada kami Syu'bah dari 'Ubaidullah bin Abu Bakar, ia berkata; saya mendengar Anas berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dosa-dosa besar adalah mensekutukan Allah, durhaka kepada orang tua, membunuh jiwa, dan berkata palsu.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "45",
    "matchingArabicURN": "1140250",
    "last_updated": null
  },
  {
    "indonesianURN": "3239460",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1746",
    "babName": "Dosa besar",
    "hadithNumber": "3946",
    "hadithText": "Telah mengabarkan kepada kami 'Abdah bin Abdur Rahim, ia berkata; telah memberitakan kepada kami Ibnu Syumail, ia berkata; telah memberitakan kepada kami Syu'bah, ia berkata; telah menceritakan kepada kami Firas, ia berkata; saya mendengar Asy Sya'bi dari Abdullah bin 'Amr dari Nabi shallallahu 'alaihi wasallam bersabda: \"Dosa-dosa besar adalah mensekutukan Allah, durhaka kepada orang tua, membunuh jiwa, dan sumpah palsu.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "46",
    "matchingArabicURN": "1140260",
    "last_updated": null
  },
  {
    "indonesianURN": "3239470",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1746",
    "babName": "Dosa besar",
    "hadithNumber": "3947",
    "hadithText": "Telah mengabarkan kepada kami Al Abbas bin Abdul 'Azhim, ia berkata; telah menceritakan kepada kami Mu'adz bin Hani`, ia berkata; telah menceritakan kepada kami Harb bin Syaddad, ia berkata; telah menceritakan kepada kami Yahya bin Abu Katsir dari Abdul Hamid bin Sinan dari hadits 'Ubaid bin 'Umair bahwa ayahnya yang termasuk sahabat Nabi shallallahu 'alaihi wasallam telah menceritakan kepadanya bahwa seseorang berkata; wahai Rasulullah apakah dosa-dosa besar itu? Beliau menjawab: \" Dosa-dosa besar itu ada tujuh yang paling besar adalah menyekutukan Allah dan membunuh jiwa tanpa haq serta melarikan diri ketika perang, \" secara ringkas.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "47",
    "matchingArabicURN": "1140270",
    "last_updated": null
  },
  {
    "indonesianURN": "3239480",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1747",
    "babName": "Dosa paling besar dan perbedaan Yahya dan Abdurrahman atas Sofyan",
    "hadithNumber": "3948",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar, ia berkata; telah menceritakan kepada kami Abdurrahman, ia berkata; telah menceritakan kepada kami Sufyan dari Washil dari Abu Wail dari 'Amr bin Syurahbil dari Abdullah, ia berkata; saya berkata; wahai Rasulullah dosa apakah yang paling besar? Beliau menjawab: \"Engkau membuat tandingan bagi Allah, padahal Dia yang menciptakanmu.\" Saya katakan; kemudian apa? beliau bersabda: \" Engkau membunuh anakmu karena khawatir makan bersamamu.\" Saya katakan; kemudian apa? beliau bersabda: \" Engkau berzina dengan isteri tetanggamu.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "48",
    "matchingArabicURN": "1140280",
    "last_updated": null
  },
  {
    "indonesianURN": "3239490",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1747",
    "babName": "Dosa paling besar dan perbedaan Yahya dan Abdurrahman atas Sofyan",
    "hadithNumber": "3949",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Yahya, ia berkata; telah menceritakan kepada kami Sufyan, ia berkata; telah menceritakan kepadaku Washil dari Abu Wail dari Abdullah, ia berkata; saya berkata; wahai Rasulullah dosa apakah yang paling besar? Beliau menjawab: \"Engkau membuat tandingan bagi Allah, padahal Dia yang menciptakanmu.\" Saya katakan; kemudian apa? beliau bersabda: \"Engkau membunuh anakmu karena ia makan bersamamu.\" Saya katakan; kemudian apa? beliau bersabda: \" Engkau berzina dengan isteri tetanggamu.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "49",
    "matchingArabicURN": "1140290",
    "last_updated": null
  },
  {
    "indonesianURN": "3239500",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1747",
    "babName": "Dosa paling besar dan perbedaan Yahya dan Abdurrahman atas Sofyan",
    "hadithNumber": "3950",
    "hadithText": "Telah mengabarkan kepada kami 'Abdah, ia berkata; telah memberitakan kepada kami Yazid, ia berkata; telah memberitakan kepada kami Syu'bah dari 'Ashim dari Abu Wail dari Abdullah, ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam; dosa apakah yang paling besar? Beliau menjawab: \"Syirik yaitu engkau membuat tandingan bagi Allah, Engkau berzina dengan isteri tetanggamu dan engkau membunuh anakmu karena khawatir makan bersamamu.\" Kemudian Abdullah membaca ayat: Dan orang-orang yang tidak menyembah tuhan yang lain beserta Allah. Abu Abdurrahman berkata; hal ini adalah salah dan yang benar adalah yang sebelumnya, dan hadits Yazid ini adalah salah, sesungguhnya ia adalah Washil. Wallahu a'lam.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "50",
    "matchingArabicURN": "1140300",
    "last_updated": null
  },
  {
    "indonesianURN": "3239510",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1748",
    "babName": "Yang menjadikan darah muslim boleh ditumpahkan",
    "hadithNumber": "3951",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Manshur, ia berkata; telah memberitakan kepada kami Abdurrahman dari Sufyan dari Al A'masy dari Abdullah bin Murrah dari Masruq dari Abdullah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang tidak ada Tuhan yang berhak disembah kecuali dia. Tidaklah halal darah seorang muslim yang bersaksi bahwa tidak ada Tuhan yang berhak disembah kecuali Allah dan saya adalah Rasulullah kecuali tiga orang, yaitu: orang yang meninggalkan Islam dan memisahkan diri dari jama'ah, seorang janda yang berbuat zina, dan membunuh jiwa.\" Al A'masy berkata; kemudian saya menceritakannya kepada Ibrahim, kemudian Ia menceritakan kepadaku Al Aswad dari Aisyah dengan hadits seperti itu.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "51",
    "matchingArabicURN": "1140310",
    "last_updated": null
  },
  {
    "indonesianURN": "3239530",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1748",
    "babName": "Yang menjadikan darah muslim boleh ditumpahkan",
    "hadithNumber": "3953",
    "hadithText": "Telah mengabarkan kepadaku Ibrahim bin Ya'qub, ia berkata; telah menceritakan kepada kami Muhammad bin Isa, ia berkata; telah menceritakan kepada kami Hammad bin Zaid, ia berkata; telah menceritakan kepada kami Yahya bin Sa'd, ia berkata; telah menceritakan kepadaku Abu Umamah bin Sahl dan Abdullah bin 'Amir bin Rabi'ah, mereka berdua berkata; kami bersama Utsman dan ia dalam keadaan terkepung. Dan kami apabila memasuki suatu tempat masuk maka kami mendengar perkataan orang di ubin. Kemudian Utsman pada suatu hari masuk kemudian keluar, dan berkata; sesungguhnya mereka mengancamku untuk dibunuh. Kami katakan; Allah akan menolongmu dari mereka. Ia berkata; kenapa mereka akan membunuhku? Saya telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \" Tidak halal darah seorang muslim kecuali dengan tiga perkara; yaitu: seseorang yang kafir setelah masuk Islam, atau berzina setelah menikah, atau membunuh jiwa.\"Demi Allah, saya tidak pernah bezina pada masa jahiliyah dan Islam, dan saya tidak berharap memiliki ganti bagi agamaku setelah Allah memberiku hidayah, dan tidak pernah membunuh jiwa. Maka kenapa mereka akan membunuhku?\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "54",
    "matchingArabicURN": "1140340",
    "last_updated": null
  },
  {
    "indonesianURN": "3239540",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1749",
    "babName": "Membunuh yang memisahkan diri dari jamaah dan perbedaan pada Ziyad bin Alaqah",
    "hadithNumber": "3954",
    "hadithText": "Telah mengabarkan kepadaku Ahmad bin Yahya Ash Shufi, ia berkata; telah menceritakan kepada kami Abu Nu'aim, ia berkata; telah menceritakan kepada kami Yazid bin Mardaniyah dari Ziyad bin 'Ilaqah dari 'Arfajah bin Syuraih Al Asyja'i, ia berkata; saya melihat Nabi shallallahu 'alaihi wasallam berada di atas mimbar sedang berkhutbah kepada manusia, beliau bersabda: \"Sesungguhnya akan terjadi setelahku fitnah dan fitnah, maka siapa yang kalian lihat telah memisahkan diri dari jama'ah atau hendak memecah belah kesatuan umat Muhammad shallallahu 'alaihi wasallam siapapun dia maka bunuhlah dia. Sesungguhnya tangan Allah bersama jama'ah dan syetan bergerak bersama orang yang misahkan diri dari jama'ah.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "55",
    "matchingArabicURN": "1140350",
    "last_updated": null
  },
  {
    "indonesianURN": "3239550",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1749",
    "babName": "Membunuh yang memisahkan diri dari jamaah dan perbedaan pada Ziyad bin Alaqah",
    "hadithNumber": "3955",
    "hadithText": "Telah mengabarkan kepada kami Abu Ali Muhammad bin Yahya Al Marwazi, Ia berkata; telah menceritakan kepada kami Abdullah bin Utsman dari Abu Hamzah dari Ziyad bin 'Ilaqah dari 'Arfajah bin Syuraih, ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya akan terjadi setelahku fitnah dan fitnah -dan beliau mengangkat kedua tangannya- maka siapa yang kalian lihat telah ingin memecah belah keadaan umat sedang mereka telah bersatu maka bunuhlah dia siapapun dia.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "56",
    "matchingArabicURN": "1140360",
    "last_updated": null
  },
  {
    "indonesianURN": "3239560",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1749",
    "babName": "Membunuh yang memisahkan diri dari jamaah dan perbedaan pada Ziyad bin Alaqah",
    "hadithNumber": "3956",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Yahya, ia berkata; telah menceritakan kepada kami Syu'bah telah menceritakan kepada kami Ziyad bin 'Ilaqah dari 'Arfajah, ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan terjadi setelahku fitnah, dan fitnah, maka barang siapa yang ingin memecah belah keadaan Umat Muhammad dan mereka telah bersatu maka penggallah lehernya dengan pedang.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "57",
    "matchingArabicURN": "1140370",
    "last_updated": null
  },
  {
    "indonesianURN": "3239570",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1749",
    "babName": "Membunuh yang memisahkan diri dari jamaah dan perbedaan pada Ziyad bin Alaqah",
    "hadithNumber": "3957",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Qudamah, ia berkata; telah menceritakan kepada kami Jarir dari Zaid bin 'Atho` bin As Saib dari Ziyad bin 'Ilaqah dari Usamah bin Syarik, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Siapapun laki-laki yang keluar lalu ia memecah belah umatku maka penggallah lehernya.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "58",
    "matchingArabicURN": "1140380",
    "last_updated": null
  },
  {
    "indonesianURN": "3239580",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1750",
    "babName": "Tafsiran ayat \"Sesungguhnya orang-orang yang memerangi Allah dan rasul-Nya\"",
    "hadithNumber": "3958",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud, ia berkata; telah menceritakan kepada kami Yazid bin Zurai' dari Hajjaj Ash Shawwaf, ia berkata; telah menceritakan kepada kami Abu Raja` maula Abu Qilabah, ia berkata; telah menceritakan kepadaku Abu Qilabah, ia berkata; telah menceritakan kepadaku Anas bin Malik bahwa beberapa orang dari 'ukl yang berjumlah delapan orang datang kepada Nabi shallallahu 'alaihi wasallam kemudian mereka memandang udaranya tidak cocok dan tubuh mereka menjadi sakit, lalu mereka mengadukan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam. Maka beliau bersabda: \"Tidakkah kalian keluar bersama penggembala kita dalam untanya? Kemudian kalian meminum susunya, dan air kencingnya? Mereka berkata; ya. Kemudian mereka keluar dan meminum sebagian susunya dan kencingnya sehingga mereka menjadi sembuh. Lalu mereka membunuh penggembala Rasulullah shallallahu 'alaihi wasallam. Lalu beliau mengirim utusan kemudian mereka menangkap orang-orang tersebut dan mereka didatangkan kepada beliau. Kemudian beliau memotong tangan dan kaki mereka serta mencungkil mata mreka, serta mencampakkan mereka dalam terik matahari hingga mati.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "59",
    "matchingArabicURN": "1140390",
    "last_updated": null
  },
  {
    "indonesianURN": "3239600",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1750",
    "babName": "Tafsiran ayat \"Sesungguhnya orang-orang yang memerangi Allah dan rasul-Nya\"",
    "hadithNumber": "3960",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman, ia berkata; telah menceritakan kepada kami Muhammad bin Bisyr, ia berkata; telah menceritakan kepada kami Sufyan dari Ayyub dari Abu Qilabah dari Anas bin Malik, ia berkata; telah datang kepada Nabi shallallahu 'alaihi wasallam beberapa orang dari 'Ukl atau 'Urainah. Mereka terkena penyakit paru-paru di Madinah, kemudian beliau memerintahkan agar didatangkan bagi mereka unta sehingga mereka dapat minum susunya dan air kencingnya. Kemudian mereka membunuh penggembala dan menggiring unta tersebut. Maka beliau mengirim utusan untuk mencari mereka, kemudian memotong tangan dan kaki mereka serta mencungkil mata mereka.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "62",
    "matchingArabicURN": "1140420",
    "last_updated": null
  },
  {
    "indonesianURN": "3239610",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1751",
    "babName": "Perbedaan pengutip berita Humaid dari Anas bin Malik",
    "hadithNumber": "3961",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin 'Amr bin As Sarh, ia berkata; telah mengabarkan kepadaku Ibnu Wahb, ia berkata; telah mengabarkan kepadaku Abdullah bin Umar dan yang lainnya dari Humaid Ath Thawil dari Anas bin Malik bahwa beberapa orang dari 'Urainah datang kepada Rasulullah shallallahu 'alaihi wasallam kemudian mereka terkena penyakit paru-paru di Madinah. Kemudian Nabi shallallahu 'alaihi wasallam mengirim mereka untuk mendatangi unta beliau dan minum sebagian susunya serta air kencingnya. Kemudian setelah sembuh mereka keluar dari Islam dan membunuh penggembala Rasulullah shallallahu 'alaihi wasallam yang beriman, dan menggiring unta tersebut. Maka Rasulullah shallallahu 'alaihi wasallam mengirim utusan untuk mengejar mereka, hingga mereka tertangkap kemudian beliau memotong tangan dan kaki mereka serta mencongkel mata mereka dan menyelip mereka.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "63",
    "matchingArabicURN": "1140430",
    "last_updated": null
  },
  {
    "indonesianURN": "3239620",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1751",
    "babName": "Perbedaan pengutip berita Humaid dari Anas bin Malik",
    "hadithNumber": "3962",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr, ia berkata; telah memberitakan kepada kami Isma'il dari Humaid dari Anas, ia berkata; telah datang kepada Rasulullah shallallahu 'alaihi wasallam beberapa orang dari 'Urainah. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepada mereka: \"Seandainya kalian keluar menuju unta kami dan kalian berada padanya serta minum sebagian susunya dan air kencingnya.\" Maka mereka melakukannya. Kemudian setelah sehat, mereka bangkit menuju penggembala Rasulullah shallallahu 'alaihi wasallam dan membubuhnya serta menggiring unta Nabi shallallahu 'alaihi wasallam. Maka beliau mengirim utusan untuk mencari mereka hingga mereka didatangkan, kemudian beliau memotong tangan dan kaki mereka serta mencongkel mata mereka.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "64",
    "matchingArabicURN": "1140440",
    "last_updated": null
  },
  {
    "indonesianURN": "3239630",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1751",
    "babName": "Perbedaan pengutip berita Humaid dari Anas bin Malik",
    "hadithNumber": "3963",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna, ia berkata; telah menceritakan kepada kami Khalid, ia berkata; telah menceritakan kepada kami Humaid dari Anas, ia berkata; telah datang beberapa orang dari 'Urainah kepada Rasulullah shallallahu 'alaihi wasallam, kemudian mereka terkena penyakit paru-paru di Madinah. Lalu Nabi shallallahu 'alaihi wasallam bersabda kepada mereka: \"Seandainya kalian keluar menuju unta kami dan meminum sebagian susunya dan kencingnya.\" Qatadah berkata; dan air kencingnya. Kemudian mereka keluar menuju unta Rasulullah shallallahu 'alaihi wasallam. Kemudian setelah mereka sehat maka mereka kafir setelah masuk Islam dan membunuh penggembala Rasulullah shallallahu 'alaihi wasallam yang mukmin dan menggiring unta Rasulullah shallallahu 'alaihi wasallam serta pergi memerangi beliau. Maka beliau mengirim utusan untuk mencari mereka hingga mereka tertangkap kemudian beliau memotong tangan dan kaki mereka serta mencongkel mata mereka.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "65",
    "matchingArabicURN": "1140450",
    "last_updated": null
  },
  {
    "indonesianURN": "3239640",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1751",
    "babName": "Perbedaan pengutip berita Humaid dari Anas bin Malik",
    "hadithNumber": "3964",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna, ia berkata; telah menceritakan kepada kami Muhammad bin Abu 'Adi, ia berkata; telah menceritakan kepada kami Humaid dari Anas, ia berkata; beberapa orang dari 'Urainah telah masuk Islam kemudian mereka terkena penyakit paru-paru di Madinah. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepada mereka: \"Seandainya kalian keluar menunu unta kami dan meminum sebagian susunya.\" Humaid berkata; Qatadan berkata; dari Anas; dan kencingnya... lalu mereka melakukannya. Kemudian setelah sembuh maka mereka kafir setelah masuk Islam, dan membunuh penggembala Rasulullah shallallahu 'alaihi wasallam dan melarikan diri sebagai orang yang memerangi. Maka Rasulullah shallallahu 'alaihi wasallam mengutus orang yang dapat membawa mereka, hingga mereka tertangkap. Kemudian beliau memotong tangan dan kaki mereka serta mencongkel mata mereka dan meninggalkan mereka di daerah Al Harrah hingga mati.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "66",
    "matchingArabicURN": "1140460",
    "last_updated": null
  },
  {
    "indonesianURN": "3239660",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1751",
    "babName": "Perbedaan pengutip berita Humaid dari Anas bin Malik",
    "hadithNumber": "3966",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Nafi' Abu Bakar, ia berkata; telah menceritakan kepada kami Bahz, ia berkata; telah menceritakan kepada kami Hammad, ia berkata; telah menceritakan kepada kami Qatadah dan Tsabit dari Anas bahwa beberapa orang dari 'Urainah singgah di Al Harrah kemudian datang kepada Nabi shallallahu 'alaihi wasallam. Lalu mereka terkena penyakit paru-paru di Madinah. Kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan mereka agar mendatangi unta shadaqah dan meminum sebagian susunya serta kencingnya. Kemudian mereka membunuh penggembala unta tersebut dan keluar dari Islam serta menggiring unta. Maka Rasulullah shallallahu 'alaihi wasallam mengirim utusan untuk mengejar mereka hingga mereka dapat didatangkan. Kemudian beliau memotong tangan dan kaki mereka serta mencongkel mata mereka dan membuang mereka di daerah Al Harrah. Anas berkata; sungguh saya melihat salah seorang dari mereka menggigit tanah dengan mulutnya karena haus hingga mati.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "69",
    "matchingArabicURN": "1140490",
    "last_updated": null
  },
  {
    "indonesianURN": "3239670",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1752",
    "babName": "Perbedaan Tolhah bin Mushrif dan Mu'awiyah bin Shalih atas Yahya",
    "hadithNumber": "3967",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Wahb, ia berkata; telah menceritakan kepada kami Muhammad bin Salamah, ia berkata; telah menceritakan kepadaku Abu Abdur Rahim, ia berkata; telah menceritakan kepadaku Zaid bin Abi Unaisah dari Thalhah bin Musharrif dari Yahya bin Sa'id dari Anas bin Malik, ia berkata; telah datang orang-orang badui dari 'Urainah kepada Nabi shallallahu 'alaihi wasallam kemudian masuk Islam, lalu mereka terkena penyakit paru-paru di Madinah hingga warna kulit mereka menguning, dan perut mereka membesar. Kemudian Nabi shallallahu 'alaihi wasallam mengirim mereka menuju unta beliau dan memerintahkan mereka agar minum sebagian susu dan kencingnya hingga mereka sehat. Lalu mereka membunuh penggembala unta tersebut dan menggiringnya. Lalu Nabi shallallahu 'alaihi wasallam mengirim utusan untuk mencari mereka hingga mereka dapat didatangkan. Kemudian beliau memotong tangan dan kaki mereka serta mencongkel mata mereka. Berkata Amirul mukminin Abdul Malik kepada Anas yang menceritakan hadits ini; karena kekafiran atau dosa? Anas berkata; karena kekafiran.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "70",
    "matchingArabicURN": "1140500",
    "last_updated": null
  },
  {
    "indonesianURN": "3239680",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1752",
    "babName": "Perbedaan Tolhah bin Mushrif dan Mu'awiyah bin Shalih atas Yahya",
    "hadithNumber": "3968",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin 'Amr bin As Sarh, ia berkata; telah memberitakan kepada kami Ibnu Wahb, ia berkata; telah mengabarkan kepadaku Yahya bin Ayyub dan Mu'awiyah bin Shalih dari Yahya bin Sa'id dari Sa'id bin Al Musayyab, ia berkata; telah datang beberapa orang Arab kepada Rasulullah shallallahu 'alaihi wasallam lalu mereka masuk Islam, kemudian sakit. Lalu Rasulullah shallallahu 'alaihi wasallam mengutus mereka untuk mendatangi unta agar meminum susunya, dan mereka berada padanya kemudian mereka mendatangi penggembalanya, ia adalah pembantu Rasulullah shallallahu 'alaihi wasallam, mereka membunuhnya dan menggiring unta. Mereka mengaku bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \" Ya Allah hauskanlah orang yang menghauskan keluarga Muhammad pada malam ini, \" Lalu Rasulullah shallallahu 'alaihi wasallam mengirimkan orang untuk mencari mereka, lalu mereka ditangkap dan beliau memotong tangan dan kaki mereka, beliau mencukil mata mereka, sebagian mereka menambah atas sebagian yang lain. Hanya saja Mua'awiyah berkata dalam hadits ini mereka menggiring menuju negeri syirik.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "71",
    "matchingArabicURN": "1140510",
    "last_updated": null
  },
  {
    "indonesianURN": "3239690",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1752",
    "babName": "Perbedaan Tolhah bin Mushrif dan Mu'awiyah bin Shalih atas Yahya",
    "hadithNumber": "3969",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdullah Al Khalanji, ia berkata; telah menceritakan kepada kami Malik bin Su'air dari Hisyam bin 'Urwah dari ayahnya dari Aisyah radliallahu 'anha, ia berkata; beberapa orang menyerang unta Rasulullah shallallahu 'alaihi wasallam, kemudian menangkap mereka, dan memotong tangan serta kaki mereka dan mencongkel mata mereka.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "72",
    "matchingArabicURN": "1140520",
    "last_updated": null
  },
  {
    "indonesianURN": "3239700",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1752",
    "babName": "Perbedaan Tolhah bin Mushrif dan Mu'awiyah bin Shalih atas Yahya",
    "hadithNumber": "3970",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dari Ibrahim bin Abu Al Wazir, ia berkata; telah menceritakan kepada kami Abdul Aziz. Telah menceritakan dan memberitahukan kepada kami Muhammad bin Basysyar, ia berkata; telah menceritakan kepada kami Ibrahim bin Abu Al Wazir, ia berkata; telah menceritakan kepada kami Ad Darawardi dari Hisyam bin 'Urwah dari ayahnya dari Aisyah bahwa beberapa orang telah menyerang unta Rasulullah shallallahu 'alaihi wasallam lalu mereka didatangkan kepada Nabi shallallahu 'alaihi wasallam kemudian beliau memotong tangan dan kaki mereka serta mencongkel mata mereka. Lafazh hadits tersebut adalah lafazh Ibnu Al Mutsanna.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "73",
    "matchingArabicURN": "1140530",
    "last_updated": null
  },
  {
    "indonesianURN": "3239710",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1752",
    "babName": "Perbedaan Tolhah bin Mushrif dan Mu'awiyah bin Shalih atas Yahya",
    "hadithNumber": "3971",
    "hadithText": "Telah mengabarkan kepada kami Isa bin Hammad, ia berkata; telah memberitakan kepada kami Al Laits dari Hisyam dari ayahnya bahwa beberapa orang telah menyerang unta Rasulullah shallallahu 'alaihi wasallam, kemudian beliau memotong tangan dan kaki mereka serta mencongkel mata mereka.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "74",
    "matchingArabicURN": "1140540",
    "last_updated": null
  },
  {
    "indonesianURN": "3239720",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1752",
    "babName": "Perbedaan Tolhah bin Mushrif dan Mu'awiyah bin Shalih atas Yahya",
    "hadithNumber": "3972",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin 'Amr bin As Sarh, ia berkata; telah memberitakan kepada kami Ibnu Wahb, ia berkata; dan telah memberitakan kepadaku Yahya bin Abdullah bin Salim serta Sa'id bin Abdurrahman. Dan ia menyebutkan yang lainnya dari Hisyam bin 'Urwah dari 'Urwah bin Az Zubair bahwa ia berkata; beberapa orang dari 'Urainah telah menyerang unta Rasulullah shallallahu 'alaihi wasallam dan menggiringnya serta membunuh pembantu beliau. Kemudian beliau mengirim orang untuk mengejar mereka hingga tertangkap, kemudian beliau memotong tangan dan kaki mereka serta mencongkel mata mereka.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "75",
    "matchingArabicURN": "1140550",
    "last_updated": null
  },
  {
    "indonesianURN": "3239730",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1752",
    "babName": "Perbedaan Tolhah bin Mushrif dan Mu'awiyah bin Shalih atas Yahya",
    "hadithNumber": "3973",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin 'Amr bin As Sarh, ia berkata; telah mengabarkan kepadaku Ibnu Wahb, ia berkata; telah mengabarkan kepadaku 'Amr bin Al Harits dari Sa'id bin Abi Hilal dari Abu Az Zinad dari Abdullah bin 'Ubaidullah dari Abdullah bin Umar dari Rasulullah shallallahu 'alaihi wasallam dan kepada mereka turun ayat perang.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "76",
    "matchingArabicURN": "1140560",
    "last_updated": null
  },
  {
    "indonesianURN": "3239740",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1752",
    "babName": "Perbedaan Tolhah bin Mushrif dan Mu'awiyah bin Shalih atas Yahya",
    "hadithNumber": "3974",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin 'Amr bin As Sarh, ia berkata; telah memberitakan kepada kami Ibnu Wahb, ia berkata; telah memberitakan kepadaku Al Laits dari Ibnu 'Ajlan dari Abu Az Zinad bahwa Rasulullah shallallahu 'alaihi wasallam ketika memotong tangan orang yang mencuri unta beliau dan mencongkel mata mereka dengan api, Allah mencela hal tersebut dan menurunkan ayat Sesungguhnya pembalasan terhadap orang-orang yang memerangi Allah dan Rasul-Nya dan membuat kerusakan di muka bumi, hanyalah mereka dibunuh atau disalib, atau dipotong tangan dan kaki mereka dengan bertimbal balik, atau dibuang dari negeri (tempat kediamannya). Yang demikian itu (sebagai) suatu penghinaan untuk mereka didunia, dan di akhirat mereka beroleh siksaan yang besar.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "77",
    "matchingArabicURN": "1140570",
    "last_updated": null
  },
  {
    "indonesianURN": "3239750",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1752",
    "babName": "Perbedaan Tolhah bin Mushrif dan Mu'awiyah bin Shalih atas Yahya",
    "hadithNumber": "3975",
    "hadithText": "Telah mengabarkan kepada kami Al Fadhl bin Sahl Al A'raj, ia berkata; telah menceritakan kepada kami Yahya bin Ghailan orang yang tsiqah dan dapat dipercaya, ia berkata; telah menceritakan kepada kami Yazid bin Zurai' dari Sulaiman At Taimi dari Anas, ia berkata; sesungguhnya Nabi shallallahu 'alaihi wasallam mencongkel mata mereka karena mereka mencongkel mata penggembala tersebut.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "78",
    "matchingArabicURN": "1140580",
    "last_updated": null
  },
  {
    "indonesianURN": "3239760",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1752",
    "babName": "Perbedaan Tolhah bin Mushrif dan Mu'awiyah bin Shalih atas Yahya",
    "hadithNumber": "3976",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin 'Amr bin As Sarh dan Al Harits bin Miskin dengan membacakan riwayat dan saya mendengar, ia berkata; telah menceritakan kepada kami Ibnu Wahb, ia berkata; telah mengabarkan kepadaku Muhammad bin 'Amr dari Ibnu Juraij dari Ayyub dari Abu Qilabah dari Anas bin Malik bahwa seorang laki-laki Yahudi membunuh seorang wanita Anshar untuk mengambil perhiasannya dan melemparkannya di sumur serta melempari kepalanya dengan batu, kemudian ia ditangkap dan beliau memerintahkan agar dirajam hingga mati.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "79",
    "matchingArabicURN": "1140590",
    "last_updated": null
  },
  {
    "indonesianURN": "3239770",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1752",
    "babName": "Perbedaan Tolhah bin Mushrif dan Mu'awiyah bin Shalih atas Yahya",
    "hadithNumber": "3977",
    "hadithText": "Telah mengabarkan kepada kami Yusuf bin Sa'id, ia berkata; telah menceritakan kepada kami Hajjaj dari Ibnu Juraij, ia berkata; telah mengabarkan kepadaku Ma'mar dari Ayyub dari Abu Qilabah dari Anas bahwa seorang laki-laki Yahudi membunuh seorang wanita Anshar untuk mengambil perhiasannya dan melemparkannya di sumur serta melempari kepalanya dengan batu, kemudian ia ditangkap dan beliau memerintahkan agar dirajam hingga mati.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "80",
    "matchingArabicURN": "1140600",
    "last_updated": null
  },
  {
    "indonesianURN": "3239780",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1752",
    "babName": "Perbedaan Tolhah bin Mushrif dan Mu'awiyah bin Shalih atas Yahya",
    "hadithNumber": "3978",
    "hadithText": "Telah mengabarkan kepada kami Zakariya bin Yahya, ia berkata; telah menceritakan kepada kami Ishaq bin Ibrahim, ia berkata; telah memberitakan kepada kami Ali bin Al Husain bin Waqid, ia berkata; telah menceritakan kepadaku ayahku, ia berkata; telah menceritakan kepada kami Yazid An Nahwi dari Ikrimah dari Ibnu Abbas mengenai firman Allah Ta'ala: Sesungguhnya pembalasan terhadap orang-orang yang memerangi Allah dan Rasul-Nya ia berkata; ayat ini mengenai orang-orang musyrik, dan barangsiapa diantara mereka yang bertaubat sebelum mereka ditangkap maka tidak ada jalan untuk membunuhnya, dan tidaklah ayat ini untuk seorang muslim, maka barangsiapa yang membunuh dan merusak didunia, memerangi Allah dan rasulNya lalu ia bertemu dengan orang kafir sebelum ditangkap maka hal itu tidak menghalanginya untuk ditegakkan hukuman pada apa yang ia lakukan.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "81",
    "matchingArabicURN": "1140610",
    "last_updated": null
  },
  {
    "indonesianURN": "3239790",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1753",
    "babName": "Larangan mencincang (mutilasi, merusak mayyit)",
    "hadithNumber": "3979",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna, ia berkata; telah menceritakan kepada kami Abdushshamad, ia berkata; telah menceritakan kepada kami Hisyam dari Qatadah dari Anas ia berkata adalah Rasulullah shallallahu 'alaihi wasallam menganjurkan di khutbahnya untuk melakukan sedekah dan melarang dari mencincang mayat.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "82",
    "matchingArabicURN": "1140620",
    "last_updated": null
  },
  {
    "indonesianURN": "3239800",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1754",
    "babName": "Penyaliban",
    "hadithNumber": "3980",
    "hadithText": "Telah mengabarkan kepada kami Al Abbas bin Muhammad Ad Duri, ia berkata; telah menceritakan kepada kami Abu 'Amir Al 'Aqadi dari Ibrahim bin Thahman dari Abdul Aziz bin Rafi' dari 'Ubaid bin 'Umair dari Aisyah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal darah seorang muslim kecuali dengan salah satu dari tiga sifat, yaitu; pezina yang telah menikah, maka ia dirajam, atau seseorang yang membunuh orang lain dengan sengaja, maka ia dibunuh, atau seseorang yang keluar dari Islam, memerangi Allah 'azza wajalla dan RasulullahNya, maka ia dibunuh atau disalib atau disingkirkan dari negeri.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "83",
    "matchingArabicURN": "1140630",
    "last_updated": null
  },
  {
    "indonesianURN": "3239810",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1755",
    "babName": "Budak melarikan diri ke negara syirik dan perbedaan lafadz pengutip",
    "hadithNumber": "3981",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan, ia berkata; telah menceritakan kepada kami Abu Daud, ia berkata; telah memberitakan kepada kami Syu'bah dari Manshur dari Asy Sya'bi dari Jarir, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Jika seorang budak kabur maka tidak akan diterima sholatnya hingga ia kembali kepada majikannya.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "84",
    "matchingArabicURN": "1140640",
    "last_updated": null
  },
  {
    "indonesianURN": "3239820",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1755",
    "babName": "Budak melarikan diri ke negara syirik dan perbedaan lafadz pengutip",
    "hadithNumber": "3982",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Qudamah dari Jarir dari Mughirah dari Asy Sya'bi, ia berkata; Jarir pernah menceritakan dari Nabi shallallahu 'alaihi wasallam: \" Jika seorang budak kabur maka tidak akan diterima sholatnya, apabila ia mati maka ia mati dalam keadaan kafir.\" Budak kecil Jarir kabur kemudian ia menangkapnya kemudian memenggal lehernya.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "85",
    "matchingArabicURN": "1140650",
    "last_updated": null
  },
  {
    "indonesianURN": "3239830",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1755",
    "babName": "Budak melarikan diri ke negara syirik dan perbedaan lafadz pengutip",
    "hadithNumber": "3983",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman, ia berkata; telah menceritakan kepada kami Ubaidullah bin Musa, ia berkata; telah memberitakan kepada kami Israil dari Mughirah dari Asy Sya'bi dari Jarir bin Abdullah, ia berkata; apabila seorang budak kabur menuju negeri syirik maka ia tidak memiliki perlindungan.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "86",
    "matchingArabicURN": "1140660",
    "last_updated": null
  },
  {
    "indonesianURN": "3239840",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1756",
    "babName": "Perbedaan pada Abu ishaq",
    "hadithNumber": "3984",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Humaid bin Abdurrahman dari ayahnya dari Abu Ishaq dari Asy Sya'bi dari Jarir, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila seorang budak kabur menuju negeri syirik maka telah halal darahnya.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "87",
    "matchingArabicURN": "1140670",
    "last_updated": null
  },
  {
    "indonesianURN": "3239850",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1756",
    "babName": "Perbedaan pada Abu ishaq",
    "hadithNumber": "3985",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Harb, ia berkata; telah memberitakan kepada kami Qasim, ia berkata; telah menceritakan kepada kami Israil dari Abu Ishaq dari Jarir dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila seorang budak kabur menuju negeri syirik maka telah halal darahnya.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "88",
    "matchingArabicURN": "1140680",
    "last_updated": null
  },
  {
    "indonesianURN": "3239860",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1756",
    "babName": "Perbedaan pada Abu ishaq",
    "hadithNumber": "3986",
    "hadithText": "Telah mengabarkan kepada kami Ar Rabi' bin Sulaiman, ia berkata; telah menceritakan kepada kami Khalid bin Abdurrahman dari Israil dari Abu Ishaq dari Asy Sya'bi dari Jarir, ia berkata; siapapun budak yang kabur menuju negeri syirik maka telah halal darahnya.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "89",
    "matchingArabicURN": "1140690",
    "last_updated": null
  },
  {
    "indonesianURN": "3239870",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1756",
    "babName": "Perbedaan pada Abu ishaq",
    "hadithNumber": "3987",
    "hadithText": "Telah mengabarkan kepada kami Shafwan bin 'Amr, ia berkata; telah menceritakan kepada kami Ahmad bin Khalid, ia berkata; telah menceritakan kepada kami Israil dari Abu Ishaq dari Asy Sya'bi dari Jarir, ia berkata; siapapun budak yang kabur menuju negeri syirik maka telah halal darahnya.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "90",
    "matchingArabicURN": "1140700",
    "last_updated": null
  },
  {
    "indonesianURN": "3239880",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1756",
    "babName": "Perbedaan pada Abu ishaq",
    "hadithNumber": "3988",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr, ia berkata; telah menceritakan kepada kami Syarik dari Abu Ishaq dari 'Amir dari Jarir, ia berkata; siapapun budak yang kabur dari tuannya dan bertemu dengan musuh maka sungguh ia telah menghalalkan dengan sendirinya.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "91",
    "matchingArabicURN": "1140710",
    "last_updated": null
  },
  {
    "indonesianURN": "3239890",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1757",
    "babName": "Hukum murtadd",
    "hadithNumber": "3989",
    "hadithText": "Telah mengabarkan kepada kami Abu Al Azhar Ahmad bin Al Azhar An Naisaburi, ia berkata; telah menceritakan kepada kami Ishaq bin Sulaiman Ar Razi, ia berkata; telah memberitakan kepada kami Al Mughirah bin Muslim dari Mathar Al Warraq dari Nafi' dari Ibnu Umar bahwa Utsman berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal darah seorang muslim kecuali dengan salah satu dari tiga perkara, yaitu; seseorang yang berzina setelah menikah, maka ia dirajam, atau membunuh dengan sengaja maka ia akan dibalas, atau murtad setelah masuk Islam maka ia dibunuh.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "92",
    "matchingArabicURN": "1140720",
    "last_updated": null
  },
  {
    "indonesianURN": "3239900",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1757",
    "babName": "Hukum murtadd",
    "hadithNumber": "3990",
    "hadithText": "Telah mengabarkan kepada kami Muammal bin Ihab, ia berkata; telah menceritakan kepada kami Abdur Razzaq, ia berkata; telah mengabarkan kepadaku Ibnu Juraij dari Abu An Nadhr dari Busr bin Sa'id dari Utsman bin 'Affan, ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal darah seorang muslim kecuali dengan tiga perkara, yaitu; berzina setelah menikah, atau membunuh orang maka ia dibunuh atau kafir setelah masuk Islam maka ia dibunuh.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "93",
    "matchingArabicURN": "1140730",
    "last_updated": null
  },
  {
    "indonesianURN": "3239910",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1757",
    "babName": "Hukum murtadd",
    "hadithNumber": "3991",
    "hadithText": "Telah mengabarkan kepada kami Imran bin Musa, ia berkata; telah menceritakan kepada kami Abdul Warits, ia berkata; telah menceritakan kepada kami Ayyub dari Ikrimah, ia berkata; Ibnu Abbas berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang mengganti agamanya maka bunuhlah.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "94",
    "matchingArabicURN": "1140740",
    "last_updated": null
  },
  {
    "indonesianURN": "3239920",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1757",
    "babName": "Hukum murtadd",
    "hadithNumber": "3992",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Al Mubarak, ia berkata; telah menceritakan kepada kami Abu Hisyam, ia berkata; telah menceritakan kepada kami Wuhaib, ia berkata; telah menceritakan kepada kami Ayyub dari 'Ikrimah bahwa beberapa orang keluar dari Islam kemudian Ali membakar mereka dengan api. Ibnu Abbas berkata; seandainya saya maka saya tidak akan membakar mereka, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menyiksa seseorang dengan siksaan Allah.\" Seandainya saya maka akan membunuh mereka, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang mengganti agamanya maka bunuhlah.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "95",
    "matchingArabicURN": "1140750",
    "last_updated": null
  },
  {
    "indonesianURN": "3239930",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1757",
    "babName": "Hukum murtadd",
    "hadithNumber": "3993",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan, ia berkata; telah menceritakan kepada kami Muhammad bin Bakr, ia berkata; telah memberitakan kepada kami Ibnu Juraij, ia berkata; telah memberitakan kepada kami Isma'il dari Ma'mar dari Ayyub dari Ikrimah dari Ibnu Abbas, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang mengganti agamanya maka bunuhlah.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "96",
    "matchingArabicURN": "1140760",
    "last_updated": null
  },
  {
    "indonesianURN": "3239940",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1757",
    "babName": "Hukum murtadd",
    "hadithNumber": "3994",
    "hadithText": "Telah mengabarkan kepada kami Hilal bin Al 'Ala`, ia berkata; telah menceritakan kepada kami Isma'il bin Abdullah bin Zurarah, ia berkata; telah menceritakan kepada kami 'Abbad bin Al 'Awwam, ia berkata; telah menceritakan kepada kami Sa'id dari Qatadah dari Ikrimah dari Ibnu Abbas, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang mengganti agamanya maka bunuhlah.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "97",
    "matchingArabicURN": "1140770",
    "last_updated": null
  },
  {
    "indonesianURN": "3239950",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1757",
    "babName": "Hukum murtadd",
    "hadithNumber": "3995",
    "hadithText": "Telah mengabarkan kepada kami Musa bin Abdurrahman, ia berkata; telah menceritakan kepada kami Muhammad bin Bisy, ia berkata; telah menceritakan kepada kami Sa'id dari Qatadah dari Al Hasan, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"\"Siapa yang mengganti agamanya maka bunuhlah.\" Abu Abdurrahman berkata; ini lebih benar daripada hadits 'Abbad.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "98",
    "matchingArabicURN": "1140780",
    "last_updated": null
  },
  {
    "indonesianURN": "3239960",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1757",
    "babName": "Hukum murtadd",
    "hadithNumber": "3996",
    "hadithText": "Telah mengabarkan kepada kami Al Husain bin Isa dari Abdush Shamad, ia berkata; telah menceritakan kepada kami Hisyam dari Qatadah dari Anas bahwa Ibnu Abbas berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang mengganti agamanya maka bunuhlah.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "99",
    "matchingArabicURN": "1140790",
    "last_updated": null
  },
  {
    "indonesianURN": "3239970",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1757",
    "babName": "Hukum murtadd",
    "hadithNumber": "3997",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna, ia berkata; telah menceritakan kepada kami Abdush Shamad, ia berkata; telah menceritakan kepada kami Hisyam dari Qatadah dari Anas bahwa Ali dihadapkan kepadanya beberapa orang dari Az Zuth, mereka menyembah berhala kemudian ia membakar mereka. Ibnu Abbas berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang mengganti agamanya maka bunuhlah.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "100",
    "matchingArabicURN": "1140800",
    "last_updated": null
  },
  {
    "indonesianURN": "3239980",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1757",
    "babName": "Hukum murtadd",
    "hadithNumber": "3998",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dan telah menceritakan kepada kami Hammad bin Mas'adah mereka berkata; telah menceritakan kepada kami Qurrah bin Khalid dari Humaid bin Hilal dari Abu Burdah bin Abu Musa Al Asy'ari dari ayahnya bahwa Nabi shallallahu 'alaihi wasallam mengutusnya ke Yaman kemudian mengirimkan Mu'adz bin Jabal setelah itu. Kemudian setelah sampai ia berkata; wahai manusia, sesungguhnya saya adalah utusan Rasulullah shallallahu 'alaihi wasallam kepada kalian. Kemudian Abu Musa melemparkan bantal untuknya agar ia duduk padanya. Kemudian didatangkan seorang laki-laki Yahudi yang masuk Islam kemudian kafir. Maka Mu'adz berkata; saya tidak akan duduk hingga ia dibunuh, inilah keputusan Allah dan RasulullahNya. Sebanyak tiga kali, kemudian setelah dibunuh iapun duduk.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "101",
    "matchingArabicURN": "1140810",
    "last_updated": null
  },
  {
    "indonesianURN": "3239990",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1757",
    "babName": "Hukum murtadd",
    "hadithNumber": "3999",
    "hadithText": "Telah mengabarkan kepada kami Al Qasim bin Zakariya bin Dinar, ia berkata; telah menceritakan kepada kami Ahmad bin Mufadhdhal, ia berkata; telah menceritakan kepada kami Asbath, ia berkata; As Suddi mengaku dari Mush'ab bin Sa'd dari ayahnya, ia berkata; pada saat hari penaklukan Mekkah Rasulullah shallallahu 'alaihi wasallam memberi keamanan kepada orang-orang kecuali empat orang dan dua wanita, beliau bersabda: \"Bunuh mereka walaupun engkau dapati mereka bergantungan dikain penutup Ka'bah yaitu Ikrimah bin Abi Jahl, Abdullah bin Khathal, Maqis bin Shubabah, dan abdullah bin Sa'd bin Abi Sarh. Adapun Abdullah bin Khathal ketahuilah bahwa ia didapati bergantungan dikain penutup Ka'bah, lalu Sa'id bin Huraits dan Ammar bin Yasir bersaing untuk mendapatkannya, dan Sa'id bin Huraits mendahului Ammar karena ia lebih muda lalu ia membunuhnya, adapun Maqis bin Shubabah diketemukan orang-orang dipasar lalu mereka membunuhnya, adapun ikrimah ia berlayar lalu datanglah angin kencang, para awak kapal berkata ikhlaskan niat kalian karena tuhan-tuhan kalian tidak akan mampu menolong kalian disini, lalu Ikrimah berkata demi Allah jika tidak ada yang bisa menyelamatkanku dilaut kecuali ikhlas maka tidak ada yang bisa menyelamatkanku didaratan kecuali ikhlas, ya Allah sesungguhnya engkau memiliki janji atasku, jika engkau memaafkanku dari apa yang aku lakukan didalamnya maka aku akan mendatangi Muhammad shallallahu 'alaihi wasallam dan meletakkan tanganku ditangannya dan aku akan mendapatinya sebagai orang yang pemaaf dan bermurah hati, lalu ia datang dan masuk Islam, sedangkan Abdullah bin Sa'd bin Abi Sarh sesungguhnya ia sembunyi dirumah Utsman bin Affan, ketika Rasulullah shallallahu 'alaihi wasallam menyeru orang-orang untuk berbaiat, ia datang bersamanya, hingga ia dibawa kesisi Nabi shallallahu 'alaihi wasallam ia berkata; wahai Rasulullah, baiatlah Abdullah, lalu beliau mengangkat kepala beliau dan melihatnya tiga kali setiap kali melihat beliau enggan lalu beliau membaiatnya setelah ketiga kalinya, lalu beliau bertemu dengan sahabatnya dan bersabda: \"Adakah diantara kalian orang yang berakal, berdiri di sisi orang ini di tempat ia melihatku menahan tanganku untuk berbaiat kepadanya, lalu ia membunuhnya?\" para sahabat berkata; bagaimana kami tahu apa yang ada didalam hatimu wahai Rasulullah, tidakkah anda memberikan isyarat kepada kami? Beliau bersabda: \"Sesungguhnya tidak layak bagi seorang Nabi memiliki mata penipu.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "102",
    "matchingArabicURN": "1140820",
    "last_updated": null
  },
  {
    "indonesianURN": "3240000",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1758",
    "babName": "Taubat murtadd",
    "hadithNumber": "4000",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Bazi', ia berkata; telah menceritakan kepada kami Yazid yaitu Ibnu Zurai', ia berkata; telah memberitakan kepada kami Daud dari Ikrimah dari Ibnu Abbas, ia berkata; ada seorang Anshor yang masuk Islam lalu ia murtad dan kembali begabung dengan kesyirikan, kemudian ia menyesal dan pergi menemui kaumnya tanyakan kepada Rasulullah shallallahu 'alaihi wasallam apakah saya bisa bertaubat? Lalu kaumnya datang menemui Rasulullah shallallahu 'alaihi wasallam dan berkata sesungguhnya Fulan menyesal dan ia menyuruh kami untuk bertanya kepadamu apakah ia masih bisa bertaubat, lalu turunlah ayat Bagaimana Allah akan menunjuki suatu kaum yang kafir sesudah mereka beriman hingga firmanNya Maha pengampun lagi Penyayang lalu beliau mengutus seseorang kepadanya dan iapun masuk Islam.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "103",
    "matchingArabicURN": "1140830",
    "last_updated": null
  },
  {
    "indonesianURN": "3240010",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1758",
    "babName": "Taubat murtadd",
    "hadithNumber": "4001",
    "hadithText": "Telah mengabarkan kepada kami Zakariya bin Yahya, ia berkata; telah menceritakan kepada kami Ishaq bin Ibrahim, ia berkata; telah memberitakan kepada kami Ali bin Al Hasan bin Waqid, ia berkata; telah mengabarkan kepadaku ayahku dari Yazid An Nahwi dari Ikrimah dari Ibnu Abbas, ia berkata mengenai Surat Nahl: Barangsiapa yang kafir kepada Allah sesudah dia beriman (dia mendapat kemurkaan Allah), kecuali orang yang dipaksa kafir hingga firmanNya baginya azab yang besar kemudian dihapus dan Allah mengecualikan dari hal tersebut, Allah berfirman: Dan sesungguhnya Tuhanmu (pelindung) bagi orang-orang yang berhijrah sesudah menderita cobaan, kemudian mereka berjihad dan sabar; sesungguhnya Tuhanmu sesudah itu benar-benar Maha Pengampun lagi Maha Penyayang. Ia adalah abdullah bin Sa'd bin Abi Sarh yang dahulu berada di Mesir, ia menulis untuk Rasulullah shallallahu 'alaihi wasallam lalu syetan menghilangkannya dan ia kembali kepada kekafiran, maka beliau menyuruh untuk membunuhnya pada hari penaklukan Mekkah lalu Utsman bin Affan meminta untuk dilindungi dan Rasulullah shallallahu 'alaihi wasallam melindunginya.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "104",
    "matchingArabicURN": "1140840",
    "last_updated": null
  },
  {
    "indonesianURN": "3240020",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1759",
    "babName": "Hukum bagi yang mencela Nabi Shallallahu'alaihiwasallam",
    "hadithNumber": "4002",
    "hadithText": "Telah mengabarkan kepada kami Utsman bin Abdullah, ia berkata; telah menceritakan kepada kami 'Abbad bin Musa, ia berkata; telah menceritakan kepada kami Isma'il bin Ja'far, ia berkata; telah menceritakan kepadaku Israil dari Utsman Asy Syahham ia berkata; aku menuntun seorang yang buta dan sampai kepada Ikrimah, ia mulai mengajak kami bicara, ia berkata Ibnu Abbas menceritakan kepadaku bahwa dahulu ada orang buta dimasa Rasulullah shallallahu 'alaihi wasallam yang memiliki budak wanita, ia memiliki dua orang anak dari hubungan dengannya, budak tersebut banyak mencela Rasulullah shallallahu 'alaihi wasallam, ia selalu menghina beliau dan orang buta tersebut mencegahnya namun ia tetap tidak dapat dicegah dan ia melarangnya namun budak tersebut tidak berhenti, pada suatu malam aku menyebutkan Nabi Shallallahu Alaihi wa sallam lalu ia mencela beliau maka saya tidak sabar untuk mengambil sebuah cangkul dan aku letakkan di keperutnya dan menyandarinya hingga saya membunuhnya dan terbunuhlah ia, kemudian hal itu disampaikan kepada Nabi shallallahu 'alaihi wasallam lalu beliau mengumpulkan manusia dan bersabda: \" Aku bersumpah kepada Allah dan meminta seseorang yang aku memiliki hak atasnya, ia melakukan apa yang telah ia lakukan agar ia berdiri kemudian menghadaplah orang yang buta dan berjalan gontai dan berkata; wahai Rasulullah akulah pemiliknya, ia dulu adalah ibu dari anakku, ia adalah wanita yang lembut dan mesra terhadapku, aku memiliki dua anak seperti permata darinya, namun ia sering mencela dan menghinamu, aku melarangnya namun ia tidak berhenti dan aku mencegahnya tapi ia tetap dapat dicegah, tadi malam aku menyebut dirimu lalu ia mencelamu lalu aku bangkit untuk mengambil cangkul dan meletakkan diperutnya dan menyandarinya hingga aku membunuhnya, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \" Saksikanlah bahwa darah wanita itu adalah sia-sia.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "105",
    "matchingArabicURN": "1140850",
    "last_updated": null
  },
  {
    "indonesianURN": "3240030",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1759",
    "babName": "Hukum bagi yang mencela Nabi Shallallahu'alaihiwasallam",
    "hadithNumber": "4003",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Mu'adz bin Mu'adz, ia berkata; telah menceritakan kepada kami Syu'bah dari Taubah Al 'Anbari dari Abdullah bin Qudamah bin 'Anazah dari Abu Barzah Al Aslami, ia berkata; seseorang berbuat kasar kepada Abu Bakar Ash Shiddiq kemudian saya mengatakan kepadanya; apakah boleh saya membunuhnya? Lalu ia mencegahku dan berkata; hal ini bukan hak bagi seseorang setelah Nabi shallallahu 'alaihi wasallam.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "106",
    "matchingArabicURN": "1140860",
    "last_updated": null
  },
  {
    "indonesianURN": "3240040",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1760",
    "babName": "Perbedaan pada A'masy tentang hadis ini",
    "hadithNumber": "4004",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al 'Ala`, ia berkata; telah menceritakan kepada kami Abu Mu'awiyah dari Al A'masy dari 'Amr bin Murrah dari Salim bin Abu Al Ja'd dari Abu Barzah, ia berkata; Abu Bakar marah kepada seseorang, kemudian saya katakan; siapakah ia wahai khalifah Rasulullah? ia berkata; untuk apa? Saya katakan; Agar saya penggal lehernya apabila engkau memerintahkan hal tersebut. Ia berkata; apakah engkau akan melakukannya? Saya katakan; ya. Ia berkata; demi Allah sungguh sebagian besar perkataanku yang saya katakan telah menghilangkan kemarahannya. Kemudian ia berkata; hal itu tidak boleh bagi seorangpun setelah Muhammad shallallahu 'alaihi wasallam.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "107",
    "matchingArabicURN": "1140870",
    "last_updated": null
  },
  {
    "indonesianURN": "3240050",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1760",
    "babName": "Perbedaan pada A'masy tentang hadis ini",
    "hadithNumber": "4005",
    "hadithText": "Telah mengabarkan kepada kami Abu Daud, ia berkata; telah menceritakan kepada kami Ya'la, ia berkata; telah menceritakan kepada kami Al A'masy dari 'Amr bin Murrah dari Abu Al Bakhtari dari Abu Barzah, ia berkata; saya melewati Abu Bakar dan ia sedang marah kepada seseorang dari para sahabatnya. Kemudian saya katakan; wahai khalifah, siapakah orang yang engkau marah kepadanya? Ia berkata; kenapa engkau bertanya? Saya katakan; saya akan memenggal lehernya. Ia berkata; demi Allah sungguh sebagian besar perkataan yang saya katakan telah menghilangkan kemarahannya. Kemudian ia berkata; hal itu tidak boleh bagi seorangpun setelah Muhammad shallallahu 'alaihi wasallam.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "108",
    "matchingArabicURN": "1140880",
    "last_updated": null
  },
  {
    "indonesianURN": "3240060",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1760",
    "babName": "Perbedaan pada A'masy tentang hadis ini",
    "hadithNumber": "4006",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dari Yahya bin Hammad, ia berkata; telah menceritakan kepada kami Abu 'Awanah dari Sulaiman dari 'Amr bin Murrah dari Abu Al Bukhturi dari Abu Barzah, ia berkata; Abu Bakar marah kepada seseorang dari para sahabatnya. Kemudian Abu Barzah berkata; seandainya engkau memerintahkan kepadaku niscaya saya akan melakukannya. Abu Bakar berkata; demi Allah tidak hal tersebut tidak diperbolehkan bagi manusia setelah Muhammad shallallahu 'alaihi wasallam.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "109",
    "matchingArabicURN": "1140890",
    "last_updated": null
  },
  {
    "indonesianURN": "3240070",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1760",
    "babName": "Perbedaan pada A'masy tentang hadis ini",
    "hadithNumber": "4007",
    "hadithText": "Telah mengabarkan kepada kami Mu'awiyah bin Shaleh Al Asy'ari, ia berkata; telah menceritakan kepada kami Abdullah bin Ja'far, ia berkata; telah menceritakan kepada kami 'Ubaidullah dari Zaid dari 'Amr bin Murrah dari Abu Nadhrah dari Abu Barzah, ia berkata; Abu Bakar marah kepada seseorang dengan kemarahan yang sangat hingga warna kulitnya berubah. Saya mengatakan; wahai khalifah Rasulullah, demi Allah seandainya engkau memerintahkan saya sungguh akan saya penggal lehernya. Seolah-olah ia tersirami air dingin. Kemudian kemarahannya kepada orang tersebut hilang. Ia berkata; ibumu kehilangan dirimu, wahai Abu Barzah, sesungguhnya hal tersebut tidak boleh untuk seseorang setelah Rasulullah shallallahu 'alaihi wasallam. Abu Abdurrahman berkata; hal ini adalah suatu kesalahan, dan yang benar adalah Abu Nashr, namanya adalah Humaid bin Hilal. Dan Syu'bah menyelisihinya.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "110",
    "matchingArabicURN": "1140900",
    "last_updated": null
  },
  {
    "indonesianURN": "3240080",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1760",
    "babName": "Perbedaan pada A'masy tentang hadis ini",
    "hadithNumber": "4008",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dari Abu Daud, ia berkata; telah menceritakan kepada kami Syu'bah dari 'Amr bin Murrah, ia berkata; saya mendengar Abu Nashr menceritakan dari Abu Barzah, ia berkata; saya datang kepada Abu Bakar dan ia telah marah kepada seseorang dan orang tersebut membalasnya. Kemudian saya katakan; tidakkah saya memenggal lehernya? Kemudian ia melarangku dan berkata; sesungguhnya hal tersebut tidak boleh untuk seseorang setelah Rasulullah shallallahu 'alaihi wasallam. Abu Abdurrahman berkata; Abu Nashr adalah Humaid bin Hilal. Yunus bin 'Ubaid meriwayatkan hadits tersebut darinya.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "111",
    "matchingArabicURN": "1140910",
    "last_updated": null
  },
  {
    "indonesianURN": "3240090",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1760",
    "babName": "Perbedaan pada A'masy tentang hadis ini",
    "hadithNumber": "4009",
    "hadithText": "Telah mengabarkan kepada kami Abu Daud, ia berkata; telah menceritakan kepada kami Affan, ia berkata; telah menceritakan kepada kami Yazid bin Zurai', ia berkata; telah menceritakan kepada kami Yunus bin 'Ubaid dari Humaid bin Hilal dari Abdullah bin Mutharrif bin Asy Syakhir dari Abu Barzah Al Aslami bahwa Ia berkata kami pernah bersama Abu Bakar Ash Shiddiq kemudian ia marah kepada seseorang dari orang-orang muslim, dan kemarahannya sangat keras. Tatkala saya melihat hal tersebut saya katakan; wahai khalifah Rasulullah, bolehkah saya penggal lehernya? Kemudian tatkala saya menyebutkan pembunuhan maka ia berpaling dari peristiwa tersebut dan berniat untuk mengarah ke selain hal tersebut. Kemudian setelah kami bubar ia mengirim utusan kepadaku dan berkata; wahai Abu Barzah, apa yang engkau katakan? Dan saya lupa yang saya katakan, saya katakan; inggatkan saya. Ia berkata; tidakkah engkau ingat apa yang engkau katakan? Saya katakan; tidak, demi Allah. Ia berkata; tidakkah engkau melihat ketika engkau melihatku marah kepada seseorang kemudian engkau mengatakan; bolehkan saya memenggal lehernya wahai khalifah Rasulullah? Apakah engkau mengingat hal tersebut atau engkau akan melakukan hal tersebut? Saya katakan; ya, demi Allah. Dan sekarang jika engkau memerintahkan saya maka saya akan melakukannya. Ia berkata; demi Allah hal tersebut tidak boleh bagi seseorang setelah Muhammad shallallahu 'alaihi wasallam. Abu Abdurrahman berkata; hadits ini adalah hadits yang terbaik. Allah ta'ala a'lam.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "112",
    "matchingArabicURN": "1140920",
    "last_updated": null
  },
  {
    "indonesianURN": "3240100",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1761",
    "babName": "Sihir",
    "hadithNumber": "4010",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al 'Ala` dari Ibnu Idris, ia berkata; telah memberitakan kepada kami Syu'bah dari 'Amr bin Murrah dari Abdullah bin Salamah dari Shafwan bin 'Assal ia berkata; seorang Yahudi berkata kepada temannya; pergilah bersama kami kepada Nabi ini. Lalu temannya berkata kepadanya; jangan engkau katakan Nabi, jika ia mendengarmu ia memiliki empat mata. Lalu mereka berdua mendatangi Rasulullah shallallahu 'alaihi wasallam dan bertanya mengenai sembilan ayat yang jelas, lalu beliau bersabda kepada mereka: \"Janganlah kalian menyekutukan Allah dengan sesuatupun, janganlah kalian mencuri, janganlah kalian berzina, janganlah kalian membunuh jiwa yang diharamkan Allah kecuali dengan haq, janganlah kalian berjalan membawa orang yang tidak bersalah kepada yang penguasa, janganlah kalian berbuat sihir, janganlah kalian makan harta riba, janganlah kalian menuduh seorang yang suci berbuat zina, janganlah kalian berpaling dihari bertemu dengan musuh, dan wajib khusus bagi kalian hai orang yahudi agar tidak melampaui batas pada hari sabtu. Lalu mereka mencium tangan dan kaki beliau dan berkata; kami bersaksi bahwa engkau adalah Nabi, kemudian beliau bersabda: \" Lalu apa yang menghalangi kalian untuk mengikutiku, \" mereka menjawab karena Dawud menyeru bahwa masih ada Nabi dari keturunannya, dan kami khawatir jika kami mengikutimu maka orang-orang yahudi akan membunuh kami.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "113",
    "matchingArabicURN": "1140930",
    "last_updated": null
  },
  {
    "indonesianURN": "3240110",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1762",
    "babName": "Hukum tukang sihir",
    "hadithNumber": "4011",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Abu Daud, ia berkata; telah menceritakan kepada kami 'Abbad bin Maisarah Al Manqari dari Al Hasan dari Abu Hurairah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Barang siapa yang mengikat buhul kemudian meniupnya sungguh ia telah berbuat sihir, dan barang siapa yang melakukan sihir maka sungguh ia telah berbuat syirik dan barang siapa yang menggantungkan sesuatu maka ia akan diserahkan kepadanya.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "114",
    "matchingArabicURN": "1140940",
    "last_updated": null
  },
  {
    "indonesianURN": "3240120",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1763",
    "babName": "Tukang sihir ahli kitab",
    "hadithNumber": "4012",
    "hadithText": "Telah mengabarkan kepada kami Hannad bin As Sari dari Abu Mu'awiyah dari Al A'masy dari Ibnu Hayyan yaitu Yazid dari Zaid bin Arqam, ia berkata; terdapat seorang laki-laki dari kalangan Yahudi yang menyihir Nabi shallallahu 'alaihi wasallam, sehingga beliau beberapa hari sakit Karena hal tersebut. Kemudian beliau di datangi Jibril 'alaihissalam dan berkata; sesungguhnya terdapat seorang laki-laki dari kalangan Yahudi Yang menyihimu. Ia mengikat buhul di sebuah sumur ini, dan ini. Kemudian Rasulullah shallallahu 'alaihi wasallam mengirimkan orang dan mereka mengeluarkannya dan didatangkan kepada beliau. Kemudian Rasulullah shallallahu 'alaihi wasallam berdiri seolah-olah beliau terbebas dari ikatan. Dan beliau tidak menyebutkan hal tersebut kepada orang Yahudi itu dan beliau tidak melihatnya di wajahnya sama sekali.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "115",
    "matchingArabicURN": "1140950",
    "last_updated": null
  },
  {
    "indonesianURN": "3240130",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1764",
    "babName": "Yang harus dilakukan terhadap seseorang yang megancam hartanya",
    "hadithNumber": "4013",
    "hadithText": "Telah mengabarkan kepada kami Hannad bin As Sari dalam haditsnya dari Abu Al Ahwash dari Simak dari Qabus dari ayahnya, ia berkata; telah datang seorang laki-laki kepada Rasulullah shallallahu 'alaihi wasallam... telah menceritakan dan mengabarkan kepadaku Ali bin Muhammad bin Ali, ia berkata; telah menceritakan kepada kami Khalaf bin Tamim, ia berkata; telah menceritakan kepada kami Abu Al Ahwash, ia berkata; telah menceritakan kepada kami Simak bin Harb dari Qabus bin Mukhariq dari ayahnya, ia berkata; saya mendengar Sufyan Ats Tsauri menceritakan dengan hadits ini, ia berkata; telah datang seorang laki-laki kepada Nabi shallallahu 'alaihi wasallam kemudian ia berkata; ada seseorang yang datang kepadaku menginginkan hartaku. beliau bersabda: \" Ingatkan dia kepada Allah.\" Kemudian apabila ia tidak dapat diberi pengitan? Mintalah orang-orang disekitarmu dari kalangan orang-orang muslim untuk menghadapinya. Ia berkata; apabila sekitarku tidak ada seorangpun dari kalangan orang muslim. Ia berkata; Apabila penguasa pergi dariku? beliau bersabda: \"Perangilah demi hartamu hingga engkau menjadi bagian dari orang-orang yang mati syahid pada hari Akhir atau engkau menolak hartamu.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "116",
    "matchingArabicURN": "1140960",
    "last_updated": null
  },
  {
    "indonesianURN": "3240140",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1764",
    "babName": "Yang harus dilakukan terhadap seseorang yang megancam hartanya",
    "hadithNumber": "4014",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Al Laits dari Ibnu Al Had dari 'Amr bin Quhaid Al Ghifari dari Abu Hurairah, ia berkata; telah datang seseorang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; wahai Rasulullah, bagaimana pendapatmu apabila hartaku diganggu? Beliau bersabda: \"Bersumpahlah dengan nama Allah dan mintalah kepadanya. Ia berkata; Apabila mereka menolak? Beliau bersabda: \" Bersumpahlah dengan nama Allah dan mintalah kepadanya.\" Ia berkata; Apabila mereka menolak? Beliau bersabda: \" Bersumpahlah dengan nama Allah dan mintalah kepadanya.\" Ia berkata; Apabila mereka menolak? Beliau bersabda: \"Perangilah mereka, apabila engkau terbunuh maka engkau di Surga dan jika engkau membunuh maka mereka berada di Neraka.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "117",
    "matchingArabicURN": "1140970",
    "last_updated": null
  },
  {
    "indonesianURN": "3240150",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1764",
    "babName": "Yang harus dilakukan terhadap seseorang yang megancam hartanya",
    "hadithNumber": "4015",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Abdul Hakam dari Syu'bah bin Al Laits, ia berkata; telah memberitakan kepada kami Al Laits dari Ibnu Al Had dari Quhaid bin Muthorrif Al Ghifari dari Abu Hurairah bahwa Seorang laki-laki datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; wahai Rasulullah, bagaimana pendapatmu apabila hartaku diganggu? Beliau bersabda: \"Bersumpahlah dengan nama Allah dan mintalah kepadanya. Ia berkata; Apabila mereka menolak? Beliau bersabda: \" Bersumpahlah dengan nama Allah dan mintalah kepadanya.\" Ia berkata; Apabila mereka menolak? Beliau bersabda: \" Bersumpahlah dengan nama Allah dan mintalah kepadanya.\" Ia berkata; Apabila mereka menolak? Beliau bersabda: \"Perangilah mereka, apabila engkau terbunuh maka engkau di Surga dan jika engkau membunuh maka mereka berada di Neraka.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "118",
    "matchingArabicURN": "1140980",
    "last_updated": null
  },
  {
    "indonesianURN": "3240160",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1765",
    "babName": "Yang terbunuh membela hartanya",
    "hadithNumber": "4016",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul Al A'la, ia berkata; telah menceritakan kepada kami Khalid, ia berkata; telah menceritakan kepada kami Hatim dari 'Amr bin Dinar dari Abdullah bin 'Amr, ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang berperang mempertahankan hartanya kemudian terbunuh maka ia adalah orang yang syahid.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "119",
    "matchingArabicURN": "1140990",
    "last_updated": null
  },
  {
    "indonesianURN": "3240170",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1765",
    "babName": "Yang terbunuh membela hartanya",
    "hadithNumber": "4017",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Bazi', ia berkata; telah menceritakan kepada kami Bisyr bin Al Mufadhdhal dari Abu Yunus Al Qusyari dari 'Amr bin Dinar dari Abdullah bin Shafwan dari Abdullah bin 'Amr, ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang berperang mempertahankan hartanya kemudian terbunuh maka ia adalah orang yang syahid.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "120",
    "matchingArabicURN": "1141000",
    "last_updated": null
  },
  {
    "indonesianURN": "3240180",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1765",
    "babName": "Yang terbunuh membela hartanya",
    "hadithNumber": "4018",
    "hadithText": "Telah mengabarkan kepadaku Abdullah bin Fadhalah bin Ibrahim An Naisaburi, ia berkata; telah memberitakan kepada kami Abdullah, ia berkata; telah menceritakan kepada kami Sa'id, ia berkata; telah memberitakan kepada kami Abu Al Aswad Muhammad bin Abdurrahman dari Ikrimah dari Abdullah bin 'Amr bin Al 'Ash bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang terbunuh mempertahankan hartanya dalam keadaan dizhalimi maka baginya Surga.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "121",
    "matchingArabicURN": "1141010",
    "last_updated": null
  },
  {
    "indonesianURN": "3240190",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1765",
    "babName": "Yang terbunuh membela hartanya",
    "hadithNumber": "4019",
    "hadithText": "Telah mengabarkan kepada kami Ja'far bin Muhammad Al Hudzali, ia berkata; telah menceritakan kepada kami 'Ashim bin Yusuf, ia berkata; telah menceritakan kepada kami Su'air bin Al Khims dari Abdullah bin Al Hasan dari Ikrimah dari Abdullah bin 'Amr, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang terbunuh mempertahankan hartanya maka ia adalah syahid.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "122",
    "matchingArabicURN": "1141020",
    "last_updated": null
  },
  {
    "indonesianURN": "3240200",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1765",
    "babName": "Yang terbunuh membela hartanya",
    "hadithNumber": "4020",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Yahya bin Sa'id, ia berkata; telah menceritakan kepada kami Sufyan, ia berkata; telah menceritakan kepadaku Abdullah bin Hasan dari Ibrahim bin Muhammad bin Thalhah bahwa ia mendengar Abdullah bin 'Amr menceritakan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barang siapa yang hartanya dikehendaki tanpa hak, kemudian ia mempertahankan dan terbunuh maka ia adalah syahid.\" Hal ini adalah salah dan yang benar adalah hadits Su'air bin Al Khims.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "123",
    "matchingArabicURN": "1141030",
    "last_updated": null
  },
  {
    "indonesianURN": "3240210",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1765",
    "babName": "Yang terbunuh membela hartanya",
    "hadithNumber": "4021",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman, ia berkata; telah menceritakan kepada kami Mu'awiyah bin Hisyam, ia berkata; telah menceritakan kepada kami Sufyan dari Abdullah bin Al Hasan dari Muhammad bin Ibrahim bin Thalhah dari Abdullah bin 'Amr, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang terbunuh mempertahankan hartanya maka ia adalah syahid.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "124",
    "matchingArabicURN": "1141040",
    "last_updated": null
  },
  {
    "indonesianURN": "3240220",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1765",
    "babName": "Yang terbunuh membela hartanya",
    "hadithNumber": "4022",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dan Qutaibah, lafazhnya adalah lafazh Ishaq, mereka berdua mengatakan; telah memberitakan kepada kami Sufyan dari Az Zuhri dari Thalhah bin Abdullah bin 'Auf dari Sa'id bin Zaid dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barang siapa yang terbunuh mempertahankan hartanya maka ia adalah syahid.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "125",
    "matchingArabicURN": "1141050",
    "last_updated": null
  },
  {
    "indonesianURN": "3240230",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1765",
    "babName": "Yang terbunuh membela hartanya",
    "hadithNumber": "4023",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah memberitakan kepada kami 'Abdah, ia berkata; telah menceritakan kepada kami Muhammad bin Ishaq dari Az Zuhri dari Thalhah bin Abdullah bin 'Auf dari Sa'id bin Zaid dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barang siapa yang berperang mempertahankan hartanya maka ia adalah syahid.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "126",
    "matchingArabicURN": "1141060",
    "last_updated": null
  },
  {
    "indonesianURN": "3240240",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1765",
    "babName": "Yang terbunuh membela hartanya",
    "hadithNumber": "4024",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Nashr, ia berkata; telah menceritakan kepada kami Al Muammal dari Sufyan dari 'Alqamah bin Martsad dari Sulaiman bin Buraidah dari ayahnya ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang terbunuh mempertahankan hartanya maka ia adalah syahid.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "127",
    "matchingArabicURN": "1141070",
    "last_updated": null
  },
  {
    "indonesianURN": "3240250",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1765",
    "babName": "Yang terbunuh membela hartanya",
    "hadithNumber": "4025",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna, ia berkata; telah menceritakan kepada kami Abdurrahman, ia berkata; telah menceritakan kepada kami Sufyan dari 'Alqamah dari Abu Ja'far, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Barangsiapa yang terbunuh mempertahankan sesuatu yang dizhalimi darinya maka ia adalah syahid, \" Abu abdurrahman berkata hadits Al Muammal salah dan yang benar adalah hadits Abdurrahman.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "128",
    "matchingArabicURN": "1141080",
    "last_updated": null
  },
  {
    "indonesianURN": "3240260",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1766",
    "babName": "Yang memerangi untuk  membela keluarganya",
    "hadithNumber": "4026",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Abdurrahman bin Mahdi, ia berkata; telah menceritakan kepada kami Ibrahim bin Sa'd dari ayahnya dari Abu 'Ubaidah bin Muhammad dari Thalhah bin Abdullah bin 'Auf dari Sa'id bin Zaid dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barang siapa yang berperang mempertahankan hartanya kemudian terbunuh maka ia adalah syahid, barang siapa yang berperang mempertahankan darahnya maka ia adalah syahid dan barang siapa yang berperang mempertahankan keluarganya maka ia adalah syahid.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "129",
    "matchingArabicURN": "1141090",
    "last_updated": null
  },
  {
    "indonesianURN": "3240270",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1767",
    "babName": "Yang memerangi untuk membela agamanya",
    "hadithNumber": "4027",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Rafi' dan Muhammad bin Isma'il bin Ibrahim mereka berdua mengatakan; telah menceritakan kepada kami Sulaiman yaitu Ibnu Daud Al Hasyimi, ia berkata; telah menceritakan kepada kami Ibrahim dari ayahnya dari Abu 'Ubaidah bin Muhammad bin 'Ammar bin Yasir dari Thalhah bin Abdullah bin 'Auf dari Sa'id bin Zaid, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang terbunuh mempertahankan hartanya maka ia adalah syahid, barang siapa yang terbunuh mempertahankan keluarganya maka ia adalah syahid, barang siapa yang terbunuh mempertahankan agamanya ia adalah syahid dan barang siapa yang terbunuh mempertahankan darahnya maka ia adalah syahid.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "130",
    "matchingArabicURN": "1141100",
    "last_updated": null
  },
  {
    "indonesianURN": "3240280",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1768",
    "babName": "Yang memerangi untuk membela ketertindasannya",
    "hadithNumber": "4028",
    "hadithText": "Telah mengabarkan kepada kami Al Qasim bin Zakariya bin Dinar, ia berkata; telah menceritakan kepada kami Sa'id bin 'Amr Al Asy'ats, ia berkata; telah menceritakan kepada kami 'Abtsar dari Mutharrif dari Sawadah bin Abu Al Ja'd dari Abu Ja'far ia berkata; aku duduk disisi Suwaid bin Muqorrin lalu ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang terbunuh mempertahankan sesuatu yang dizhalimi darinya maka ia adalah syahid.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "131",
    "matchingArabicURN": "1141110",
    "last_updated": null
  },
  {
    "indonesianURN": "3240300",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1769",
    "babName": "Yang menghunuskan pedang lantas mengayunkan ke tengah-tengah manusia",
    "hadithNumber": "4030",
    "hadithText": "Telah mengabarkan kepada kami Abu Daud, ia berkata; telah menceritakan kepada kami Abu 'Ashim dari Ibnu Juraij dari Ibnu Thawus dari ayahnya dari Ibnu Az Zubair, ia berkata; barang siapa yang mengangkat senjata kemudian meletakkannya maka darahnya sia-sia.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "134",
    "matchingArabicURN": "1141140",
    "last_updated": null
  },
  {
    "indonesianURN": "3240310",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1769",
    "babName": "Yang menghunuskan pedang lantas mengayunkan ke tengah-tengah manusia",
    "hadithNumber": "4031",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin 'Amr bin As Sarh, ia berkata; telah memberitakan kepada kami Ibnu Wahb, ia berkata; telah memberitakan kepadaku Malik dan Abdullah bin Umar, Usamah bin Zaid, dan Yunus bin Yazid bahwa Nafi' telah mengabarkan kepada mereka dari Abdullah bin Umar bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang mengarahkan senjata kepada kami maka ia bukan dari golongan kami.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "135",
    "matchingArabicURN": "1141150",
    "last_updated": null
  },
  {
    "indonesianURN": "3240320",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1769",
    "babName": "Yang menghunuskan pedang lantas mengayunkan ke tengah-tengah manusia",
    "hadithNumber": "4032",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan, ia berkata; telah menceritakan kepada kami Abdur Razzaq, ia berkata; telah memberitakan kepada kami Ats Tsauri dari ayahnya dari Ibnu Abu Nu'aim dari Abu Sa'id Al Khudri, ia berkata; Ali mengirim seseorang kepada Nabi shallallahu 'alaihi wasallam sedangkan ia berada di Yaman membawa emas yang masih dalam tanahnya, kemudian beliau membaginya antara Al Aqra` bin Habis Al Hanzhali kemudian salah seorang dari Bani Mujasyim dan antara 'Uyainah bin Badr Al Fazari dan 'Alqamah bin 'Ulatsah Al 'Amiri, kemudian salah seorang dari Bani Kilab dan antara Zaid Al Khail Ath Thai, kemudian salah seorang dari Bani Nabhan. Abu Sa'id berkata; kemudian orang-orang Quraisy dan Anshar marah dan berkata; beliau memberikan kepada pembesar-pembesar Najed dan meninggalkan kita. Maka beliau bersabda: \"Sesungguhnya saya melunakkan hati mereka.\" Kemudian terdapat seorang laki-laki yang cekung matanya, bagian atas pipinya menonjol, lebat jenggotnya, dan gundul rambutnya, kemudian ia berkata; wahai Muhammad, bertakwalah kepada Allah! Beliau bersabda: \"Siapakah yang taat kepada Allah apabila aku durhaka kepadaNya? Apakah Dia mempercayaiku atas penduduk bumi dan kalian tidak mempercayaiku?\" kemudian terdapat seseorang dari orang-orang tersebut yang meminta untuk membunuhnya. Lalu beliau melarangnya, kemudian setelah ia pergi beliau bersabda: \"Sesungguhnya dari keturunan orang ini akan ada orang-orang yang keluar membaca Al Qur'an dan tidak melewati tenggorokan mereka, mereka melesat dari agama seperti melesatnya anak panah dari busur. Mereka akan membunuh orang Islam, dan membiarkan penyembah berhala, sungguh apabila aku menjumpai mereka niscaya akan aku perangi mereka seperti membunuh kaum 'Ad.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "136",
    "matchingArabicURN": "1141160",
    "last_updated": null
  },
  {
    "indonesianURN": "3240330",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1769",
    "babName": "Yang menghunuskan pedang lantas mengayunkan ke tengah-tengah manusia",
    "hadithNumber": "4033",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar, ia berkata; telah menceritakan kepada kami Abdurrahman, ia berkata; telah menceritakan kepada kami Sufyan dari Al A'masy dari Khaitsamah dari Suwaid bin Ghafalah dari Ali, ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan keluar suatu kaum pada akhir zaman orang-orang yang muda umurnya dan lemah akalnya, mereka menceritakan mengenai perkataan manusia terbaik, keimanan mereka tidak melampaui tenggorokan. Mereka melesat dari agama seperti melesatnya anak panah dari busurnya, apabila kalian menjumpai mereka maka bunuhlah mereka. Sesungguhnya membunuh mereka adalah pahala bagi orang yang membunuhnya pada Hari Kiamat.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "137",
    "matchingArabicURN": "1141170",
    "last_updated": null
  },
  {
    "indonesianURN": "3240340",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1769",
    "babName": "Yang menghunuskan pedang lantas mengayunkan ke tengah-tengah manusia",
    "hadithNumber": "4034",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Ma'mar Al Bashri Al Harrani, ia berkata; telah menceritakan kepada kami Abu Daud Athayalisi, ia berkata; telah menceritakan kepada kami Hammad bin Salamah dari Al Azraq bin Qais dari Syarik bin Syihab ia berkata; dahulu saya berharap untuk bertemu dengan seorang sahabat Nabi shallallahu 'alaihi wasallam dan bertanya kepadanya mengenai Khawarij, lalu aku bertemu dengan Abu Barzah pada hari 'Id diantara beberapa orang dari sahabatnya, saya katakan kepadanya; apakah engkau mendengar Rasulullah shallallahu 'alaihi wasallam menyebutkan mengenai khowarij? Ia menjawab; ya. Saya mendengar Rasulullah shallallahu 'alaihi wasallam dengan dua telingaku dan melihat dengan kedua mataku, didatangkan kepada Rasulullah Shallallahu Alaihi wa sallam suatu harta lalu beliau mulai membagi untuk orang yang berada disebelah kanan dan kiri beliau, dan beliau tidak memberi yang berada dibelakannya sedikitpun, lalu seseorang yang berada dibelakang beliau berdiri dan berkata; wahai Muhammad, engkau tidak adil dalam membagi, ia adalah orang yang hitam, rambutnya dicukur, ia mengenakan dua kain putih, lalu Rasulullah shallallahu 'alaihi wasallam marah dan bersabda: \"Demi Allah kalian tidak akan mendapati seorangpun yang lebih adil setelahku, \" lalu beliau bersabda: \" akan keluar pada akhir zaman, suatu kaum seakan-akan orang ini termasuk darinya, yang mereka membaca quran tidak melebihi kerongkongan mereka, mereka melesat dari Islam seperti melesatnya anak panah dari busurnya, ciri-ciri mereka adalah bercukur, mereka senantiasa keluar hingga keluar akhir dari mereka bersama Al Masih Ad Dajjal, jika kalian bertemu dengan mereka maka bunuhlah mereka, mereka adalah seburuk-buruk makhluk dan ciptaan, \" Abu Abdurrahman rahimahullah berkata Syarik bin Syihab bukanlah Syarik yang terkenal itu.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "138",
    "matchingArabicURN": "1141180",
    "last_updated": null
  },
  {
    "indonesianURN": "3240350",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1770",
    "babName": "Memerangi muslim",
    "hadithNumber": "4035",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah memberitakan kepada kami Abdur Razzaq, ia berkata; telah menceritakan kepada kami Ma'mar dari Abu Ishaq dari Umar bin Sa'd, ia berkata; telah menceritakan kepada kami Sa'd bin Abu Waqqash bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Membunuh orang muslim adalah kekafiran dan mencelanya adalah kefasikan.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "139",
    "matchingArabicURN": "1141190",
    "last_updated": null
  },
  {
    "indonesianURN": "3240360",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1770",
    "babName": "Memerangi muslim",
    "hadithNumber": "4036",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar, ia berkata; telah menceritakan kepada kami Abdurrahman, ia berkata; telah menceritakan kepada kami Syu'bah dari Abu Ishaq, ia berkata; saya mendengar Abu Al Ahwash dari Abdullah ia berkata; mencela seorang muslim adalah kefasikan dan membunuhnya adalah kekafiran.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "140",
    "matchingArabicURN": "1141200",
    "last_updated": null
  },
  {
    "indonesianURN": "3240370",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1770",
    "babName": "Memerangi muslim",
    "hadithNumber": "4037",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Hakim, ia berkata; telah menceritakan kepada kami Abdurrahman bin Mahdi dari Syu'bah dari Abu Ishaq dari Abu Al Ahwash dari Abdullah, ia berkata; mencela seorang muslim adalah kefasikan dan membunuhnya adalah kekafiran. Kemudian Aban berkata; kepadanya; wahai Abu Ishaq, apakah engkau tidak mendengarnya kecuali dari Abu Al Ahwash? Ia berkata; bahkan saya mendengarnya dari Al Aswad dan Hubairah.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "141",
    "matchingArabicURN": "1141210",
    "last_updated": null
  },
  {
    "indonesianURN": "3240380",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1770",
    "babName": "Memerangi muslim",
    "hadithNumber": "4038",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Harb, ia berkata; telah menceritakan kepada kami Sufyan bin 'Uyainah dari Abu Az Za'ra` dari pamannya yaitu Abu Al Ahwash dari Abdullah, ia berkata; mencela seorang muslim adalah kefasikan dan membunuhnya adalah kekafiran.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "142",
    "matchingArabicURN": "1141220",
    "last_updated": null
  },
  {
    "indonesianURN": "3240390",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1770",
    "babName": "Memerangi muslim",
    "hadithNumber": "4039",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan, ia berkata; telah menceritakan kepada kami Wahb bin Jarir, ia berkata; telah menceritakan kepada kami ayahku, saya mendengar Abdul Malik bin 'Umair menceritakan kepadanya dari Abdurrahman bin Abdullah dari ayahnya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mencela seorang muslim adalah kefasikan dan membunuhnya adalah kekafiran.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "143",
    "matchingArabicURN": "1141230",
    "last_updated": null
  },
  {
    "indonesianURN": "3240400",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1770",
    "babName": "Memerangi muslim",
    "hadithNumber": "4040",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan, ia berkata; telah menceritakan kepada kami Abu Daud, ia berkata; telah menceritakan kepada kami Syu'bah, ia berkata; saya berkata kepada Hammad; saya mendengar Manshur dan Sulaiman serta Zubaid menceritakan dari Abu Wa'il dari Abdullah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mencela seorang muslim adalah kefasikan dan membunuhnya adalah kekafiran.\" Siapakah yang engkau sangka? Saya menyangka Manshur. Apakah engkau menyangka Zaid, apakah engkau menyangka Sulaiman? Ia berkata; tidak akan tetapi saya menyangka Abu Wail.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "144",
    "matchingArabicURN": "1141240",
    "last_updated": null
  },
  {
    "indonesianURN": "3240410",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1770",
    "babName": "Memerangi muslim",
    "hadithNumber": "4041",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan, ia berkata; telah menceritakan kepada kami Waki', ia berkata; telah menceritakan kepada kami Sufyan dari Zaid dari Abu Wail dari Abdullah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mencela seorang muslim adalah kefasikan dan membunuhnya adalah kekafiran.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "145",
    "matchingArabicURN": "1141250",
    "last_updated": null
  },
  {
    "indonesianURN": "3240420",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1770",
    "babName": "Memerangi muslim",
    "hadithNumber": "4042",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan, ia berkata; telah menceritakan kepada kami Mu'awiyah, ia berkata; telah menceritakan kepada kami Sufyan dari Manshur dari Abu Wail dari Abdullah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mencela seorang muslim adalah kefasikan dan membunuhnya adalah kekafiran.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "146",
    "matchingArabicURN": "1141260",
    "last_updated": null
  },
  {
    "indonesianURN": "3240430",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1770",
    "babName": "Memerangi muslim",
    "hadithNumber": "4043",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Jarir dari Manshur dari Abu Wail, ia berkata; Abdullah berkata; Mencela seorang muslim adalah kefasikan dan membunuhnya adalah kekafiran.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "147",
    "matchingArabicURN": "1141270",
    "last_updated": null
  },
  {
    "indonesianURN": "3240440",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1770",
    "babName": "Memerangi muslim",
    "hadithNumber": "4044",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al 'Ala` dari Abu Mu'awiyah dari Al A'masy dari Syaqiq dari Abdullah, ia berkata; membunuh orang mukmin adalah kekafiran dan mencelanya adalah kefasikan.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "148",
    "matchingArabicURN": "1141280",
    "last_updated": null
  },
  {
    "indonesianURN": "3240450",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1771",
    "babName": "Teguran keras bagi yang berperang dengan panji-panji fatanisme",
    "hadithNumber": "4045",
    "hadithText": "Telah mengabarkan kepada kami Bisyr bin Hilal Ash Shawwaf, ia berkata; telah menceritakan kepada kami Abdul Warits, ia berkata; telah menceritakan kepada kami Ayyub dari Ghailan bin Jarir dari Ziyad bin Riyah dari Abu Hurairah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang keluar dari ketaatan dan memisahkan diri dari jama'ah kemudian mati maka ia mati dengan kematian jahiliyah, dan barang siapa yang menyerang umatku dan membunuh orang yang baik dan pelaku dosa dan tidak menjauhi orang mukminnya dan tidak menepati janji orang yang memiliki janki maka ia bukan dari golonganku, dan barang siapa yang berperang dibawah bendera ketidak jelasan dan menyeru kepada kefanatikan atau marah karena fanatik kemudian terbunuh maka terbunuhnya adalah terbunuh secara jahiliyah.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "149",
    "matchingArabicURN": "1141290",
    "last_updated": null
  },
  {
    "indonesianURN": "3240460",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1771",
    "babName": "Teguran keras bagi yang berperang dengan panji-panji fatanisme",
    "hadithNumber": "4046",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dari Abdurrahman, ia berkata; telah menceritakan kepada kami Imran Al Qaththan dari Qatadah dari Abu Mijlaz dari Jundub bin Abdullah ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang berperang dibawah bendera ketidak jelasan, ia berperang karena kefanatikan dan marah karena kefanatikan maka terbunuhnya adalah terbunuh secara jahiliyah.\" Abu abdurrahman berkata Imron Al Qaththan bukan orang yang kuat.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "150",
    "matchingArabicURN": "1141300",
    "last_updated": null
  },
  {
    "indonesianURN": "3240470",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1772",
    "babName": "Keharaman pembunuhan",
    "hadithNumber": "4047",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan, ia berkata; telah menceritakan kepada kami Abu Daud dari Syu'bah, ia berkata; telah mengabarkan kepadaku Manshur, ia berkata; saya mendengar Rab'i menceritakan dari Abu Bakarah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila seorang muslim menunjuk saudara muslimnya menggunakan senjata maka mereka berada di atas jurang Jahannam, kemudian apabila ia membunuhnya maka mereka berdua terjatuh ke dalamnya.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "151",
    "matchingArabicURN": "1141310",
    "last_updated": null
  },
  {
    "indonesianURN": "3240480",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1772",
    "babName": "Keharaman pembunuhan",
    "hadithNumber": "4048",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman, ia berkata; telah menceritakan kepada kami Ya'la, ia berkata; telah menceritakan kepada kami Sufyan dari Manshur dari Rib'i dari Abu Bakarah, ia berkata; apabila dua orang muslim membawa senjata salah satunya mengarahkan kepada yang lainnya maka mereka berdua berada di atas jurang Jahannam, dan apabila salah satunya membunuh yang lain maka mereka berdua berada di Neraka.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "152",
    "matchingArabicURN": "1141320",
    "last_updated": null
  },
  {
    "indonesianURN": "3240490",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1772",
    "babName": "Keharaman pembunuhan",
    "hadithNumber": "4049",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Isma'il bin Ibrahim dari Yazid dari Sulaiman At Taimi dari Al Hasan dari Abu Musa dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Apabila dua orang muslim saling berhadapan dengan pedang mereka kemudian salah seorang dari mereka membunuh sahabatnya maka mereka berada dalam Neraka.\" Kemudian beliau ditanya; wahai Rasulullah, ini orang yang membunuh, maka bagaimana dengan orang yang dibunuh? beliau bersabda: \"Ia ingin membunuh sahabatnya.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "153",
    "matchingArabicURN": "1141330",
    "last_updated": null
  },
  {
    "indonesianURN": "3240500",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1772",
    "babName": "Keharaman pembunuhan",
    "hadithNumber": "4050",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Isma'il bin Ibrahim, ia berkata; telah menceritakan kepada kami Yazid yaitu Ibnu Harun, ia berkata; telah memberitakan kepada kami Sa'id dari Qatadah dari Al Hasan dari Abu Musa Al Asy'ari dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Apabila dua orang muslim saling berhadapan dengan pedang mereka kemudian salah seorang dari mereka membunuh sahabatnya maka mereka berada dalam Neraka seperti itu sama.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "154",
    "matchingArabicURN": "1141340",
    "last_updated": null
  },
  {
    "indonesianURN": "3240510",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1772",
    "babName": "Keharaman pembunuhan",
    "hadithNumber": "4051",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Muhammad bin Ali Al Mishshishi, ia berkata; telah menceritakan kepada kami Khalaf dari Zaidah dari Hisyam dari Al Hasan dari Abu Bakarah dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Apabila dua orang muslim saling berhadapan dengan pedang mereka setiap orang ingin membunuh sahabatnya maka mereka berada dalam Neraka.\" Kemudian beliau ditanya; wahai Rasulullah, ini orang yang membunuh, maka bagaimana dengan orang yang dibunuh? beliau bersabda: \"Ia berusaha membunuh sahabatnya.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "155",
    "matchingArabicURN": "1141350",
    "last_updated": null
  },
  {
    "indonesianURN": "3240520",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1772",
    "babName": "Keharaman pembunuhan",
    "hadithNumber": "4052",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna, ia berkata; telah menceritakan kepada kami Al Khalil bin Umar bin Ibrahim, ia berkata; telah menceritakan kepadaku ayahku, ia berkata; telah menceritakan kepadaku Qatadah dari Al Hasan dari Abu Bakarah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Apabila dua orang muslim bertemu dengan pedang mereka kemudian salah seorang diantara mereka membunuh sahabatnya maka orang yang membunuh dan yang dibunuh berada dalam Neraka.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "156",
    "matchingArabicURN": "1141360",
    "last_updated": null
  },
  {
    "indonesianURN": "3240530",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1772",
    "babName": "Keharaman pembunuhan",
    "hadithNumber": "4053",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Fadhalah, ia berkata; telah menceritakan kepada kami Abdur Razzaq, ia berkata; telah memberitakan kepada kami Ma'mar dari Ayyub dari Al Hasan dari Al Ahnaf bin Qais dari Abu Bakarah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Apabila dua orang muslim bertemu dengan pedang mereka kemudian salah seorang diantara mereka membunuh sahabatnya maka orang yang membunuh dan yang dibunuh berada dalam Neraka.\" Para sahabat berkata; wahai Rasulullah, ini orang yang membunuh, maka bagaimana dengan orang yang dibunuh? beliau bersabda: \"Ia ingin membunuh sahabatnya.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "157",
    "matchingArabicURN": "1141370",
    "last_updated": null
  },
  {
    "indonesianURN": "3240540",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1772",
    "babName": "Keharaman pembunuhan",
    "hadithNumber": "4054",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin 'Abdah dari Hammad dari Ayyub dan Yunus serta Al 'Ala` bin Ziyad dari Al Hasan dari Al Ahnaf bin Qais dari Abu Bakarah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Apabila dua orang muslim bertemu dengan pedang mereka kemudian salah seorang diantara mereka membunuh sahabatnya maka orang yang membunuh dan yang dibunuh berada dalam Neraka.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "158",
    "matchingArabicURN": "1141380",
    "last_updated": null
  },
  {
    "indonesianURN": "3240550",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1772",
    "babName": "Keharaman pembunuhan",
    "hadithNumber": "4055",
    "hadithText": "Telah mengabarkan kepada kami Mujahid bin Musa, ia berkata; telah menceritakan kepada kami Isma'il yaitu Ibnu 'Aliyah dari Yunus dari Al Hasan dari Abu Musa Al Asy'ari bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila dua orang muslim saling berhadapan dengan pedang mereka kemudian salah seorang dari mereka membunuh sahabatnya maka mereka berada dalam Neraka.\" Seorang laki-laki berkata; wahai Rasulullah, ini orang yang membunuh, bagaimana dengan orang yang dibunuh? Beliau bersabda: \"Ia ingin membunuh sahabatnya.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "159",
    "matchingArabicURN": "1141390",
    "last_updated": null
  },
  {
    "indonesianURN": "3240560",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1772",
    "babName": "Keharaman pembunuhan",
    "hadithNumber": "4056",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Abdullah bin Al Hakam, ia berkata; telah menceritakan kepada kami Muhammad bin Ja'far, ia berkata; telah menceritakan kepada kami Syu'bah dari Waqid bin Muhammad bin Zaid bahwa Ia mendengar ayahnya menceritakan dari Ibnu Umar dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah kalian kembali setelahku sebagai orang kafir, sebagian kalian membunuh sebagian yang lain.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "160",
    "matchingArabicURN": "1141400",
    "last_updated": null
  },
  {
    "indonesianURN": "3240570",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1772",
    "babName": "Keharaman pembunuhan",
    "hadithNumber": "4057",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Rafi', ia berkata; telah menceritakan kepada kami Abu Ahmad Az Zubiri, ia berkata; telah menceritakan kepada kami Syarik dari Al A'masy dari Abu Adh Dhuha dari Masruq dari Ibnu Umar, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Janganlah kalian kembali kafir setelahku, sebagian kalian membunuhsebagian yang lain tidaklah seseorang menanggung kejahatan ayahnya serta kejahatan saudaranya.\" Abu Abdurrahman berkata; ini adalah kesalahan dan yang benar adalah mursal.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "161",
    "matchingArabicURN": "1141410",
    "last_updated": null
  },
  {
    "indonesianURN": "3240580",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1772",
    "babName": "Keharaman pembunuhan",
    "hadithNumber": "4058",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Ya'qub, ia berkata; telah menceritakan kepada kami Ahmad bin Yunus, ia berkata; telah menceritakan kepada kami Abu Bakar bin 'Ayyasy dari Al A'masy dari Muslim dari Masruq dari Abdullah ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Janganlah kalian kembali kafir setelahku, sebagian kalian membunuhsebagian yang lain tidaklah seseorang menanggung kejahatan ayahnya serta kejahatan saudaranya.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "162",
    "matchingArabicURN": "1141420",
    "last_updated": null
  },
  {
    "indonesianURN": "3240590",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1772",
    "babName": "Keharaman pembunuhan",
    "hadithNumber": "4059",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al 'Alaa', ia berkata; telah menceritakan kepada kami Abu Mu'awiyah, ia berkata; telah menceritakan kepada kami Al A'masy dari Muslim dari Masruq ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh jangan sampai aku mendapati kalian kembali kafir setelahku, sebagian kalian membunuh sebagian yang lain, tidaklah seseorang menanggung kejahatan ayahnya serta kejahatan saudaranya.\" ini yang benar.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "163",
    "matchingArabicURN": "1141430",
    "last_updated": null
  },
  {
    "indonesianURN": "3240600",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1772",
    "babName": "Keharaman pembunuhan",
    "hadithNumber": "4060",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Ya'qub, ia berkata; telah menceritakan kepada kami Ya'la, ia berkata; telah menceritakan kepada kami Al A'masy dari Abu Adh Dhuha dari Masruq, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kembali kafir setelahku.\" Hadits mursal.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "164",
    "matchingArabicURN": "1141440",
    "last_updated": null
  },
  {
    "indonesianURN": "3240610",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1772",
    "babName": "Keharaman pembunuhan",
    "hadithNumber": "4061",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Zurarah, ia berkata; telah memberitakan kepada kami Isma'il dari Ayyub dari Muhammad bin Sirin dari Abu Bakarah dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah kalian kembali sesat setelahku, sebagian kalian membunuh sebagian yang lain.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "165",
    "matchingArabicURN": "1141450",
    "last_updated": null
  },
  {
    "indonesianURN": "3240620",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1772",
    "babName": "Keharaman pembunuhan",
    "hadithNumber": "4062",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar, ia berkata; telah menceritakan kepada kami Muhammad dan Abdurrahman mereka berkata; telah menceritakan kepada kami Syu'bah dari Ali bin Mudrik, ia berkata; saya mendengar Abu Zur'ah bin 'Amr bin Jarir dari Jarir bahwa Rasulullah shallallahu 'alaihi wasallam ketika melakukan haji wada' beliau memerintahkan orang-orang agar diam, beliau bersabda: \"Janganlah kalian kembali kafir setelahku, sebagian kalian membunuh sebagian yang lain.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "166",
    "matchingArabicURN": "1141460",
    "last_updated": null
  },
  {
    "indonesianURN": "3240630",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1772",
    "babName": "Keharaman pembunuhan",
    "hadithNumber": "4063",
    "hadithText": "Telah mengabarkan kepada kami Abu 'Ubaidah bin Abu As Safar, ia berkata; telah menceritakan kepada kami Abdullah bin Numair, ia berkata; telah menceritakan kepada kami Isma'il dari Qais, ia berkata; telah sampai kepadaku bahwa Jarir bin Abdullah berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Perintahkan orang-orang agar diam.\" Kemudian beliau bersabda: \"Sungguh jangan sampai aku mendapati kalian kalian Setelah apa yang aku lihat, kembali kafir setelahku, sebagian kalian membunuh sebagian yang lain.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "167",
    "matchingArabicURN": "1141470",
    "last_updated": null
  },
  {
    "indonesianURN": "3239161",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3916",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdullah Al Mubarak, ia berkata; telah menceritakan kepada kami Al Aswad bin 'Amir, ia berkata; telah menceritakan kepada kami Israil dari Simak dari An Nu'man bin Basyir, ia berkata; kami bersama Nabi shallallahu 'alaihi wasallam lalu datanglah seseorang dan ia membisikkan sesuatu kepada beliau, kemudian beliau bersabda: \" Bunuhlah dia, \" lalu beliau bersabda: \" Apakah ia bersaksi bahwa tiada Tuhan yang berhak disembah kecuali Allah, \" ia menjawab; ya, tapi ia mengatakannya karena mencari perlindungan, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \" Janganlah engkau membunuhnya, karena saya diperintahkan untuk memerangi manusia hingga mereka mengucapkan LAA ILAAHA ILLALLAAH, apabila mereka mengucapkannya maka mereka telah melindungi darah dan harta mereka dariku kecuali dengan haknya dan perhitungannya kepada Allah 'azza wajalla.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "1139940",
    "last_updated": null
  },
  {
    "indonesianURN": "3239163",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3916",
    "hadithText": "Ubaidillah berkata; telah menceritakan kepada kami Israil dari Simak dari An Nu'man bin Salim dari seseorang yang menceritakan kepadanya, ia berkata; Rasulullah shallallahu 'alaihi wasallam menemui kami yang sedang berada di dalam kemah dimasjid Madinah, beliau bersabda didalamnya: \" Telah diwahyukan kepadaku agar aku memerangi manusia hingga mereka mengatakan bahwa tidak ada Tuhan yang berhak disembah selain Allah, \" yang sama dengan hadits tersebut.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "1139950",
    "last_updated": null
  },
  {
    "indonesianURN": "3239164",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1744",
    "babName": "BAB",
    "hadithNumber": "3916",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman ia berkata; telah menceritakan kepada kami Al Hasan bin Muhammad bin A'yan, ia berkata; telah menceritakan kepada kami Zuhair, ia berkata; telah menceritakan kepada kami Simak dari Nu'man bin Salim, ia berkata; saya mendengar Aus berkata; Rasulullah shallallahu 'alaihi wasallam menemui kami ketika kami berada didalam kemah dimasjid... Dan ia menyebutkan hadits tersebut.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "1139960",
    "last_updated": null
  },
  {
    "indonesianURN": "3239521",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1748",
    "babName": "Yang menjadikan darah muslim boleh ditumpahkan",
    "hadithNumber": "3952",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Yahya, ia berkata; telah menceritakan kepada kami Sufyan, ia berkata; telah menceritakan kepada kami Abu Ishaq dari 'Amr bin Ghalib, ia berkata; Aisyah berkata; tidakkah engkau mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal darah seorang muslim kecuali seorang laki-laki yang berzina setelah menikah, atau kafir setelah masuk Islam, serta membunuh jiwa.\" Hadits tersebut dimauqufkan oleh Zuhair.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "52",
    "matchingArabicURN": "1140320",
    "last_updated": null
  },
  {
    "indonesianURN": "3239522",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1748",
    "babName": "Yang menjadikan darah muslim boleh ditumpahkan",
    "hadithNumber": "3952",
    "hadithText": "Telah mengabarkan kepada kami Hilal bin Al 'Ala`, ia berkata; telah menceritakan kepada kami Husain berkata; telah menceritakan kepada kami Zuhair, ia berkata; telah menceritakan kepada kami Abu Ishaq dari 'Amr bin Ghalib, ia berkata; Aisyah berkata; wahai Ammar, tidakkah engkau mengetahui bahwa tidak halal darah seseorang kecuali karena tiga perkara, yaitu: membunuh jiwa, atau seseorang yang berzina setelah menikah.. dan ia menyebutkan hadits.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "53",
    "matchingArabicURN": "1140330",
    "last_updated": null
  },
  {
    "indonesianURN": "3239591",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1750",
    "babName": "Tafsiran ayat ",
    "hadithNumber": "3959",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Utsman bin Sa'id bin Katsir bin Dinar dari Al Walid dari Al Auza'i dari Yahya dari Abu Qilabah dari Anas bahwa beberapa orang dari 'ukl datang kepada Nabi shallallahu 'alaihi wasallam kemudian mereka terkena penyakit paru-paru di Madinah. Lalu Nabi shallallahu 'alaihi wasallam memerintahkan mereka agar mendatangi unta shadaqah, dan meminum sebagian kencingnya, serta susunya. Kemudian mereka melakukannya dan membunuh orang yang menggembalanya serta menggiring unta tersebut. Maka Rasulullah shallallahu 'alaihi wasallam mengirimkan utusan untuk mencari mereka. Anas berkata; kemudian mereka dihadapkan kepada beliau. Lalu beliau memotong tangan dan kaki mereka serta mencungkil mata mereka, tidak memenggal mereka dan beliau meninggalkan mereka hingga mati. Kemudian Allah 'azza wajalla menurunkan ayat: Sesungguhnya pembalasan terhadap orang-orang yang memerangi Allah dan Rasul-Nya hingga akhir Ayat.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "60",
    "matchingArabicURN": "1140400",
    "last_updated": null
  },
  {
    "indonesianURN": "3239592",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1750",
    "babName": "Tafsiran ayat ",
    "hadithNumber": "3959",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Manshur, ia berkata; telah menceritakan kepada kami Muhammad bin Yusuf, ia berkata; telah menceritakan kepada kami Al Auza'i, ia berkata; telah menceritakan kepadaku Yahya bin Abu Katsir, ia berkata; telah menceritakan kepadaku Abu Qilabah dari Anas, ia berkata; telah datang kepada Rasulullah shallallahu 'alaihi wasallam delapan orang dari 'ukl.. kemudian ia menyebutkan hadits sama seperti itu hingga perkataannya tidak memenggal mereka. Dan ia berkata; mereka telah membunuh penggembala tersebut.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "61",
    "matchingArabicURN": "1140410",
    "last_updated": null
  },
  {
    "indonesianURN": "3239651",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1751",
    "babName": "Perbedaan pengutip berita Humaid dari Anas bin Malik",
    "hadithNumber": "3965",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la, ia berkata; telah menceritakan kepada kami Yazid yaitu Ibnu Zurai', ia berkata; telah menceritakan kepada kami Syu'bah, ia berkata; telah menceritakan kepada kami Qatadah bahwa Anas bin Malik telah menceritakan kepada mereka bahwa beberapa orang atau laki-laki dari 'Ukl atau 'Urainah datang kepada Rasulullah shallallahu 'alaihi wasallam, dan berkata; wahai Rasulullah, sesungguhnya kami adalah para pemilik hewan ternak bukan pemilik tanaman. Dan mereka tidak cocok tinggal di Madinah. Kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan mereka agar datang kepada unta dan memerintahkan mereka agar keluar dan meminum sebagian susu dan kencingnya. Kemudian setelah mereka sembuh dan berada di pinggir daerah Al Harrah mereka kafir setelah masuk Islam, dan membunuh penggembala Rasulullah shallallahu 'alaihi wasallam dan menggiring unta tersebut. Kemudian beliau meningirimkan utusan untuk mengejar mereka, hingga mereka dapat didatangkan, kemudian beliau mencongkel mata mereka dan memotong tangan serta kaki mereka kemudian meninggalkan mereka di daerah Al Harrah dalam keadaan mereka hingga mati.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "67",
    "matchingArabicURN": "1140470",
    "last_updated": null
  },
  {
    "indonesianURN": "3239652",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1751",
    "babName": "Perbedaan pengutip berita Humaid dari Anas bin Malik",
    "hadithNumber": "3965",
    "hadithText": "Muhammad bin Al Mutsanna telah mengabarkan kepada kami seperti itu dari Abdul A'la.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "68",
    "matchingArabicURN": "1140480",
    "last_updated": null
  },
  {
    "indonesianURN": "3240291",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1769",
    "babName": "Yang menghunuskan pedang lantas mengayunkan ke tengah-tengah manusia",
    "hadithNumber": "4029",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah memberitakan kepada kami Al Fadhl bin Musa, ia berkata; telah menceritakan kepada kami Ma'mar dari Ibnu Thawus dari ayahnya dari Ibnu Az zubair dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa yang memperlihatkan pedangnya lalu ia meletakkannya maka darahnya sia-sia.\"</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "132",
    "matchingArabicURN": "1141120",
    "last_updated": null
  },
  {
    "indonesianURN": "3240292",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "37",
    "bookName": "Kesucian darah",
    "babNumber": "1769",
    "babName": "Yang menghunuskan pedang lantas mengayunkan ke tengah-tengah manusia",
    "hadithNumber": "4029",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah memberitakan kepada kami Abdur Razzaq dengan sanad seperti ini namun ia tidak memarfu'kannya.</b>",
    "bookID": "37.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "133",
    "matchingArabicURN": "1141130",
    "last_updated": null
  }
]