[
  {
    "indonesianURN": "3240640",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "38",
    "bookName": "Pembagian fai\"",
    "babNumber": "1773",
    "babName": "BAB",
    "hadithNumber": "4064",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Abdullah Al Hammal, ia berkata; telah menceritakan kepada kami Utsman bin Umar dari Yunus bin Yazid dari Az Zuhri dari Yazid bin Hurmuz bahwa Najdah Al Haruri ketika ia keluar di saat terjadi fitnah mengenai Ibnu Az Zubair mengirimkan utusan kepada Ibnu Abbas bertanya kepadanya mengenai saham kaum kerabat, untuk siapakah saham tersebut? Ia berkata; saham tersebut untuk kami, untuk kerabat Rasulullah shallallahu 'alaihi wasallam. Rasulullah shallallahu 'alaihi wasallam telah membaginya untuk mereka, Umar pernah menawarkan kepada kami sesuatu yang kami lihat bukan sebagai hak kami, kemudian kami menolak untuk menerimanya. Dan sesuatu yang ia tawarkan kepada mereka adalah ia membantu orang yang menikah diantara mereka, dan membayar hutang orang yang berhutang diantara mereka, memberikan kepada orang fakir diantara mereka. Dan ia menolak untuk memberikan tambahan kepada mereka melebihi hal itu.</b>",
    "bookID": "38.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "1141480",
    "last_updated": null
  },
  {
    "indonesianURN": "3240650",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "38",
    "bookName": "Pembagian fai\"",
    "babNumber": "1773",
    "babName": "BAB",
    "hadithNumber": "4065",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Yazid yaitu Ibnu Harun, ia berkata; telah memberitakan kepada kami Muhammad bin Ishaq dari Az Zuhri dan Muhammad bin Ali dari Yazid bin Hurmuz, ia berkata; Najdah menulis surat kepada Ibnu Abbas bertanya mengenai saham kaum kerabat, untuk siapakah saham tersebut? Yazid bin Hurmuz berkata; dan saya yang menulis surat Ibnu Abbas kepada Najdah. Ia berkata; saya menulis kepadanya; engkau telah menulis surat kepadaku menanyakan mengenai saham kaum kerabat, untuk siapa saham tersebut? Saham tersebut untuk kami ahli bait. Dahulu Umar mengajak kami agar ia menikahkan janda kami dan memberi sebagian rampasan perang kepada orang miskin kami, serta membayar hutang orang yang memberi hutang diantara kami, kemudian kami menolak kecuali ia menyerahkannya kepada kami. Namun ia menolak sehingga kami meninggalkannya seperti itu.</b>",
    "bookID": "38.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "1141490",
    "last_updated": null
  },
  {
    "indonesianURN": "3240660",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "38",
    "bookName": "Pembagian fai\"",
    "babNumber": "1773",
    "babName": "BAB",
    "hadithNumber": "4066",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Yahya, ia berkata; telah menceritakan kepada kami Mahbub yaitu Ibnu Musa, ia berkata; telah memberitakan kepada kami Abu Ishaq yaitu Al Fazari dari Al Auza'I, ia berkata; Umar bin Abdul Aziz mengirim surat kepada Umar bin Walid yang isinya adalah: dan pembagian ayahmu kepadamu seperlima seluruhnya, sesungguhnya bagian ayahmu seperti bagian seseorang dari kaum muslimin dan didalamnya ada haq Allah dan haq rasul, kaum kerabat, anak-anak yatim, orang-orang miskin, dan Ibn Sabil, maka betapa banyak penuntut ayahmu pada hari kiamat kelak, dan bagaimana ia bisa selamat orang yang banyak penututnya, dan engkau menampakkan alat musik dan seruling adalah bid'ah didalam Islam dan sungguh aku ingin mengirim seseorang kepadamu untuk memotong rambutmu yaitu rambut yang buruk.</b>",
    "bookID": "38.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "1141500",
    "last_updated": null
  },
  {
    "indonesianURN": "3240670",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "38",
    "bookName": "Pembagian fai\"",
    "babNumber": "1773",
    "babName": "BAB",
    "hadithNumber": "4067",
    "hadithText": "Telah mengabarkan kepada kami Abdurrahman bin Abdullah bin Abdul Hakam, ia berkata; telah menceritakan kepada kami Syu'aib bin Yahya, ia berkata; telah menceritakan kepada kami Nafi' bin Yazid dari Yunus bin Yazid dari Ibnu Syihab, ia berkata; telah mengabarkan kepadaku Sa'id bin Al Musayyab bahwa Jubair bin Muth'im telah menceritakan kepadanya bahwa ia dan Utsman datang kepada Rasulullah shallallahu 'alaihi wasallam berbicara kepadanya mengenai apa yang beliau bagikan dari seperlima bagian pada perang Hunain antara Bani Hasyim dan Bani Al Muththalib bin abdu Manaf. Mereka berkata; wahai Rasulullah, engkau telah membagi untuk saudara-saudara kami yaitu Bani Al Muththalib bin Abdu Manaf dan tidak memberikan kepada kami sedikitpun, sedangkan kerabat kami seperti kerabat mereka. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepada mereka: \"Sesungguhnya saya melihat Hasyim dan Al Muththalib sebagai sesuatu yang satu.\" Jubair berkata; Rasulullah shallallahu 'alaihi wasallam tidak memberikan bagian untuk Bani Abdu Syams dan Bani Naufal dari seperlima tersebut sedikitpun sebagaimana beliau membagi untuk Hasyim dan Bani Al Muththalib.</b>",
    "bookID": "38.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "1141510",
    "last_updated": null
  },
  {
    "indonesianURN": "3240680",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "38",
    "bookName": "Pembagian fai\"",
    "babNumber": "1773",
    "babName": "BAB",
    "hadithNumber": "4068",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna, ia berkata; telah menceritakan kepada kami Yazid bin Harun, ia berkata; telah memberitakan kepada kami Muhammad bin Ishaq dari Az Zuhri dari Sa'id bin Al Musayyab dari Jubair bin Muth'im, ia berkata; tatkala Rasulullah shallallahu 'alaihi wasallam membagi saham para kerabat antara Bani Hasyim dan Bani Al Muththalib, saya datang kepada beliau bersama Utsman bin Affan. Kami berkata; wahai Rasulullah, mereka orang-orang Bani Hasyim, kami tidak mengingkari keutamaan mereka karena posisimu yang Allah telah menjadikan dirimu yang telah Allah berikan kepadamu diantara mereka. Bagaimana pendapat anda mengenai Bani Al Muththalib, anda telah memberikan kepada mereka dan menahan kami, sesungguhnya kami dan mereka adalah satu tingkat di sisimu. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya mereka tidak meningalkan aku baik pada masa jahiliyah maupun Islam. Sesungguhnya Bani Hasyim dan Bani Al Muththalib adalah sesuatu yang satu.\" Dan beliau menjalin antara jari-jari tangannya.</b>",
    "bookID": "38.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "1141520",
    "last_updated": null
  },
  {
    "indonesianURN": "3240690",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "38",
    "bookName": "Pembagian fai\"",
    "babNumber": "1773",
    "babName": "BAB",
    "hadithNumber": "4069",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Yahya bin Al Harits, ia berkata; telah menceritakan kepada kami Mahbub yaitu Ibnu Musa, ia berkata; telah memberitakan kepada kami Abu Ishaq yaitu Al Fazari dari Abdurrahman bin 'Ayyasy dari Sulaiman bin Musa dari Makhul dari Abu Sallam dari Abu Umamah Al Bahili dari 'Ubadah bin Ash Shamit, ia berkata; Rasulullah shallallahu 'alaihi wasallam usai perang Hunain mengambil bulu di samping unta dan bersabda: \"wahai sekalian manusia, sesungguhnya tidak halal bagiku dari apa yang Allah berikan kepada kalian sebanyak rambut ini kecuali hanya seperlima, dan seperlima akan dikembalikan kepada kalian, \" Abu Abdurrahman berkata nama Abi Salam adalah Mamthur ia orang Habasyah dan nama Abu Umamah adalah Shudai bin 'Ajlan, wallahu ta'ala a'lam.</b>",
    "bookID": "38.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "1141530",
    "last_updated": null
  },
  {
    "indonesianURN": "3240700",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "38",
    "bookName": "Pembagian fai\"",
    "babNumber": "1773",
    "babName": "BAB",
    "hadithNumber": "4070",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Yazid, ia berkata; telah menceritakan kepada kami Ibnu Abi 'Adi, ia berkata; telah menceritakan kepada kami Hammad bin Salamah dari Muhammad bin Ishaq dari 'Amr bin Syu'aib dari ayahnya dari kakeknya bahwa Rasulullah shallallahu 'alaihi wasallam mendatangi seekor onta kemudian mengambil bulu dari punuknya diantara dua jarinya, kemudian bersabda: \"Sesungguhnya tidak ada sesutupun dari harta fai` ini untukku, dan tidak pula bulu ini kecuali seperlima dan seperlima dikembalikan kepada kalian.\"</b>",
    "bookID": "38.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "1141540",
    "last_updated": null
  },
  {
    "indonesianURN": "3240710",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "38",
    "bookName": "Pembagian fai\"",
    "babNumber": "1773",
    "babName": "BAB",
    "hadithNumber": "4071",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaid bin Sa'id, ia berkata; telah menceritakan kepada kami Sufyan dari 'Amr yaitu Ibnu Dinar dari Az Zuhri dari Malik bin Aus bin Al Hadatsan dari Umar, ia berkata; harta Bani Nadhir diantara yang diberikan Allah kepada RasulullahNya dari sesuatu yang tanpa pengerahan kuda dan unta oleh orang-orang muslim. Beliau menafkahi dirinya dari harta tersebut sebagai makanan satu tahun, dan sisanya beliau salurkan kepada kuda dan senjata sebagai perlengkapan di jalan Allah.</b>",
    "bookID": "38.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "1141550",
    "last_updated": null
  },
  {
    "indonesianURN": "3240720",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "38",
    "bookName": "Pembagian fai\"",
    "babNumber": "1773",
    "babName": "BAB",
    "hadithNumber": "4072",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Yahya bin Al Harits, ia berkata; telah menceritakan kepada kami Mahbub yaitu Ibnu Musa, Ia berkata; telah memberitakan kepada kami Abu Ishaq yaitu Al Fazari dari Syu'aib bin Abu Hamzah dari Az Zuhri dari 'Urwah bin Az Zubair dari Aisyah bahwa Fathimah mengirim surat kepada Abu Bakar menanyakan warisannya kepada Nabi shallallahu 'alaihi wasallam dari nafkahnya dan sebagian dari apa yang beliau tinggalkan dari bagian seperlima dari Khaibar. Abu Bakar berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kami tidak diwarisi.\"</b>",
    "bookID": "38.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "1141560",
    "last_updated": null
  },
  {
    "indonesianURN": "3240730",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "38",
    "bookName": "Pembagian fai\"",
    "babNumber": "1773",
    "babName": "BAB",
    "hadithNumber": "4073",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Yahya, ia berkata; telah menceritakan kepada kami Mahbub, ia berkata; telah memberitakan kepada kami Abu Ishaq dari Zaidah dari Abdul Malik bin Abu Sulaiman dari 'Atha` mengenai firman Allah \"azza wa jalla: Ketahuilah, sesungguhnya apa saja yang dapat kamu peroleh sebagai rampasan perang, maka sesungguhnya seperlima untuk Allah, Rasul, kerabat Rasul. Ia berkata; seperlima untuk Allah dan rasulNya adalah satu, dulu Rasulullah shallallahu 'alaihi wasallam membawa darinya, memberi darinya dan meletakkannya dimana beliau mau dan berbuat dengannya apa yang beliau mau.</b>",
    "bookID": "38.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "1141570",
    "last_updated": null
  },
  {
    "indonesianURN": "3240740",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "38",
    "bookName": "Pembagian fai\"",
    "babNumber": "1773",
    "babName": "BAB",
    "hadithNumber": "4074",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Yahya bin Al Harits, ia berkata; telah menceritakan kepada kami Mahbub yaitu Ibnu Musa, ia berkata; telah memberitakan kepada kami Abu Ishaq yaitu Al Fazari dari Sufyan dari Qais bin Muslim, ia berkata; saya bertanya kepada Al Hasan bin Muhammad mengenai firman Allah Azza wa jalla: Ketahuilah, sesungguhnya apa saja yang dapat kamu peroleh sebagai rampasan perang, maka sesungguhnya seperlima untuk Allah, ia berkata ini adalah kunci firman Allah, dunia dan akhirat adalah milik Allah. Ia berkata; mereka berselisih mengenai kedua saham ini setelah wafatnya Rasulullah shallallahu 'alaihi wasallam, yaitu saham rasul dan saham kerabat beliau, seseorang berkata; saham Rasulullah shallallahu 'alaihi wasallam adalah untuk khalifah setelah beliau, seseorang berkata; saham kaum kerabat adalah untuk kerabat Rasulullah shallallahu 'alaihi wasallam dan seseorang berkata; saham kaum kerabat adalah untuk kerabat khalifah, kemudian pendapat mereka bersepakat untuk menajadikan dua saham ini untuk kuda dan perlengkapan perang di jalan Allah, kedua hal itu terjadi pada masa Abu Bakar dan Umar.</b>",
    "bookID": "38.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "1141580",
    "last_updated": null
  },
  {
    "indonesianURN": "3240750",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "38",
    "bookName": "Pembagian fai\"",
    "babNumber": "1773",
    "babName": "BAB",
    "hadithNumber": "4075",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Yahya bin Al Harits, ia berkata; telah menceritakan kepada kami Mahbub, ia berkata; telah memberitakan kepada kami Abu Ishaq dari Musa bin Abu 'Aisyah ia berkata; saya bertanya kepada Yahya bin Al Jazzar tentang ayat ini: Ketahuilah, sesungguhnya apa saja yang dapat kamu peroleh sebagai rampasan perang, maka sesungguhnya seperlima untuk Allah, Rasul, kerabat Rasul. Ia berkata aku berkata; berapa jatah untuk Nabi shallallahu 'alaihi wasallam dari seperlima itu? Ia menjawab seperlima dari seperlima.</b>",
    "bookID": "38.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "1141590",
    "last_updated": null
  },
  {
    "indonesianURN": "3240760",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "38",
    "bookName": "Pembagian fai\"",
    "babNumber": "1773",
    "babName": "BAB",
    "hadithNumber": "4076",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Yahya bin Al Harits, ia berkata; telah menceritakan kepada kami Mahbub, ia berkata; telah memberitakan kepada kami Abu Ishaq dari Mutharrif ia berkata; Asy Sya'bi ditanya mengenai saham Nabi shallallahu 'alaihi wasallam dan pilihan beliau, ia menjawab adapun saham Nabi shallallahu 'alaihi wasallam seperti jatah seorang dari kaum muslimin dan harta pilihannya adalah budak yang dipilih sesuai keinginannya.</b>",
    "bookID": "38.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "1141600",
    "last_updated": null
  },
  {
    "indonesianURN": "3240770",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "38",
    "bookName": "Pembagian fai\"",
    "babNumber": "1773",
    "babName": "BAB",
    "hadithNumber": "4077",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Yahya, ia berkata; telah menceritakan kepada kami Mahbub, ia berkata; telah memberitakan kepada kami Abu Ishaq dari Sa'id Al Jurairi dari Yazid bin Syikhir ia berkata; ketika saya bersama Mutharrif di tempat dikumpulkannya kurma tiba-tiba datanglah seseorang yang membawa potongan kulit, ia berkata Rasulullah shallallahu 'alaihi wasallam menuliskan ini untukku, adakah diantara kalian yang bisa membaca, saya menjawab; saya bisa membaca, ternyata didalamnya: \"dari Muhammad seorang Nabi shallallahu 'alaihi wasallam untuk Bani Zuhair bin Aqaisy bahwa jika mereka bersaksi bahwa tiada Tuhan yang berhak disembah kecuali hanya Allah dan Muhammad adalah Rasulullah dan mereka meninggalkan orang-orang musyrik, dan menetapkan seperlima pada harta rampasan mereka dan saham Nabi shallallahu 'alaihi wasallam serta pilihannya maka sesungguhnya mereka aman dengan keamanan dari Allah dan RasulNya.\"</b>",
    "bookID": "38.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "1141610",
    "last_updated": null
  },
  {
    "indonesianURN": "3240780",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "38",
    "bookName": "Pembagian fai\"",
    "babNumber": "1773",
    "babName": "BAB",
    "hadithNumber": "4078",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Yahya bin Al Harits, ia berkata; telah memberitakan kepada kami Mahbub, ia berkata; telah memberitakan kepada kami Abu Ishaq dari Syarik dari Khushaif dari Mujahid ia berkata; seperlima yang untuk Allah dan Rasul, adalah untuk Nabi shallallahu 'alaihi wasallam dan kerabatnya mereka tidak memakan harta sedekah sedikitpun. Maka untuk Nabi shallallahu 'alaihi wasallam seperlima dari seperlima dan untuk keluarganya seperlima dari seperlima, untuk anak-anak yatim seperti itu, untuk orang-orang miskin seperti itu, dan untuk Ibn sabil seperti itu, Abu Abdurrahman berkata; Allah: Ketahuilah, sesungguhnya apa saja yang dapat kamu peroleh sebagai rampasan perang, maka sesungguhnya seperlima untuk Allah, Rasul, kerabat Rasul, anak-anak yatim, orang-orang miskin dan ibnussabil dan firmanNya Azza wa jalla untuk Allah adalah permulaan perkataan karena segala sesuatu adalah milik Allah Azza wa jalla dan barangkali firman tentang Fai` dan seperlima ini dimulai dengan penyebutan diriNya karena hal itu adalah sebaik-mata pencaharian dan Allah tidak menisbatkan sedekah kepada diriNya Azza wa jalla karena ia adalah kotoran manusia, wallahua'lam, dan dikatakan bahwa dari harta rampasan itu diambil sedikit kemudian diperuntukkan untuk Ka'bah dan itulah bagian untuk Allah sedangkan saham untuk Nabi shallallahu 'alaihi wasallam diberikan kepada seorang pemimpin ia membeli hewan tunggangan dan senjata serta ia memberikan darinya siapa saja yang ia pandang membutuhkan dan bermanfaat bagi orang Islam, atau ahli hadits, ilmu, fiqh dan Al Qur'an, adapun saham untuk kerabat beliau, yaitu Bani Hasyim dan AbdUl Muththalib diantara mereka yang kaya dan fakir, dan dikatakan bahwa saham itu hanya untuk yang fakir saja tanpa orang-orang kaya, seperti anak yatim dan Ibn Sabil dan itu adalah perkataan yang paling mendekati kebenaran menurutku wallahu Ta'ala a'lam. Anak kecil, orang dewasa, laki-laki maupun perempuan sama karena Allah Azza wa jalla memberikan hal itu untuk mereka, dan Rasulullah shallallahu 'alaihi wasallam membaginya diantara mereka, tidak disebutkan dalam hadits bahwa beliau beliau mengutamakan yang lain diatas sebagian yang lain, tidak ada perselisihan yang kami ketahui dari para Ulama mengenai seseorang apabila ia mewasiatkan sepertiga hartanya untuk Bani Fulan bahwa harta tersebut dibagi diantara mereka dan untuk laki-laki serta perempuan mendapatkan bagian yang sama, demikian juga jika keseluruhan diberikan kepada Bani Fulan maka mereka mendapatkan jatah yang sama, kecuali jika orang yang memerintahkan menjelaskan hal tersebut. Dan satu bagian untuk anak-anak yatim dari kaum muslimin, satu bagian untuk orang-orang miskin dari kaum muslimin, satu bagian untuk Ibn Sabil dari kaum muslimin, dan tidak seorang dari mereka yang diberi saham orang miskin atau Ibn sabil dan dikatakan kepadanya; ambillah mana yang engkau inginkan, sedangkan empat perlima bagian dibagi oleh imam diantara orang yang mengikuti perang yang sudah baligh.</b>",
    "bookID": "38.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "1141620",
    "last_updated": null
  },
  {
    "indonesianURN": "3240790",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "38",
    "bookName": "Pembagian fai\"",
    "babNumber": "1773",
    "babName": "BAB",
    "hadithNumber": "4079",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr, ia berkata; telah menceritakan kepada kami Isma'il yaitu Ibnu Ibrahim dari Ayyub dari Ikrimah bin Khalid dari Malik bin Aus bin Al Hadatsan, ia berkata; telah datang Al Abbas dan Ali kepada Umar, mereka sedang berselisih. Al Abbas berkata; putuskan antara diriku dan orang ini. Kemudian orang-orang berkata; putuskan antara mereka berdua! Kemudian Umar berkata; saya tidak akan memutuskan diantara mereka, sungguh mereka telah mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam berkata; kami tidak diwarisi, apa yang kami tinggalkan adalah sedekah. Aus berkata; Az Zuhri berkata; Rasulullah shallallahu 'alaihi wasallam mengurusinya maka beliau mengambil darinya makan untuk keluarganya dan menjadikan penyaluran selebihnya adalah penyaluran harta. Kemudian diurusi oleh Abu Bakar setelahnya kemudian saya yang diminta untuk mengurusinya setelah Abu Bakar dan saya melakukan apa yang ia lakukan, kemudian mereka berdua datang kepadaku dan memintaku untuk menyerahkannya kepada mereka berdua agar mereka yang mengurusinya sebagaimana Rasulullah shallallahu 'alaihi wasallam mengurusinya serta sebagaimana Abu Bakar mengurusinya serta yang saya urusi. Kemudian saya menyerahkannya kepada mereka berdua dan saya mengambil janji dari mereka. Kemudian mereka datang kepadaku, yang ini mengatakan; bagikan untukku bagiku dari saudaraku, dan yang ini mengatakan; bagikan untukku bagiku dari isteriku. Apabila mereka berdua ingin agar saya menyerahkannya kepada mereka agar mereka mengurusinya sebagaimana Rasulullah shallallahu 'alaihi wasallam mengurusi dan sebagaimana Abu Bakar mengurusi serta sebagaimana saya mengurusi maka saya akan menyerahkannya kepada mereka, dan jika mereka menolak maka cukuplah hal tersebut bagi mereka. Kemudian ia berkata; \"Ketahuilah, sesungguhnya apa saja yang dapat kamu peroleh sebagai rampasan perang, maka sesungguhnya seperlima untuk Allah, Rasul, kerabat Rasul, anak-anak yatim, orang-orang miskin dan ibnussabil. Ini untuk mereka, Sesungguhnya zakat-zakat itu, hanyalah untuk orang-orang fakir, orang-orang miskin, pengurus-pengurus zakat, para mu'allaf yang dibujuk hatinya, untuk (memerdekakan) budak, orang-orang yang berhutang, untuk jalan Allah dan untuk mereka yuang sedang dalam perjalanan dan ini untuk mereka. Dan apa saja harta rampasan (fai-i) yang diberikan Allah kepada RasulNya (dari harta benda) mereka, maka untuk mendapatkan itu kamu tidak mengerahkan seekor kudapun dan (tidak pula) seekor untapun.\" Az Zuhri mengatakan; ini adalah untuk Rasulullah shallallahu 'alaihi wasallam secara khusus kampung-kampung Arab, tempat ini dan tempat ini.\"Apa saja harta rampasan (fai-i) yang diberikan Allah kepada RasulNya (dari harta benda) yang berasal dari penduduk kota-kota maka adalah untuk Allah, untuk Rasul, kaum kerabat, anak-anak yatim, orang-orang miskin dan orang-orang yang dalam perjalanan.\" \"Bagi orang fakir yang berhijrah yang diusir dari kampung halaman dan dari harta benda mereka.\" \"Dan orang-orang yang telah menempati kota Madinah dan telah beriman (Anshor) sebelum (kedatangan) mereka (Muhajirin).\" \"Dan orang-orang yang datang sesudah mereka (Muhajirin dan Anshor).\" Ayat ini mencakup seluruh manusia tidak tertinggal seorang muslimpun melainkan ia memiliki hak dalam harta ini, kecuali sebagian apa yang kalian miliki berupa budak-budak kalian. Sungguh seandainya saya hidup insya Allah niscaya akan datang kepada setiap muslim haknya.</b>",
    "bookID": "38.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "1141630",
    "last_updated": null
  }
]