[
  {
    "indonesianURN": "3241410",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Aqiqah",
    "babNumber": "1813",
    "babName": "BAB",
    "hadithNumber": "4141",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman, ia berkata; telah menceritakan kepada kami Abu Nu'aim, ia berkata; telah menceritakan kepada kami Daud bin Qais dari 'Amr bin Syu'aib dari ayahnya dari kakeknya, ia berkata; Rasulullah shallallahu 'alaihi wasallam ditanya mengenai aqiqah, kemudian beliau bersabda: \"Sesungguhnya Allah 'azza wajalla membenci sifat durhaka.\" Sepertinya beliau membenci nama tersebut. Orang yang bertanya mengatakan; sesungguhnya kami bertanya kepadamu mengenai seseorang diantara kami terlahirkan anaknya. beliau bersabda: \"Barang siapa yang ingin menyembelih untuk anaknya maka hendaknya ia menyembelih untuknya, untuk anak laki-laki dua kambing dan untuk anak wanita satu kambing.\" Abu Daud berkata; saya bertanya kepada Zaid bin Aslam mengenai kata mukaafa ataani, ia berkata; dua kambing yang sama dan disembelih bersama.</b>",
    "bookID": "40.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "1142270",
    "last_updated": null
  },
  {
    "indonesianURN": "3241420",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Aqiqah",
    "babNumber": "1813",
    "babName": "BAB",
    "hadithNumber": "4142",
    "hadithText": "Telah mengabarkan kepada kami Al Husain bin Huraits, ia berkata; telah menceritakan kepada kami Al Fadhl dari Al Husain bin Waqid dari Abdullah bin Buraidah dari ayahnya bahwa Rasulullah shallallahu 'alaihi wasallam melakukan aqiqah untuk Al Hasan dan Al Husain.</b>",
    "bookID": "40.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "1142280",
    "last_updated": null
  },
  {
    "indonesianURN": "3241430",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Aqiqah",
    "babNumber": "1814",
    "babName": "Aqiqah bayi",
    "hadithNumber": "4143",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna, ia berkata; telah menceritakan kepada kami Affan, ia berkata; telah menceritakan kepada kami Hammad bin Salamah, ia berkata; telah menceritakan kepada kami Ayyub dan Habib dan Yunus serta Qatadah dari Muhammad bin Sirin dari Salman bin 'Amir Adh Dhabbi bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Untuk anak laki-laki terdapat aqiqah maka alirkanlah darah dan hilangkanlah darinya gangguan.\"</b>",
    "bookID": "40.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "1142290",
    "last_updated": null
  },
  {
    "indonesianURN": "3241440",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Aqiqah",
    "babNumber": "1814",
    "babName": "Aqiqah bayi",
    "hadithNumber": "4144",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman, ia berkata; telah menceritakan kepada kami 'Affan, ia berkata; telah menceritakan kepada kami Hammad dari Qais bin Sa'd dari 'Atho` dan Thawus serta Mujahid dari Ummi Kurz bahwa Rasulullah shallallahu 'alaihi wasallam bersabda mengenai aqiqah seorang anak laki-laki: \"Dua ekor kambing yang sama, sedang untuk seorang anak perempuan adalah seekor kambing.\"</b>",
    "bookID": "40.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "1142300",
    "last_updated": null
  },
  {
    "indonesianURN": "3241450",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Aqiqah",
    "babNumber": "1815",
    "babName": "Aqiqah bayi perempuan",
    "hadithNumber": "4145",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id, ia berkata; telah menceritakan kepada kami Sufyan, ia berkata; 'Amr berkata dari 'Atho` dari Habibah binti Maisarah dari Ummu Kurz bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Untuk anak laki-laki dua ekor kambing yang sama, dan untuk anak wanita satu kambing.\"</b>",
    "bookID": "40.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "1142310",
    "last_updated": null
  },
  {
    "indonesianURN": "3241460",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Aqiqah",
    "babNumber": "1816",
    "babName": "Berapa kambing untuk bayi perempuan?",
    "hadithNumber": "4146",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Sufyan dari 'Ubaidullah yaitu Ibnu Abu Yazid dari Siba' bin Tsabit dari Ummu Kurz, ia berkata; saya datang kepada Nabi shallallahu 'alaihi wasallam di Hudaibiyah bertanya kepadanya mengenai daging hewan kurban, saya mendengar beliau bersabda: \"Untuk anak laki-laki dua kambing dan anak wanita satu kambing, tidak masalah atas kalian apakah kambing tersebut jantan atau betina.\"</b>",
    "bookID": "40.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "1142320",
    "last_updated": null
  },
  {
    "indonesianURN": "3241470",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Aqiqah",
    "babNumber": "1816",
    "babName": "Berapa kambing untuk bayi perempuan?",
    "hadithNumber": "4147",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Yahya, ia berkata; telah menceritakan kepada kami Ibnu Juraij, ia berkata; telah menceritakan kepadaku 'Ubaidullah bin Abu Yazid dari Siba' bin Tsabit dari Ummu Kurz bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Untuk anak laki-laki dua kambing dan untuk anak wanita satu kambing, tidak masalah atas kalian apakah kambing tersebut jantan atau betina.\"</b>",
    "bookID": "40.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "1142330",
    "last_updated": null
  },
  {
    "indonesianURN": "3241480",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Aqiqah",
    "babNumber": "1816",
    "babName": "Berapa kambing untuk bayi perempuan?",
    "hadithNumber": "4148",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Hafsh bin Abdullah, ia berkata; telah menceritakan kepadaku ayahku, ia berkata; telah menceritakan kepadaku Ibrahim yaitu Ibnu Thahman dari Al Hajjaj bin Al Hajjaj dari Qatadah dari Ikrimah dari Ibnu Abbas ia berkata; Rasulullah shallallahu 'alaihi wasallam melakukan aqiqah untuk Al Hasan dan Al Husain radliallahu 'anhuma dengan dua ekor kambing dua ekor kambing.</b>",
    "bookID": "40.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "1142340",
    "last_updated": null
  },
  {
    "indonesianURN": "3241491",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Aqiqah",
    "babNumber": "1817",
    "babName": "Kapan aqiqah?",
    "hadithNumber": "4149",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali dan Muhammad bin Abdul A'la, mereka berkata; telah menceritakan kepada kami Yazid yaitu Ibnu Zurai' dari Sa'id, telah memberitakan kepada kami Qatadah dari Al Hasan dari Samurah bin Jundub dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Setiap anak laki-laki tergadai dengan aqiqahnya, disembelihkan untuknya pada hari ketujuh dan dicukur kepalanya serta diberi nama.\"</b>",
    "bookID": "40.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "1142350",
    "last_updated": null
  },
  {
    "indonesianURN": "3241492",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "40",
    "bookName": "Aqiqah",
    "babNumber": "1817",
    "babName": "Kapan aqiqah?",
    "hadithNumber": "4149",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Abdullah, ia berkata; telah menceritakan kepada kami Quraisy bin Anas dari Habib bin Asy Syahid, telah berkata kepadaku Muhammad bin Sirin; tanyakan kepada Al Hasan dari manakah ia mendengar haditsnya mengenai aqiqah. Kemudian saya bertanya kepadanya mengenai hal tersebut, lalu ia berkata; saya mendengarnya dari Samurah.</b>",
    "bookID": "40.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "1142360",
    "last_updated": null
  }
]