[
  {
    "indonesianURN": "3242850",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1867",
    "babName": "BAB",
    "hadithNumber": "4285",
    "hadithText": "Telah mengabarkan kepada kami Sulaiman bin Salm Al Balkhi, ia berkata; telah menceritakan kepada kami An Nadhr yaitu Ibnu Syumail, ia berkata; telah memberitakan kepada kami Syu'bah dari Malik bin Anas dari Ibnu Muslim dari Sa'id bin Al Musayyab dari Ummu Salamah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barang siapa yang melihat bulan sabit Bulan Dzul Hijjah kemudian ia hendak berkorban maka janganlah ia mengambil sebagian dari rambutnya dan kukunya hingga ia menyembelihnya.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "1143760",
    "last_updated": null
  },
  {
    "indonesianURN": "3242860",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1867",
    "babName": "BAB",
    "hadithNumber": "4286",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Abdul Hakam dari Syu'aib, ia berkata; telah memberitakan kepada kami Al Laits, ia berkata; telah menceritakan kepada kami Khalid bin Yazid dari Ibnu Abu Hilal dari 'Amr bin Muslim bahwa ia berkata; telah mengabarkan kepadaku Ibnu Al Musayyab bahwa Ummu salamah isteri Nabi shallallahu 'alaihi wasallam telah mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang ingin bekorban maka janganlah ia memotong sebagian dari kukunya dan mencukur sebagian dari rambutnya pada sepuluh pertama bulan Dzul Hijjah.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "1143770",
    "last_updated": null
  },
  {
    "indonesianURN": "3242870",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1867",
    "babName": "BAB",
    "hadithNumber": "4287",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr, ia berkata; telah memberitakan kepada kami Syarik dari Utsman Al Ahlafi dari Said bin Al Musayyab ia berkata; barangsiapa yang ingin menyembelih lalu masuk sepuluh hari, maka janganlah ia memotong sebagian dari rambut atau kukunya. Lalu saya menceritakan hal itu kepada Ikrimah, ia menjawab, tidakkah ia menjauhi para wanita dan parfum.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "1143780",
    "last_updated": null
  },
  {
    "indonesianURN": "3242880",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1867",
    "babName": "BAB",
    "hadithNumber": "4288",
    "hadithText": "Telah mengabarkan kepada kami Abdullah bin Muhammad bin Abdurrahman, ia berkata; telah menceritakan kepada kami Sufyan, ia berkata; telah menceritakan kepadaku Abdurrahman bin Humaid bin Abdurrahman bin 'Auf dari Sa'id bin Al Musayyab dari Ummu Salamah, beliau bersabda: \"Apabila telah masuk sepuluh hari kemudian salah seorang diantara kalian ingin berkorban maka hendaknya ia tidak mengambil sebagian dari rambutnya dan sebagian dari kulitnya sedikitpun.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "1143790",
    "last_updated": null
  },
  {
    "indonesianURN": "3242890",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1868",
    "babName": "Yang tidak mendapat hewan sembelihan",
    "hadithNumber": "4289",
    "hadithText": "Telah mengabarkan kepada kami Yunus bin Abdul A'la, ia berkata; telah menceritakan kepada kami Ibnu Wahb, ia berkata; telah mengabarkan kepadaku Sa'id bin Abu Ayyub dan ia menyebutkan yang lainnya dari 'Ayyasy bin 'Ayyasy bin Abbas Al Qatbani dari Isa bin Hilal Ash Shadafi dari Abdullah bin 'Amr bin Al 'Ash bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepada seseorang: \"Aku diperintah untuk menjadikan hari qurban sebagai hari raya yang Allah Azza wa jalla jadikan untuk umat ini, \" lalu seseorang berkata; bagaimana pendapatmu jika aku tidak mendapatkan kecuali hewan betina untuk diambil susunya, apakah aku menyembelihnya, beliau bersabda: \"Tidak, tapi potonglah rambutmu, kukumu, kumismu dan bulu kemaluanmu maka itu adalah kesempurnaan kurbanmu disisi Allah Azza wa jalla.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "1143800",
    "last_updated": null
  },
  {
    "indonesianURN": "3242900",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1869",
    "babName": "Imam menyembelih sembelihan di tanah lapang",
    "hadithNumber": "4290",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Abdul Hakam dari Syu'aib dari Al Laits dari Katsir bin Farqad dari Nafi' bahwa Abdullah telah mengabarkannya bahwa Rasulullah shallallahu 'alaihi wasallam menyembelih di lapangan.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "1143810",
    "last_updated": null
  },
  {
    "indonesianURN": "3242910",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1869",
    "babName": "Imam menyembelih sembelihan di tanah lapang",
    "hadithNumber": "4291",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Utsman An Nufaili, ia berkata; telah menceritakan kepada kami Sa'id bin Isa, ia berkata; telah menceritakan kepada kami Al Mufadhdhal bin Fadhalah, ia berkata; telah menceritakan kepadaku Abdullah bin Sulaiman, ia berkata; telah menceritakan kepadaku, Nafi' dari Abdullah bin Umar bahwa Rasulullah shallallahu 'alaihi wasallam menyembelih pada hari raya kurban di Madinah. Al Mufadhdhal berkata; Rasulullah shallallahu 'alaihi wasallam apabila tidak melakukan nahr maka beliau menyembelih di lapangan.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "1143820",
    "last_updated": null
  },
  {
    "indonesianURN": "3242920",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1870",
    "babName": "Orang-orang menyembelih di tanah lapang",
    "hadithNumber": "4292",
    "hadithText": "Telah mengabarkan kepada kami Hannad bin As Sari dari Abu Al Ahwash dari Al Aswad bin Qais dari Jundub bin Sufyan, ia berkata; saya menyaksikan shalat idul adhha bersama Rasulullah shallallahu 'alaihi wasallam, beliau shalat bersama orang-orang, kemudian setelah menyelesai melakukan shalat beliau melihat seekor kambing yang disembelih. Lalu beliau bersabda: \"Barang siapa yang menyembelih sebelum shalat maka hendaknya ia menyembelih kambing sebagai gantinya dan barang siapa yang belum menyembelih maka hendaknya ia menyembelih dengan nama Allah 'azza wajalla.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "1143830",
    "last_updated": null
  },
  {
    "indonesianURN": "3242930",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1871",
    "babName": "Larangan sembelihan buta sebelah",
    "hadithNumber": "4293",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud, ia berkata; telah menceritakan kepada kami Khalid dari Syu'bah dari Sulaiman bin Abdurrahman budak Bani Asad dari Abu Adh Dhuha 'Ubaid bin Fairuz budak Bani Syaiban, ia berkata; saya berkata kepada Al Barra`; ceritakan kepadaku mengenai apa yang dilarang Rasulullah shallallahu 'alaihi wasallam dari hewan kurban! Ia berkata; Rasulullah shallallahu 'alaihi wasallam berdiri dan tanganku lebih pendek daripada tangannya, kemudian beliau bersabda: \"Empat sifat yang tidak mencukupi, yaitu; buta sebelah matanya yang jelas kebutaannya, sakit yang jelas sakitnya, pincang yang jelas pincangnya, dan pecah kakinya yang tidak memiliki sumsum.\" Saya katakan; saya tidak suka pada tanduknya terdapat cacat, dan pada giginya terdapat cacar. Ia berkata; apa yang tidak engkau sukai maka tinggalkan dan jangan engkau haramkan atas seseorang.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "1143840",
    "last_updated": null
  },
  {
    "indonesianURN": "3242940",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1872",
    "babName": "Pincang",
    "hadithNumber": "4294",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar, ia berkata; telah menceritakan kepada kami Muhammad bin Ja'far, Abu Daud, Yahya, Abdurrahman dan Ibnu Abu 'Adi serta Abu Al Walid, mereka berkata; telah memberitakan kepada kami Syu'bah, ia berkata; saya mendengar Sulaiman bin Abdurrahman berkata; saya mendengar 'Ubaid bin Fairuz berkata; saya berkata kepada Al Barra` bin 'Azib; ceritakan kepadaku mengenai apa yang tidak disukai atau dilarang oleh Rasulullah shallallahu 'alaihi wasallam dari binatang kurban! Ia berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda demikian dengan tangannya dan tanganku lebih pendek dari tangan Rasulullah shallallahu 'alaihi wasallam: \"Empat sifat yang tidak mencukupi dalam hewan kurban yaitu; buta sebelah matanya yang jelas kebutaannya, sakit yang jelas sakitnya, pincang yang jelas pincangnya, dan pecah kakinya yang tidak memiliki sumsum.\" Saya katakan; saya tidak suka pada tanduknya terdapat cacat, dan pada telinganya terdapat cacat. Ia berkata; apa yang tidak engkau sukai maka tinggalkan dan jangan engkau haramkan atas seseorang.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "1143850",
    "last_updated": null
  },
  {
    "indonesianURN": "3242950",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1873",
    "babName": "Kurus, kecil, lemah hingga tak punya sungsum",
    "hadithNumber": "4295",
    "hadithText": "Telah mengabarkan kepada kami Sulaiman bin Daud dari Ibnu Wahb, ia berkata; telah mengabarkan kepadaku 'Amr bin Al Harits dan Al Laits bin Sa'd dan ia menyebutkan yang lain dan mengedepankannya bahwa Sulaiman bin Abdurrahman telah menceritakan kepada mereka dari 'Ubaid bin Fairuz dari Al Bara` bin 'Azib berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam.. (dan ia memberikan isyarat dengan jari-jarinya) dan jariku-jariku lebih pendek dari jari-jari Rasulullah shallallahu 'alaihi wasallam, beliau memberikan isyarat dengan jarinya bersabda: \"Tidak boleh ada hewan kurban yang buta sebelah matanya yang jelas kebutaannya, sakit yang jelas sakitnya, pincang yang jelas pincangnya, dan pecah kakinya yang tidak memiliki sumsum.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "1143860",
    "last_updated": null
  },
  {
    "indonesianURN": "3242960",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1874",
    "babName": "Ujung telinganya sobek (terpotong)",
    "hadithNumber": "4296",
    "hadithText": "Telah mengabarkan kepadaku Muhammad bin Adam dari Abdur Rahim yaitu Ibnu Sulaiman dari Zakariya bin Abu Zaidah dari Abu Ishaq dari Syuraih bin An Nu'man dari Ali radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk memeriksa mata dan telinga serta tidak berkurban dengan hewan yang terpotong dari ujung telinganya dan dibiarkan tergantung, yang terpotong dari belakang telinganya dan dibiarkan tergantung, dan yang terpotong telinganya serta yang lubang telinganya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "1143870",
    "last_updated": null
  },
  {
    "indonesianURN": "3242970",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1875",
    "babName": "Pangkal telinganya sobek (terpotong)",
    "hadithNumber": "4297",
    "hadithText": "Telah mengabarkan kepada kami Abu Daud, ia berkata; telah menceritakan kepada kami Al Hasan bin Muhammad bin A'yan, ia berkata; telah menceritakan kepada kami Zuhair, ia berkata; telah menceritakan kepada kami Abu Ishaq dari Syuraih bin An Nu'man, telah berkata Abu Ishaq dan ia adalah orang yang jujur, dari Ali radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam telah memerintahkan kami agar memperhatikan mata, dan telinga dan tidak berkurban dengan hewan yang buta sebelah matanya, yang terpotong dari ujung telinganya, yang terpotong dari belakang telinganya, dan yang terbelah menjadi dua serta yang lubang telinganya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "1143880",
    "last_updated": null
  },
  {
    "indonesianURN": "3242980",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1876",
    "babName": "Telinagnya berlubang",
    "hadithNumber": "4298",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Nashih, ia berkata; telah menceritakan kepada kami Abu Bakar bin 'Ayyasy dari Abu Ishaq dari Syuraih bin An Nu'man dari Ali bin Abu Thalib radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang kami untuk berkurban dengan hewan yang terpotong dari ujung telinganya, atau yang terpotong dari belakang telinganya atau yang terbelah menjadi dua, atau yang lubang telinganya atau yang terpotong telinganya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "1143890",
    "last_updated": null
  },
  {
    "indonesianURN": "3242990",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1877",
    "babName": "Telinganya retak (terbelah)",
    "hadithNumber": "4299",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Abdullah, ia berkata; telah menceritakan kepada kami Syuja' bin Al Walid, ia berkata; telah menceritakan kepadaku Ziyad bin Khaitsamah, ia berkata; telah menceritakan kepada kami Abu Ishaq dari Syuraih bin An Nu'man dari Ali radliallahu 'anhu bahwa Rasulullah shallallahu 'alaihi wasallam bersabda; \"Tidak boleh dikurbankan dengan hewan yang terpotong dari ujung telingannya, yang terpotong dari belakang telinganya, yang terbelah telinganya, dan yang lubang telinganya serta yang buta sebelah matanya.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "1143900",
    "last_updated": null
  },
  {
    "indonesianURN": "3243000",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1877",
    "babName": "Telinganya retak (terbelah)",
    "hadithNumber": "4300",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la, ia berkata; telah menceritakan kepada kami Khalid telah menceritakan kepada kami Syu'bah bahwa Salamah yaitu Ibnu Kuhail telah mengabarkan kepadanya, ia berkata; saya mendengar Hujayyah bin 'Adi berkata; saya mendengar Ali berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan kami agar meneliti mata dan telinga.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "1143910",
    "last_updated": null
  },
  {
    "indonesianURN": "3243010",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1878",
    "babName": "Tanduknya pecah",
    "hadithNumber": "4301",
    "hadithText": "Telah mengabarkan kepada kami Humaid bin Mas'adah dari Sufyan yaitu Ibnu Habib dari Syu'bah dari Qatadah dari Jurai bin Kulaib, ia berkata; saya mendengar Ali berkata; Rasulullah shallallahu 'alaihi wasallam melarang berkurban dengan hewan yang bertanduk pecah. Kemudian hal tersebut saya sebutkan kepada Sa'id bin Al Musayyab maka Ia berkata; ya, hanya saja yang tanduknya pecah setengah atau lebih dari itu.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "17",
    "matchingArabicURN": "1143920",
    "last_updated": null
  },
  {
    "indonesianURN": "3243020",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1879",
    "babName": "Musinnah dan Jadza'ah",
    "hadithNumber": "4302",
    "hadithText": "Telah mengabarkan kepada kami Abu Daud Sulaiman bin Saif, ia berkata; telah menceritakan kepada kami Al Hasan yaitu Ibnu A'yan dan Abu Ja'far yaitu An Nufaili mereka berkata; telah menceritakan kepada kami Zuhair, ia berkata; telah menceritakan kepada kami Abu Az Zubair dari Jabir, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menyembelih kecuali domba yang berumur dua tahun, kecuali mengalami kesulitan maka sembelihlah yang berumur satu tahun.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "18",
    "matchingArabicURN": "1143930",
    "last_updated": null
  },
  {
    "indonesianURN": "3243030",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1879",
    "babName": "Musinnah dan Jadza'ah",
    "hadithNumber": "4303",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Al Laits dari Yazid bin Abu Habib dari Abu Al Khair dari 'Uqbah bin 'Amir bahwa Rasulullah shallallahu 'alaihi wasallam telah memberinya kambing yang banyak yang ia bagikan kepada isterinya kemudian tersisa kambing kacang, kemudian ia menyampaikannya kepada Rasulullah shallallahu 'alaihi wasallam lalu beliau bersabda: \"Berkurbanlah dengannya.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "19",
    "matchingArabicURN": "1143940",
    "last_updated": null
  },
  {
    "indonesianURN": "3243040",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1879",
    "babName": "Musinnah dan Jadza'ah",
    "hadithNumber": "4304",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Durust, ia berkata; telah menceritakan kepada kami Abu Isma'il yaitu Al Qannad, ia berkata; telah menceritakan kepada kami Yahya, ia berkata; telah menceritakan kepadaku Ba'jah bin Abdullah dari 'Uqbah bin 'Amir bahwa Rasulullah shallallahu 'alaihi wasallam telah membagikan hewan kurban diantara isteri-isterinya dan saya memiliki kambing yang berumur satu tahun. Kemudian saya katakan; wahai Rasulullah, saya memiliki kambing yang berumur satu tahun. Maka beliau bersabda: \"Berkurbanlah dengannya.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "20",
    "matchingArabicURN": "1143950",
    "last_updated": null
  },
  {
    "indonesianURN": "3243050",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1879",
    "babName": "Musinnah dan Jadza'ah",
    "hadithNumber": "4305",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud, ia berkata; telah menceritakan kepada kami Khalid, ia berkata; telah menceritakan kepada kami Hisyam dari Yahya bin Abu Katsir dari Ba'jah bin Abdullah Al Juhani dari 'Uqbah bin 'Amir, ia berkata; Rasulullah shallallahu 'alaihi wasallam telah membagi hewan-hewan kurban diantara para isterinya. Dan saya mendapatkan kambing yang berumur satu tahun. Kemudian saya katakan; wahai Rasulullah, saya telah mendapatkan kambing yang berumur satu tahun. Kemudian beliau bersabda: \"Berkurbanlah dengannya.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "21",
    "matchingArabicURN": "1143960",
    "last_updated": null
  },
  {
    "indonesianURN": "3243060",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1879",
    "babName": "Musinnah dan Jadza'ah",
    "hadithNumber": "4306",
    "hadithText": "Telah mengabarkan kepada kami Sulaiman bin Daud dari Ibnu Wahb, ia berkata; telah mengabarkan kepadaku 'Amr dari Bukair bin Al Asyaj dari Mu'adz bin Abdullah bin Khubaib dari 'Uqbah bin 'Amir, ia berkata; kami berkurban bersama Rasulullah shallallahu 'alaihi wasallam dengan domba yang berumur satu tahun.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "22",
    "matchingArabicURN": "1143970",
    "last_updated": null
  },
  {
    "indonesianURN": "3243070",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1879",
    "babName": "Musinnah dan Jadza'ah",
    "hadithNumber": "4307",
    "hadithText": "Telah mengabarkan kepada kami Hannad bin As Sari dalam haditsnya dari Abu Al Ahwash dari 'Ashim bin Kulaib dari ayahnya, ia berkata; kami berada dalam suatu perjalanan kemudian telah datang hari raya Adhha, kemudian seseorang diantara kami membeli seekor domba yang berumur dua tahun ditukar dengan dua ekor domba yang berumur satu tahun atau tiga ekor. Kemudian seseorang dari Muzainah berkata kepada kami; dahulu kami bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan kemudian datang hari Adhha ini, kemudian seseorang meminta seekor domba yang berumur satu tahun ditukar dengan dua atau tiga ekor domba yang berumur satu tahun. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya domba yang berumur satu tahun mencukupi apa yang apa yang dicukupi oleh domba yang berumur tiga tahun.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "23",
    "matchingArabicURN": "1143980",
    "last_updated": null
  },
  {
    "indonesianURN": "3243080",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1879",
    "babName": "Musinnah dan Jadza'ah",
    "hadithNumber": "4308",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la, ia berkata; telah menceritakan kepada kami Khalid, ia berkata; telah menceritakan kepada kami Syu'bah dari 'Ashim bin Kulaib, ia berkata; saya mendengar ayahku menceritakan dari seorang laki-laki, ia berkata; kami pernah bersama Nabi shallallahu 'alaihi wasallam dua hari sebelum hari idul Adhha, kami memberi dua domba yang berumur satu tahun ditukar dengan yang berumur tiga tahun. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya domba yang berumur satu tahun mencukupi apa yang dicukupi oleh domba yang berumur tiga tahun.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "24",
    "matchingArabicURN": "1143990",
    "last_updated": null
  },
  {
    "indonesianURN": "3243090",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1880",
    "babName": "Kambing gibas",
    "hadithNumber": "4309",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah menceritakan kepada kami Isma'il dari Abdul 'Aziz yaitu Ibnu Shuhaib dari Anas bahwa Rasulullah shallallahu 'alaihi wasallam pernah berkurban dengan dua ekor kambing kibas. Anas berkata; sedangkan saya berkurban dengan dua ekor kambing kibas.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "25",
    "matchingArabicURN": "1144000",
    "last_updated": null
  },
  {
    "indonesianURN": "3243100",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1880",
    "babName": "Kambing gibas",
    "hadithNumber": "4310",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dari Khalid, ia berkata; telah menceritakan kepada kami Humaid dari Tsabit dari Anas, ia berkata; Rasulullah shallallahu 'alaihi wasallam berkurban dengan dua kambing kibas yang gemuk.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "26",
    "matchingArabicURN": "1144010",
    "last_updated": null
  },
  {
    "indonesianURN": "3243110",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1880",
    "babName": "Kambing gibas",
    "hadithNumber": "4311",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Abu 'Awanah dari Qatadah dari Anas, ia berkata; Nabi shallallahu 'alaihi wasallam berkurban dengan dua ekor kambing kibas yang bertanduk, beliau menyembelihnya dengan tangannya, mengucapkan bismillah dan bertakbir serta meletakkan kakinya pada samping leher.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "27",
    "matchingArabicURN": "1144020",
    "last_updated": null
  },
  {
    "indonesianURN": "3243120",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1880",
    "babName": "Kambing gibas",
    "hadithNumber": "4312",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud, ia berkata; telah menceritakan kepada kami Hatim bin Wardan dari Ayyub dari Muhammad bin Sirin dari Anas bin Malik, ia berkata; Rasulullah shallallahu 'alaihi wasallam berkhutbah kepada kami pada idul Adhha dan beliau menuju kepada dua kambing kibasnya yang gemuk kemudian menyembelihnya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "28",
    "matchingArabicURN": "1144030",
    "last_updated": null
  },
  {
    "indonesianURN": "3243130",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1880",
    "babName": "Kambing gibas",
    "hadithNumber": "4313",
    "hadithText": "Telah mengabarkan kepada kami Humaid bin Mas'adah dalam haditsnya dari Yazid bin Zurai' dari Ibnu 'Aun dari Muhammad dari Abdurrahman bin Abu Bakarah dari ayahnya, ia berkata; kemudian beliau pergi yakni Nabi shallallahu 'alaihi wasallam pada hari Qurban, menuju ke dua ekor kambing kibas yang gemuk, lalu beliau menyembelih keduanya, dan menuju pada potongan daging kambing dan membagi untuk kami.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "29",
    "matchingArabicURN": "1144040",
    "last_updated": null
  },
  {
    "indonesianURN": "3243140",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1880",
    "babName": "Kambing gibas",
    "hadithNumber": "4314",
    "hadithText": "Telah mengabarkan kepada kami Abdullah bin Sa'id Abu Sa'id Al Asyaj, ia berkata; telah menceritakan kepada kami Hafsh bin Ghiyats dari Ja'far bin Muhammad dari ayahnya dari Abu Sa'id, ia berkata; Rasulullah shallallahu 'alaihi wasallam berkurban dengan seekor kambing kibas yang bertanduk dan kuat, ia berkaki hitam, bermulut hitam, dan mermata hitam.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "30",
    "matchingArabicURN": "1144050",
    "last_updated": null
  },
  {
    "indonesianURN": "3243150",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1881",
    "babName": "Unta yang  memenuhi kriteria sembelihan",
    "hadithNumber": "4315",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Abdullah bin Al Hakam berkata telah menceritakan kepada kami Muhammad bin Ja'far, ia berkata; telah menceritakan kepada kami Syu'bah, ia berkata; telah menceritakan kepada kami Sufyan Ats Tsauri dari ayahnya dari 'Abadah bin Rifa'ah bin Rafi' dari kakeknya yaitu Rafi' bin Khadij, ia berkata; Rasulullah shallallahu 'alaihi wasallam di dalam pembagian harta rampasan perang menjadikan sepuluh kambing sebanding dengan satu ekor unta. Syu'bah berkata; dan yang paling saya ketahui adalah bahwa saya mendengar hadits tersebut dari Sa'id bin Masruq, dan telah menceritakan kepadaku dengannya Sufyan darinya... wallahu a'lam.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "31",
    "matchingArabicURN": "1144060",
    "last_updated": null
  },
  {
    "indonesianURN": "3243160",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1881",
    "babName": "Unta yang  memenuhi kriteria sembelihan",
    "hadithNumber": "4316",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul 'aziz bin Ghazwn, ia berkata; telah menceritakan kepada kami Al Fadhl bin Musa dari Husain yaitu Ibnu Waqid dari 'Ilba` bin Ahmar dari Ikrimah dari Ibnu Abbas ia berkata; kami bersama Rasulullah shallallahu 'alaihi wasallam ketika melakukan safar lalu datang hari Qurban, kemudian kami menyembelih seekor unta dari sepuluh orang dan seekor sapi dari tujuh orang.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "32",
    "matchingArabicURN": "1144070",
    "last_updated": null
  },
  {
    "indonesianURN": "3243170",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1882",
    "babName": "Sapi yang memenuhi kriteria sembelihan",
    "hadithNumber": "4317",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dari Yahya dari Abdul Malik dari 'Atho` dari Jabir, ia berkata; kami melakukan haji tamattu' bersama Nabi shallallahu 'alaihi wasallam, kemudian kami menyembelih sapi untuk orang tujuk dan kami berserikat padanya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "33",
    "matchingArabicURN": "1144080",
    "last_updated": null
  },
  {
    "indonesianURN": "3243180",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1883",
    "babName": "Menyembelih hewan sembelihan sebelum imam",
    "hadithNumber": "4318",
    "hadithText": "Telah mengabarkan kepada kami Hannad bin As Sari dari Ibnu Abu Zaidah, ia berkata; telah memberitakan kepada kami ayahku dari Firas dari 'Amir dari Al Bara` bin 'Azib. Telah menceritakan dan memberitakan kepada kami Daud bin Abu Hindun dari Asy Sya'bi dari Al Bara` kemudian salah seorang diantara mereka menyebutkan apa yang tidak disebutkan oleh yang lain, ia berkata; Rasulullah shallallahu 'alaihi wasallam berdiri pada hari raya Kurban dan bersabda: \"Barang siapa yang menghadap ke Kiblat kami, melakukan shalat kami, menyembelih sembelihan kami maka janganlah ia menyembelih hingga ia melakukan shalat.\" Kemudian pamanku berdiri dan berkata; wahai Rasulullah, sesungguhnya saya mempercepat sembelihanku agar dapat memberikan makan keluargaku dan penghuni rumahku atau keluargaku dan tetanggaku. Kemudian beliau bersabda: \"Ulangi sembelihan yang lain\", ia berkata; sesungguhnya saya memiliki anak kambing betina yang masih menyusu yang lebih saya cintai daripada dua ekor kambing pedaging. Beliau bersabda: \"Sembelihlah sesungguhnya itu penyembelihanmu yang terbaik, dan kambing yang berumur satu tahun tidak dapat menunaikan bagi seorangpun setelahmu.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "34",
    "matchingArabicURN": "1144090",
    "last_updated": null
  },
  {
    "indonesianURN": "3243190",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1883",
    "babName": "Menyembelih hewan sembelihan sebelum imam",
    "hadithNumber": "4319",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Abu Al Ahwash dari Manshur dari Asy Sya'bi dari Al Bara` bin 'Azib, ia berkata; Rasulullah shallallahu 'alaihi wasallam berkhutbah kepada kami pada hari Kurban setelah melakukan shalat kemudian bersabda: \"Barang siapa yang melakukan shalat kami dan menyembelih sembelihan kami sungguh ia telah benar dalam menyembelih dan barang siapa yang menyembelih sebelum shalat maka itu adalah kambing yang dimanfaatkan dagingnya bukan kurban.\" Kemudian Abu Burdah berkata; wahai Rasulullah, demi Allah saya telah menyembelih sebelum keluar melakukan shalat dan saya tahu bahwa hari ini adalah hari makan dan minum, sehingga saya mempercepat, kemudian saya makan dan memberikan makan kepada keluarga dan tetanggaku. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Itu adalah kambing yang dimanfaatkan dagingnya.\" Ia berkata; saya memiliki anak kambing betina, kambing yang berumur satu tahun lebih baik daripada dua kambing yang dimanfaatkan dagingnya saja, apakah itu mencukupi untukku? Beliau bersabda: \"ya, dan tidak mencukupi untuk seorangpun setelahmu.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "35",
    "matchingArabicURN": "1144100",
    "last_updated": null
  },
  {
    "indonesianURN": "3243200",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1883",
    "babName": "Menyembelih hewan sembelihan sebelum imam",
    "hadithNumber": "4320",
    "hadithText": "Telah mengabarkan kepada kami Ya'qub bin Ibrahim, ia berkata; telah menceritakan kepada kami Ibnu Ulayyah, ia berkata; telah menceritakan kepada kami Ayyub dari Muhammad dari Anas, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda pada hari Kurban: \"Barang siapa yang menyembelih sebelum shalat maka hendaknya ia mengulangi.\" Kemudian terdapat seorang laki-laki yang berdiri dan berkata; wahai Rasulullah, ini adalah hari memakan daging..... kemudian ia menyebutkan kebutuhan dari tetangganya, sepertinya Rasulullah shallallahu 'alaihi wasallam membenarkannya. Ia berkata; saya memiliki anak kambing yang berumur satu tahun itu lebih saya senangi daripada dua kambing yang hanya dimanfaatkan dagingnya saja bukan kurban. Kemudian beliau memberikan keringanan baginya. Saya tidak tahu apakah keringanan yang beliau berikan itu sampai kepada orang selainnya atau tidak. Kemudian beliau menuju kepada dua kambing kibasnya dan menyembelihnya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "36",
    "matchingArabicURN": "1144110",
    "last_updated": null
  },
  {
    "indonesianURN": "3243210",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1883",
    "babName": "Menyembelih hewan sembelihan sebelum imam",
    "hadithNumber": "4321",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id, ia berkata; telah menceritakan kepada kami Yahya dari Yahya. Telah menceritakan dan memberitakan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Yahya dari Yahya bin Sa'id dari Busyair bin Yasar dari Abu Burdah bin Niyar bahwa ia telah menyembelih sebelum Nabi shallallahu 'alaihi wasallam, kemudian Nabi shallallahu 'alaihi wasallam memerintahkannya agar mengulanginya. Ia berkata; saya memiliki anak kambing betina, kambing berumur satu tahun lebih saya senangi daripada dua kambing yang berumur dua tahun. Beliau bersabda: \"Sembelihlah kambing tersebut.\" Dalam hadits 'Ubaidullah; Kemudian ia berkata; sesungguhnya saya tidak mendapatkan kecuali kambing yang berumur satu tahun. Lalu beliau memerintahkannya untuk menyembelih.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "37",
    "matchingArabicURN": "1144120",
    "last_updated": null
  },
  {
    "indonesianURN": "3243220",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1883",
    "babName": "Menyembelih hewan sembelihan sebelum imam",
    "hadithNumber": "4322",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Abu 'Awanah dari Al Aswad bin Qais dari Jundub bin Sufyan, ia berkata; kami telah berkurban bersama Rasulullah shallallahu 'alaihi wasallam pada hari 'idul Adhha, ternyata terdapat beberapa orang yang telah menyembelih kurban mereka sebelum melakukan shalat, kemudian tatkala beliau pergi Nabi shallallahu 'alaihi wasallam melihat mereka telah menyembelih sebelum melakukan shalat, lalu beliau bersabda: \"Barang siapa yang menyembelih sebelum melakukan shalat maka hendaknya ia menyembelih yang lain sebagai gantinya dan barang siapa yang belum menyembelih hingga melakukan shalat maka hendaknya ia menyembelih dengan menyebut nama Allah 'azza wajalla.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "38",
    "matchingArabicURN": "1144130",
    "last_updated": null
  },
  {
    "indonesianURN": "3243230",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1884",
    "babName": "Dibolehkan menyembelih dengan batu tajam",
    "hadithNumber": "4323",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna, ia berkata; telah menceritakan kepada kami Yazid bin Harun, ia berkata; telah menceritakan kepada kami Daud dari 'Amir dari Muhammad bin Shafwan bahwa ia telah menangkap dua ekor kelinci dan tidak mendapatkan besi untuk menyembelihnya. Kemudian ia menyembelihnya menggunakan batu putih yang dibuat seperti pisau, lalu datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; wahai Rasulullah, sesungguhnya saya telah memburu dua ekor kelinci dan tidak mendapatkan besi untuk menyembelihnya kemudian saya menyembelihnya menggunakan batu putih yang dibuat seperti pisau, apakah saya boleh memakannya? Beliau bersabda: \"Makanlah.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "39",
    "matchingArabicURN": "1144140",
    "last_updated": null
  },
  {
    "indonesianURN": "3243240",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1884",
    "babName": "Dibolehkan menyembelih dengan batu tajam",
    "hadithNumber": "4324",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dari Muhammad bin Ja'far, ia berkata; telah menceritakan kepada kami Syu'bah, ia berkata; telah menceritakan kepada kami Hadhir bin Al Muhajir Al Bahili, ia berkata; saya mendengar Sulaiman bin Yasar menceritakan dari Zaid bin Tsabit bahwa terdapat seekor serigala yang menggigit seekor kambing, kemudian mereka menyembelihnya menggunakan menggunakan batu putih yang dibuat seperti pisau, kemudian Nabi shallallahu 'alaihi wasallam memberikan keringanan untuk memakannya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "40",
    "matchingArabicURN": "1144150",
    "last_updated": null
  },
  {
    "indonesianURN": "3243250",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1885",
    "babName": "Dibolehkan menyembelih dengan kayu",
    "hadithNumber": "4325",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la dan Isma'il bin Mas'ud dari Khalid dari Syu'bah dari Simak, ia berkata; saya mendengar Murri bin Qathari dari 'Adi bin hatim, ia berkata; saya berkata; wahai Rasulullah, saya melepas anjingku berburu, lalu aku mengambil buruannya namun saya tidak mendapati sesuatu untuk menyembelihnya, maka saya menyembelihnya dengan batu putih yang dibentuk seperti pisau dan tongkat, beliau bersabda: \" Alirkan darah dengan apa yang engkau kehendaki dan sebutlah nama Allah 'azza wajalla.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "41",
    "matchingArabicURN": "1144160",
    "last_updated": null
  },
  {
    "indonesianURN": "3243260",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1885",
    "babName": "Dibolehkan menyembelih dengan kayu",
    "hadithNumber": "4326",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Ma'mar, ia berkata; telah menceritakan kepada kami Habban bin Hilal, ia berkata; telah menceritakan kepada kami Jarir bin Hazim, ia berkata; telah menceritakan kepada kami Ayyub dari Zaid bin Aslam, dan saya bertemu dengan Zaid bin Aslam kemudian ia menceritakan kepadaku dari 'Atho' bin Yasar dari Abu Sa'd' Al Khudri ia berkata; seorang Anshar memiliki seekor unta yang digembalakan disekitar Uhud, ketika nampak unta itu, ia menyembelihnya dengan pasak. Saya berkata kepada Zaid; pasak dari kayu atau besi? Ia menjawab; tidak, melainkan dari kayu. Kemudian ia datang kepada Nabi shallallahu 'alaihi wasallam dan bertanya kepada beliau, lalu beliau menyuruh untuk memakannya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "42",
    "matchingArabicURN": "1144170",
    "last_updated": null
  },
  {
    "indonesianURN": "3243270",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1886",
    "babName": "Larangan menyembelih dengan kuku",
    "hadithNumber": "4327",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur, ia berkata; telah menceritakan kepada kami Sufyan dari Umar bin Sa'id dari ayahnya dari 'Abayah bin Rifa'ah dari Rafi' bin Khadij bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apa yang dapat mengalirkan darah dan telah disebutkan nama Allah, maka makanlah, kecuali dengan gigi atau kuku.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "43",
    "matchingArabicURN": "1144180",
    "last_updated": null
  },
  {
    "indonesianURN": "3243280",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1887",
    "babName": "Menyembelih dengan tulang",
    "hadithNumber": "4328",
    "hadithText": "Telah mengabarkan kepada kami Hannad bin As Sari dari Abu Al Ahwash dari Sa'id bin Masruq dari 'Abayah bin Rifa'ah dari ayahnya dari kakeknya yaitu Rafi' bin Khadij, ia berkata; saya berkata; wahai Rasulullah, sesungguhnya kita akan bertemu musuh besok, dan kita tidak memiliki pisau. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apa yang dapat mengalirkan darah dan telah disebutkan nama Allah, maka makanlah, selama bukan gigi atau kuku dan akan saya ceritakan mengenai hal tersebut; adapun gigi maka itu adalah tulang, adapun kuku maka itu adalah pisau orang-orang Habasyah.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "44",
    "matchingArabicURN": "1144190",
    "last_updated": null
  },
  {
    "indonesianURN": "3243290",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1888",
    "babName": "Perintahkan menajamkan pisau",
    "hadithNumber": "4329",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr, ia berkata; telah menceritakan kepada kami Isma'il dari Khalid dari Abu Qilabah dari Abu Al Asy'ats dari Syadad bin Aus, ia berkata; ada dua perkara yang saya hafal dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya Allah telah mewajibkan berbuat baik kepada segala sesuatu, apabila kalian membunuh maka bunuhlah secara baik, dan apabila kalian menyembelih maka sembelihlah secara baik, dan hendaknya salah seorang diantara kalian menajamkan pisaunya serta memberikan kenyamanan kepada sembelihannya.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "45",
    "matchingArabicURN": "1144200",
    "last_updated": null
  },
  {
    "indonesianURN": "3243300",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1889",
    "babName": "Rukhsah menggorok yang disembelih atau menyembelih yang digorok",
    "hadithNumber": "4330",
    "hadithText": "Telah mengabarkan kepada kami Isa bin Ahmad Al 'Asqalani, ia berkata; telah menceritakan kepada kami Ibnu Wahb, ia berkata; telah menceritakan kepadaku Sufyan dari Hisyam bin 'Urwah ia telah menceritakan kepadanya dari Fathimah binti Al Mundzir dari Asma` binti Abu Bakar, ia berkata; kami menyembelih kuda pada zaman Rasulullah shallallahu 'alaihi wasallam kemudian kami memakannya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "46",
    "matchingArabicURN": "1144210",
    "last_updated": null
  },
  {
    "indonesianURN": "3243310",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1890",
    "babName": "Sembelihan yang digigit binatang buas",
    "hadithNumber": "4331",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dari Muhammad bin Ja'far, ia berkata; telah menceritakan kepada kami Syu'bah, ia berkata; saya mendengar Hadhir bin Al Muhajir Al Bahili, ia berkata; saya mendengar Sulaiman bin Yasar menceritakan dari Zaid bin Tsabit bahwa terdapat seekor serigala yang menggigit seekor kambing kemudian mereka menyembelihnya menggunakan batu putih yang dibuat seperti pisau, lalu Nabi shallallahu 'alaihi wasallam memberikan keringanan dan kami memakannya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "47",
    "matchingArabicURN": "1144220",
    "last_updated": null
  },
  {
    "indonesianURN": "3243320",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1891",
    "babName": "Binatang yang jatuh ke sumur dan tak sampai dasarnya",
    "hadithNumber": "4332",
    "hadithText": "Telah mengabarkan kepada kami Ya'qub bin Ibrahim, ia berkata; telah menceritakan kepada kami Abdurrahman dari Hammad bin Salamah dari Abu Al 'Usyara` dari ayahnya, ia berkata; saya berkata; wahai Rasulullah, bukankah menyembelih itu hanya di tenggorokan dan leher bagian bawah? Beliau bersabda: \"Apabila engkau menusuk pada pahanya maka cukup bagimu.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "48",
    "matchingArabicURN": "1144230",
    "last_updated": null
  },
  {
    "indonesianURN": "3243330",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1892",
    "babName": "Melarikan diri dan tak bisa ditangkap",
    "hadithNumber": "4333",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud, ia berkata; telah menceritakan kepada kami Khalid dari Syu'bah dari Sa'id bin Masruq dari 'Abayah bin Rafi' dari Rafi', ia berkata; saya berkata; wahai Rasulullah, sesungguhnya kita akan bertemu musuh besok, dan kita tidak memiliki pisau. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apa yang dapat mengalirkan darah dan telah disebutkan nama Allah, maka makanlah, selama bukan gigi dan kuku.\" Kemudian Rasulullah shallallahu 'alaihi wasallam mendapatkan rampasan, lalu terdapat unta yang lari, kemudian seorang laki-laki memanahnya dengan anak panah sehingga menghentikannya. Beliau bersabda: \"Sesungguhnya binatang ternak ini.. atau beliau bersabda: \"unta ini memiliki binanatang-binatang yang menjadi liar, seperti liarnya binatang liar, maka apa yang kalian mampu lakukan terhadapnya maka lakukanlah.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "49",
    "matchingArabicURN": "1144240",
    "last_updated": null
  },
  {
    "indonesianURN": "3243340",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1892",
    "babName": "Melarikan diri dan tak bisa ditangkap",
    "hadithNumber": "4334",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah memberitakan kepada kami Yahya bin Sa'id, ia berkata; telah menceritakan kepada kami Sufyan, ia berkata; telah menceritakan kepadaku ayahku dari 'Abayah bin Rifa'ah dari Rafi' bin Khadij, ia berkata; saya mengatakan; wahai Rasulullah, sesungguhnya kita akan bertemu musuh besok, dan kita tidak memiliki pisau. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apa yang dapat mengalirkan darah dan telah disebutkan nama Allah, maka makanlah, yang bukan gigi atau kuku dan akan saya ceritakan mengenai hal tersebut; adapun gigi maka itu adalah tulang, adapun kuku maka itu adalah pisau orang-orang Habasyah.\" Dan kami mendapatkan rampasan unta dan kambing, lalu terdapat unta yang lari, kemudian seorang laki-laki memanahnya dengan anak panah sehingga menghentikannya. Beliau bersabda: \"Sesungguhnya unta ini memiliki binanatang-binatang yang menjadi liar, seperti liarnya binatang liar, maka apa yang kalian mampu lakukan terhadapnya maka lakukanlah demikian.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "50",
    "matchingArabicURN": "1144250",
    "last_updated": null
  },
  {
    "indonesianURN": "3243350",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1892",
    "babName": "Melarikan diri dan tak bisa ditangkap",
    "hadithNumber": "4335",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Ya'qub, ia berkata; telah menceritakan kepada kami 'Ubaidullah bin Musa, ia berkata; telah memberitakan kepada kami Israil dari Manshur dari Khalid Al Hadzdza` dari Abu Qilabah dari Abu Asma` Ar Rahabi dari Abu Al Asy'ats dari Syaddad bin Aus, ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah telah mewajibkan berbuat baik kepada segala sesuatu, apabila kalian membunuh maka bunuhlah secara baik, dan apabila kalian menyembelih maka sembelihlah secara baik, dan hendaknya salah seorang diantara kalian menajamkan pisaunya apabila ia menyembelih serta memberikan kenyamanan kepada sembelihannya.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "51",
    "matchingArabicURN": "1144260",
    "last_updated": null
  },
  {
    "indonesianURN": "3243360",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1893",
    "babName": "Menyembelih dengan baik",
    "hadithNumber": "4336",
    "hadithText": "Telah mengabarkan kepada kami Al Husain bin Huraits Abu 'Ammar, ia berkata; telah memberitakan kepada kami Jarir dari Manshur dari Khalid Al Hadzdza` dari Abu Qilabah dari Abu Al Asy'ats Ash Shan'ani dari Syaddad bin Aus, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah telah mewajibkan berbuat baik kepada segala sesuatu, apabila kalian membunuh maka bunuhlah secara baik, dan apabila kalian menyembelih maka sembelihlah secara baik, dan hendaknya salah seorang diantara kalian menajamkan pisaunya serta memberikan kenyamanan kepada sembelihannya.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "52",
    "matchingArabicURN": "1144270",
    "last_updated": null
  },
  {
    "indonesianURN": "3243370",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1893",
    "babName": "Menyembelih dengan baik",
    "hadithNumber": "4337",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Rafi', ia berkata; telah menceritakan kepada kami Abdur Razzaq, ia berkata; telah memberitakan kepada kami Ma'mar dari Ayyub dari Abu Qilabah dari Abu Al Asy'ats dari Syaddad bin Aus, ia berkata; saya telah mendengar dari Nabi shallallahu 'alaihi wasallam dua hal, beliau bersabda: \"\"Sesungguhnya Allah 'azza wajalla telah mewajibkan berbuat baik kepada segala sesuatu, apabila kalian membunuh maka bunuhlah secara baik, dan apabila kalian menyembelih maka sembelihlah secara baik, dan hendaknya salah seorang diantara kalian menajamkan pisaunya kemudian memberikan kenyamanan kepada sembelihannya.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "53",
    "matchingArabicURN": "1144280",
    "last_updated": null
  },
  {
    "indonesianURN": "3243380",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1893",
    "babName": "Menyembelih dengan baik",
    "hadithNumber": "4338",
    "hadithText": "Telah mengabarkan kepada kami Muhammad Abdullah bin Bazi', ia berkata; telah menceritakan kepada kami Yazid yaitu Ibnu Zurai', ia berkata; telah menceritakan kepada kami Khalid. Telah menceritakan dan memberitakan kepada kami Abdullah bin Muhammad bin Abdurrahman, ia berkata; telah menceritakan kepada kami Ghundar dari Syu'bah dari Khalid dari Abu Qilabah dari Abu Al Asy'ats dari Syaddad bin Aus, ia berkata; dua perkara yang saya hafal Rasulullah shallallahu 'alaihi wasallam: \"Sesungguhnya Allah telah mewajibkan berbuat baik kepada segala sesuatu, apabila kalian membunuh maka bunuhlah secara baik, dan apabila kalian menyembelih maka sembelihlah secara baik, dan hendaknya salah seorang diantara kalian menajamkan pisaunya serta memberikan kenyamanan kepada sembelihannya.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "54",
    "matchingArabicURN": "1144290",
    "last_updated": null
  },
  {
    "indonesianURN": "3243390",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1894",
    "babName": "Menginjakkan kaki di kening sembelihan",
    "hadithNumber": "4339",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud, ia berkata; telah menceritakan kepada kami Khalid dari Syu'bah telah memberitakan kepadaku Qatadah, ia berkata; saya mendengar Anas, ia berkata; Rasulullah shallallahu 'alaihi wasallam berkurban dengan dua ekor kambing kibas yang gemuk dan bertanduk, beliau bertakbir dan menyebutkan nama Allah. Sungguh saya telah melihat beliau menyembelihnya dengan tangannya dan meletakkan kakinya di atas sebelah pipinya. Saya katakan; apakah engkau mendengarnya dari beliau? Ia berkata; ya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "55",
    "matchingArabicURN": "1144300",
    "last_updated": null
  },
  {
    "indonesianURN": "3243400",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1895",
    "babName": "Menyebut nama Allah untuk hewan sembelihan",
    "hadithNumber": "4340",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Nashih, ia berkata; telah menceritakan kepada kami Husyaim dari Syu'bah dari Qatadah, ia berkata; telah menceritakan kepada kami Anas bin Malik, ia berkata; Rasulullah shallallahu 'alaihi wasallam berkurban dengan dua ekor kambing kibas yang gemuk dan bertanduk, beliau bertakbir dan menyebutkan nama Allah. Sungguh saya telah melihat beliau menyembelihnya dengan tangannya dan meletakkan kakinya di atas sebelah pipinya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "56",
    "matchingArabicURN": "1144310",
    "last_updated": null
  },
  {
    "indonesianURN": "3243410",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1896",
    "babName": "Bertakbir",
    "hadithNumber": "4341",
    "hadithText": "Telah mengabarkan kepada kami Al Qasim bin Zakariya bin Dinar, ia berkata; telah menceritakan kepada kami Mush'ab bin Al Miqdam dari Al Hasan yaitu Ibnu Shalih dari Syu'bah dari Qatadah dari Anas, ia berkata; Sungguh saya telah melihat beliau menyembelihnya dengan tangannya dan meletakkan kakinya di atas sebelah pipinya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "57",
    "matchingArabicURN": "1144320",
    "last_updated": null
  },
  {
    "indonesianURN": "3243420",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1897",
    "babName": "Seseorang menyembelih hewan sembelihannya sendiri",
    "hadithNumber": "4342",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la, ia berkata; telah menceritakan kepada kami Yazid yaitu Ibnu Zurai', ia berkata; telah menceritakan kepada kami Sa'id, ia berkata; telah menceritakan kepada kami Qatadah bahwa Anas bin Malik telah menceritakan kepada mereka bahwa Nabi shallallahu 'alaihi wasallam telah berkurban dengan dua ekor kambing kibas yang bertanduk dan gemuk, beliau menginjak sebelah pipinya dan menyembelihnya serta menyebutkan nama Allah dan bertakbir.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "58",
    "matchingArabicURN": "1144330",
    "last_updated": null
  },
  {
    "indonesianURN": "3243430",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1898",
    "babName": "Seseorang menyembelihan bukan hewan sembelihannya",
    "hadithNumber": "4343",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dan Al Harits bin Miskin dengan membacakan riwayat sedang saya mendengar, dari Ibnu Al Qasim, ia berkata; telah menceritakan kepadaku Malik dari Ja'far bin Muhammad dari ayahnya dari Jabir bin Abdullah bahwa Rasulullah shallallahu 'alaihi wasallam menyembelih kambingnya dengan tangan kanannya dan sebagiannya disembelih selain beliau.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "59",
    "matchingArabicURN": "1144340",
    "last_updated": null
  },
  {
    "indonesianURN": "3243440",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1899",
    "babName": "Menggorok yang seharusnya disembelih",
    "hadithNumber": "4344",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dan Muhammad bin Abdullah bin Yazid mereka berdua berkata; telah menceritakan kepada kami Sufyan dari Hisyam bin 'Urwah dari Fathimah dari Asma`, ia berkata; kami menyembelih kuda pada zaman Rasulullah shallallahu 'alaihi wasallam, dan memakannya. Qutaibah berkata di dalam haditsnya; kemudian kami memakan dagingnya. ' Abdah bin Salman telah menyelisihinya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "60",
    "matchingArabicURN": "1144350",
    "last_updated": null
  },
  {
    "indonesianURN": "3243450",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1899",
    "babName": "Menggorok yang seharusnya disembelih",
    "hadithNumber": "4345",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Adam, ia berkata; telah menceritakan kepada kami 'Abdah dari Hisyam bin 'Urwah dari Fathimah dari Asma`, ia berkata; kami menyembelih kuda pada zaman Rasulullah shallallahu 'alaihi wasallam dan kami berada di Madinah, kemudian kami memakannya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "61",
    "matchingArabicURN": "1144360",
    "last_updated": null
  },
  {
    "indonesianURN": "3243460",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1900",
    "babName": "Menyembelih untuk selain Allah",
    "hadithNumber": "4346",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Yahya yaitu Zakariya bin Abu Zaidah dari Ibnu Hayyan yaitu Manshur dari 'Amir bin Watsilah, ia berkata; seseorang telah bertanya kepada Ali; apakah Rasulullah shallallahu 'alaihi wasallam pernah merahasiakan sesuatu kepadamu tanpa orang lain? Kemudian Ali marah hingga wajahnya memerah, dan berkata; beliau tidak pernah merahasiakan sesuatu kepadaku tanpa orang lain, selain bahwa beliau telah menceritakan kepadaku empat perkataan, saya dan beliau berada dalam rumah. Beliau bersabda: \"Allah melaknat orang yang melaknat orang tuanya, Allah melaknat orang yang menyembelih untuk selain Allah dan Allah melaknat orang yang melindungi orang yang berbuat jahat, serta Allah melaknat orang yang mengubah patok tanah.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "62",
    "matchingArabicURN": "1144370",
    "last_updated": null
  },
  {
    "indonesianURN": "3243470",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1901",
    "babName": "Larangan menyantap daging setelah tiga hari dan menahannya",
    "hadithNumber": "4347",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah memberitakan kepada kami Abdur Razzaq, ia berkata; telah menceritakan kepada kami Ma'mar dari Az Zuhri dari Salim dari Ibnu Umar bahwa Rasulullah shallallahu 'alaihi wasallam melarang memakan daging kurban setelah tiga hari.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "63",
    "matchingArabicURN": "1144380",
    "last_updated": null
  },
  {
    "indonesianURN": "3243480",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1901",
    "babName": "Larangan menyantap daging setelah tiga hari dan menahannya",
    "hadithNumber": "4348",
    "hadithText": "Telah mengabarkan kepada kami Ya'qub bin Ibrahim dari Ghundar, ia berkata; telah menceritakan kepada kami Ma'mar, ia berkata; telah menceritakan kepada kami Az Zuhri dari Abu 'Ubaid mantan Ibnu 'Auf, ia berkata; saya menyaksikan Ali bin Abu Thalib semoga Allah memuliakan wajahnya pada hari raya memulai dengan melakukan shalat sebelum khutbah, ia melakukan shalat dengan tanpa adzan serta iqamah, kemudian ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam melarang seseorang menyimpan sebagian dari sembelihan kurbannya di atas tiga hari.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "64",
    "matchingArabicURN": "1144390",
    "last_updated": null
  },
  {
    "indonesianURN": "3243490",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1901",
    "babName": "Larangan menyantap daging setelah tiga hari dan menahannya",
    "hadithNumber": "4349",
    "hadithText": "Telah mengabarkan kepada kami Abu Daud, ia berkata; telah menceritakan kepada kami Ya'qub, ia berkata; telah menceritakan kepada kami ayahku dari Shalih dari Ibnu Syihab bahwa Abu 'Ubaid telah mengabarkan kepadanya bahwa Ali bin Abu Thalib berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah melarang kalian makan daging kurban kalian di atas tiga hari.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "65",
    "matchingArabicURN": "1144400",
    "last_updated": null
  },
  {
    "indonesianURN": "3243500",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1902",
    "babName": "Ijin dalam masalah ini",
    "hadithNumber": "4350",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dan Al Harits bin Miskin dengan membacakan riwayat dan saya mendengar, lafazhnya adalah lafazh Al Harits, dari Ibnu Al Qasim, ia berkata; telah menceritakan kepadaku Malik dari Abu Az Zubair dari Jabir bin Abdullah bahwa ia mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari memakan daging kurban setelah tiga hari kemudian beliau bersabda: \" Makanlah, berbekallah dan masaklah.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "66",
    "matchingArabicURN": "1144410",
    "last_updated": null
  },
  {
    "indonesianURN": "3243510",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1902",
    "babName": "Ijin dalam masalah ini",
    "hadithNumber": "4351",
    "hadithText": "Telah mengabarkan kepada kami Isa bin Hammad Zughbah, ia berkata; telah memberitakan kepada kami Al Laits dari Yahya bin Sa'id dari Al Qasim bin Muhammad dari Ibnu Khabbab yaitu Abdullah bin Khabbab bahwa Abu Sa'id Al Khudri datang dari perjalanan kemudian keluarganya menghidangkan kepadanya daging kurban. Kemudian ia berkata; saya tidak akan memakannya hingga bertanya. Kemudian ia pergi kepada saudara seibunya Qatadah bin An Nu'man ia adalah orang Badr. Lalu ia bertanya kepadanya mengenai hal tersebut, kemudian Qatadah berakta; sesungguhnya telah terjadi setelahmu suatu perkara sebagai pembatal apa yang dahulu mereka dilarang darinya yaitu memakan daging kurban setelah tiga hari.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "67",
    "matchingArabicURN": "1144420",
    "last_updated": null
  },
  {
    "indonesianURN": "3243520",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1902",
    "babName": "Ijin dalam masalah ini",
    "hadithNumber": "4352",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id, ia berkata; telah menceritakan kepada kami Yahya dari Sa'd bin Ishaq, ia berkata; telah menceritakan kepadaku Zainab dari Abu Sa'id Al Khudri bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang dari daging kurban di atas tiga hari. Kemudian Qatadah bin An Nu'man yang merupakan saudara Seibu Abu Sa'id datang dan ia adalah orang Badr. Lalu mereka menyuguhkan sesuatu kepadanya, kemudian ia berkata; bukankah Rasulullah shallallahu 'alaihi wasallam telah melarang darinya? Abu Sa'id berkata; sesungguhnya telah terjadi perkara dalam hal itu, bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang kita untuk memakannya di atas tiga hari kemudian beliau memberikan keringanan kepada kita untuk makan dan menyimpannya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "68",
    "matchingArabicURN": "1144430",
    "last_updated": null
  },
  {
    "indonesianURN": "3243530",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1902",
    "babName": "Ijin dalam masalah ini",
    "hadithNumber": "4353",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Manshur, ia berkata; telah menceritakan kepada kami Abdullah bin Muhammad yaitu An Nufaili, ia berkata; telah menceritakan kepada kami Zuhair; telah menceritakan dan memberitakan kepada kami Muhammad bin Ma'dan bin Isa, ia berkata; telah menceritakan kepada kami Al Hasan bin A'yan, ia berkata; telah menceritakan kepada kami Zuhair, ia berkata; telah menceritakan kepada kami Zubaid bin Al Harits dari Muharib bin Ditsar dari Ibnu Buraidah dari ayahnya, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dahulu saya telah melarang kalian dari tiga perkara; dari berziarah kubur, sekarang berziarahlah dan hendaknya ziarahnya memberikan tambahan kebaikan kepadanya, dan saya telah melarang kalian dari daging kurban setelah tiga hari, sekarang makanlah sebagian darinya dan simpanlah semaumu, dan saya telah melarang kalian dari minuman dalam bejana, sekarang minumlah dalam bejana apapun, dan janganlah minum sesuatu yang memabukkan.\" Muhammad tidak menyebutkan; dan simpanlah</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "69",
    "matchingArabicURN": "1144440",
    "last_updated": null
  },
  {
    "indonesianURN": "3243540",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1902",
    "babName": "Ijin dalam masalah ini",
    "hadithNumber": "4354",
    "hadithText": "Telah mengabarkan kepada kami Al Abbas bin Abdul 'Azhim Al 'Anbari dari Al Ahwash bin Jawwab dari 'Ammar bin Ruzaiq dari Abu Ishaq dari Az Zubair bin 'Adi dari Ibnu Buraidah dari ayahnya, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya saya telah melarang kalian dari daging kurban Setelah tiga hari dan dari rendaman anggur kecuali dalam wadah air dari kulit dan dari menziarahi kuburan, sekarang makanlah daging kurban semau kalian dan berbekallah serta simpanlah, dan barang siapa yang ingin berziarah kubur maka sesungguhnya hal itu akan mengingatkannya kepada Akherat, dan minumlah serta jauhi segala yang memabukkan.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "70",
    "matchingArabicURN": "1144450",
    "last_updated": null
  },
  {
    "indonesianURN": "3243550",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1903",
    "babName": "Menyimpan daging sembelihan",
    "hadithNumber": "4355",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id, ia berkata; telah menceritakan kepada kami Yahya dari Malik, ia berkata; telah menceritakan kepadaku Abdullah bin Abu Bakar dari 'Amrah dari Aisyah, ia berkata; sekelompok orang dari penduduk badui datang dengan terburu-buru pada waktu idul adhha, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Makan dan dan simpanlah selama tiga hari.\" Kemudian setelah itu mereka berkata; wahai Rasulullah, sesungguhnya orang-orang memanfaatkan dari kurban mereka mencairkan lemaknya dan darinya mereka membuat geriba. Beliau bersabda: \"Ada apa dengan hal tersebut?\" Ia berkata; yang telah anda larang yaitu menyimpan daging kurban. Beliau bersabda: \"Sesungguhnya saya melarang sekelompok orang yang datang terburu-buru, makan, simpan dan bersedekahlah.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "71",
    "matchingArabicURN": "1144460",
    "last_updated": null
  },
  {
    "indonesianURN": "3243560",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1903",
    "babName": "Menyimpan daging sembelihan",
    "hadithNumber": "4356",
    "hadithText": "Telah mengabarkan kepada kami Ya'qub bin Ibrahim dari Abdurrahman dari Sufyan dari Abdurrahman bin 'Abis dari ayahnya, ia berkata; saya menemui Aisyah kemudian berkata; apakah dahulu Rasulullah shallallahu 'alaihi wasallam melarang dari daging kurban setelah tiga hari? Ia berkata; ya, orang-orang tertimpa kesusahan kemudian Rasulullah shallallahu 'alaihi wasallam ingin agar orang kaya memberi makan orang yang miskin. 'Abis berkata; sungguh saya telah melihat keluarga Muhammad shallallahu 'alaihi wasallam memakan betis kambing setelah lima belas hari. Saya bertanya; apa sebab hal itu? Aisyah tertawa dan berkata; keluarga Muhammad tidaklah kenyang roti Yang diberi lauk sejak tiga hari hingga beliau menemui Allah 'azza wajalla.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "72",
    "matchingArabicURN": "1144470",
    "last_updated": null
  },
  {
    "indonesianURN": "3243570",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1903",
    "babName": "Menyimpan daging sembelihan",
    "hadithNumber": "4357",
    "hadithText": "Telah mengabarkan kepada kami Yusuf bin Isa, ia berkata; telah menceritakan kepada kami Al Fhadhl bin Musa, ia berkata; telah menceritakan kepada kami Yazid yaitu Ibnu Ziyad bin Abu Al Ja'd dari Abdurrahman bin 'Abis dari ayahnya, ia berkata; saya bertanya kepada Aisyah mengenai daging kurban. Ia berkata; dahulu kami menyimpan betis kambing untuk Rasulullah shallallahu 'alaihi wasallam selama satu bulan, kemudian beliau memakannya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "73",
    "matchingArabicURN": "1144480",
    "last_updated": null
  },
  {
    "indonesianURN": "3243580",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1903",
    "babName": "Menyimpan daging sembelihan",
    "hadithNumber": "4358",
    "hadithText": "Telah mengabarkan kepada kami Suwaid bin Nashr, ia berkata; telah memberitakan kepada kami Abdullah dari Ibnu 'Aun dari Ibnu Sirin dari Abu Sa'id Al Khudri, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menyimpan kurban di atas tiga hari kemudian beliau bersabda: \"Makan dan berilah makan.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "74",
    "matchingArabicURN": "1144490",
    "last_updated": null
  },
  {
    "indonesianURN": "3243590",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1904",
    "babName": "Sembelihan orang yahudi",
    "hadithNumber": "4359",
    "hadithText": "Telah mengabarkan kepada kami Ya'qub bin Ibrahim, ia berkata; telah menceritakan kepada kami Yahya bin Sa'id dari Sulaiman bin Mughirah, ia berkata; telah menceritakan kepada kami Humaid bin Hilal, ia berkata; telah menceritakan kepada kami Abdullah bin Mughaffal, ia berkata; sekantong lemak telah digantungkan pada saat perang Khaibar, dan saya menungguinya dan mengatakan; tidak akan saya berikan sedikitpun darinya kepada seseorang. Kemudian saya menoleh ternyata Rasulullah shallallahu 'alaihi wasallam tersenyum.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "75",
    "matchingArabicURN": "1144500",
    "last_updated": null
  },
  {
    "indonesianURN": "3243600",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1905",
    "babName": "Sembelihan orang tak dikenal identitasnya",
    "hadithNumber": "4360",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah menceritakan kepada kami An Nadhr bin Syumail, ia berkata; telah menceritakan kepada kami Hisyam bin 'Urwah dari ayahnya dari 'Aisyah bahwa orang-orang Badui menemui kami dengan membawa daging yang kami tidak mengetahui apakah mereka menyebut nama Allah ketika menyembelih atau tidak, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebutlah nama Allah Azza wa jalla lalu makanlah.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "76",
    "matchingArabicURN": "1144510",
    "last_updated": null
  },
  {
    "indonesianURN": "3243610",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1906",
    "babName": "Tafsiran ayat \"Dan jangan kalian menyantap segala yang tak disebut nama Allah\"",
    "hadithNumber": "4361",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Yahya, ia berkata; telah menceritakan kepada kami Sufyan, ia berkata; telah menceritakan kepadaku Harun bin Abu Waki' yaitu Harun bin 'Antarah dari ayahnya dari Ibnu Abbas mengenai firman Allah 'azza wajalla: Dan janganlah kamu memakan binatang-binatang yang tidak disebut nama Allah ketika menyembelihnya, ia berkata; orang-orang musyrikin mempermasalahkan hal itu dan mereka berkata; apa yang disembelih Allah janganlah kalian memakan sedangkan apa yang kalian sembelih boleh kalian memakannya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "77",
    "matchingArabicURN": "1144520",
    "last_updated": null
  },
  {
    "indonesianURN": "3243620",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1907",
    "babName": "Larangan menjadikan hewan sebagai obyek lemparan",
    "hadithNumber": "4362",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Utsman, ia berkata; telah menceritakan kepada kami Baqiyah dari Bahir dari Khalid dari Jubair bin Nufair dari Abu Tsa'labah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal menjadikan hewan sebagai sasaran memanah.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "78",
    "matchingArabicURN": "1144530",
    "last_updated": null
  },
  {
    "indonesianURN": "3243630",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1907",
    "babName": "Larangan menjadikan hewan sebagai obyek lemparan",
    "hadithNumber": "4363",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud, ia berkata; telah menceritakan kepada kami Khalid dari Syu'bah dari Hisyam bin Zaid, ia berkata; saya bersama Anas menemui Al Hakam yaitu Ibnu Ayyub, ternyata orang-orang sedang membidik ayam di rumah Al Amir, kemudian ia berkata; Rasulullah shallallahu 'alaihi wasallam telah melarang hewan-hewan ternak dijadikan sasaran.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "79",
    "matchingArabicURN": "1144540",
    "last_updated": null
  },
  {
    "indonesianURN": "3243640",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1907",
    "babName": "Larangan menjadikan hewan sebagai obyek lemparan",
    "hadithNumber": "4364",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Zunbur Al Makki, dia berkata; telah menceritakan kepada kami Ibnu Abu Hazim dari Yazid dan dia adalah Ibnu Al Had dai Mu'awiyyah bin Abdullah bin Ja'far dari Abdullah bin Ja'far ia berkata Rasulullah shallallahu 'alaihi wasallam melewati sekelompok orang yang sedang melempari seekor kambing dengan tombak, beliau membenci hal itu dan bersabda: \" Janganlah kalian mencincang hewan.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "80",
    "matchingArabicURN": "1144550",
    "last_updated": null
  },
  {
    "indonesianURN": "3243650",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1907",
    "babName": "Larangan menjadikan hewan sebagai obyek lemparan",
    "hadithNumber": "4365",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Husyaim dari Abu Bisyr dari Sa'id bin Jubair dari Ibnu Umar, ia berkata; Rasulullah shallallahu 'alaihi wasallam melaknat orang yang orang yang menjadikan sesuatu yang bernyawa sebagai sasaran.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "81",
    "matchingArabicURN": "1144560",
    "last_updated": null
  },
  {
    "indonesianURN": "3243660",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1907",
    "babName": "Larangan menjadikan hewan sebagai obyek lemparan",
    "hadithNumber": "4366",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Yahya, ia berkata; telah menceritakan kepada kami Syu'bah, ia berkata; telah menceritakan kepadaku Al Minhal bin 'Amr dari Sa'id bin Jubair dari Ibnu Umar, ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \" Allah melaknat orang yang mencincang hewan.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "82",
    "matchingArabicURN": "1144570",
    "last_updated": null
  },
  {
    "indonesianURN": "3243670",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1907",
    "babName": "Larangan menjadikan hewan sebagai obyek lemparan",
    "hadithNumber": "4367",
    "hadithText": "Telah mengabarkan kepada kami Suwaid bin Nashr, ia berkata; telah memberitakan kepada kami Abdullah dari Syu'bah dari 'Adi bin Tsabit dari Sa'id bin Jubair dari Ibnu Abbas bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian jadikan sesuatu yang bernyawa sebagai sasaran.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "83",
    "matchingArabicURN": "1144580",
    "last_updated": null
  },
  {
    "indonesianURN": "3243680",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1907",
    "babName": "Larangan menjadikan hewan sebagai obyek lemparan",
    "hadithNumber": "4368",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Ubaid Al Kufi, ia berkata; telah menceritakan kepada kami Ali bin Hasyim dari Al 'Ala` bin Shalih dari 'Adi bin Tsabit dari Sa'id bin Jubair dari Ibnu Abbas bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menjadikan sesuatu yang bernyawa sebagai sasaran.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "84",
    "matchingArabicURN": "1144590",
    "last_updated": null
  },
  {
    "indonesianURN": "3243690",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1908",
    "babName": "Membunuh burung dengan tanpa haknya",
    "hadithNumber": "4369",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Sufyan dari 'Amr dari Shuhaib dari Abdullah bin 'Amr dan ia memarfu'kannya: \"Barang siapa yang membunuh burung pipit tanpa hak, maka Allah 'azza wajalla akan menanyakan mengenainya pada hari Kiamat.\" Dikatakan kepada Rasulullah shallallahu 'alaihi wasallam; wahai Rasulullah, apakah haknya? Beliau bersabda: \"Menyembelihnya dan memakannya serta tidak memotong kepalanya kemudia membuangnya.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "85",
    "matchingArabicURN": "1144600",
    "last_updated": null
  },
  {
    "indonesianURN": "3243700",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1908",
    "babName": "Membunuh burung dengan tanpa haknya",
    "hadithNumber": "4370",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Daud Al Mishshishi, ia berkata; telah menceritakan kepada kami Ahmad bin Hanbal, ia berkata; telah menceritakan kepada kami Abu 'Ubaidah Abdul Wahid bin Washil dari Khalaf yaitu Ibnu Mahran, ia berkata; telah menceritakan kepada kami 'Amir Al Ahwal dari Shalih bin Dinar dari 'Amr bin Asy Syarid, ia berkata; saya mendengar Asy Syarid berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membunuh burung pipit dengan sia-sia maka burung tersebut akan berteriak kepada Allah, dan mengatakan; wahai Tuhanku, sesungguhnya Fulan telah membunuhku dengan sia-sia dan tidak membunuhku untuk suatu manfaat.\"</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "86",
    "matchingArabicURN": "1144610",
    "last_updated": null
  },
  {
    "indonesianURN": "3243710",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1909",
    "babName": "Larangan makan daging hewan yang menyantap makanan menjijikkan (kotoran)",
    "hadithNumber": "4371",
    "hadithText": "Telah mengabarkan kepada kami Utsman bin Abdullah, ia berkata; telah menceritakan kepadaku Sahl bin Bakkar, ia berkata; telah menceritakan kepada kami Wuhaib bin Khalid dari Ibnu Thawus dari 'Amr bin Syu'aib dari ayahnya dari ayahnya yaitu Muhammad bin Abdullah bin 'Amr, sesekali, ia berkata; dari ayahnya, dan sesekali, ia berkata; dari kakeknya. Bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang pada saat perang Khaibar dari daging keledai jinak, dan dari hewan yang diberi makan kotoran, dan dari menaikinya serta memakan dagingnya.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "87",
    "matchingArabicURN": "1144620",
    "last_updated": null
  },
  {
    "indonesianURN": "3243720",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "43",
    "bookName": "Hewan sembelihan",
    "babNumber": "1910",
    "babName": "Larangan susu hewan yang menyantap makanan menjijikkan (kotoran)",
    "hadithNumber": "4372",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud, ia berkata; telah menceritakan kepada kami Khalid, ia berkata; telah menceritakan kepada kami Hisyam, ia berkata; telah menceritakan kepada kami Qatadah dari Ikrimah dari Ibnu Abbas, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menjadikan binatang sebagai sasaran, dan susu binatang yang diberi makan kotoran serta minum dari geriba.</b>",
    "bookID": "43.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "88",
    "matchingArabicURN": "1144630",
    "last_updated": null
  }
]