[
  {
    "indonesianURN": "3243730",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1911",
    "babName": "Motivasi BEKERJA",
    "hadithNumber": "4373",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id Abu Qudamah As Sarkhasi, ia berkata; telah menceritakan kepada kami Yahya bin Sa'id dari Sufyan dari Manshur dari Ibrahim dari 'Umarah bin 'Umair dari bibinya dari Aisyah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya sebaik-baik apa yang dimakan seseorang adalah yang berasal dari usahanya, dan sesungguhnya anak seseorang adalah berasal dari usahanya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "1144640",
    "last_updated": null
  },
  {
    "indonesianURN": "3243740",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1911",
    "babName": "Motivasi BEKERJA",
    "hadithNumber": "4374",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur, ia berkata; telah menceritakan kepada kami Sufyan, ia berkata; telah menceritakan kepada kami Al A'masy dari Ibrahim dari 'Umarah bin 'Umair dari bibinya dari Aisyah bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya anak-anak kalian adalah merupakan usaha kalian yang terbaik. Maka makanlah dari usaha anak-anakmu.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "1144650",
    "last_updated": null
  },
  {
    "indonesianURN": "3243750",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1911",
    "babName": "Motivasi BEKERJA",
    "hadithNumber": "4375",
    "hadithText": "Telah mengabarkan kepada kami Yusuf bin Isa, ia berkata; telah memberitakan kepada kami Al Fadhl bin Musa, ia berkata; telah memberitakan kepada kami Al A'masy dari Ibrahim dari Al Aswad dari Aisyah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Sesungguhnya sebaik-baik apa yang dimakan oleh seseorang adalah yang berasal dari usahanya, dan anaknya adalah berasal dari usahanya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "1144660",
    "last_updated": null
  },
  {
    "indonesianURN": "3243760",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1911",
    "babName": "Motivasi BEKERJA",
    "hadithNumber": "4376",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Hafsh bin Abdullah An Naisaburi, ia berkata; telah menceritakan kepadaku ayahku, ia berkata; telah menceritakan kepadaku Ibrahim bin Thahman dari Umar bin Sa'id dari Al A'masy dari Ibrahim dari Al Aswad dari Aisyah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Sesungguhnya sebaik-baik apa yang dimakan seseorang adalah yang berasal dari usahanya dan anaknya adalah berasal dari usahanya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "1144670",
    "last_updated": null
  },
  {
    "indonesianURN": "3243770",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1912",
    "babName": "Menghindari yang meragukan ketika mencari penghasilan",
    "hadithNumber": "4377",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la Ash Shan'ani, ia berkata; telah menceritakan kepada kami Khalid yaitu Ibnu Al Harits, ia berkata; telah menceritakan kepada kami Ibnu 'Aun dari Asy Sya'bi, ia berkata; saya mendengar An Nu'man bin Basyir, ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam, demi Allah saya tidak mendengar seorangpun setelahnya, ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya yang halal itu jelas dan yang haram itu jelas. Dan diantara hal itu terdapat perkara-perkara yang tidak jelas dan akan saya berikan permisalan kepadamu dalam hal tersebut; sesungguhnya alla 'azza wajalla telah membuat daerah larangan dan sesungguhnya daerah larangan Allah 'azza wajalla adalah apa yang Dia haramkan. Sesunggunya orang yang menggembala di sekitar daerah larangan akan memasuki daerah larangan.\" Dan terkadang beliau bersabda: \"Barang siapa yang menggembala di sekitar daerah larangan akan menggembala di dalamnya, dan orang yang memasuki sesuatu yang meragukan maka ia akan menyeberanginya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "1144680",
    "last_updated": null
  },
  {
    "indonesianURN": "3243780",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1912",
    "babName": "Menghindari yang meragukan ketika mencari penghasilan",
    "hadithNumber": "4378",
    "hadithText": "Telah mengabarkan kepada kami Al Qasim bin Zakariya bin Dinar, ia berkata; telah menceritakan kepada kami Abu Daud Al Hafari dari Sufyan dari Muhammad bin Abdurrahman dari Al Maqburi dari Abu Hurairah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan datang kepada manusia suatu zaman dimana seseorang tidak peduli darimana ia mendapatkan harta, dari yang halal atau yang haram.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "1144690",
    "last_updated": null
  },
  {
    "indonesianURN": "3243790",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1912",
    "babName": "Menghindari yang meragukan ketika mencari penghasilan",
    "hadithNumber": "4379",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Ibnu Abu 'Adi dari Daud bin Abu Hindun dari Sa'id bin Abu Khubairah dari Al Hasan dari Abu Hurairah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan datang kepada manusia suatu zaman, dimana mereka makan riba, dan orang yang tidak memakannya ia akan mendapatkan debunya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "1144700",
    "last_updated": null
  },
  {
    "indonesianURN": "3243800",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1913",
    "babName": "Bisnis atau dagang",
    "hadithNumber": "4380",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah memberitakan kepada kami Wahb bin Jarir, ia berkata; telah menceritakan kepadaku ayahku dari Yunus dari Al Hasan dari 'Amr bin Taghlib, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya diantara tanda-tanda Hari Kiamat adalah semakin banyaknya harta dan menyebarnya perdagangan, munculnya pengetahuan, seseorang menjual barang dan berkata; jangan engkau jual hingga aku meminta pertimbangan penjual dari Bani Fulan dan dicari seorang penulis yang adal disuatu kampung yang besar namun tidak ditemukan.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "1144710",
    "last_updated": null
  },
  {
    "indonesianURN": "3243810",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1914",
    "babName": "Prinsip-prinsip yang harus dijaga pedagang dalam bisnis",
    "hadithNumber": "4381",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali dari Yahya, ia berkata; telah menceritakan kepada kami Syu'bah, ia berkata; telah menceritakan kepadaku Qatadah dari Abu Al Khalil dari Abdullah bin Al Harits dari Hakim bin Hizam, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang berjual beli memiliki hak memilih selama mereka belum berpisah, apabila keduanya berbuat jujur dan memberikan penjelasan maka jual beli mereka akan mendapatkan berkah, dan apabila mereka berdusta dan menyembunyikan aib maka akan dihapuskan berkah jual beli mereka.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "1144720",
    "last_updated": null
  },
  {
    "indonesianURN": "3243820",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1915",
    "babName": "Melariskan dagangan dengan sumpah palsu",
    "hadithNumber": "4382",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dari Muhammad, ia berkata; telah menceritakan kepada kami Syu'bah dari Ali bin Mudrik dari Abu Zur'ah bin 'Amr bin Jarir dari Kharasyah bin Al Hurr dari Abu Dzar dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tiga orang yang tidak akan diajak bicara Allah pada Hari Kiamat dan Allah tidak akan melihatnya serta mensucikannya dan mereka mendapatkan adzab yang pedih kemudian Rasulullah shallallahu 'alaihi wasallam membacakannya. Abu Dzar berkata; mereka telah binasa dan merugi. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang memanjangkan kainya melebihi mata kaki, orang yang menjual barangnya dengan sumpah palsu, serta orang yang mengungkit-ungkit pemberiannya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "1144730",
    "last_updated": null
  },
  {
    "indonesianURN": "3243830",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1915",
    "babName": "Melariskan dagangan dengan sumpah palsu",
    "hadithNumber": "4383",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Yahya, ia berkata; telah menceritakan kepada kami Sufyan, ia berkata; telah menceritakan kepadaku Sulaiman Al A'masy dari Sulaiman bin Mushir dari Kharasyah bin Al Hurr dari Abu Dzar dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: Tiga orang yang tidak akan diajak bicara Allah pada Hari Kiamat dan Allah tidak akan melihatnya serta mensucikannya dan mereka mendapatkan adzab yang pedih yaitu; orang yang tidak memberi sesuatu melainkan ia mengungkitnya, orang yang memanjangkan kainnya hingga melebihi mata kaki, dan orang yang menjual barangnya dengan sumpah palsu.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "1144740",
    "last_updated": null
  },
  {
    "indonesianURN": "3243840",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1915",
    "babName": "Melariskan dagangan dengan sumpah palsu",
    "hadithNumber": "4384",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Abdullah, ia berkata; telah menceritakan kepada kami Abu Usamah, ia berkata; telah memberitakan kepadaku Al Walid yaitu Ibnu Katsir dari Ma'bad bin Ka'b bin Malik dari Abu Qatadah Al Anshari bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berhati-hatilah kalian dari sering bersumpah dalam berjual beli, karena sesungguhnya bisa jadi ia menjual kemudian dihilangkan berkahnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "1144750",
    "last_updated": null
  },
  {
    "indonesianURN": "3243850",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1915",
    "babName": "Melariskan dagangan dengan sumpah palsu",
    "hadithNumber": "4385",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin 'Amr bin As Sarh, ia berkata; telah menceritakan kepada kami Ibnu Wahb dari Yunus dari Ibnu Syihab dari Sa'id bin Al Musayyab dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sumpah akan melariskan barang dagangan dan menghilangkan kelarisannya dalam sangkaan orang yang bersumpah.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "1144760",
    "last_updated": null
  },
  {
    "indonesianURN": "3243860",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1916",
    "babName": "Sumpah untuk penipuan penjualan",
    "hadithNumber": "4386",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah memberitakan kepada kami Jarir dari Al A'masy dari Abu Shalih dari Abu Hurairah dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Tiga orang yang tidak akan diajak bicara Allah 'azza wajalla dan Allah tidak akan melihat mereka pada Hari Kiamat serta tidak akan mensucikan mereka dan bagi mereka siksaan yang pedih, yaitu; orang yang memiliki kelebihan air dijalan dan ia melarang orang yang dalam perjalan untuk mengambilnya, seseorang yang membai'at imam karena urusan dunia, apabila ia memberi apa yang ia inginkan maka ia akan menunaikan haknya dan apabila ia tidak memberinya maka ia tidak memenuhi haknya, dan seseorang yang menawar barang orang lain setelah Ashar dan bersumpah kepadanya dengan nama Allah sungguh ia telah diberi dengan harga sekian dan sekian, kemudian orang lain mempercayainya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "1144770",
    "last_updated": null
  },
  {
    "indonesianURN": "3243870",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1917",
    "babName": "Perintah bersedekah bagi yang belum yakin daganganya disertai keberkahan",
    "hadithNumber": "4387",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Qudamah dari Jarir dari Manshur dari Abu Wail dari Qais bin Abu Gharazah, ia berkata; dahulu kami di Madinah menjual beberapa wasaq makanan dan juga membelinya, kami kami serta orang-orang menamai diri kami para calo, kemudian Rasulullah shallallahu 'alaihi wasallam mendatangi kami dan menamai kami dengan nama yang lebih baik bagi kami daripada apa yang telah kami namai diri kami dengannya. Beliau bersabda: \"Wahai para pedagang, sesungguhnya jual beli kalian disaksikan oleh orang bersumpah dan sesuatu yang sia-sia, maka campurlah dengan sedekah.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "1144780",
    "last_updated": null
  },
  {
    "indonesianURN": "3243880",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1918",
    "babName": "Kewajiban memilih antara penjual-pembeli selama belum berpisah",
    "hadithNumber": "4388",
    "hadithText": "Telah mengabarkan kepada kami Abu Al Asy'ats dari Khalid, ia berkata; telah menceritakan kepada kami Sa'id yaitu Ibnu Abu 'Arubah dari Qatadah dari Shalih Abu Al Khalil dari Abdullah bin Al Harits dari Hakim bin Hizam bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang berjual beli memiliki hak memilih selama mereka belum berpisah, apabila keduanya berbuat jujur dan memberikan penjelasan maka jual beli mereka akan mendapatkan berkah, dan apabila mereka berdusta dan menyembunyikan aib maka akan dihapuskan berkah jual beli mereka.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "1144790",
    "last_updated": null
  },
  {
    "indonesianURN": "3243890",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1919",
    "babName": "Perbedaan Nafi' pada lafadz hadisnya",
    "hadithNumber": "4389",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dan Al Harits bin Miskin dengan membacakan riwayat dan saya mendengar, lafazh hadits ini adalah lafazh Al Harits, dari Al Qasim, ia berkata; telah menceritakan kepadaku Malik dari Nafi' dari Abdullah bin Umar bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang berjual beli setiap mereka memiliki hak memilih atas sahabatnya selama mereka belum berpisah, kecuali jual beli dengan syarat ada hak memilih.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "17",
    "matchingArabicURN": "1144800",
    "last_updated": null
  },
  {
    "indonesianURN": "3243900",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1919",
    "babName": "Perbedaan Nafi' pada lafadz hadisnya",
    "hadithNumber": "4390",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Yahya dari 'Ubaidullah, ia berkata; telah menceritakan kepadaku Nafi' dari Ibnu Umar bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang berjual beli memiliki hak memilih selama mereka belum berpisah, atau merupakan jual beli dengan syarat memiliki hak memilih.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "18",
    "matchingArabicURN": "1144810",
    "last_updated": null
  },
  {
    "indonesianURN": "3243910",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1919",
    "babName": "Perbedaan Nafi' pada lafadz hadisnya",
    "hadithNumber": "4391",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Ali Al Marwazi, ia berkata; telah menceritakan kepada kami Muhriz bin Al Wadhdhah dari Isma'il dari Nafi' dari Ibnu Umar, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang berjual beli memiliki hak memilih selama mereka belum berpisah, kecuali jual beli tersebut dengan syarat adanya hak memilih, apabila jual beli tersebut dengan syarat adanya hak memilih maka jual beli tersebut telah tetap.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "19",
    "matchingArabicURN": "1144820",
    "last_updated": null
  },
  {
    "indonesianURN": "3243920",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1919",
    "babName": "Perbedaan Nafi' pada lafadz hadisnya",
    "hadithNumber": "4392",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Maimun, ia berkata; telah menceritakan kepada kami Sufyan dari Ibnu Juraij, ia berkata; Ali mendektekan kepada Nafi' dari Ibnu Umar, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila dua orang yang berjual beli telah melakukan jual beli maka setiap mereka memiliki hak memilih dalam jual belinya selama mereka belum berpisah, atau jual beli mereka dengan syarat adanya hak memilih, apabila dengan syarat adanya hak memilih maka jual beli tersebut telah tetap.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "20",
    "matchingArabicURN": "1144830",
    "last_updated": null
  },
  {
    "indonesianURN": "3243930",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1919",
    "babName": "Perbedaan Nafi' pada lafadz hadisnya",
    "hadithNumber": "4393",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Abdul A'la, ia berkata; telah menceritakan kepada kami Syu'bah dari Ayyub dari Nafi' dari Ibnu Umar bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penjual dan pembali memiliki hak memilih selama mereka belum berpisah, atau salah seorang dari mereka mengatakan kepada yang lain; pilihlah.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "21",
    "matchingArabicURN": "1144840",
    "last_updated": null
  },
  {
    "indonesianURN": "3243940",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1919",
    "babName": "Perbedaan Nafi' pada lafadz hadisnya",
    "hadithNumber": "4394",
    "hadithText": "Telah mengabarkan kepada kami Ziyad bin Ayyub, ia berkata; telah menceritakan kepada kami Ibnu Ulayyah, ia berkata; telah memberitakan kepada kami Ayyub dari Nafi' dari Ibnu Umar, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pedagang dan pembeli memiliki hak memilih hingga mereka memilih, atau jual beli tersebut adalah jual beli dengan syarat adanya hak memilih.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "22",
    "matchingArabicURN": "1144850",
    "last_updated": null
  },
  {
    "indonesianURN": "3243950",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1919",
    "babName": "Perbedaan Nafi' pada lafadz hadisnya",
    "hadithNumber": "4395",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Al Laits dari Nafi' dari Ibnu Umar dari Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pedagang dan pembeli memiliki hak memilih atau merupakan jual beli dengan syarat adanya hak memilih.\" Dan terkadang Nafi' mengatakan; atau salahj seorang dari mereka berkata kepada yang lain; pilihlah.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "23",
    "matchingArabicURN": "1144860",
    "last_updated": null
  },
  {
    "indonesianURN": "3243960",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1919",
    "babName": "Perbedaan Nafi' pada lafadz hadisnya",
    "hadithNumber": "4396",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Al Laits dari Nafi' dari Ibnu Umar dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Apabila dua orang saling berjaul beli maka setiap mereka memiliki hak memilih hingga mereka berpisah\" dan berkata sekali lagi; selama mereka belum berpisah atau salah seorang diantara mereka memberikan hak memilih kepada yang lain, maka apabila salah seorang diantara mereka memberikan hak memilih kepada kepada yang lain kemudian mereka berjual beli atas dasar hal tersebut maka jual beli mereka telah tetap, kemudian apabila mereka berpisah setelah melakukan jual beli dan salah seorang diantara mereka tidak meninggalkan jual beli maka jual beli tersebut telah tetap\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "24",
    "matchingArabicURN": "1144870",
    "last_updated": null
  },
  {
    "indonesianURN": "3243970",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1919",
    "babName": "Perbedaan Nafi' pada lafadz hadisnya",
    "hadithNumber": "4397",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Abdul Wahhab, ia berkata; saya mendengar Yahya bin Sa'id berkata; saya mendengar Nafi' menceritakan dari Ibnu Umar dari Rasulullah shallallahu 'alaihi wasallam; sesungguhnya dua orang yang berjual beli memiliki hak memilih dalam jual beli selama mereka belum berpisah kecuali jual beli tersebut berdasarkan atas hak memilih. Nafi' berkata; dan Abdullah apabila membeli sesuatu yang menarik baginya maka ia cepat meninggalkan pemiliknya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "25",
    "matchingArabicURN": "1144880",
    "last_updated": null
  },
  {
    "indonesianURN": "3243980",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1919",
    "babName": "Perbedaan Nafi' pada lafadz hadisnya",
    "hadithNumber": "4398",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr, ia berkata; telah menceritakan kepada kami Husyaim dari Yahya bin Sa'id, ia berkata; telah menceritakan kepada kami Nafi' dari Ibnu Umar, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang berjual beli tidak ada jual beli antara mereka berdua hingga mereka berpisah, kecuali jual beli dengah syarat adanya hak memilih.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "26",
    "matchingArabicURN": "1144890",
    "last_updated": null
  },
  {
    "indonesianURN": "3243990",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1920",
    "babName": "Perbedaan Abdullah bin dinar pada lafadz hadis",
    "hadithNumber": "4399",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr dari Isma'il dari Abdullah bin Dinar dari Ibnu Umar, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap dua orang yang berjual beli tidak ada jual beli diantara mereka hingga mereka berpisah kecuali jual beli dengan syarat adanya hak memilih.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "27",
    "matchingArabicURN": "1144900",
    "last_updated": null
  },
  {
    "indonesianURN": "3244000",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1920",
    "babName": "Perbedaan Abdullah bin dinar pada lafadz hadis",
    "hadithNumber": "4400",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Abdul Hakam dari Syu'aib dari Al Laits dari Ibnu Al Had dari Abdullah bin Dinar dari Abdullah bin Umar bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap dua orang yang berjual beli tidak ada jual beli diantara mereka hingga mereka berpisah kecuali jual beli dengan syarat adanya hak memilih.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "28",
    "matchingArabicURN": "1144910",
    "last_updated": null
  },
  {
    "indonesianURN": "3244010",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1920",
    "babName": "Perbedaan Abdullah bin dinar pada lafadz hadis",
    "hadithNumber": "4401",
    "hadithText": "Telah mengabarkan kepada kami Abdul Hamid bin Muhammad, ia berkata; telah menceritakan kepada kami Makhlad, ia berkata; telah menceritakan kepada kami Sufyan dari 'Amr bin Dinar dari Ibnu Umar, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap dua orang yang berjual beli tidak ada jual beli diantara mereka hingga mereka berpisah kecuali jual beli dengan syarat adanya hak memilih.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "29",
    "matchingArabicURN": "1144920",
    "last_updated": null
  },
  {
    "indonesianURN": "3244020",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1920",
    "babName": "Perbedaan Abdullah bin dinar pada lafadz hadis",
    "hadithNumber": "4402",
    "hadithText": "Telah mengabarkan kepada kami Ar Rabi' bin Sulaiman bin Daud, ia berkata; telah menceritakan kepada kami Ishaq bin Bakr, ia berkata; telah menceritakan kepada kami ayahku dari Yazid dari Abdullah bin Dinar dari Ibnu Umar bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap dua orang yang berjual beli tidak ada jual beli diantara mereka hingga mereka berpisah kecuali jual beli dengan syarat adanya hak memilih.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "30",
    "matchingArabicURN": "1144930",
    "last_updated": null
  },
  {
    "indonesianURN": "3244030",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1920",
    "babName": "Perbedaan Abdullah bin dinar pada lafadz hadis",
    "hadithNumber": "4403",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Yazid dari Bahz bin Asad, ia berkata; telah menceritakan kepada kami Syu'bah, ia berkata; telah menceritakan kepada kami Abdullah bin Dinar dari Ibnu Umar, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap dua orang yang berjual beli tidak ada jual beli diantara mereka hingga mereka berpisah kecuali jual beli dengan syarat adanya hak memilih.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "31",
    "matchingArabicURN": "1144940",
    "last_updated": null
  },
  {
    "indonesianURN": "3244040",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1920",
    "babName": "Perbedaan Abdullah bin dinar pada lafadz hadis",
    "hadithNumber": "4404",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Sufyan dari Abdullah bin Dinar dari Ibnu Umar dari Nabi shallallahu 'alaihi wasallam bersabda: \"Setiap dua orang yang berjual beli memiliki hak memilih selama mereka belum berpisah atau jual beli mereka dengan syarat adanya hak memilih.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "32",
    "matchingArabicURN": "1144950",
    "last_updated": null
  },
  {
    "indonesianURN": "3244050",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1920",
    "babName": "Perbedaan Abdullah bin dinar pada lafadz hadis",
    "hadithNumber": "4405",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Mu'adz bin Hisyam, ia berkata; telah menceritakan kepadaku ayahku dari Qatadah dari Al Hasan dari Samrah bahwasanya Nabi shallallahu 'alaihi wasallam bersabda: \"Penjual dan pembeli mempunyai hak memilih hingga mereka berpisah atau setiap mereka mengambil yang ia inginkan dari jual beli tersebut dan saling memilih sebanyak tiga kali.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "33",
    "matchingArabicURN": "1144960",
    "last_updated": null
  },
  {
    "indonesianURN": "3244060",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1920",
    "babName": "Perbedaan Abdullah bin dinar pada lafadz hadis",
    "hadithNumber": "4406",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Isma'il bin Ibrahim, ia berkata; telah menceritakan kepada kami Yazid, ia berkata; telah memberitakan kepada kami Hammam dari Qatadah dari Al Hasan dari Samurah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang berjual beli memiliki hak memilih selama mereka belum berpisah dan sebelum salah seorang dari mereka mengambil apa yang ia ridhai dari sahabatnya atau ia inginkan.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "34",
    "matchingArabicURN": "1144970",
    "last_updated": null
  },
  {
    "indonesianURN": "3244070",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1921",
    "babName": "Kewajiban memilih antara penjual-pembeli sebelum berpisah badannya",
    "hadithNumber": "4407",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah memberitakan kepada kami Al Laits dari Ibnu 'Ajlan dari 'Amr bin Syu'aib dari ayahnya dari kakeknya bahwa Nabi shallallahu 'alaihi wasallam bersabda: \" Dua orang yang berjual beli memiliki hak memilih selama mereka belum berpisah kecuali jika ada kesepakatan hak memilih, dan tidak halal baginya untuk meninggalkan sahabatnya karena takut jika ia membatalkan jual beli tersebut.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "35",
    "matchingArabicURN": "1144980",
    "last_updated": null
  },
  {
    "indonesianURN": "3244080",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1922",
    "babName": "Penipuan penjualan",
    "hadithNumber": "4408",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id dari Malik dari Abdullah bin Dinar dari Ibnu Umar bahwa seorang laki-laki menyebutkan kepada Nabi shallallahu 'alaihi wasallam bahwa ia tertipu dalam berjual beli. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Apabila engkau menjual maka katakanlah; tidak boleh ada penipuan.\" Kemudian orang tersebut apabila hendak menjual maka ia mengatakan; tidak boleh ada penipuan.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "36",
    "matchingArabicURN": "1144990",
    "last_updated": null
  },
  {
    "indonesianURN": "3244090",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1922",
    "babName": "Penipuan penjualan",
    "hadithNumber": "4409",
    "hadithText": "Telah mengabarkan kepada kami Yusuf bin Hammad, ia berkata; telah menceritakan kepada kami Abdul A'la dari Sa'id dari Qatadah dari Anas bahwa ada seseorang yang memiliki kelemahan pada lisannya, keluarganya mendatangi Nabi shallallahu 'alaihi wasallam dan berkata; wahai Nabi Allah, laranglah ia berjualan, lalu Nabi shallallahu 'alaihi wasallam memanggilnya dan melarangnya, ia berkata; wahai Rasulullah, sesungguhnya saya tidak sabar untuk berjual beli. Beliau bersabda: \"Jika engkau berjualan maka katakanlah tidak boleh ada tipuan.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "37",
    "matchingArabicURN": "1145000",
    "last_updated": null
  },
  {
    "indonesianURN": "3244100",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1923",
    "babName": "Susu yang dibiarkan tidak diperas untuk penipuan",
    "hadithNumber": "4410",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah memberitakan kepada kami Abdur Razzaq telah menceritakan kepada kami Ma'mar dari Yahya bin Abu Katsir, ia berkata; telah menceritakan kepadaku Abu Katsir bahwa ia mendengar Abu Hurairah berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian menjual kambing atau unta perah maka janganlah engkau menahan air susunya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "38",
    "matchingArabicURN": "1145010",
    "last_updated": null
  },
  {
    "indonesianURN": "3244110",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1924",
    "babName": "Larangan menahan susu dalam kantung untuk penipuan",
    "hadithNumber": "4411",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur, ia berkata; telah menceritakan kepada kami Sufyan dari Abu Az Zinad dari Al A'raj dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah kalian menyambut orang-orang yang membawa barang dagangan ke kota untuk berjual beli, dan jangan kalian menahan air susu unta dan kambing dalam kantongnya. Barang siapa yang membeli sesuatu dari hal tersebut maka ia berhak memilih yang terbaik dari dua pendapatnya, apabila ia mau maka ia bisa menahannya dan apabila ia mau ingin mengembalikannya maka ia mengembalikannya disertai dengan satu sha' kurma.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "39",
    "matchingArabicURN": "1145020",
    "last_updated": null
  },
  {
    "indonesianURN": "3244120",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1924",
    "babName": "Larangan menahan susu dalam kantung untuk penipuan",
    "hadithNumber": "4412",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah menceritakan kepada kami Abdullah bin Al Harits, ia berkata; telah menceritakan kepada kami Daud bin Qais, dari Ibnu Yasar dari Abu Hurairah dari Rasulullah beliau bersabda: \"Barang siapa yang membeli hewan yang ditahan ais susu yang ada dalam kantongnya kemudian apabila ia ridha terhadapnya ketika memerahnya maka hendaknya ia menahannya dan apabila ia tidak menyukainya maka hendaknya ia mengembalikannya di sertai satu sha' kurma.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "40",
    "matchingArabicURN": "1145030",
    "last_updated": null
  },
  {
    "indonesianURN": "3244130",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1924",
    "babName": "Larangan menahan susu dalam kantung untuk penipuan",
    "hadithNumber": "4413",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur, ia berkata; telah menceritakan kepada kami Sufyan dari Ayyub dari Muhammad, ia berkata; saya mendengar Abu Hurairah berkata; Abu Al Qasim shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membeli hewan yang ditahan air susu yang ada dalam kantongnya maka ia memiliki hak memilih selama tiga hari, apabila ia ingin menahannya maka ia menahannya dan apabila ia ingin mengembalikannya maka ia mengembalikannya disertai satu sha' kurma tidak harus yang berwarna sawo matang.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "41",
    "matchingArabicURN": "1145040",
    "last_updated": null
  },
  {
    "indonesianURN": "3244140",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1925",
    "babName": "Pembelian yang dimungkinkan ada cacat, harus memperoleh garansi",
    "hadithNumber": "4414",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah menceritakan kepada kami Isa bin Yunus dan Waki' mereka berkata; telah menceritakan kepada kami Ibnu Abu Dzi`b dari Makhlad bin Khufaf dari 'Urwah dari 'Aisyah ia berkata; Rasulullah shallallahu 'alaihi wasallam menetapkan bahwa manfaat yang di dapat disertai dengan tanggungan.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "42",
    "matchingArabicURN": "1145050",
    "last_updated": null
  },
  {
    "indonesianURN": "3244150",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1926",
    "babName": "Orang yang berhijrah (metropolis) menjual kepada arab badwi (primitif)",
    "hadithNumber": "4415",
    "hadithText": "Telah mengabarkan kepadaku Abdullah bin Muhammad bin Tamim, ia berkata; telah menceritakan kepada kami Hajjaj, ia berkata; telah menceritakan kepadaku Syu'bah dari 'Adi bin Tsabit dari Abu Hazim dari Abu Hurairah, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menyambut orang-orang yang membawa dagangan sebelum sampai pasar, dan seorang muhajir menjualkan barang untuk orang badui, dan dari menahan air susu hewan dalam kantongnya, serta seseorang menawar atas penawaran saudaranya dan seorang wanita meminta agar saudaranya dicerai.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "43",
    "matchingArabicURN": "1145060",
    "last_updated": null
  },
  {
    "indonesianURN": "3244160",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1927",
    "babName": "Orang kota (metropolis) menjual kepada orang pelosok (badwi)",
    "hadithNumber": "4416",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar, ia berkata; telah menceritakan kepadaku Muhammad bin Az Zibriqan, ia berkata; telah menceritakan kepada kami Yunus bin 'Ubaid dari Al Hasan dari Anas bahwasanya Nabi shallallahu 'alaihi wasallam melarang orang yang tinggal di kota menjualkan untuk orang yang di pelosok walaupun ia adalah bapak atau saudaranya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "44",
    "matchingArabicURN": "1145070",
    "last_updated": null
  },
  {
    "indonesianURN": "3244170",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1927",
    "babName": "Orang kota (metropolis) menjual kepada orang pelosok (badwi)",
    "hadithNumber": "4417",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna, ia berkata; telah menceritakan kepadaku Salim bin Nuh, ia berkata; telah memberitakan kepada kami Yunus dari Muhammad bin Sirin dari Anas bin Malik, ia berkata; kita dilarang orang yang tinggal di kota menjualkan untuk orang yang tinggal di pelosok walaupun ia adalah saudara atau bapaknya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "45",
    "matchingArabicURN": "1145080",
    "last_updated": null
  },
  {
    "indonesianURN": "3244180",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1927",
    "babName": "Orang kota (metropolis) menjual kepada orang pelosok (badwi)",
    "hadithNumber": "4418",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la, ia berkata; telah menceritakan kepada kami Khalid, ia berkata; telah menceritakan kepada kami Ibnu 'Aun dari Muhammad dari Anas, ia berkata; kita dilarang orang yang tinggal di kota menjualkan untuk orang yang tinggal di pelosok.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "46",
    "matchingArabicURN": "1145090",
    "last_updated": null
  },
  {
    "indonesianURN": "3244190",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1927",
    "babName": "Orang kota (metropolis) menjual kepada orang pelosok (badwi)",
    "hadithNumber": "4419",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Al Hasan, ia berkata; telah menceritakan kepada kami Hajjaj, ia berkata; Ibnu Juraij berkata; telah mengabarkan kepadaku Abu Az Zubair bahwa ia telah mendengar Jabir berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh orang yang tinggal di kota menjualkan untuk orang yang tinggal di desa, biarkan manusia Allah memberi rizki sebagian mereka dengan sebagian yang lain.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "47",
    "matchingArabicURN": "1145100",
    "last_updated": null
  },
  {
    "indonesianURN": "3244200",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1927",
    "babName": "Orang kota (metropolis) menjual kepada orang pelosok (badwi)",
    "hadithNumber": "4420",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Abu Az Zinad dari Al A'raj dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah menyambut orang yang membawa barang dagangan sebelum sampai pasar dan janganlah sebagian kalian menjual di atas jual beli sebagian yang lainnya dan janganlah berpura-pura menawar agar mengecoh pembeli yang lain, dan janganlah orang yang tinggal di kota menjualkan untuk orang yang tinggal di pelosok.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "48",
    "matchingArabicURN": "1145110",
    "last_updated": null
  },
  {
    "indonesianURN": "3244210",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1927",
    "babName": "Orang kota (metropolis) menjual kepada orang pelosok (badwi)",
    "hadithNumber": "4421",
    "hadithText": "Telah mengabarkan kepada kami Abdurrahman bin Abdullah bin Abdul Hakam bin A'yan, ia berkata; telah menceritakan kepada kami Syu'aib bin Al Laits dari ayahnya dari Katsir bin Farqad dari Nafi' dari Abdullah dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau melarang dari menawar barang tidak untuk membelinya tapi agar harganya naik, menyambut orang yang membawa barang dagangan sebelum sampai ke pasar, serta orang yang tinggal di kota menjualkan untuk orang yang tinggal di pelosok.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "49",
    "matchingArabicURN": "1145120",
    "last_updated": null
  },
  {
    "indonesianURN": "3244220",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1928",
    "babName": "Mencegat dagangan",
    "hadithNumber": "4422",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id, ia berkata; telah menceritakan kepada kami Yahya dari 'Ubaidullah dari Nafi' dari Ibnu Umar bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menyambut orang yang membawa barang dagang sebelum sampai pasar.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "50",
    "matchingArabicURN": "1145130",
    "last_updated": null
  },
  {
    "indonesianURN": "3244230",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1928",
    "babName": "Mencegat dagangan",
    "hadithNumber": "4423",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; saya berkata kepada Abu Usamah; apakah 'Ubaidullah menceritakan kepadamu dari Nafi' dari Ibnu Umar, Ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menyambut orang yang membawa dagangan sebelum masuk pasar hingga ia masuk pasar. Kemudian Abu Usamah mengakui dan mengatakan; ya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "51",
    "matchingArabicURN": "1145140",
    "last_updated": null
  },
  {
    "indonesianURN": "3244240",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1928",
    "babName": "Mencegat dagangan",
    "hadithNumber": "4424",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Rafi', ia berkata; telah memberitakan kepada kami Abdur Razzaq, ia berkata; telah memberitakan kepada kami Ma'mar dari Ibnu Thawus dari ayahnya dari Ibnu Abbas, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang menyambut orang yang membawa dagangan sebelum masuk pasar dan orang yang tinggal di kota menjualkan barang untuk orang yang tinggal di pelosok. Saya berkata kepada Ibnu Abbas; apa maksud perkataan orang yang tinggal di kota untuk orang yang tinggal di pelosok? Ia berkata; tidak boleh menjadi calo untuknya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "52",
    "matchingArabicURN": "1145150",
    "last_updated": null
  },
  {
    "indonesianURN": "3244250",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1928",
    "babName": "Mencegat dagangan",
    "hadithNumber": "4425",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Al Hasan, ia berkata; telah menceritakan kepada kami Hajjaj bin Muhammad, ia berkata; telah memberitakan kepada kami Ibnu Juraij, ia berkata; telah memberitakan kepada kami Hisyam bin Hassan Al Qurdusi bahwa ia mendengar Ibnu Sirin berkata; saya mendengar Abu Hurairah berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menyambut orang yang membawa barang dagangan sebelum sampai pasar, barang siapa yang menyambutnya kemudian membeli darinya kemudian apabila pemiliknya datang ke pasar maka ia memiliki hak untuk memilih.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "53",
    "matchingArabicURN": "1145160",
    "last_updated": null
  },
  {
    "indonesianURN": "3244260",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1929",
    "babName": "Menawar dagangan yang sudah ditawar saudaranya",
    "hadithNumber": "4426",
    "hadithText": "Telah mengabarkan kepada kami Mujahid bin Musa, ia berkata; telah menceritakan kepada kami Isma'il dari Ma'mar dari Az Zuhri dari Sa'id bin Al Musayyab dari Abu Hurairah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah orang yang tinggal di kota menjualkan barang untuk orang yang tinggal di pelosok, dan janganlah menawar untuk mengecohkan pembeli yang lain, janganlah seseorang menawar penawaran saudaranya dan janganlah ia meminang atas pinangan saudaranya dan janganlah seorang wanita meminta agar saudaranya dicerai agar ia mendapatkan apa yang ada dalam periuknya dan agar ia dinikahi, karena sesungguhnya ia mendapatkan apa yang telah Allah tetapkan baginya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "54",
    "matchingArabicURN": "1145170",
    "last_updated": null
  },
  {
    "indonesianURN": "3244270",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1930",
    "babName": "Membeli dagangan yang sudah dibeli saudaranya",
    "hadithNumber": "4427",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id dari Malik dan Al Laits, lafazhnya adalah lafazh Al Laits, dari Nafi' dari Ibnu Umar dari Nabi shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Janganlah salah seorang diantara kalian menjual atas penjualan saudaranya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "55",
    "matchingArabicURN": "1145180",
    "last_updated": null
  },
  {
    "indonesianURN": "3244280",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1930",
    "babName": "Membeli dagangan yang sudah dibeli saudaranya",
    "hadithNumber": "4428",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah menceritakan kepada kami Abu Mu'awiyah, ia berkata; telah menceritakan kepada kami 'Ubaidullah dari Nafi' dari Ibnu Umar dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah seseorang menjual atas penjualan saudaranya hingga ia membeli atau meninggalkan.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "56",
    "matchingArabicURN": "1145190",
    "last_updated": null
  },
  {
    "indonesianURN": "3244290",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1931",
    "babName": "Najasy (Penipuan)",
    "hadithNumber": "4429",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Nafi' dari Ibnu Umar bahwa Nabi shallallahu 'alaihi wasallam melarang dari menawar barang untuk mengecoh pembeli yang lain.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "57",
    "matchingArabicURN": "1145200",
    "last_updated": null
  },
  {
    "indonesianURN": "3244300",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1931",
    "babName": "Najasy (Penipuan)",
    "hadithNumber": "4430",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Yahya, ia berkata; telah menceritakan kepada kami Bisyr bin Syu'aib, ia berkata; telah menceritakan kepada kami ayahku dari Az Zuhri telah mengabarkan kepadaku Abu Salamah dan Sa'id bin Al Musayyab bahwa Abu Hurairah berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah seseorang menjual di atas jualan saudaranya dan janganlah orang yang tinggal di kota menjual barang untuk orang yang tinggal di pelosok, dan janganlah menawar barang untuk mengecoh pembeli, janganlah seseorang menambah atas penjualan saudaranya, dan janganlah seorang wanita meminta wanita yang lain dicerai agar ia mendapatkan apa yang ada dalam periuknya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "58",
    "matchingArabicURN": "1145210",
    "last_updated": null
  },
  {
    "indonesianURN": "3244310",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1931",
    "babName": "Najasy (Penipuan)",
    "hadithNumber": "4431",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la, ia berkata; telah menceritakan kepada kami Yazid, ia berkata; telah menceritakan kepada kami Ma'mar dari Az Zuhri dari Sa'id bin Al Musayyab dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidak boleh orang yang tinggal di kota menjualkan barang untuk orang yang tinggal di pelosok, dan janganlah menawar barang untuk mengecoh pembeli, janganlah seseorang menambah atas penjualan saudaranya, dan janganlah seorang wanita meminta saudarinya dicerai agar ia mendapatkan apa yang ada dalam periuknya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "59",
    "matchingArabicURN": "1145220",
    "last_updated": null
  },
  {
    "indonesianURN": "3244320",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1932",
    "babName": "Menjual untuk orang yang mau menambah lagi tawarannya",
    "hadithNumber": "4432",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah menceritakan kepada kami Al Mu'tamir dan Isa bin Yunus mereka berkata; telah menceritakan kepada kami Al Akhdhar bin 'Ajlan dari Abu Bakar Al Hanafi dari Anas bin Malik bahwa Rasulullah shallallahu 'alaihi wasallam menjual gelas dan alas pelana kepada orang yang menambahkan harga.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "60",
    "matchingArabicURN": "1145230",
    "last_updated": null
  },
  {
    "indonesianURN": "3244330",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1933",
    "babName": "Jual beli mulamasah",
    "hadithNumber": "4433",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dan Al Harits bin Miskin dengan membacakan riwayat dan saya mendengar, lafazhnya adalah lafazh Al Harits, dari Ibnu Al Qasim, ia berkata; telah menceritakan kepadaku Malik dari Muhammad bin Yahya bin Habban serta Abu Az Zinad dari Al A'raj dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari mulamasah (yaitu barang dagangan apapun yang disentuh wajib untuk dibayar tanpa mengetahui kondisi barang tersebut), serta munabadzah (yaitu jual beli dengan saling melemparkan barang yang akan dijual tanpa diketahui barangnya).</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "61",
    "matchingArabicURN": "1145240",
    "last_updated": null
  },
  {
    "indonesianURN": "3244340",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1934",
    "babName": "Penafsiran",
    "hadithNumber": "4434",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Ya'qub bin Ishaq, ia berkata; telah menceritakan kepada kami Abdullah bin Yusuf, ia berkata; telah menceritakan kepada kami Al Laits dari 'Uqail dari Ibnu Syihab, ia berkata; telah memberitakan kepadaku 'Amir bin Sa'd bin Abu Waqqash dari Abu Sa'id Al Khudri bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari mulamasah yaitu menyentuh pakaian dan tidak melihatnya. Dan beliau melarang dari munabadzah yaitu seseorang melempar pakaiannya kepada seseorang untuk dijual kepadanya sebelum ia membalik baju tersebut atau melihat kepadanya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "62",
    "matchingArabicURN": "1145250",
    "last_updated": null
  },
  {
    "indonesianURN": "3244350",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1935",
    "babName": "Jual beli munabadzah",
    "hadithNumber": "4435",
    "hadithText": "Telah mengabarkan kepada kami Yunus bin Abdul A'la serta Al Harits bin Miskin dengan membacakan riwayat dan saya mendengar, dari Ibnu Wahb, ia berkata; telah mengabarkan kepadaku Yunus dari Ibnu Syihab dari 'Amir bin Sa'd dari Abu Sa'id Al Khudri, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari mulamasah, dan munabadzah dalam berjual beli.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "63",
    "matchingArabicURN": "1145260",
    "last_updated": null
  },
  {
    "indonesianURN": "3244360",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1935",
    "babName": "Jual beli munabadzah",
    "hadithNumber": "4436",
    "hadithText": "Telah mengabarkan kepada kami Al Husain bin Huraits Al Marwazi, ia berkata; telah menceritakan kepada kami Sufyan dari Az Zuhri dari 'Atho` bin Yazid dari Abu Sa'id Al Kudri, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari dua macam jual beli yaitu mulamasah dan munbadzah.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "64",
    "matchingArabicURN": "1145270",
    "last_updated": null
  },
  {
    "indonesianURN": "3244370",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1936",
    "babName": "Penafsiran",
    "hadithNumber": "4437",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mushaffa bin Bahlul dari Muhammad bin Harb dari Az Zubaidi dari Az Zuhri, ia berkata; saya mendengar Sa'id berkata; saya mendengar Abu Hurairah berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari mulamasah dan menabadzah. Dan mulamasah adalah dua orang melakukan jual beli dengan dua pakaian dimalam hari setiap orang dari mereka menyentuh pakaian temannya dengan tangannya, sedangkan munabadzah adalah seseorang melemparkan pakaian kepada orang lain dan orang yang lain melemparkan baju kepadanya dan mereka berjual beli atas dasar seperti itu.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "65",
    "matchingArabicURN": "1145280",
    "last_updated": null
  },
  {
    "indonesianURN": "3244380",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1936",
    "babName": "Penafsiran",
    "hadithNumber": "4438",
    "hadithText": "Telah mengabarkan kepada kami Abu Daud, ia berkata; telah menceritakan kepada kami Ya'qub bin Ibrahim, ia berkata; telah menceritakan kepada kami ayahku dari Shalih dari Ibnu Syihab bahwa 'Amir bin Sa'd telah mengabarkan kepadanya bahwa Abu Sa'id Al Khudri radliallahu 'anhu berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari mulamasah, dan mulamasah adalah menyentuh baju dan tidak melihat kepadanya, dan dari munabadzah. Munabadzah adalah seseorang melemparkan baju kepada orang lain sebelum ia membaliknya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "66",
    "matchingArabicURN": "1145290",
    "last_updated": null
  },
  {
    "indonesianURN": "3244390",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1936",
    "babName": "Penafsiran",
    "hadithNumber": "4439",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Rafi', ia berkata; telah menceritakan kepada kami Abdur Razzaq, ia berkata; telah menceritakan kepada kami Ma'mar dari Az Zuhri dari 'Atho` bin Yazid dari Abu Sa'id Al Khudri, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari dua pakaian dan dari dua macam jual beli. Adapun dua macam jual beli yaitu mulamasah dan munabadzah, yaitu berkata; apabila saya melempar baju ini maka telah terjadi jual beli. Sedangkan mulamasah yaitu memegang dengan tangannya dan tidak membukanya serta membalikkannya, apabila ia memegangnya maka telah terjadi jual beli.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "67",
    "matchingArabicURN": "1145300",
    "last_updated": null
  },
  {
    "indonesianURN": "3244400",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1936",
    "babName": "Penafsiran",
    "hadithNumber": "4440",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Zaid bin Abu Az Zarqa`, ia berkata; telah menceritakan kepada kami ayahku, ia berkata; telah menceritakan kepada kami Ja'far bin Burqan, ia berkata; telah sampai kepadaku dari Az Zuhri dari Salim dari ayahnya ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari dua pakaian dan Rasulullah shallallahu 'alaihi wasallam melarang kita dari dua jual beli yaitu munabadzah dan mulamasah itu adalah jual beli yang mereka lakukan pada masa Jahiliyah.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "68",
    "matchingArabicURN": "1145310",
    "last_updated": null
  },
  {
    "indonesianURN": "3244410",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1936",
    "babName": "Penafsiran",
    "hadithNumber": "4441",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la, ia berkata; telah menceritakan kepada kami Al Mu'tamir, ia berkata; saya mendengar 'Ubaidullah dari Khubaib dari Hafsh bin 'Ashim dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam bahwa beliau melarang dari dua macam jual beli, yaitu munabadzah dan mulamasah. Dan ia mengatakan bahwa mulamasah adalah seseorang berkata kepada orang lain; saya jual kepadamu bajuku dengan bajumu dan setiap mereka tidak melihat kepada baju orang lain akan tetapi ia menyentuhnya sekali. Adapun munabadzah adalah mengatakan saya lemparkan apa yang ada padaku dan engkau melemparkan apa yang ada padamu, agar keduanya saling membeli dari yang lainnya, dan setiap mereka tidak mengetahui berapa yang ada pada orang lain. Dan yang serupa dengan sifat ini.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "69",
    "matchingArabicURN": "1145320",
    "last_updated": null
  },
  {
    "indonesianURN": "3244420",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1937",
    "babName": "Jual beli hushaat",
    "hadithNumber": "4442",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id, ia berkata; telah menceritakan kepada kami Yahya dari 'Ubaidullah, ia berkata; telah mengabarkan kepadaku Abu Az Zinad dari Al A'raj dari Abu Hurairah, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menjual dengan cara hashah (jual beli, dan jual beli gharar (tidak jelas).</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "70",
    "matchingArabicURN": "1145330",
    "last_updated": null
  },
  {
    "indonesianURN": "3244430",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1938",
    "babName": "Menjual kurma sebelum nampak kematangannya",
    "hadithNumber": "4443",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Al Laits dari Nafi' dari Ibnu Umar dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah menjual buah hingga kelihatan layaknya\", beliau melarang penjual dan pembeli.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "71",
    "matchingArabicURN": "1145340",
    "last_updated": null
  },
  {
    "indonesianURN": "3244440",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1938",
    "babName": "Menjual kurma sebelum nampak kematangannya",
    "hadithNumber": "4444",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Sufyan dari Az Zuhri dari Salim dari ayahnya bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual buah hingga kelihatan kelayakannya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "72",
    "matchingArabicURN": "1145350",
    "last_updated": null
  },
  {
    "indonesianURN": "3244450",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1938",
    "babName": "Menjual kurma sebelum nampak kematangannya",
    "hadithNumber": "4445",
    "hadithText": "Telah mengabarkan kepadaku Yunus bin Abdul A'la serta Al Harits bin Miskin dengan membacakan riwayat dan saya mendengar, dari Ibnu Wahb, telah mengabarkan kepadaku Yunus dari Ibnu Syihab, ia berkata; telah menceritakan kepadaku Sa'id dan Abu Salamah bahwa Abu Hurairah berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian jual buah hingga terlihat kelayakannya, dan janganlah kalian beli buah dengan buah.\" Ibnu Syihab berkata; telah menceritakan kepadaku Salim bin Abdullah dari ayahnya bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari hal seperti itu.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "73",
    "matchingArabicURN": "1145360",
    "last_updated": null
  },
  {
    "indonesianURN": "3244460",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1938",
    "babName": "Menjual kurma sebelum nampak kematangannya",
    "hadithNumber": "4446",
    "hadithText": "Telah mengabarkan kepada kami Abdul Hamid bin Muhammad, ia berkata; telah menceritakan kepada kami Makhlad bin Yazid, ia berkata; telah menceritakan kepada kami Hanzhalah, ia berkata; saya mendengar Thawus berkata; saya mendengar Ibnu Umar berkata; Rasulullah shallallahu 'alaihi wasallam berdiri diantara kami dan bersabda: \"Janganlah kalian jual buah hingga nampak kelayakannya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "74",
    "matchingArabicURN": "1145370",
    "last_updated": null
  },
  {
    "indonesianURN": "3244470",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1938",
    "babName": "Menjual kurma sebelum nampak kematangannya",
    "hadithNumber": "4447",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur, ia berkata; telah menceritakan kepada kami Sufyan dari Ibnu Juraij dari 'Atho` saya mendengar Jabir bin Abdullah dari Nabi shallallahu 'alaihi wasallam bahwa beliau melarang dari mukhabarah, muzabanah dan muhaqalah serta menjual buah hingga nampak kelayakannya, dan agar tidak dijual kecuali dengan dinar dan dirham. dan beliau memberikan keringanan dalam hal 'araya (membeli pohon kurma dengan kurma).</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "75",
    "matchingArabicURN": "1145380",
    "last_updated": null
  },
  {
    "indonesianURN": "3244480",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1938",
    "babName": "Menjual kurma sebelum nampak kematangannya",
    "hadithNumber": "4448",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Al Mufadhdhal dari Ibnu Juraij dari 'Atho` dan Abu Az Zubair dari Jabir bahwa Nabi shallallahu 'alaihi wasallam melarang dari mukhabarah, muzabanah dan muhaqalah, serta menjual buah hingga dapat dimakan kecuali 'araya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "76",
    "matchingArabicURN": "1145390",
    "last_updated": null
  },
  {
    "indonesianURN": "3244490",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1938",
    "babName": "Menjual kurma sebelum nampak kematangannya",
    "hadithNumber": "4449",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la, ia berkata; telah menceritakan kepada kami Khalid, ia berkata; telah menceritakan kepada kami Hisyam dari Abu Zubair dari Jabir, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menjual kurma hingga dapat dimakan.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "77",
    "matchingArabicURN": "1145400",
    "last_updated": null
  },
  {
    "indonesianURN": "3244500",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1939",
    "babName": "Membeli buah-buahan sebelum nampak kematangannya, dan mengharuskan untuk mengambil dan menunggu masak",
    "hadithNumber": "4450",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dan Al Harits bin Miskin dengan membacakan riwayat dan saya mendengar, lafazhnya adalah lafazh Al Harits, dari Ibnu Al Qasim, ia berkata; telah menceritakan kepadaku Malik dari Humaid Atha Thawil dari Anas bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual buah hingga layak, Rasulullah ditanya; wahai Rasulullah, apakah yang dimaksud dengan layak itu? Beliau bersabda: \"Hingga memerah.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagaimana pendapatmu apabila Allah menolak tumbuhnya buah maka dengan apakah salah seorang dari kalian mengambil harta saudaranya?\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "78",
    "matchingArabicURN": "1145410",
    "last_updated": null
  },
  {
    "indonesianURN": "3244510",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1940",
    "babName": "Tidak meneruskan penjualan karena buah rusak",
    "hadithNumber": "4451",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Al Hasan, ia berkata; telah menceritakan kepada kami Hajjaj, ia berkata; telah berkata; Ibnu Juraij; telah mengabarkan kepadaku Abu Az Zubair bahwa ia mendengar Jabir berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila engkau menjual buah kepada saudaramu kemudian buah tersebut tertimpa bencana maka tidak halal bagimu untuk mengambil sebagian darinya, dengan apakah engkau mengambil harta saudaramu dengan tanpa hak?\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "79",
    "matchingArabicURN": "1145420",
    "last_updated": null
  },
  {
    "indonesianURN": "3244520",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1940",
    "babName": "Tidak meneruskan penjualan karena buah rusak",
    "hadithNumber": "4452",
    "hadithText": "Telah mengabarkan kepada kami Hisyam bin 'Ammar, ia berkata; telah menceritakan kepada kami Yahya bin Hamzah, ia berkata; telah menceritakan kepada kami Tsaur bin Yazid bahwa ia mendengar Ibnu Juraij bercerita dari Abu Az Zubair Al Makki dari Jabir bin Abdullah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: barang siapa yang menjual buah kemudian terkena bencana maka janganlah ia mengambil dari saudaranya sesuatupun, atas dasar apakah salah seorang dari kalian memakan harta saudaranya?\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "80",
    "matchingArabicURN": "1145430",
    "last_updated": null
  },
  {
    "indonesianURN": "3244530",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1940",
    "babName": "Tidak meneruskan penjualan karena buah rusak",
    "hadithNumber": "4453",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Yazid, ia berkata; telah menceritakan kepada kami Sufyan dari Humaid yaitu Al A'raj dari Sulaiman bin 'Atiq dari Jabir bahwa Nabi shallallahu 'alaihi wasallam meletakkan sebagian tanggungan karena adanya musibah yang menimpa.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "81",
    "matchingArabicURN": "1145440",
    "last_updated": null
  },
  {
    "indonesianURN": "3244540",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1940",
    "babName": "Tidak meneruskan penjualan karena buah rusak",
    "hadithNumber": "4454",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Al Laits dari Bukair dari 'Iyadh bin Abdullah dari Abu Sa'id Al Khudri, ia berkata; seorang laki-laki tertimpa musibah pada zaman Nabi shallallahu 'alaihi wasallam pada buah-buahan yang ia beli, sehingga hutangnya menjadi banyak. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bersedekahlah kepadanya.\" Maka orang-orang bersedekah kepadanya namun belum bisa melunasi hutang. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ambillah apa yang kalian dapatkan dan kalian tidak memiliki selain itu.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "82",
    "matchingArabicURN": "1145450",
    "last_updated": null
  },
  {
    "indonesianURN": "3244550",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1941",
    "babName": "Membeli pohon kurma untuk sekian tahun tertentu",
    "hadithNumber": "4455",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Sufyan dari Humaid Al A'raj dari Sulaiman bin 'Atik, ia mengatakan; Qutaibah bin 'Atik dengan huruf kaf, yang benar adalah 'Atiq. Dari Jabir dari Nabi shallallahu 'alaihi wasallam, beliau melarang dari menjual buah beberapa tahun yang akan datang.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "83",
    "matchingArabicURN": "1145460",
    "last_updated": null
  },
  {
    "indonesianURN": "3244560",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1942",
    "babName": "Membeli kurma dengan kurma",
    "hadithNumber": "4456",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Sufyan dari Az Zuhri dari Salim dari ayahnya bahwa Nabi shallallahu 'alaihi wasallam melarang dari menjual buah dengan kurma. Ibnu Umar berkata; telah menceritakan kepadaku Zaid bin Tsabit bahwa Rasulullah shallallahu 'alaihi wasallam memberikan keringanan dalam hal 'araya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "84",
    "matchingArabicURN": "1145470",
    "last_updated": null
  },
  {
    "indonesianURN": "3244570",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1942",
    "babName": "Membeli kurma dengan kurma",
    "hadithNumber": "4457",
    "hadithText": "Telah mengabarkan kepada kami Ziyad bin Ayyub, ia berkata; telah menceritakan kepada kami Ibnu 'Ulaiyah, ia berkata; telah menceritakan kepada kami Ayyub dari Nafi' dari Ibnu Umar bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari muzabanah, dan muzabanah adalah menjual apa yang ada di atas pohon kurma dengan kurma dengan takaran tertentu, ia mengatakan; apabila lebih maka untukku dan apabila kurang maka menjadi tanggunganku.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "85",
    "matchingArabicURN": "1145480",
    "last_updated": null
  },
  {
    "indonesianURN": "3244580",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1943",
    "babName": "Membeli kurma dengan kismis",
    "hadithNumber": "4458",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Nafi' dari Ibnu Umar radliallahu 'anhuma bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari muzabanah, dan muzabanah adalah menjual kurma dengan kurma dengan takaran, serta menjual anggur dengan kismis dengan takaran.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "86",
    "matchingArabicURN": "1145490",
    "last_updated": null
  },
  {
    "indonesianURN": "3244590",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1943",
    "babName": "Membeli kurma dengan kismis",
    "hadithNumber": "4459",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Abu Al Ahwash dari Thariq dari Sa'id bin Al Musayyab dari Rafi' bin Khadij, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari muhaqalah dan muzabanah.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "87",
    "matchingArabicURN": "1145500",
    "last_updated": null
  },
  {
    "indonesianURN": "3244600",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1943",
    "babName": "Membeli kurma dengan kismis",
    "hadithNumber": "4460",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Sufyan dari Az Zuhri dari Salim dari ayahnya, ia berkata; telah menceritakan kepadaku Zaid bin Tsabit bahwa Rasulullah shallallahu 'alaihi wasallam memberikan keringanan dalam hal 'araya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "88",
    "matchingArabicURN": "1145510",
    "last_updated": null
  },
  {
    "indonesianURN": "3244610",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1943",
    "babName": "Membeli kurma dengan kismis",
    "hadithNumber": "4461",
    "hadithText": "Telah berkata Al Harits bin Miskin dengan membacakan riwayat, dan saya mendengar, dari Ibnu Wahb, ia berkata; telah mengabarkan kepadaku Yunus dari Ibnu Syihab, ia berkata; telah menceritakan kepadaku Kharijah bin Zaid bin Tsabit dari ayahnya bahwa Rasulullah shallallahu 'alaihi wasallam memberikan keringanan dalam hal membeli pohon kurma dengan buah kurma atau ruthab.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "89",
    "matchingArabicURN": "1145520",
    "last_updated": null
  },
  {
    "indonesianURN": "3244620",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1944",
    "babName": "Membeli kurma yang masih dalam tangkai dengan kurma masak yang ditaksir",
    "hadithNumber": "4462",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id, ia berkata; telah menceritakan kepada kami Yahya dari 'Ubaidullah, ia berkata; telah mengabarkan kepadaku Nafi' dari Abdullah dari Zaid bin Tsabit bahwa Rasulullah shallallahu 'alaihi wasallam memberikan keringanan dalam menjual 'araya dijual dengan taksirannya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "90",
    "matchingArabicURN": "1145530",
    "last_updated": null
  },
  {
    "indonesianURN": "3244630",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1944",
    "babName": "Membeli kurma yang masih dalam tangkai dengan kurma masak yang ditaksir",
    "hadithNumber": "4463",
    "hadithText": "Telah mengabarkan kepada kami Isa bin Hammad, ia berkata; telah menceritakan kepada kami Al Laits dari Yahya bin Sa'id dari Nafi' dari Ibnu Umar, ia berkata; telah menceritakan kepadaku Zaid bin Tsabit bahwa Rasulullah shallallahu 'alaihi wasallam memberikan keringanan dalam menjual 'araya dengan kurma secara taksiran.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "91",
    "matchingArabicURN": "1145540",
    "last_updated": null
  },
  {
    "indonesianURN": "3244640",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1945",
    "babName": "Membeli kurma masih dalam tangkai dengan kurma mengkal",
    "hadithNumber": "4464",
    "hadithText": "Telah mengabarkan kepada kami Abu Daud, ia berkata; telah menceritakan kepada kami Ya'qub bin Ibrahim, ia berkata; telah menceritakan kepada kami ayahku dari Shalih dari Ibnu Syihab bahwa Salim telah mengabarkan kepadanya bahwa ia mendengar Abdullah bin Umar berkata; sesungguhnya Zaid bin Tsabit telah mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam memberikan keringanan untuk menjual pohon kurma dengan ruthab dan kurma dan tidak memberikan keringanan dalam perkara selain itu.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "92",
    "matchingArabicURN": "1145550",
    "last_updated": null
  },
  {
    "indonesianURN": "3244650",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1945",
    "babName": "Membeli kurma masih dalam tangkai dengan kurma mengkal",
    "hadithNumber": "4465",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Manshur dan Ya'qub bin Ibrahim, lafazhnya adalah lafazh Ya'qub, dari Abdurrahman dari Malik dari Daud bin Al Hushain dari Abu Sufyan dari Abu Hurairah bahwa Nabi shallallahu 'alaihi wasallam memberikan keringanan dalam 'araya agar dijual dengan penaksirannya, lima wasaq atau kurang dari lima wasaq.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "93",
    "matchingArabicURN": "1145560",
    "last_updated": null
  },
  {
    "indonesianURN": "3244660",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1945",
    "babName": "Membeli kurma masih dalam tangkai dengan kurma mengkal",
    "hadithNumber": "4466",
    "hadithText": "Telah mengabarkan kepada kami Abdullah bin Muhammad bin Abdurrahman, ia berkata; telah menceritakan kepada kami Sufyan dari Yahya dari Busyair bin Yasar dari Sahl bin Abu Hatsmah bahwa Nabi shallallahu 'alaihi wasallam melarang dari menjual buah hingga nampak kelayakannya, dan memberikan keringanan dalalm hal 'araya di beli dengan perkiraannya, dan dimakan pemiliknya dalam bentuk ruthab.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "94",
    "matchingArabicURN": "1145570",
    "last_updated": null
  },
  {
    "indonesianURN": "3244670",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1945",
    "babName": "Membeli kurma masih dalam tangkai dengan kurma mengkal",
    "hadithNumber": "4467",
    "hadithText": "Telah mengabarkan kepada kami Al Husain bin Isa, ia berkata; telah menceritakan kepada kami Abu Usamah, ia berkata; telah menceritakan kepadaku Al Walid bin Katsir, ia berkata; telah mengabarkan kepadaku Busyair bin Yasar bahwa Rafi' bin Khadij serta Sahl bin Abu Hatsmah telah menceritakan kepdanya bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari muzabanah yaitu menjual buah dengan kurma, kecuali bagi pemilik 'araya, sesungguhnya beliau mengizinkannya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "95",
    "matchingArabicURN": "1145580",
    "last_updated": null
  },
  {
    "indonesianURN": "3244680",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1945",
    "babName": "Membeli kurma masih dalam tangkai dengan kurma mengkal",
    "hadithNumber": "4468",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Al Laits dari Yahya dari Busyair bin Yasar dari para sahabat Rasulullah shallallahu 'alaihi wasallam bahwa mereka berkta; Rasulullah shallallahu 'alaihi wasallam memberikan keringanan untuk menjual 'araya dengan penaksirannya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "96",
    "matchingArabicURN": "1145590",
    "last_updated": null
  },
  {
    "indonesianURN": "3244690",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1946",
    "babName": "Membeli kurma masak dengan kurma mengkal",
    "hadithNumber": "4469",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Ali, ia berkata; telah menceritakan kepada kami Yahya, ia berkata; telah menceritakan kepada kami Malik, ia berkata; telah menceritakan kepadaku Abdullah bin Yazid dari Zaid bin Abu 'Ayyasy dari Sa'd, ia berkata; Rasulullah shallallahu 'alaihi wasallam ditanya mengenai menjual kurma dengan ruthab kemudian beliau bertanya kepada orang di sekitarnya: \"Apakah ruthab akan berkurang apabila mongering?\" mereka berkata; ya. Kemudian beliau melarangnya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "97",
    "matchingArabicURN": "1145600",
    "last_updated": null
  },
  {
    "indonesianURN": "3244700",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1946",
    "babName": "Membeli kurma masak dengan kurma mengkal",
    "hadithNumber": "4470",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Ali bin Maimun, ia berkata; telah menceritakan kepada kami Muhammad bin Yusuf Al Firyabi, ia berkata; telah menceritakan kepada kami Sufyan dari Isma'il bin Umayyah dari Abdullah bin Yazid dari Zaid dari Sa'd bin Malik, ia berkata; Rasulullah shallallahu 'alaihi wasallam ditanya mengenai jual beli ruthab dengan kurma. Lalu beliau bertanya: \"Apakah ruthab akan berkurang apabila mengering?\" mereka berkata; ya. Kemudian beliau melarang.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "98",
    "matchingArabicURN": "1145610",
    "last_updated": null
  },
  {
    "indonesianURN": "3244710",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1947",
    "babName": "Membeli sekumpulan kurma yang tak jelas takarannya dengan takaran tertentu",
    "hadithNumber": "4471",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Al Hasan, ia berkata; telah menceritakan kepada kami Hajjaj, telah berkata Ibnu Juraij telah mengabarkan kepadaku Abu Az Zubair berkata bahwa ia mendengar Jabir bin Abdullah berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menjual kumpulan kurma yang tidak diketahui takarannya dengan kurma dengan takaran tertentu.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "99",
    "matchingArabicURN": "1145620",
    "last_updated": null
  },
  {
    "indonesianURN": "3244720",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1948",
    "babName": "Membeli sekumpulan makanan dengan sekumpulan makanan",
    "hadithNumber": "4472",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Al Hasan, ia berkata; telah menceritakan kepada kami Hajjaj, ia berkata; Ibnu Juraij telah mengabarkan kepadaku Abu Az Zubair bahwa ia mendengar Jabir bin Abdullah berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak boleh menjual sekumpulan makanan dengan sekumpulan makanan dan sekumpulan makanan dengan makanan dengan takaran tertentu.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "100",
    "matchingArabicURN": "1145630",
    "last_updated": null
  },
  {
    "indonesianURN": "3244730",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1949",
    "babName": "Membeli tanaman dengan makanan",
    "hadithNumber": "4473",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Al Laits dari Nafi' dari Ibnu Umar, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari muzabanah dengan menjual buah kebunnya apabila berupa pohon kurma dengan kurma dalam bentuk takaran, apabila pohon anggur menjualnya dengan kismis dalam bentuk takaran, dan apabila tanaman menjualnya dengan makanan dalam bentuk takaran. Beliau melarang dari semua itu.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "101",
    "matchingArabicURN": "1145640",
    "last_updated": null
  },
  {
    "indonesianURN": "3244740",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1949",
    "babName": "Membeli tanaman dengan makanan",
    "hadithNumber": "4474",
    "hadithText": "Telah mengabarkan kepada kami Abdul Hamid bin Muhammad, ia berkata; telah menceritakan kepada kami Makhlad bin Yazid, ia berkata; telah menceritakan kepada kami Ibnu Juraij dari 'Atho` dari Jabir bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari mukhabarah, muzabanah, muhaqalah dan dari menjual buah sebelum bisa dimakan dan dari menjual hal tersebut kecuali dengan dinar dan dirham.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "102",
    "matchingArabicURN": "1145650",
    "last_updated": null
  },
  {
    "indonesianURN": "3244750",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1950",
    "babName": "Membeli cikal buah hingga nampak berisi",
    "hadithNumber": "4475",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr, ia berkata; telah menceritakan kepada kami Isma'il dari Ayyub dari Nafi' dari Ibnu Umar bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual kurma yang masih di pohon hingga memerah dan dari bulir hingga mengeras bijinya, dan aman dari bencana. Beliau melarang penjual dan pembeli.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "103",
    "matchingArabicURN": "1145660",
    "last_updated": null
  },
  {
    "indonesianURN": "3244760",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1950",
    "babName": "Membeli cikal buah hingga nampak berisi",
    "hadithNumber": "4476",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Abu Al Ahwash dari Al A'masy dari Habib bin Abu Tsabit dari Abu Shalih bahwa seseorang dari sahabat Nabi shallallahu 'alaihi wasallam telah mengabarkan kepadanya bahwa ia mengatakan; wahai Rasulullah, kami tidak mendapatkan Shaihani (jenis kurma yang baik) atau Al 'Idzq dengan kurma Jam' kecuali kami menambahkan mereka, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Juallah kurma dengan uang perak lalu belilah dengannya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "104",
    "matchingArabicURN": "1145670",
    "last_updated": null
  },
  {
    "indonesianURN": "3244770",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1951",
    "babName": "Membeli kurma dengan kurma tertentu dengan dilebihkan",
    "hadithNumber": "4477",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dan Al Harits bin Miskin dengan membacakan riwayat, dan saya mendengar, lafazhnya adalah lafazh Al Harits, dari Ibnu Al Qasim, ia berkata; telah menceritakan kepadaku Malik dari Abdul Majid bin Suhail dari Sa'id bin Al Musayyab dari Abu Sa'id Al Khudri dan dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam menggunakan tenaga orang untuk menggarap lahan Khaibar, kemudian orang tersebut datang membawa kurma Janih. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah seluruh kurma Khaibar seperti ini?\" orang tersebut berkata; tidak, demi Allah wahai Rasulullah, sesungguhnya kami mengambil satu sha' dengan dua sha', mengambil dua sha' dengan tiga sha'. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jangan kalian lakukan, juallah kurma jam' dengan uang dirham kemudian belilah dengan dirham tersebut kurma Janih.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "105",
    "matchingArabicURN": "1145680",
    "last_updated": null
  },
  {
    "indonesianURN": "3244780",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1951",
    "babName": "Membeli kurma dengan kurma tertentu dengan dilebihkan",
    "hadithNumber": "4478",
    "hadithText": "Telah mengabarkan kepada kami Nashr bin Ali dan Isma'il bin Mas'ud dan lafazhnya adalah lafazh Isma'il, dari Khalid, ia berkata; telah menceritakan kepada kami Sa'id dari Qatadah dari Sa'id bin Al Musayyab dari Abu Sa'id Al Khudri bahwa Rasulullah shallallahu 'alaihi wasallam diberi kurman Rayyan sedangkan kurma Rasulullah shallallahu 'alaihi wasallam adalah kurma Ba'l yang basah, kemudian beliau bersabda: \"Dari manakah kalian mendapatkan hal ini?\" mereka berkata; kami membelinya satu sha' dengan dua sha' dari kurma kami. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jangan engkau lakukan, sesungguhnya hal tidaklah sah, akan tetapi juallah kurmamu dan belilah dari penjualan ini apa yang engkau kehendaki.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "106",
    "matchingArabicURN": "1145690",
    "last_updated": null
  },
  {
    "indonesianURN": "3244790",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1951",
    "babName": "Membeli kurma dengan kurma tertentu dengan dilebihkan",
    "hadithNumber": "4479",
    "hadithText": "Telah mengabarkan kepadaku Isma'il bin Mas'ud, ia berkata; telah menceritakan kepada kami Khalid, ia berkata; telah menceritakan kepada kami Hisyam dari Yahya bin Abu Katsir dari Abu Salamah bin Abdurrahman, ia berkata; telah menceritakan kepada kami Abu Sa'id Al Khudri, ia berkata; dahulu kami mendapatkan rizqi kurma Jam' pada zaman Rasulullah shallallahu 'alaihi wasallam, kemudian kami menjual dua sha' dengan satu sha'. Kemudian hal tersebut sampai kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau bersabda: \"Jangan engkau jual dua sha' kurma dengan satu sha' dan dua sha' gandum dengan satu sha', serta satu dirham dengan dua dirham.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "107",
    "matchingArabicURN": "1145700",
    "last_updated": null
  },
  {
    "indonesianURN": "3244800",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1951",
    "babName": "Membeli kurma dengan kurma tertentu dengan dilebihkan",
    "hadithNumber": "4480",
    "hadithText": "Telah mengabarkan kepada kami Hisyam bin 'Ammar dari Yahya yaitu Ibnu Hamzah, ia berkata; telah menceritakan kepada kami Al Auza'i dari Yahya, ia berkata; telah menceritakan kepadaku Abu Salamah, ia berkata; telah menceritakan kepadaku Abu Sa'id, ia berkata; dahulu kami menjual kurma Jam' dua Sha' dengan satu sha'. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Jangan engkau jual dua sha' kurma dengan satu sha' dan dua sha' gandum dengan satu sha', serta satu dirham dengan dua dirham.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "108",
    "matchingArabicURN": "1145710",
    "last_updated": null
  },
  {
    "indonesianURN": "3244810",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1951",
    "babName": "Membeli kurma dengan kurma tertentu dengan dilebihkan",
    "hadithNumber": "4481",
    "hadithText": "Telah mengabarkan kepada kami Hisyam bin 'Ammar dari Yahya yaitu Ibnu Hamzah, ia berkata; telah menceritakan kepada kami Al Auza'i, ia berkata; telah menceritakan kepadaku Yahya, ia berkata; telah menceritakan kepadaku 'Uqbah bin Abdul Ghafir, ia berkata; telah menceritakan kepadaku Abu Sa'id, ia berkata; telah datang Bilal kepada Rasulullah shallallahu 'alaihi wasallam membawa kurma Barni, kemudian beliau bersabda: \"Apa ini?\" Ia berkata; saya membelinya satu sha' dengan dua sha'. Lalu beliau bersabda: \"Aduh, bentuk riba, janganlah engkau dekati.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "109",
    "matchingArabicURN": "1145720",
    "last_updated": null
  },
  {
    "indonesianURN": "3244820",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1951",
    "babName": "Membeli kurma dengan kurma tertentu dengan dilebihkan",
    "hadithNumber": "4482",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah menceritakan kepada kami Sufyan dari Az Zuhri dari Malik bin Aus bin Al Hadatsan bahwa Ia mendengar Umar bin Al Khathab berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Menjual emas dengan perak adalah riba, kecuali serah terima secara langsung, kurma dengan kurma adalah riba kecuali serah terima secara langsung, gandum dengan gandum adalah riba kecuali serah terima secara langsung, jewawut dengan jewawut adalah riba kecuali serah terima secara langsung.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "110",
    "matchingArabicURN": "1145730",
    "last_updated": null
  },
  {
    "indonesianURN": "3244830",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1952",
    "babName": "Membeli kurma dengan kurma",
    "hadithNumber": "4483",
    "hadithText": "Telah mengabarkan kepada kami Washil bin Abdul A'la, ia berkata; telah menceritakan kepada kami Ibnu Fudhail dari ayahnya dari Abu Zur'ah dari Abu Hurairah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kurma dengan kurma, gandum dengan gandum, jewawut dengan jewawut, garam dengan garam dengan serah terima secara langsung, barang siapa menambah atau meminta tambahan maka sungguh ia telah melakukan riba kecuali yang berbeda warnanya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "111",
    "matchingArabicURN": "1145740",
    "last_updated": null
  },
  {
    "indonesianURN": "3244840",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1953",
    "babName": "Membeli gandum dengan gandum",
    "hadithNumber": "4484",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Bazi', ia berkata; telah menceritakan kepada kami Yazid, ia berkata; telah menceritakan kepada kami Salamah yaitu Ibnu 'Alqamah dari Muhammad bin Sirin dari Muslim bin Yasar dan Abdullah bin 'Atik mereka berkata; di dalam rumah terdapat 'Ubadah bin Ash Shamit dan Mu'awiyah, 'Ubadah menceritakan kepada mereka, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang kita dari menjual emas dengan emas, perak dengan perak, gandum dengan gandum, jewawut dengan jewawut dan kurma dengan kurma. Salah seorang dari mereka berdua berkata; dan garam dengan garam, sedangkan yang lain tidak mengatakan hal tersebut. Kecuali dengan semisal dengan yang semisal, dan dengan serah terima secara langsung. Dan beliau memerintahkan agar kami menjual emas dengan perak, dan perak dengan emas, gandum dengan jewawut dengan serah terima secara langsung bagaimanapun yang kami kehendaki. Barang siapa menambah atau meminta tambahan maka sungguh ia telah melakukan riba.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "112",
    "matchingArabicURN": "1145750",
    "last_updated": null
  },
  {
    "indonesianURN": "3244850",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1953",
    "babName": "Membeli gandum dengan gandum",
    "hadithNumber": "4485",
    "hadithText": "Telah mengabarkan kepada kami Al Muammal bin Hisyam, ia berkata; telah menceritakan kepada kami Isma'il yaitu Ibnu 'Ulayyah dari Salamah bin 'Alqamah dari Ibnu Sirin, ia berkata; telah menceritakan kepadaku Muslim bin Yasar dan Abdullah bin Atik dan ia dahulu dipanggil dengan nama Ibnu Hurmuz, ia berkata; sementara di dalam rumah terdapat 'Ubadah bin Ash Shamit dan Mu'awiyah, 'Ubadah menceritakan kepada mereka, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang kita dari menjual emas dengan emas, perak dengan perak, kurma dengan kurma, gandum dengan gandum, jewawut dengan jewawut. Salah seorang dari mereka berdua berkata; dan garam dengan garam, sedangkan yang lain tidak mengatakan hal tersebut. Kecuali secara sama-sama, semisal dengan yang semisal. Salah seorang diantara mereka berdua mengatakan; Barang siapa menambah atau meminta tambahan maka sungguh ia telah melakukan riba. Dan yang lainnya tidak mengatakannya. Dan beliau memerintahkan agar kami menjual emas dengan perak, dan perak dengan emas, gandum dengan jewawut dan jewawut dengan gandum, dengan serah terima secara langsung bagaimanapun yang kami kehendaki.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "113",
    "matchingArabicURN": "1145760",
    "last_updated": null
  },
  {
    "indonesianURN": "3244860",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1954",
    "babName": "Membeli gandum halus dengan gandum halus",
    "hadithNumber": "4486",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud, ia berkata; telah menceritakan kepada kami Bisyr bin Al Mufadhdhal, ia berkata; telah menceritakan kepada kami Salamah bin 'Alqamah dari Muhammad, ia berkata; telah menceritakan kepadaku Muslim bin Yasar dan Abdullah bin Atik, mereka mengatakan; sementara di dalam rumah terdapat 'Ubadah bin Ash Shamit dan Mu'awiyah, kemudian 'Ubadah berkata; Rasulullah shallallahu 'alaihi wasallam melarang kami dari menjual emas dengan emas, perak dengan perak, gandum dengan gandum, jewawut dengan jewawut, dan kurma dengan kurma. Salah seorang dari mereka berdua berkata; dan garam dengan garam, sedangkan yang lain tidak mengatakan hal tersebut. Kecuali secara sama-sama, semisal dengan yang semisal. Salah seorang diantara mereka berdua mengatakan; Barang siapa menambah atau meminta tambahan maka sungguh ia telah melakukan riba. Dan yang lainnya tidak mengatakannya. Dan beliau memerintahkan agar kami menjual emas dengan perak, dan perak dengan emas, gandum dengan jewawut dan jewawut dengan gandum, dengan serah terima secara langsung bagaimanapun yang kami kehendaki. Kemudian hadits ini sampai kepada Mu'awiyah, kemudian ia berdiri dan berkata; bagaimana keadaan orang-orang yang meriwayatkan hadits-hadits dari Rasulullah shallallahu 'alaihi wasallam, dan kami telah menemani beliau dan belum mendengarnya dari beliau. Kemudian hal tersebut sampai kepada Ubadah bin Ash Shamit, lalu ia berdiri dan mengulangi hadits tersebut. Kemudian berkata; sungguh kami akan ceritakan apa yang telah kami dengar dari Rasulullah shallallahu 'alaihi wasallam walaupun Mu'awiyah tidak menyukainya. Qatadah menyelisinya, ia meriwayatkannya dari Muslim bin Yasar dari Abu Al Asy'ats dari Ubadah.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "114",
    "matchingArabicURN": "1145770",
    "last_updated": null
  },
  {
    "indonesianURN": "3244870",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1954",
    "babName": "Membeli gandum halus dengan gandum halus",
    "hadithNumber": "4487",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Adam dari 'Abdah dari Ibnu Abu 'Arubah dari Qatadah dari Muslim bin Yasar dari Al Asy'ats Ash Shan'ani dari 'Ubadah bin Ash Shamit yang merupakan orang Badr, dan telah membai'at Nabi shallallahu 'alaihi wasallam untuk tidak takut karena Allah kepada celaan orang yang mencela. Bahwa 'Ubadah berdiri melakukan ceramah, ia berkata; wahai manusia, sungguh kalian telah mengadakan jual beli, saya tidak tahu apa itu, ketahuilah sesungguhnya emas dengan emas satu timbangan dengan satu timbangan, baik yang masih murni atau mata uangnya, dan perak dengan perak, satu timbangan dengan satu timbangan, baik yang masih murni atau mata uangnya. Dan tidak mengapa menjual perak dengan emas dengan serah terima secara langsung dan perak lebih banyak, tidak boleh ditunda. Ketahuilah sesungguhnya gandum dengan gandum, dan jewawut-dengan jewawut satu mudyun (jenis takaran penduduk Syam) dengan satu mudyun dan tidak mengapa menjual jewawut dengan gandum dengan serah terima secara langsung, dan jewawut lebih banyak, dan tidak boleh menunda. Ketahuilah sesungguhnya kurma dengan kurma satu mudyun dengan satu mudyun....hingga ia menyebutkan garam satu mud dengan satu mud. Barang siapa yang menambah atau meminta tambahan maka sungguh ia telah melakukan riba.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "115",
    "matchingArabicURN": "1145780",
    "last_updated": null
  },
  {
    "indonesianURN": "3244880",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1954",
    "babName": "Membeli gandum halus dengan gandum halus",
    "hadithNumber": "4488",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dan Ibrahim bin Ya'qub mereka berkata; telah menceritakan kepada kami 'Amr bin 'Ashim, ia berkata; telah menceritakan kepada kami Hammam, ia berkata; telah menceritakan kepada kami Qatadah dari Abu Al Khalil dari Muslim Al Makki dari Abu Al Asy'ats Ash Shan'ani dari 'Ubadah bin Ash Shamit, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Emas dengan emas yang murni dan mata uangnya satu timbangan dengan satu timbangan, perak dengan perak yang murni dan mata uangnya satu timbangan dengan satu timbangan, garam dengan garam, kurma dengan kurma, gandum dengan gandum, dan jewawut dengan jewawut secara sama-sama dan semisal dengan semisal. Barang siapa yang menambah atau minta tambahan maka sungguh ia telah melakukan riba.\" Lafazhnya adalah lafazh Muhammad, Ibnu Ya'qub tidak menyebutkan; dan jewawut dengan jewawut.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "116",
    "matchingArabicURN": "1145790",
    "last_updated": null
  },
  {
    "indonesianURN": "3244890",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1954",
    "babName": "Membeli gandum halus dengan gandum halus",
    "hadithNumber": "4489",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud, ia berkata; telah menceritakan kepada kami Khalid dari Sulaiman bin Ali bahwa Abu Al Mutawalli melewati orang-orang di pasar kemudian beberapa orang datang kepadanya dan saya termasuk diantara mereka. Sulaiman mengatakan; kami mengatakan; kami datang kepadamu untuk bertanya mengenai barter. Ia berkata; saya mendengar Abu Sa'id Al Khudri.... kemudian seorang laki-laki berkata kepadanya; apakah tidak ada orang antara engkau dan Rasulullah shallallahu 'alaihi wasallam selain Abu Sa'id Al Khudri? Abu Al Mutawalli berkata; tidak ada orang antara saya dengan Rasulullah shallallahu 'alaihi wasallam selain dia. Ia berkata; sesungguhnya emas dengan emas, perak dengan perak, gandum dengan gandum, jewawut dengan jewawut, kurma dengan kurma dan garam dengan garam secara sama-sama, barang siapa menambah hal itu atau minta tambahan maka ia telah melakukan riba, orang yang mengambil dan yang memberi adalah sama.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "117",
    "matchingArabicURN": "1145800",
    "last_updated": null
  },
  {
    "indonesianURN": "3244900",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1954",
    "babName": "Membeli gandum halus dengan gandum halus",
    "hadithNumber": "4490",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Abdullah, ia berkata; telah menceritakan kepada kami Abu Usamah, ia berkata; telah berkata Isma'il; telah menceritakan kepada kami Hakim bin Jabir. Dari jalur lain; Telah menceritakan dan memberitakan kepada kami Ya'qub bin Ibrahim, ia berkata; telah menceritakan kepada kami Yahya dari Isma'il, ia berkata; telah menceritakan kepada kami Hakim bin Jabir dari 'Ubadah bin Ash Shamit, ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Emas dengan emas satu timbangan dengan satu timbangan Ya'qub tidak menyebutkan; \"satu timbangan dengan satu timbangan\". Mu'awiyah berkata; sesungguhnya orang ini tidak mengatakan sesuatupun. 'Ubadah berkata; demi Allah sesungguhnya saya tidak peduli untuk tidak berada di negeri yang padanya terdapat Mu'awiyah, sesungguhnya saya bersaksi bahwa saya mendengar Rasulullah shallallahu 'alaihi wasallam mengatakan hal tersebut.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "118",
    "matchingArabicURN": "1145810",
    "last_updated": null
  },
  {
    "indonesianURN": "3244910",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1955",
    "babName": "Membeli dinar dengan dinar",
    "hadithNumber": "4491",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id dari Malik dari Musa bin Abu Tamim dari Sa'id bin Yasar dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dinar dengan dinar, dan dirham dengan dirham, tidak boleh ada lebih diantara keduanya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "119",
    "matchingArabicURN": "1145820",
    "last_updated": null
  },
  {
    "indonesianURN": "3244920",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1956",
    "babName": "Membeli dirham dengan dirham",
    "hadithNumber": "4492",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id dari Malik dari Humaid bin Qais Al Makki dari Mujahid, ia berkata; Umar berkata; dinar dengan dinar, dirham dengan dirham tidak boleh ada kelebihan diantara keduanya. Hal ini adalah janji Nabi kita kepada kita.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "120",
    "matchingArabicURN": "1145830",
    "last_updated": null
  },
  {
    "indonesianURN": "3244930",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1956",
    "babName": "Membeli dirham dengan dirham",
    "hadithNumber": "4493",
    "hadithText": "Telah mengabarkan kepada kami Washil bin Abdul A'la, ia berkata; telah menceritakan kepada kami Muhammad bin Fudhail dari ayahnya dari Ibnu Abu Nu'aim dari Abu Hurairah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Emas dengan emas, satu timbangan dengan satu timbangan dan semisal dengan yang semisalnya, perak dengan perak satu timbangan dengan satu timbangan, semisalnya dengan semisalnya. Barang siapa yang menambah atau meminta tambahan maka ia telah melakukan riba.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "121",
    "matchingArabicURN": "1145840",
    "last_updated": null
  },
  {
    "indonesianURN": "3244940",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1957",
    "babName": "Membeli emas dengan emas",
    "hadithNumber": "4494",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Nafi' dari Abu Sa'id Al Khudri bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menjual emas dengan emas kecuali semisalnya dengan yang semisalnya, dan janganlah kalian melebihkan sedikitpun darinya, baik dengan ditunda atau secara kuntan.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "122",
    "matchingArabicURN": "1145850",
    "last_updated": null
  },
  {
    "indonesianURN": "3244950",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1957",
    "babName": "Membeli emas dengan emas",
    "hadithNumber": "4495",
    "hadithText": "Telah mengabarkan kepada kami Humaid bin Mas'adah dan Isma'il bin Mas'ud mereka berkata; telah menceritakan kepada kami Yazid yaitu Ibnu Zurai', ia berkata; telah menceritakan kepada kami Ibnu 'Aun dari Nafi' dari Abu Sa'id Al Khudri, ia berkata; mataku telah melihat dan telingaku mendengar dari Rasulullah shallallahu 'alaihi wasallam dan beliau menyebutkan larangan dari menjual emas dengan emas, perak dengan perak kecuali secara sama - sama, dan semisalnya dengan yang semisalnya, dan janganlah kalian menjual yang tidak kuntan dengan yang kuntan, dan janganlah kalian melebihkan salah satu dari keduanya atas yang lainnya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "123",
    "matchingArabicURN": "1145860",
    "last_updated": null
  },
  {
    "indonesianURN": "3244960",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1957",
    "babName": "Membeli emas dengan emas",
    "hadithNumber": "4496",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Zaid bin Aslam dari 'Atho` bin Yasar bahwa Mu'awiyah menjual geriba dari emas atau perak dengan lebih dari timbanganya, kemudian Abu Ad Darda` berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam melarang hal seperti ini kecuali semisalnya dengan yang semisalnya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "124",
    "matchingArabicURN": "1145870",
    "last_updated": null
  },
  {
    "indonesianURN": "3244970",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1958",
    "babName": "Membeli kalung yang berisi manik-manik dan emas dengan emas",
    "hadithNumber": "4497",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Al Laits dari Abu Syuja' Sa'id bin Yazid dari Khalid bin Abu Imran dari Hanasy Ash Shan'ani dari Fadhalah bin 'Ubaid, ia berkata; saya membeli kalung yang mengandung emas serta mutiara padanya saat Perang Khaibar, dengan harga dua belas dinar. Kemudian saya memisahkannya dan mendapatinya lebih dari dua belas dinar, kemudian hal tersebut disebutkan kepada Nabi shallallahu 'alaihi wasallam lalu beliau bersabda: \"Tidak boleh dijual hingga emas tersebut dipisahkan.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "125",
    "matchingArabicURN": "1145880",
    "last_updated": null
  },
  {
    "indonesianURN": "3244980",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1958",
    "babName": "Membeli kalung yang berisi manik-manik dan emas dengan emas",
    "hadithNumber": "4498",
    "hadithText": "Telah mengabarkan kepada kami 'Amr bin Manshur, ia berkata; telah menceritakan kepada kami Muhammad bin Mahbub, ia berkata; telah menceritakan kepada kami Husyaim, ia berkata; telah memberitakan kepada kami Al Laits bin Sa'd dari Khalid bin Abu Imran dari Hanasy Ash Shan'ani dari Fadhalah bin 'Ubaid, ia berkata; pada saat perang Khaibar saya mendapatkan kalung yang mengandung emas dan mutiara, kemudian saya hendak menjualnya, kemudian hal tersebut diutarakan kepada Nabi shallallahu 'alaihi wasallam, kemudian beliau bersabda: \"Pisahkan sebagian dari sebagiannya kemudian juallah.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "126",
    "matchingArabicURN": "1145890",
    "last_updated": null
  },
  {
    "indonesianURN": "3244990",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1959",
    "babName": "Membeli perak dengan emas dengan pembayaran ditangguhkan",
    "hadithNumber": "4499",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur dari Sufyan dari 'Amr dari Abu Al Minhal, ia berkata; Syarik menjualkan perak untukku dengan tidak tunai, kemudian ia datang dan mengabarkan kepadaku, maka saya katakan; ini tidak boleh. Lalu ia berkata; cukup, demi Allah, saya telah menjualnya di pasar dan tidak ada seorang seorangpun yang mencelaku. Kemudian saya datang kepada Al Barra` bin 'Azib dan bertanya kepadanya, lalu ia berkata; Nabi shallallahu 'alaihi wasallam datang kepada kami di Madinah dan kami sedang berjual beli seperti ini, kemudian beliau bersabda: \"Selama serah terima secara langsung maka tidak mengapa, dan yang tidak tunai maka itu Adalah riba.\" Kemudian ia berkata kepadaku; datanglah kepada Zaid bin Arqam. Kemudian saya datang kepada dan bertanya kepadanya, lalu ia mengatakan seperti itu.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "127",
    "matchingArabicURN": "1145900",
    "last_updated": null
  },
  {
    "indonesianURN": "3245000",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1959",
    "babName": "Membeli perak dengan emas dengan pembayaran ditangguhkan",
    "hadithNumber": "4500",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Al Hasan, ia berkata; telah menceritakan kepada kami Hajjaj, ia berkata; telah berkata Ibnu Juraij; telah mengabarkan kepadaku 'Amr bin Dinar serta 'Amir bin Mush'ab bahwa mereka telah mendengar Abu Al Minhal berkata; saya mendengar Al Bara` bin 'Azib dan Zaid bin Arqam berkata; dahulu kami adalah pedagang pada zaman Rasulullah shallallahu 'alaihi wasallam kemudian kami bertanya kepada Nabi Allah shallallahu 'alaihi wasallam mengenai barter, lalu beliau bersabda: \"Apabila serah terima secara langsung maka tidak mengapa dan apabila tidak tunai maka tidak boleh.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "128",
    "matchingArabicURN": "1145910",
    "last_updated": null
  },
  {
    "indonesianURN": "3245010",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1959",
    "babName": "Membeli perak dengan emas dengan pembayaran ditangguhkan",
    "hadithNumber": "4501",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Abdullah bin Al Hakam dari Muhammad telah menceritakan kepada kami Syu'bah dari Habib, dia berkata; \"Saya mendengar Abu Al Minhal berkata; \"Saya bertanya kepada Al Bara` bin 'Azib mengenai barter, kemudian dia berkata; \"Tanyakan kepada Zaid bin Arqam, sesungguhnya dia lebih baik dariku dan lebih mengetahui.\" Lalu saya bertanya kepada Zaid kemudian dia berkata; \"Tanyakan kepada Al Bara` sesungguhnya dia lebih baik dariku dan lebih mengetahui.\" Kemudian mereka berdua berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang menjual perak dengan emas dengan cara dihutang.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "129",
    "matchingArabicURN": "1145920",
    "last_updated": null
  },
  {
    "indonesianURN": "3245020",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1960",
    "babName": "Membeli perak dengan emas atau membeli emas dengan perak",
    "hadithNumber": "4502",
    "hadithText": "Dan di antara yang dibacakan kepada kami oleh Ahmad bin Mani', dia berkata; telah menceritakan kepada kami 'Abbad bin Al 'Awwab telah menceritakan kepada kami Yahya bin Abu Ishaq telah menceritakan kepada kami Abdur Rahman bin Abu Bakrah dari ayahnya, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang menjual perak dengan perak dan emas dengan emas kecuali bila sama ukuran/beratnya, dan beliau memerintahkan kami agar menjual emas dengan perak semau kami serta perak dengan emas semau kami.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "130",
    "matchingArabicURN": "1145930",
    "last_updated": null
  },
  {
    "indonesianURN": "3245030",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1960",
    "babName": "Membeli perak dengan emas atau membeli emas dengan perak",
    "hadithNumber": "4503",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Yahya bin Muhammad bin Katsir Al Harrani telah menceritakan kepada kami Abu Taubah telah menceritakan kepada kami Mu'awiyah bin Sallam dari Yahya bin Abu Katsir dari Abdur Rahman bin Abu Bakrah dari ayahnya, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang kami untuk menjual perak dengan perak kecuali secara kontan dan keduanya sama beratnya. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Juallah emas dengan perak bagaimanapun kalian mau, dan perak dengan emas bagaimanapun kalian mau.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "131",
    "matchingArabicURN": "1145940",
    "last_updated": null
  },
  {
    "indonesianURN": "3245040",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1960",
    "babName": "Membeli perak dengan emas atau membeli emas dengan perak",
    "hadithNumber": "4504",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Ali telah menceritakan kepada kami Sufyan dari 'Ubaidullah bin Abu Yazid, dia telah mendengar Ibnu Abbas berkata; \"Telah menceritakan kepadaku Usamah bin Zaid bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada riba kecuali di dalam kredit.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "132",
    "matchingArabicURN": "1145950",
    "last_updated": null
  },
  {
    "indonesianURN": "3245050",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1960",
    "babName": "Membeli perak dengan emas atau membeli emas dengan perak",
    "hadithNumber": "4505",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id telah menceritakan kepada kami Sufyan dari 'Amru dari Abu Shalih, dia mendengar Abu Sa'id Al Khudri berkata; saya berkata kepada Ibnu Abbas; \"Bagaimana pendapatmu mengenai sesuatu yang engkau katakan ini, apakah itu adalah sesuatu yang engkau dapatkan di dalam Kitab Allah 'azza wajalla atau sesuatu yang engkau dengar dari Rasulullah shallallahu 'alaihi wasallam?\" Ibnu Abbas berkata; \"Saya tidak mendapatkannya dalam Kitab Allah 'azza wajalla dan tidak pula mendengarnya dari Rasulullah shallallahu 'alaihi wasallam akan tetapi Usamah bin Zaid telah mengabarkan kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya riba itu hanya ada dalam pembayaran yang ditangguhkan.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "133",
    "matchingArabicURN": "1145960",
    "last_updated": null
  },
  {
    "indonesianURN": "3245060",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1960",
    "babName": "Membeli perak dengan emas atau membeli emas dengan perak",
    "hadithNumber": "4506",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Yahya dari Abu Nu'aim telah menceritakan kepada kami Hammad bin Salamah dari Simak bin Harb dari Sa'id bin Jubair dari Ibnu Umar, dia berkata; \"Saya pernah menjual unta di Baqi' saya menjualnya dengan beberapa dinar, dan kuambil beberapa dirham, kemudian saya datang menemui Nabi shallallahu 'alaihi wasallam di rumah Hafshah, saya berkata; \"Wahai Rasulullah, saya ingin bertanya. Sesungguhnya saya menjual unta di Baqi', saya menjualnya dengan dinar dan mengambil dirham.\" Beliau bersabda: \"Tidak mengapa engkau mengambilnya dengan harga pada hari itu, selama kalian berdua belum berpisah sementara (ketika itu) di antara kalian ada sesuatu.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "134",
    "matchingArabicURN": "1145970",
    "last_updated": null
  },
  {
    "indonesianURN": "3245070",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1961",
    "babName": "Menerima perak penjualan emas atau menerima emas penjualan perak dan perbedaan lafadz",
    "hadithNumber": "4507",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah telah menceritakan kepada kami Abu Al Ahwash dari Simak dari Ibnu Jubair dari Ibnu Umar, dia berkata; \"Saya pernah menjual emas dengan perak atau perak dengan emas kemudian saya datang menemui Rasulullah shallallahu 'alaihi wasallam dan mengabarkan kepada beliau mengenai hal tersebut. Lalu beliau bersabda: \"Apabila engkau menjual kepada sahabatmu maka janganlah engkau meninggalkannya sedang diantara kalian ada ketidak jelasan.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "135",
    "matchingArabicURN": "1145980",
    "last_updated": null
  },
  {
    "indonesianURN": "3245080",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1961",
    "babName": "Menerima perak penjualan emas atau menerima emas penjualan perak dan perbedaan lafadz",
    "hadithNumber": "4508",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar telah menceritakan kepada kami Waki' telah memberitakan kepada kami Musa bin Nafi' dari Sa'id bin Jubair bahwa dia membenci untuk mengambil dinar sebagai ganti dari dirham dan mengambil dirham sebagai ganti dari dinar.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "136",
    "matchingArabicURN": "1145990",
    "last_updated": null
  },
  {
    "indonesianURN": "3245090",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1961",
    "babName": "Menerima perak penjualan emas atau menerima emas penjualan perak dan perbedaan lafadz",
    "hadithNumber": "4509",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar telah memberitakan kepada kami Muammal telah menceritakan kepada kami Sufyan dari Abu Hasyim dari Sa'id bin Jubair dari Ibnu Umar bahwa dia berpendapat, tidak mengapa mengenai pengambilan dirham sebagai ganti dari dinar dan mengambil dinar sebagai ganti dari dirham.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "137",
    "matchingArabicURN": "1146000",
    "last_updated": null
  },
  {
    "indonesianURN": "3245100",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1961",
    "babName": "Menerima perak penjualan emas atau menerima emas penjualan perak dan perbedaan lafadz",
    "hadithNumber": "4510",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar telah menceritakan kepada kami Abdur Rahman telah menceritakan kepada kami Sufyan dari Abu Al Hudzail dari Ibrahim mengenai pengambilan dinar sebagai ganti dari dirham bahwa dia membencinya apabila berasal dari hutang.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "138",
    "matchingArabicURN": "1146010",
    "last_updated": null
  },
  {
    "indonesianURN": "3245120",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1962",
    "babName": "Menerima perak penjualan emas",
    "hadithNumber": "4512",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Ammar telah menceritakan kepada kami Al Mu'afa dari Hammad bin Salamah dari Simak bin Harb dari Sa'id bin Jubair dari Ibnu Umar, dia berkata; \"Saya datang menemui Nabi shallallahu 'alaihi wasallam dan mengatakan; \"Perlahan, saya akan bertanya kepada Tuan. Sesungguhnya saya menjual unta di Baqi' dengan dinar dan mengambil dirham.\" Beliau bersabda: \"Tidak mengapa engkau mengambil harga pada hari itu selama belum berpisah sementara diantara kalian terdapat sesuatu.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "141",
    "matchingArabicURN": "1146040",
    "last_updated": null
  },
  {
    "indonesianURN": "3245130",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1963",
    "babName": "Tambahan dalam timbangan",
    "hadithNumber": "4513",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la telah menceritakan kepada kami Khalid dari Syu'bah telah memberitakan kepadaku Muharib bin Ditsar dari Jabir, dia berkata; \"Tatkala Nabi shallallahu 'alaihi wasallam datang ke Madinah, beliau meminta timbangan, kemudian beliau menimbang untukku dan menambahiku.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "142",
    "matchingArabicURN": "1146050",
    "last_updated": null
  },
  {
    "indonesianURN": "3245140",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1963",
    "babName": "Tambahan dalam timbangan",
    "hadithNumber": "4514",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur dan Muhammad bin Abdullah bin Yazid dari Sufyan dari Mis'ar dari Muharib bin Ditsar dari Jabir, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam membayarku dan beliau menambahiku.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "143",
    "matchingArabicURN": "1146060",
    "last_updated": null
  },
  {
    "indonesianURN": "3245150",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1964",
    "babName": "Menimbang dengan sempurna",
    "hadithNumber": "4515",
    "hadithText": "Telah mengabarkan kepada kami Ya'qub bin Ibrahim telah menceritakan kepada kami Abdur Rahman dari Sufyan dari Simak dari Suwaid bin Qais, dia berkata; \"Saya dan Makhrafah Al 'Abdi mendatangkan kain sutera dari Hajar, kemudian Rasulullah shallallahu 'alaihi wasallam mendatangi kami ketika kami berada di Mina, dan terdapat seorang penimbang yang menimbang dengan upah, kemudian beliau membeli beberapa celana panjang dari kami, kemudian beliau berkata kepada penimbang tersebut: \"Timbanglah dan lebihkan.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "144",
    "matchingArabicURN": "1146070",
    "last_updated": null
  },
  {
    "indonesianURN": "3245160",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1964",
    "babName": "Menimbang dengan sempurna",
    "hadithNumber": "4516",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dan Muhammad bin Basysyar dari Muhammad telah menceritakan kepada kami Syu'bah dari Simak bin Harb, dia berkata; \"Saya mendengar Abu Shafwan berkata; \"Saya menjual beberapa celana panjang kepada Rasulullah shallallahu 'alaihi wasallam sebelum berhijrah dan beliau melebihkan berat timbangannya untukku.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "145",
    "matchingArabicURN": "1146080",
    "last_updated": null
  },
  {
    "indonesianURN": "3245170",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1964",
    "babName": "Menimbang dengan sempurna",
    "hadithNumber": "4517",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dari Al Mulai dari Sufyan. Dalam jalur lain disebutkan: telah memberitakan kepada kami Muhammad bin Isma'il telah memberitakan kepada kami Abu Nu'aim dari Sufyan dari Hanzhalah dari Thawus dari Ibnu Umar, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Takaran itu menyesuaikan dengan takaran penduduk Madinah, sedang timbangan menyesuaikan dengan timbangan penduduk Makkah, \" lafazh hadits tersebut adalah lafazh Ishaq.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "146",
    "matchingArabicURN": "1146090",
    "last_updated": null
  },
  {
    "indonesianURN": "3245180",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1965",
    "babName": "Menjual makanan sebelum menerima",
    "hadithNumber": "4518",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dan Al Harits bin Miskin dengan membacakan riwayat dan saya mendengar, dari Ibnu Al Qasim dari Malik dari Nafi' dari Ibnu Umar, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membeli makanan maka janganlah dia menjualnya hingga mengambilnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "147",
    "matchingArabicURN": "1146100",
    "last_updated": null
  },
  {
    "indonesianURN": "3245190",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1965",
    "babName": "Menjual makanan sebelum menerima",
    "hadithNumber": "4519",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah telah memberitakan kepada kami Ibnu Al Qasim dari Malik dari Abdullah bin Dinar dari Abdullah bin Umar bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membeli makanan maka janganlah dia menjualnya hingga mengambilnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "148",
    "matchingArabicURN": "1146110",
    "last_updated": null
  },
  {
    "indonesianURN": "3245210",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1965",
    "babName": "Menjual makanan sebelum menerima",
    "hadithNumber": "4521",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah telah menceritakan kepada kami Sufyan dari Ibnu Thawus dari Thawus, dia berkata; \"Saya mendengar Ibnu Abbas berkata; \"Adapun yang dilarang Rasulullah shallallahu 'alaihi wasallam untuk dijual hingga diambil adalah makanan.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "151",
    "matchingArabicURN": "1146140",
    "last_updated": null
  },
  {
    "indonesianURN": "3245220",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1965",
    "babName": "Menjual makanan sebelum menerima",
    "hadithNumber": "4522",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Rafi' telah menceritakan kepada kami Abdur Razzaq telah menceritakan kepada kami Ma'mar dari Ibnu Thawus dari ayahnya dari Ibnu Abbas, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membeli makanan maka janganlah dia menjualnya hingga mengambilnya.\" Ibnu Abbas berkata; \"Saya mengira bahwa segala sesuatu sama dengan makanan.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "152",
    "matchingArabicURN": "1146150",
    "last_updated": null
  },
  {
    "indonesianURN": "3245240",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1965",
    "babName": "Menjual makanan sebelum menerima",
    "hadithNumber": "4524",
    "hadithText": "Telah mengabarkan kepada kami Sulaiman bin Manshur, ia berkata; telah menceritakan kepada kami Abu Al Ahwash dari Abdul 'Aziz bin Rufai' dari 'Atho` bin Abu Rabah dari Hizam bin Hakim, ia berkata; telah berkata Hakim bin Hizam; saya membeli makanan dari makanan sedekah kemudian mendapatkan keuntungan padanya sebelum mengambilnya, kemudian saya datang kepada Rasulullah shallallahu 'alaihi wasallam dan menyebutkan hal tersebut kepada beliau. Kemudian beliau bersabda: \"Janganlah engkau menjualnya hingga engkau mengambilnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "155",
    "matchingArabicURN": "1146180",
    "last_updated": null
  },
  {
    "indonesianURN": "3245250",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1966",
    "babName": "Larangan menjual makanan yang dibeli hingga menerima",
    "hadithNumber": "4525",
    "hadithText": "Telah mengabarkan kepada kami Sulaiman bin Daud dan Al Harits bin Miskin dengan membacakan riwayat, dan saya mendengar, dari Ibnu Wahb, ia berkata; telah mengabarkan kepadaku 'Amru bin Al Harits dari Al Mundzir bin 'Ubaid dari Al Qasim bin Muhammad dari Ibnu Umar bahwa Nabi shallallahu 'alaihi wasallam melarang seseorang menjual makanan yang ia beli dengan takaran hingga ia mengambilnya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "156",
    "matchingArabicURN": "1146190",
    "last_updated": null
  },
  {
    "indonesianURN": "3245260",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1967",
    "babName": "Menjual makanan yang dibeli tanpa timbangan sebelum dipindahkan  dari tempatnya",
    "hadithNumber": "4526",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dan Al Harits bin Miskin dengan membacakan riwayat dan saya mendengar, dari Ibnu Al Qasim, ia berkata; telah menceritakan kepadaku Malik dari Nafi' dari Abdullah bin Umar, ia berkata; kami pada zaman Rasulullah shallallahu 'alaihi wasallam membeli makanan kemudian diutus kepada kami orang yang memerintahkan kami untuk memindahnya dari tempat kami membelinya ke tempat lainnya sebelum menjualnya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "157",
    "matchingArabicURN": "1146200",
    "last_updated": null
  },
  {
    "indonesianURN": "3245270",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1967",
    "babName": "Menjual makanan yang dibeli tanpa timbangan sebelum dipindahkan  dari tempatnya",
    "hadithNumber": "4527",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id, ia berkata; telah menceritakan kepada kami Yahya dari 'Ubaidullah, ia berkata; telah mengabarkan kepadaku Nafi' dari Ibnu Umar bahwa mereka dahulu membeli pada zaman Rasulullah shallallahu 'alaihi wasallam di atas pasar tanpa diketahui kadarnya, kemudian Rasulullah shallallahu 'alaihi wasallam melarang mereka untuk menjualnya di tempatnya hingga ia memindahnya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "158",
    "matchingArabicURN": "1146210",
    "last_updated": null
  },
  {
    "indonesianURN": "3245280",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1967",
    "babName": "Menjual makanan yang dibeli tanpa timbangan sebelum dipindahkan  dari tempatnya",
    "hadithNumber": "4528",
    "hadithText": "Telah mengabarkan kepada kami Abdur Rahman bin Abdullah bin Abdullah bin Abdul Hakam, ia berkata; telah menceritakan kepada kami Syu'aib bin Al Laits dari ayahnya dari Muhammad bin Abdur Rahman dari Nafi' bahwa Ibnu Umar telah menceritakan kepada mereka bahwa mereka membeli makanan pada zaman Rasulullah shallallahu 'alaihi wasallam dari orang-orang membawa dagangan ke pasar kemudian beliau melarang mereka untuk menjual di tempat mereka membelinya hingga memindahnya ke pasar makanan.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "159",
    "matchingArabicURN": "1146220",
    "last_updated": null
  },
  {
    "indonesianURN": "3245290",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1967",
    "babName": "Menjual makanan yang dibeli tanpa timbangan sebelum dipindahkan  dari tempatnya",
    "hadithNumber": "4529",
    "hadithText": "Telah mengabarkan kepada kami Nashr bin Ali, ia berkata; telah menceritakan kepada kami Yazid dari Ma'mar dari Az Zuhri dari Salim dari ayahnya, ia berkata; saya melihat manusia pada zaman Rasulullah shallallahu 'alaihi wasallam mendapatkan hukuman apabila mereka membeli makanan tidak diketahui kadarnya dan menjualnya kecuali mereka mengambilnya ada memindahkannya ke tempat tinggal mereka.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "160",
    "matchingArabicURN": "1146230",
    "last_updated": null
  },
  {
    "indonesianURN": "3245300",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1968",
    "babName": "Seseorang membeli makanan dengan pembayaran tangguh dan penjual meminta gadai (jaminan)",
    "hadithNumber": "4530",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Adam dari Hafsh bin Ghiyats dari Al A'masy dari Ibrahim dari Al Aswad dari Aisyah, ia berkata; Rasulullah shallallahu 'alaihi wasallam membeli makanan dari seorang Yahudi hingga suatu tempo dan beliau menggadaikan baju zirahnya kepadanya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "161",
    "matchingArabicURN": "1146240",
    "last_updated": null
  },
  {
    "indonesianURN": "3245310",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1969",
    "babName": "Gadai ketika tidak bepergian",
    "hadithNumber": "4531",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud, ia berkata; telah menceritakan kepada kami Khalid, ia berkata; telah menceritakan kepada kami Hisyam, ia berkata; telah menceritakan kepada kami Qatadah dari Anas bin Malik bahwa ia berjalan kepada Rasulullah shallallahu 'alaihi wasallam membawa roti dari gandum dan lemak cair yang telah berubah baunya. Ia berkata; sungguh beliau telah menggadaikan baju zirahnya pada seorang Yahudi di Madinah dan darinya ia mengambil gandum untuk keluarganya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "162",
    "matchingArabicURN": "1146250",
    "last_updated": null
  },
  {
    "indonesianURN": "3245320",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1970",
    "babName": "Menjual barang yang tak dimiliki",
    "hadithNumber": "4532",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Ali dan Humaid bin Mas'adah dari Yazid, ia berkata; telah menceritakan kepada kami Ayyub dari 'Amru bin Syu'aib dari ayahnya dari kakeknya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal jual beli dengan syarat diberi hutang, serta dua syarat dalam jual beli serta menjual apa yang tidak kamu miliki.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "163",
    "matchingArabicURN": "1146260",
    "last_updated": null
  },
  {
    "indonesianURN": "3245330",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1970",
    "babName": "Menjual barang yang tak dimiliki",
    "hadithNumber": "4533",
    "hadithText": "Telah mengabarkan kepada kami Utsman bin Abdullah, ia berkata; telah menceritakan kepada kami Sa'id bin Sulaiman dari 'Abbad bin Al 'Awwam dari Sa'id bin Abu 'Arubah dari Abu Raja`, Utsman berkata dia adalah Muhammad bin Saif dari Mathar dari 'Amru bin Syu'aib dari ayahnya dari kakeknya, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh seseorang menjual sesuatu yang tidak ia miliki.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "164",
    "matchingArabicURN": "1146270",
    "last_updated": null
  },
  {
    "indonesianURN": "3245340",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1970",
    "babName": "Menjual barang yang tak dimiliki",
    "hadithNumber": "4534",
    "hadithText": "Telah mengabarkan kepada kami Ziyad bin Ayyub, ia berkata; telah menceritakan kepada kami Husyaim, ia berkata; telah menceritakan kepada kami Abu Bisyr dari Yusuf bin Mahak dari Hakim bin Hizam, ia berkata; saya bertanya kepada Nabi shallallahu 'alaihi wasallam, saya katakan; wahai Rasulullah, datang kepadaku seorang laki-laki dan meminta kepadaku untuk menjual apa yang tidak ada padaku, saya jual kepadanya kemudian saya membeli membeli untuknya dari pasar. Beliau bersabda: \"Janganlah engkau menjual apa yang tidak engkau miliki.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "165",
    "matchingArabicURN": "1146280",
    "last_updated": null
  },
  {
    "indonesianURN": "3245350",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1971",
    "babName": "Membeli makanan dengan uang dimuka (indent)",
    "hadithNumber": "4535",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'id, ia berkata; telah menceritakan kepada kami Yahya dari Syu'bah dari Abdullah bin Abu Al Mujalid, ia berkata; saya bertanya kepada Ibnu Abu Aufa mengenai jual beli secara salaf. Ia berkata; dahulu kami melakukan salaf pada zaman Rasulullah shallallahu 'alaihi wasallam, Abu Bakr dan Umar dalam gandum dan jewawut serta kurma kepada suatu kaum yang saya tidak mengetahui apakah mereka memiliki atau tidak. Dan Ibnu Abzaa mengatakan seperti itu.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "166",
    "matchingArabicURN": "1146290",
    "last_updated": null
  },
  {
    "indonesianURN": "3245360",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1972",
    "babName": "Membeli kismis dengan uang dimuka (indent)",
    "hadithNumber": "4536",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan, ia berkata; telah menceritakan kepada kami Abu Daud, ia berkata; telah memberitakan kepada kami Syu'bah, ia berkata; telah menceritakan kepada kami Ibnu Abu Al Mujalid dan ia mengatakan terkadang Abdullah dan terkadang Muhammad, ia berkata; Abu Burdah Abdullah bin Syaddad berselisih menganai jual belia secara salam. Kemudian mereka mengutusku kepada Ibnu Abu Aufa kemudian saya bertanya kepadanya. Lalu ia berkata; dahulu kami melakukan jual beli dengan cara dihutang pada zaman Rasulullah shallallahu 'alaihi wasallam, dan zaman Abu Bakr serta Umar pada gandum dan jewawut, kismis serta kurma kepada beberapa orang yang kami lihat memiliki barang tersebut. Dan saya bertanya kepada Ibnu Abza kemudian ia berkata seperti itu.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "167",
    "matchingArabicURN": "1146300",
    "last_updated": null
  },
  {
    "indonesianURN": "3245370",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1973",
    "babName": "Membeli buah-buahan dengan uang ditangguhkan",
    "hadithNumber": "4537",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Sufyan dari Ibnu Abu Najih dari Abdullah bin Katsir dari Abu Al Minhal, ia berkata; saya mendengar Ibnu Abbas berkata; Rasulullah shallallahu 'alaihi wasallam datang ke Madinah dan mereka melakukan jual beli secara salaf pada kurma selama dalam jangka dua tahun dan tiga tahun. Kemudian beliau melarang mereka dan bersabda: \"Barang siapa yang memberikan hutang maka hendaknya ia menghutangi pada takaran yang diketahui, timbangan yang diketahui hingga jangka yang diketahui.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "168",
    "matchingArabicURN": "1146310",
    "last_updated": null
  },
  {
    "indonesianURN": "3245380",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1974",
    "babName": "Membeli hewan dengan meminta pembayaran ditangguhkan dan meminta dipinjami",
    "hadithNumber": "4538",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Ali, ia berkata; telah menceritakan kepada kami Abdur Rahman, ia berkata; telah menceritakan kepada kami Malik dari Zaid bin Aslam dari 'Atho` bin Yasar dari Abu Rafi' bahwa Rasulullah shallallahu 'alaihi wasallam menghutang unta muda kepada seseorang, kemudian orang tersebut datang kepada beliau menuntut unta mudanya, maka Rasulullah shallallahu 'alaihi wasallam bersabda kepada seseorang: \"Pergilah dan belikan untuknya unta muda.\" Kemudian orang tersebut datang kepada beliau dan berkata; saya tidak mendapatkan kecuali unta muda yang berumur empat tahun. Kemudian beliau bersabda: \"Berikan kepadanya sesungguhnya sebaik-baik orang muslim adalah orang yang paling baik dalam membayar.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "169",
    "matchingArabicURN": "1146320",
    "last_updated": null
  },
  {
    "indonesianURN": "3245390",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1974",
    "babName": "Membeli hewan dengan meminta pembayaran ditangguhkan dan meminta dipinjami",
    "hadithNumber": "4539",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Manshur, ia berkata; telah menceritakan kepada kami Abu Nu'aim, ia berkata; telah menceritakan kepada kami Sufyan dari Salamah bin Kuhail dari Abu Salamah dari Abu Hurairah, ia berkata; dahulu terdapat seseorang yang memiliki hak atas Rasulullah shallallahu 'alaihi wasallam berupa unta satu tahun, lalu ia datang kepada beliau menuntut, kemudian beliau bersabda: \"Berilah ia.\" Kemudian mereka tidak mendapatkan kecuali yang berumur di atas umur unta tersebut. Beliau bersabda: \"Berikan kepadanya.\" Orang tersebut berkata; engkau telah memenuhi hakku. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya sebaik-baik kalian adalah yang paling baik membayarnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "170",
    "matchingArabicURN": "1146330",
    "last_updated": null
  },
  {
    "indonesianURN": "3245400",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1974",
    "babName": "Membeli hewan dengan meminta pembayaran ditangguhkan dan meminta dipinjami",
    "hadithNumber": "4540",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah memberitakan kepada kami Abdur Rahman bin Mahdi, ia berkata; telah menceritakan kepada kami Mu'awiyah bin Shalih ia berkata; saya mendengar Sa'id bin Hani' berkata; saya mendengar 'Irbadh bin Sariyah berkata; saya menjual kepada Rasulullah shallallahu 'alaihi wasallam seekor unta muda. Lalu saya mendatangi beliau menuntut anak unta itu, beliau bersabda: \" Baiklah aku tidak akan membayarnya kepadamu kecuali dengan seekor unta yang berharga, \" lalu beliau membayarku dengan pembayaran yang terbaik, kemudian datanglah kepada beliau seorang badui menuntut seekor unta yang berumur kepada beliau, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \" berikan unta kepadanya, \" lalu mereka pada hari itu memberikan unta, lalu ia berkata; ini lebih baik dari untaku, kemudian beliau bersabda: \" sebaik-baik kalian adalah yang paling baik membayarnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "171",
    "matchingArabicURN": "1146340",
    "last_updated": null
  },
  {
    "indonesianURN": "3245410",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1975",
    "babName": "Menjual hewan dengan hewan yang dibayarkan secara tangguh",
    "hadithNumber": "4541",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Ali, ia berkata; telah menceritakan kepada kami Yahya bin Sa'id dan Yazid bin Zurai' dan Khalid bin Al Harits mereka berkata; telah menceritakan kepada kami Syu'bah dan telah mengabarkan kepadaku Ahmad bin Fadhalah bin Ibrahim, ia berkata; telah menceritakan kepada kami 'Ubaidullah bin Musa, ia berkata; telah menceritakan kepada kami Al Hasan bin Shalih dari Ibnu Abu 'Arubah dari Qatadah dari Al Hasan dari Samurah bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual hewan dengan hewan secara kredit.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "172",
    "matchingArabicURN": "1146350",
    "last_updated": null
  },
  {
    "indonesianURN": "3245420",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1976",
    "babName": "Jual beli hewan dengan hewan secara langsung (cash) dengan dilebihkan",
    "hadithNumber": "4542",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Al Laits dari Abu Az Zubair dari Jabir, ia berkata; telah datang seorang budak kemudian membai'at Rasulullah shallallahu 'alaihi wasallam untuk melakukan hijrah, dan Nabi shallallahu 'alaihi wasallam tidak merasakan bahwa ia adalah seorang budak. Kemudian tuannya datang menginginkannya. Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Juallah dia kepadaku.\" Kemudian beliau membelinya dengan dua orang budak hitam, kemudian beliau tidak membai'at seseorang hingga bertanya kepadanya apakah ia budak?</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "173",
    "matchingArabicURN": "1146360",
    "last_updated": null
  },
  {
    "indonesianURN": "3245430",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1977",
    "babName": "Jual beli habalul habalah (janin masih dalam kandungan)",
    "hadithNumber": "4543",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Hakim, ia berkata; telah menceritakan kepada kami Muhammad bin Ja'far, ia berkata; telah menceritakan kepada kami Syu'bah dari Ayyub dari Sa'id bin Jubair dari Ibnu Abbas dari Nabi beliau bersabda: \"salaf (mendahulukan pembayaran dan mengakhirkan barang pembelian) dalam hablil hablah (menjual janin yang nantinya ada dalam janin unta) adalah riba.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "174",
    "matchingArabicURN": "1146370",
    "last_updated": null
  },
  {
    "indonesianURN": "3245440",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1977",
    "babName": "Jual beli habalul habalah (janin masih dalam kandungan)",
    "hadithNumber": "4544",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur, ia berkata; telah menceritakan kepada kami Sufyan dari Ayyub dari Sa'id bin Jubair dari Ibnu Umar bahwa Nabi shallallahu 'alaihi wasallam melarang dari menjual janin yang ada dalam janin unta.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "175",
    "matchingArabicURN": "1146380",
    "last_updated": null
  },
  {
    "indonesianURN": "3245450",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1977",
    "babName": "Jual beli habalul habalah (janin masih dalam kandungan)",
    "hadithNumber": "4545",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Al Laits dari Nafi' dari Ibnu Umar bahwa Nabi shallallahu 'alaihi wasallam melarang dari menjual janin yang ada dalam janin unta.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "176",
    "matchingArabicURN": "1146390",
    "last_updated": null
  },
  {
    "indonesianURN": "3245460",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1978",
    "babName": "Penafsiran",
    "hadithNumber": "4546",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dan Al Harits bin Miskin dengan membacakan riwayat dan saya mendengar, lafazhnya adalah lafazh Al Harits, dari Ibnu Al Qasim, ia berkata; telah menceritakan kepadaku Malik dari Nafi' dari Ibnu Umar bahwa Nabi shallallahu 'alaihi wasallam melarang dari melarang dari menjual hablul hablah, dan hal itu merupakan jual beli yang dilakukan orang-orang ahli Jahiliyah, yaitu seseorang membeli unta sembelihan hingga waktu unta melahirkan dan anaknya yang ada dalam perutnya itupun melahirkan</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "177",
    "matchingArabicURN": "1146400",
    "last_updated": null
  },
  {
    "indonesianURN": "3245470",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1979",
    "babName": "Jual beli untuk beberapa tahun tertentu",
    "hadithNumber": "4547",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur, ia berkata; telah menceritakan kepada kami Sufyan dari Abu Az Zubair dari Jabir, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menjual hingga beberapa tahun.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "178",
    "matchingArabicURN": "1146410",
    "last_updated": null
  },
  {
    "indonesianURN": "3245480",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1979",
    "babName": "Jual beli untuk beberapa tahun tertentu",
    "hadithNumber": "4548",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Manshur, ia berkata; telah menceritakan kepada kami Sufyan dari Humaid Al A'raj dari Sulaiman yaitu Ibnu 'Atiq dari Jabir bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual hingga beberapa tahun.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "179",
    "matchingArabicURN": "1146420",
    "last_updated": null
  },
  {
    "indonesianURN": "3245490",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1980",
    "babName": "Jual beli untuk waktu tertentu",
    "hadithNumber": "4549",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Ali, ia berkata; telah menceritakan kepada kami Yazid bin Zurai', ia berkata; telah menceritakan kepada kami 'Umarah bin Abu Hafshah, ia berkata; telah memberitakan kepada kami 'Ikrimah dari 'Aisyah ia berkata; dulu Rasulullah shallallahu 'alaihi wasallam mengenakan dua kain burdah yang tebal, jika beliau duduk lalu berkeringat maka kain itu memberatkannya, dan telah datang kepada seorang Yahudi sejenis pakaian sutera, lalu saya katakan; seandainya anda mengutus seseorang kemudian membeli darinya dua pakaian hingga waktu mendapatkan kemudaha. Lalu beliau mengutus seseorang kepadanya, kemudian orang Yahudi itu berkata; aku tahu apa yang diinginkan Muhammad, ia hanya ingin untuk pergi dengan hartaku atau ia pergi dengan keduanya. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \" ia dusta, sesungguhnya ia telah mengetahui bahwa aku adalah yang paling takut kepada Allah dari mereka dan yang paling menjaga amanat.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "180",
    "matchingArabicURN": "1146430",
    "last_updated": null
  },
  {
    "indonesianURN": "3245500",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1981",
    "babName": "Menjual dagangan dengan syarat meminta pinjaman",
    "hadithNumber": "4550",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud dari Khalid dari Husain Al Mu'allim dari 'Amru bin Syu'aib dari ayahnya dari kakeknya bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari jual beli dengan syarat diberi hutang, dua syarat dalam jual beli dan keuntungan sesuatu yang belum ditanggung.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "181",
    "matchingArabicURN": "1146440",
    "last_updated": null
  },
  {
    "indonesianURN": "3245510",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1982",
    "babName": "Dua syarat dalam penjualan",
    "hadithNumber": "4551",
    "hadithText": "Telah mengabarkan kepada kami Ziyad bin Ayyub, ia berkata; telah menceritakan kepada kami Ibnu 'Ulayyah, ia berkata; telah menceritakan kepada kami Ayyub, ia berkata; telah menceritakan kepada kami 'Amru bin Syu'aib, ia berkata; telah menceritakan kepadaku ayahku dari ayahnya hingga ia menyebutkan Abdullah bin 'Amru, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal jual beli dengan syarat diberi hutang, dua syarat dalam jual beli dan keuntungan sesuatu yang belum ditanggung.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "182",
    "matchingArabicURN": "1146450",
    "last_updated": null
  },
  {
    "indonesianURN": "3245520",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1982",
    "babName": "Dua syarat dalam penjualan",
    "hadithNumber": "4552",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Rafi', ia berkata; telah menceritakan kepada kami Abdur Razzaq, ia berkata; telah menceritakan kepada kami Ma'mar dari Ayyub dari 'Amru bin Syu'aib dari ayahnya dari kakeknya, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari jual beli dengan syarat diberi hutang, dua syarat dalam satu akad jual beli, dan menjual sesuatu yang tidak engkau miliki.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "183",
    "matchingArabicURN": "1146460",
    "last_updated": null
  },
  {
    "indonesianURN": "3245530",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1983",
    "babName": "Dua pembelian dalam satu pembelian",
    "hadithNumber": "4553",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Ali dan Ya'qub bin Ibrahim dan Muhammad bin Al Mutsanna mereka berkata; telah menceritakan kepada kami Yahya bin Sa'id, ia berkata; telah menceritakan kepada kami Muhammad bin 'Amru, ia berkata; telah menceritakan kepada kami Abu Salamah dari Abu Hurairah berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari dua jual beli dalam satu akad jual beli.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "184",
    "matchingArabicURN": "1146470",
    "last_updated": null
  },
  {
    "indonesianURN": "3245540",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1984",
    "babName": "Larangan penjualan \"Pengecualian yang tak jelas\" hingga jelas",
    "hadithNumber": "4554",
    "hadithText": "Telah mengabarkan kepada kami Ziyad bin Ayyub, ia berkata; telah menceritakan kepada kami 'Abbad bin Al Awwam, ia berkata; telah menceritakan kepada kami Sufyan bin Husain, ia berkata; telah menceritakan kepada kami Yunus dari 'Atho` dari Jabir bahwa Nabi shallallahu 'alaihi wasallam melarang dari muhaqalah, muzabanah dan mukhabarah serta pengecualian kecuali diketahui.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "185",
    "matchingArabicURN": "1146480",
    "last_updated": null
  },
  {
    "indonesianURN": "3245550",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1984",
    "babName": "Larangan penjualan \"Pengecualian yang tak jelas\" hingga jelas",
    "hadithNumber": "4555",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr, ia berkata; telah menceritakan kepada kami Isma'il bin Ibrahim dari Ayyub dan telah mengabarkan kepada kami Ziyad bin Ayyub, ia berkata; telah menceritakan kepada kami Ibnu 'Ulayyah, ia berkata; telah memberitakan kepada kami Ayyub dari Abu Az Zubair dari Jabir, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari muhaqalah, muzabanah dan mukhabarah dan mu'awamah (menjual buah yang ada di atas pohon beberapa tahun sebelum nampak buah tersebut) serta pengecualian dan beliau memberikan keringanan dalam hal 'araya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "186",
    "matchingArabicURN": "1146490",
    "last_updated": null
  },
  {
    "indonesianURN": "3245560",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1985",
    "babName": "Pohon kurma dijual, dan pembeli mengecualikan buahannya",
    "hadithNumber": "4556",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Al Laits dari Nafi' dari Ibnu Umar bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Siapapun orang yang mengawinkan pohon kurma kemudian menjual pokoknya maka bagi orang yang mengawinkan mendapatkan buah pohon kurma kecuali apabila orang yang membeli mensyaratkan buah tersebut untuknya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "187",
    "matchingArabicURN": "1146500",
    "last_updated": null
  },
  {
    "indonesianURN": "3245570",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1986",
    "babName": "Budak dijual, dan pembeli mengecualikan hartanya",
    "hadithNumber": "4557",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah memberitakan kepada kami Sufyan dari Az Zuhri dari Salim dari ayahnya dari Nabi shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membeli pohon kurma setelah dikawinkan maka buahnya untuk orang yang membeli kecuali orang yang membeli mensyaratkan buah tersebut untuknya, dan barang siapa yang membeli budak dan ia memiliki harta maka hartanya milik orang yang menjual kecuali orang yang membeli mensyaratkannya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "188",
    "matchingArabicURN": "1146510",
    "last_updated": null
  },
  {
    "indonesianURN": "3245580",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1987",
    "babName": "Penjualan dengan syarat, sehingga pembelian dan syarat sah",
    "hadithNumber": "4558",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr, ia berkata; telah memberitakan kepada kami Sa'dan bin Yahya dari Zakariya dari 'Amir dari Jabir bin Abdullah, ia berkata; saya pernah bersama Nabi shallallahu 'alaihi wasallam dalam suatu perjalanan kemudian untaku tidak mampu untuk berjalan, lalu saya hendak meninggalkannya kemudian Rasulullah shallallahu 'alaihi wasallam menyusulku dan memanggil kemudian memukul unta tersebut sehingga ia berjalan yang sebelumnya tidak berjalan seperti itu. Lalu beliau bersabda: 'Juallah unta tersebut kepadaku dengan satu uqiyah.\" Maka saya katakan; tidak. Beliau bersabda: 'Juallah unta tersebut kepadaku.\" Kemudian saya menjual kepadanya dengan satu uqiyah dan saya mensyaratkan untuk membawaku ke Madinah. Setelah kami sampai Madinah maka saya mendatangi beliau dengan membawa unta tersebut, dan saya mengambil harganya, kemudian kembali. Lalu beliau mengirim utusan kepadaku dan beliau bersabda: \"Apakah engkau mengira bahwa saya menawarmu agar untuk mengambil untamu? Ambillah unta dan uang dirhammu.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "189",
    "matchingArabicURN": "1146520",
    "last_updated": null
  },
  {
    "indonesianURN": "3245590",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1987",
    "babName": "Penjualan dengan syarat, sehingga pembelian dan syarat sah",
    "hadithNumber": "4559",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Yahya bin Abdullah, ia berkata; telah menceritakan kepada kami Muhammad bin Isa bin Ath Thabba', ia berkata; telah menceritakan kepada kami Abu 'Awanah dari Mughirah dari Asy Sya'bi dari Jabir, ia berkata; saya berperang bersama Nabi shallallahu 'alaihi wasallam di atas unta kami, kemudian saya menyebutkan peristiwa tersebut. Kemudian unta tersebut mengalami keletihan lalu Nabi shallallahu 'alaihi wasallam menghardiknya sehingga ia menjadi semangat kembali hingga berada di hadapan pasukan. Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Wahai Jabir, saya tidak melihat kecuali telah bersemangat kembali.\" Maka saya katakan; karena berkahmu wahai Rasulullah! Beliau bersabda: \"Juallah kepadaku, dan engkau mendapatkan tunggangannya hingga engkau sampai Madinah.\" Kemudian saya menjualnya padahal saya sangat membutuhkannya, akan tetapi saya malu dari beliau. Kemudian tatkala kami telah menyelesaikan perang kami dan kami telah dekat dengan Madinah, maka saya meminta izin untuk mendahului. Saya katakan; wahai Rasulullah, saya adalah orang yang baru menikah. Beliau bersabda: \"Engkau menikahi gadis atau janda?\" Saya mengatakan; janda wahai Rasulullah, sesungguhnya Abdullah bin 'Amru telah terbunuh dan ia meninggalkan beberapa orang anak wanita yang masih gadis, dan saya tidak suka untuk mendatangi mereka dengan wanita yang seperti mereka, sehingga saya menikahi janda yang akan mengajari dan mendidik mereka. Kemudian beliau mengizinkan saya, dan bersabda: \"Datanglah kepada keluargamu pada saat isya`.\" Kemudian tatkala saya telah sampai maka saya khabarkan penjualan ont a tesebut kepada bibiku, lalu ia mencelaku. Tatkala Rasulullah shallallahu 'alaihi wasallam telah sampai maka saya datang kepada beliau membawa unta. Kemudian beliau memberiku harga unta serta unta itu sendiri, dan saham saya bersama orang-orang.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "190",
    "matchingArabicURN": "1146530",
    "last_updated": null
  },
  {
    "indonesianURN": "3245600",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1987",
    "babName": "Penjualan dengan syarat, sehingga pembelian dan syarat sah",
    "hadithNumber": "4560",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al 'Ala`, ia berkata; telah menceritakan kepada kami Abu Mu'awiyah dari Al A'masy dari Salim bin Abu Al Ja'd dari Jabir bin Abdullah, ia berkata; kami pernah bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu safar, dan saya berada di atas unta. Kemudian beliau bersabda: \"Kenapa engkau berada di bagian belakang?\" Saya katakan; untaku keletihan. Kemudian beliau memegang ekornya dan menghardiknya, lalu saya berada di depan orang-orang dan kepala unta tersebut membuatkan merasa khawatir. Kemudian tatkala kami telah mendekati Madinah beliau bersabda: \"Apa yang dilakukan unta tersebut? Juallah kepadaku.\" Saya mengatakan; tidak, melainkan unta tersebut untukmu wahai Rasulullah. Beliau bersabda: \"Tidak, juallah kepadaku.\" Saya mengatakan; tidak, melainkan unta tersebut untukmu. Beliau bersabda: \"Tidak, julallah kepadaku, saya beli dengan satu uqiyah, naiklah kemudian apabila engkau telah sampai Madinah maka datanglah kepada kami membawa unta tersebut.\" Tatkala saya telah sampai Madinah maka saya mendatanginya membawa unta tersebut. Kemudian beliau bersabda kepada Bilal: \"Wahai Bilal, timbanglah untuknya satu uqiyah dan tambahlah satu qirath.\" Ini adalah sesuatu yang dilebihkan Rasulullah shallallahu 'alaihi wasallam untukku, dan beliau tidak meninggalkanku. Kemudian saya meletakkannya di sebuah kantong, dan tetap ada padaku hingga penduduk Syam datang menyerang pada saat perang Harrah, dan mereka mengambil dari kami apa yang telah mereka ambil.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "191",
    "matchingArabicURN": "1146540",
    "last_updated": null
  },
  {
    "indonesianURN": "3245610",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1987",
    "babName": "Penjualan dengan syarat, sehingga pembelian dan syarat sah",
    "hadithNumber": "4561",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur, ia berkata; telah menceritakan kepada kami Sufyan dari Abu Az Zubair dari Jabir, ia berkata; Rasulullah shallallahu 'alaihi wasallam menemuiku dan saya berada di atas unta kami yang lemah. Kemudian saya katakan; aduh, kami senantiasa memiliki unta yang lemah. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Apakah engkau akan menjualnya kepadaku wahai Jabir?\" Maka saya katakan; unta itu untukmu wahai Rasulullah! Beliau bersabda: \"Ya Allah, ampunilah dia. Ya Allah, rahmatilah dia, sungguh saya telah membelinya dengan sekian dan sekian. Dan saya telah meminjamkan punggungnya hingga sampai Madinah.\" Kemudian setelah saya sampai Madinah, saya mempersiapkan unta tersebut dan pergi membawanya kepada beliau. Kemudian beliau bersabda: \"Wahai Bilal, berikan hartanya kepadanya.\" Kemudian setelah saya pergi maka beliau memanggilku, maka saya khawatir beliau mengembalikannya. Beliau bersabda: \"Unta itu untukmu.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "192",
    "matchingArabicURN": "1146550",
    "last_updated": null
  },
  {
    "indonesianURN": "3245620",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1987",
    "babName": "Penjualan dengan syarat, sehingga pembelian dan syarat sah",
    "hadithNumber": "4562",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la, ia berkata; telah menceritakan kepada kami Al Mu'tamir, ia berkata; saya mendengar ayahku berkata; telah menceritakan kepada kami Abu Nadhrah dari Jabir bin Abdullah, ia berkata; kami pernah berjalan bersama Rasulullah shallallahu 'alaihi wasallam dan saya berada di atas unta. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: 'Apakah engkau menjualnya kepadaku dengan sekian serta sekian dan Allah mengampuni dosamu?\" Maka saya katakan; ya, unta itu untukmu wahai Nabi Allah. Beliau bersabda: 'Apakah engkau menjualnya kepadaku dengan sekian serta sekian dan Allah mengampuni dosamu?\" Maka saya katakan; ya, unta itu untukmu wahai Nabi Allah. 'Apakah engkau menjualnya kepadaku dengan sekian serta sekian dan Allah mengampuni dosamu?\" Maka saya katakan; ya, unta itu untukmu wahai Nabi Allah. Abu Nadhrah mengatakan; dan hal itu menjadi perkataan yang dikatakan oleh orang-orang muslim; lakukanlah demikian dan demikian dan semoga Allah mengampunimu.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "193",
    "matchingArabicURN": "1146560",
    "last_updated": null
  },
  {
    "indonesianURN": "3245630",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1987",
    "babName": "Penjualan dengan syarat, sehingga pembelian dan syarat sah",
    "hadithNumber": "4563",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Jarir dari Manshur dari Ibrahim dari Al Aswad dari Aisyah, ia berkata; saya membeli Barirah kemudian pemiliknya mensyaratkan perwaliannya. Lalu hal tersebut saya utarakan kepada Nabi shallallahu 'alaihi wasallam kemudian beliau bersabda: \"Bebaskan dia, sesungguhnya perwalian itu untuk orang yang memberikan perak (pembeli).\" Aisyah berkata; kemudian Rasulullah shallallahu 'alaihi wasallam memanggil Barirah dan memberikan pilihan kepadanya terhadap suaminya, maka ia memilih dirinya. Suaminya pada saat itu adalah orang merdeka.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "194",
    "matchingArabicURN": "1146570",
    "last_updated": null
  },
  {
    "indonesianURN": "3245640",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1987",
    "babName": "Penjualan dengan syarat, sehingga pembelian dan syarat sah",
    "hadithNumber": "4564",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar, ia berkata; telah menceritakan kepada kami Muhammad, ia berkata; telah menceritakan kepada kami Syu'bah, ia berkata; telah menceritakan kepada kami Abdur Rahman bin Al Qasim, ia berkata; saya mendengar Al Qasim bercerita dari Aisyah bahwa ia ingin membeli Barirah untuk di merdekakan. Dan mereka mensyaratkan perwaliannya, lalu Aisyah mengutarakan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Belilah dia dan merdekakan, sesungguhnya perwalian adalah untuk orang yang memerdekakan.\" Dan Rasulullah shallallahu 'alaihi wasallam telah diberi daging kemudian dikatakan; daging ini disedekahkan kepada Barirah. Kemudian beliau bersabda: \"Itu sedekah baginya dan bagi kita sebagai hadiah.\" Kemudian Barirah diminta untuk memilih.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "195",
    "matchingArabicURN": "1146580",
    "last_updated": null
  },
  {
    "indonesianURN": "3245650",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1987",
    "babName": "Penjualan dengan syarat, sehingga pembelian dan syarat sah",
    "hadithNumber": "4565",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id dari Malik dari Nafi' dari Abdullah bin Umar bahwa Aisyah ingin membeli seorang budak wanita yang akan ia merdekakan, kemudian pemiliknya berkata; kami akan menjualnya kepadamu dengan syarat perwalian untuk kami. Kemudian Aisyah mengutarakan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau bersabda: \"Hal itu tidak menghalangimu, sesungguhnya perwalian adalah untuk orang yang memerdekakan.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "196",
    "matchingArabicURN": "1146590",
    "last_updated": null
  },
  {
    "indonesianURN": "3245660",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1988",
    "babName": "Penjualan ghanimah sebelum dibagi",
    "hadithNumber": "4566",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Hafsh bin Abdullah, ia berkata; telah menceritakan kepadaku ayahku, ia berkata; telah menceritakan kepadaku Ibrahim dari Yahya bin Sa'id dari 'Amru bin Syu'aib dari Abdullah bin Abu Najih dari Mujahid dari Ibnu Abbas, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menjual harta rampasan perang hingga dibagikan, dan dari wanita-wanita hamil untuk digauli hingga melahirkan kandungannya, dan dari daging setiap yang memiliki taring dari binatang buas.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "197",
    "matchingArabicURN": "1146600",
    "last_updated": null
  },
  {
    "indonesianURN": "3245670",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1989",
    "babName": "Penjualan harta yang kepemilikannya berserikat",
    "hadithNumber": "4567",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Zurarah, ia berkata; telah memberitakan kepada kami Isma'il dari Ibnu Juraij, ia berkata; telah mengabarkan kepadaku Abu Az Zubair dari Jabir, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hak membeli terlebih dahulu ada dalam setiap rumah yang dimiliki bersama, atau kebun dan tidak boleh ia menjual hingga memberi tahu sekutunya, kemudian apabila ia menjual maka sekutunya tersebut lebih berhak terhadapnya hingga ia memberi izin untuk menjualnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "198",
    "matchingArabicURN": "1146610",
    "last_updated": null
  },
  {
    "indonesianURN": "3245680",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1990",
    "babName": "Memudahkan untuk tidak mencari kesaksian penjualan",
    "hadithNumber": "4568",
    "hadithText": "Telah mengabarkan kepada kami Al Haitsam bin Marwan bin Imran, ia berkata; telah menceritakan kepada kami Muhammad bin Bakkar, ia berkata; telah menceritakan kepada kami Yahya yaitu Ibnu Hamzah dari Az Zubaidi bahwa Az Zuhri telah mengabarkan kepadanya dari 'Umarah bin Khuzaimah bahwa pamannya berkata kepadanya yang termasuk seorang sahabat Nabi shallallahu 'alaihi wasallam telah menceritakan kepadanya bahwa Nabi shallallahu 'alaihi wasallam membeli seekor kuda dari seorang badui dan ia mengikuti beliau untuk mengambil uangnya, lalu Nabi shallallahu 'alaihi wasallam mempercepat jalannya sedangkan orang badui itu memperlambat jalannya, lalu orang-orang mulai mendatangi badui itu dan menawarnya, mereka tidak mengetahui jika Nabi shallallahu 'alaihi wasallam telah membelinya hingga salah seorang dari mereka menambah harganya melebihi harga yang telah dibeli beliau, lalu orang badui itu memanggil Nabi shallallahu 'alaihi wasallam dan berkata apakah engkau jadi membeli kudaku ini jika tidak maka aku akan menjualnya, Nabi shallallahu 'alaihi wasallam berdiri begitu mendengar panggilan orang badui itu, beliau bersabda: \"Bukankah aku telah membelinya darimu?\" Ia menjawab tidak, demi Allah aku tidak menjualnya kepadamu, lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Aku telah membelinya darimu, \" lalu orang-orang mulai mengerumunin Nabi shallallahu 'alaihi wasallam dan orang badui itu, kemudian mereka berdua kembali, orang badui itu berkata datangkan seorang saksi bahwa aku telah menjualnya kepadamu, Khuzaimah bin Tasbit berkata aku bersaksi bahwa engkau telah menjualnya, lalu Nabi shallallahu 'alaihi wasallam menerima persaksian Kuzaimah dan bersabda: \"Karena apa engkau bersaksi, \" ia berkata dengan mempercayaimu ya Rasulullah ia berkata lalu Rasulullah shallallahu 'alaihi wasallam menjadikan persaksian Khuzaimah dengan dua orang saksi.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "199",
    "matchingArabicURN": "1146620",
    "last_updated": null
  },
  {
    "indonesianURN": "3245690",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1991",
    "babName": "Penjual-pembeli berbeda masalah harga",
    "hadithNumber": "4569",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Idris, ia berkata; telah menceritakan kepada kami Umar bin Hafsh bin Ghiyats, ia berkata; telah menceritakan kepada kami ayahku dari Abu 'Umais ia berkata; telah menceritakan kepadaku Abdur Rahman bin Qais bin Muhammad bin Al Asy'ats dari ayahnya dari kakekknya, Abdullah berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika dua orang yang berjual beli berselisih dan tidak ada bukti diantara keduanya maka yang diambil adalah perkataan pemilik barang atau mereka berdua meninggalkannya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "200",
    "matchingArabicURN": "1146630",
    "last_updated": null
  },
  {
    "indonesianURN": "3245700",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1991",
    "babName": "Penjual-pembeli berbeda masalah harga",
    "hadithNumber": "4570",
    "hadithText": "Telah mengabarkan kepadaku Ibrahim bin Al Hasan dan Yusuf bin Sa'id dan Abdur Rahman bin Khalid, lafazhnya adalah lafazh Ibrahim, mereka berkata; telah menceritakan kepada kami Hajjaj, ia berkata; telah berkata Ibnu Juraij; telah mengabarkan kepadaku Isma'il bin Umayyah dari Abdul Malik bin 'Ubaid, ia berkata; kami bersama 'Ubaidah bin Abdullah bin Mas'ud, telah datang kepadanya dua orang yang berjual beli suatu barang. Kemudian salah seorang diantara mereka berkata; saya membelinya dengan sekian dan sekian. Dan yang lain berkata; saya menjualnya dengan sekian dan sekian. Lalu Abu 'Ubaidah berkata; Ibnu Mas'ud dihadapkan pada permasalahan seperti ini, kemudian ia berkata; saya bersama Rasulullah shallallahu 'alaihi wasallam dan beliau dihadapkan pada permasalahan seperti ini kemudian beliau memerintahkan penjual agar bersumpah kemudian pembeli memilih, apabila mau maka ia mengambilnya dan apabila mau maka ia meninggalkannya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "201",
    "matchingArabicURN": "1146640",
    "last_updated": null
  },
  {
    "indonesianURN": "3245710",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1992",
    "babName": "Jual beli dengan ahli kitab",
    "hadithNumber": "4571",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Harb, ia berkata; telah menceritakan kepada kami Abu Mu'awiyah dari Al A'masy dari Ibrahim dari Al Aswad dari Aisyah, ia berkata; Rasulullah shallallahu 'alaihi wasallam membeli makanan dengan kredit dari seorang Yahudi, dan beliau memberikan kepadanya baju zirah beliau sebagai gadaian.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "202",
    "matchingArabicURN": "1146650",
    "last_updated": null
  },
  {
    "indonesianURN": "3245720",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1992",
    "babName": "Jual beli dengan ahli kitab",
    "hadithNumber": "4572",
    "hadithText": "Telah mengabarkan kepada kami Yusuf bin Hammad, ia berkata; telah menceritakan kepada kami Sufyan bin Habib dari Hisyam dari Ikrimah dari Ibnu Abbas, ia berkata; Rasulullah shallallahu 'alaihi wasallam meninggal dan baju zirahnya tergadaikan pada seorang Yahudi dengan tiga pulu sha' jewawut untuk keluarganya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "203",
    "matchingArabicURN": "1146660",
    "last_updated": null
  },
  {
    "indonesianURN": "3245730",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1993",
    "babName": "Penjualan budak budabbar",
    "hadithNumber": "4573",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Al Laits dari Abu Az Zubair dari Jabir, ia berkata; seseorang dari Bani 'Udzrah telah memerdekakan seorang budaknya apabila ia telah meninggal. Kemudian hal tersebut sampai kepada Rasulullah shallallahu 'alaihi wasallam, kemudian beliau bersabda: \"Apakah engkau memiliki harta selainnya?\" Ia berkata; tidak. Kemudian beliau bersabda: \"Siapakah yang akan membelinya dariku?\" Lalu budak tersebut dibeli Nu'aim bin Abdullah Al 'Adawi dengan harga delapan ratus dirham. kemudian ia membawanya kepada Rasulullah shallallahu 'alaihi wasallam. Lalu Rasulullah shallallahu 'alaihi wasallam menyerahkannya kepada orang tersebut kemudian bersabda: \"Mulailah dari dirimu, dan bersedekahlah kepadanya, kemudian apabila tersisa maka sisa tersebut untuk keluargamu, apabila tersisa dari keluargamu maka untuk kerabatmu, apabila tersisa dari kerabatmu maka demikian, demikian dan demikian.\" Beliau bersabda; untuk orang yang dihadapanmu, di sebelah kananmu dn sebelah kirimu.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "204",
    "matchingArabicURN": "1146670",
    "last_updated": null
  },
  {
    "indonesianURN": "3245740",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1993",
    "babName": "Penjualan budak budabbar",
    "hadithNumber": "4574",
    "hadithText": "Telah mengabarkan kepada kami Ziyad bin Ayyub, ia berkata; telah menceritakan kepada kami Isma'il, ia berkata; telah menceritakan kepada kami Ayyub dari Abu Az Zubair dari Jabir bahwa seorang laki-laki dari Anshar yang dipanggil Abu Madzkur memerdekakan budaknya yang bernama Ya'qub apabila ia meninggal, ia tidak memiliki harta selainnya. Lalu Rasulullah shallallahu 'alaihi wasallam meminta agar budak tersebut didatangkan, kemudian beliau bersabda: \"Siapakah yang akan membelinya?\" kemudian ia dibeli Nu'aim bin Abdullah dengan harga delapan ratus dirham. kemudian beliau menyerahkannya kepada orang Anshar tersebut dan bersabda: Apabila salah seorang diantara kalian fakir maka hendaknya ia memulai dari dirinya, kemudian apabila tersisa maka diberikan kepada keluarganya, kemudian apabila tersisa maka diberikan kepada kerabatnya kemudian apabila tersisa maka diberikan ke sini dan ke sini.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "205",
    "matchingArabicURN": "1146680",
    "last_updated": null
  },
  {
    "indonesianURN": "3245750",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1993",
    "babName": "Penjualan budak budabbar",
    "hadithNumber": "4575",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan, ia berkata; telah menceritakan kepada kami Waki', ia berkata; telah menceritakan kepada kami Sufyan dan Ibnu Abu Khalid dari Salamah bin Khuhail dari 'Atho` dari Jabir bahwa Nabi shallallahu 'alaihi wasallam menjual budak yang dimerdekakan apabila tuannya meninggal.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "206",
    "matchingArabicURN": "1146690",
    "last_updated": null
  },
  {
    "indonesianURN": "3245760",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1994",
    "babName": "Penjualan budak mukatab",
    "hadithNumber": "4576",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Al Laits dari Ibnu Syihab dari 'Urwah dari Aisyah, ia telah mengabarkan kepadanya bahwa Barirah datang kepada Aisyah meminta bantuan dalam menyelesaikan perjanjian pembebasannya. Kemudian Aisyah berkata kepadanya; kembalilah kepada tuanmu, apabila mereka ingin saya membayar perjanjian pembebasanmu dan perwaliannya untukku maka saya akan melakukannya. Kemudian Barirah menyebutkan hal tersebut kepada tuannyada mereka menolak, dan mengatakan; apabila ia ingin mengharapkan pahala dan perwaliannya untuk kami maka silahkan ia melakukannya. Kemudian Aisyah mengungkan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam dan beliau bersabda kepadanya: \"Belilah dan merdekakan, sesungguhnya perwalian itu untuk orang yang memerdekakan.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagaimana keadaan suatu kaum, mereka memberikan syarat yang tidak ada dalam Kitab Allah, barang siapa yang memberi syarat yang tidak ada dalam Kitab Allah, maka ia tidak berhak atas syarat tersebut walaupun ia telah memberikan syarat seratus syarat. Syarat Allah lebih berhak dan lebih kuat.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "207",
    "matchingArabicURN": "1146700",
    "last_updated": null
  },
  {
    "indonesianURN": "3245770",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1995",
    "babName": "Budak mukatab dijual sebelum membayar sedikitpun pembebasannya",
    "hadithNumber": "4577",
    "hadithText": "Telah mengabarkan kepada kami Yunus bin Abdul A'la, ia berkata; telah memberitakan kepada kami Ibnu Wahb, ia berkata; telah memberitakan kepadaku beberapa orang dari ulama, diantara mereka adalah Yunus dan Al Laits bahwa Ibnu Syihab telah mengabarkan kepada mereka dari 'Urwah dari Aisyah bahwa ia berkata; telah datang Barirah kepadaku dan berkata; wahai Aisyah, sesungguhnya saya telah mengadakan janji dengan tuanku untuk memerdekakan diriku, dengan sembila uqiyah pada setiap tahun satu uqiyah, maka bantulah saya. Dan ia belum membayar sedikitpun dari perjanjian pembebasannya itu. Kemudian Aisyah berkata kepadanya; kembalilah kepada taunmu, apabila mereka ingin saya memberikan itu semua kepada mereka dan perwaliannya untukku maka saya akan melakukannya. Kemudian Barirah pergi menemui tuannya dan menawarkan kepada mereka hal tersebut, namun mereka menolak, dan mengatakan; apabila ia mau mengharapkan pahala maka hendaknya silahkan ia melakukan dan perwalian itu untuk kami. Kemudian Aisyah menyampaikan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam. Lalu beliau bersabda: \"Hal itu tidak menghalangimu darinya. Belilah dan merdekakan, sesungguhnya perwalian untuk orang yang memerdekakan.\" Kemudian Aisyah melakukannya, dan Rasulullah shallallahu 'alaihi wasallam berdiri diantara manusia kemudian memuji Allah ta'la kemudian bersabda: \"Adapun selanjutnya, bagaimana keadaan orang-orang yang memberikan syarat-syarat yang tidak ada dalam Kitab Allah. Barang siapa yang memberikan syarat yang tidak ada dalam Kitab Allah maka syarat tersebut adalah batil, walaupun seratus syarat. Keputusan Allah lebih berhak dan syarat Allah lebih kuat, sesungguhnya perwalian adalah untuk orang yang memerdekakan.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "208",
    "matchingArabicURN": "1146710",
    "last_updated": null
  },
  {
    "indonesianURN": "3245780",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1996",
    "babName": "Jual beli wala\"",
    "hadithNumber": "4578",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud, ia berkata; telah menceritakan kepada kami Khalid, ia berkata; telah menceritakan kepada kami 'Ubaidullah dari Abdullah bin Dinar dari Abdullah radliallahu 'anhu bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual perwalian dan memberikannya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "209",
    "matchingArabicURN": "1146720",
    "last_updated": null
  },
  {
    "indonesianURN": "3245790",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1996",
    "babName": "Jual beli wala\"",
    "hadithNumber": "4579",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Malik dari Abdullah bin Dinar dari Ibnu Umar bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual perwalian dan memberikannya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "210",
    "matchingArabicURN": "1146730",
    "last_updated": null
  },
  {
    "indonesianURN": "3245800",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1996",
    "babName": "Jual beli wala\"",
    "hadithNumber": "4580",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr, ia berkata; telah menceritakan kepada kami Isma'il bin Ibrahim dari Syu'bah dari Abdullah bin Dinar dari Ibnu Umar, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menjual perwalian dan memberikannya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "211",
    "matchingArabicURN": "1146740",
    "last_updated": null
  },
  {
    "indonesianURN": "3245810",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1997",
    "babName": "Jual beli air",
    "hadithNumber": "4581",
    "hadithText": "Telah mengabarkan kepada kami Al Husain bin Huraits, ia berkata; telah menceritakan kepada kami Al Fadhl bin Musa As Sinani dari Husain bin Waqid dari Ayyub As Sakhtiyani dari 'Atho` dari Jabir bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual air.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "212",
    "matchingArabicURN": "1146750",
    "last_updated": null
  },
  {
    "indonesianURN": "3245820",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1997",
    "babName": "Jual beli air",
    "hadithNumber": "4582",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dan Abdullah bin Muhammad bin Abdur Rahman dan lafazhnya adalah lafazh Abdullah, mereka berkata; telah menceritakan kepada kami Sufyan dari 'Amru bin Dinar, ia berkata; saya mendengar Abu Al Minhal berkata; saya mendengar Iyas bin Umar... (terkadang ia mengatakan; Ibnu ' Abd) berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam melarang dari menjual air. Qutaibah berkata; saya tidak memahami sebagian yang dikatakan Abu Al Minhal sebagaimana yang saya inginkan.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "213",
    "matchingArabicURN": "1146760",
    "last_updated": null
  },
  {
    "indonesianURN": "3245830",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1998",
    "babName": "Jual beli kelebihan air",
    "hadithNumber": "4583",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id, ia berkata; telah menceritakan kepada kami Daud dari 'Amru dari Abu Al Minhal dari Iyas bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual kelebihan air. Dan penjaga Al Wahth telah menjual kelebihan air dan Abdullah bin 'Amru tidak menyukainya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "214",
    "matchingArabicURN": "1146770",
    "last_updated": null
  },
  {
    "indonesianURN": "3245840",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1998",
    "babName": "Jual beli kelebihan air",
    "hadithNumber": "4584",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Al Hasan dari Hajjaj, ia berkata; telah berkata Ibnu Juraij berkata; telah mengabarkan kepadaku 'Amru bin Dinar bahwa Abu Al Minhal telah mengabarkan kepadanya bahwa Iyas bin 'Abd seorang sahabat Nabi berkata; janganlah kalian menjual kelebihan air, sesungguhnya Nabi melarang dari menjual kelebihan air.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "215",
    "matchingArabicURN": "1146780",
    "last_updated": null
  },
  {
    "indonesianURN": "3245850",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1999",
    "babName": "Jual beli khamar atau miras (minuman keras)",
    "hadithNumber": "4585",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Zaid bin Aslam dari Ibnu Wa'lah Al Mishri bahwa ia bertanya kepada Ibnu Abbas mengenai apa yang diperas dari anggur, Ibnu Abbas berkata; seseorang telah memberikan hadiah kepada Rasulullah shallallahu 'alaihi wasallam geriba yang penuh dengan minuman keras, kemudian Nabi shallallahu 'alaihi wasallam bersabda kepadanya; \"Tidakkah engkau mengetahui bahwa Allah 'azza wajalla telah mengharamkannya?\" kemudian orang tersebut membisikkan dan saya tidak memahami apa yang ia bisikkan seperti saya menginginkan. Kemudian saya bertanya kepada seseorang disampingnya. Lalu Nabi shallallahu 'alaihi wasallam bertanya kepadanya: \"Apa yang engkau bisikkan?\" Orang tersebut berkata; saya memerintahkannya agar menjualnya. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Yang mengharamkannya mengharamkan penjualannya.\" Kemudian beliau membuka dua bejana besar yang terbuat dari kulit hingga terbuang isinya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "216",
    "matchingArabicURN": "1146790",
    "last_updated": null
  },
  {
    "indonesianURN": "3245860",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1999",
    "babName": "Jual beli khamar atau miras (minuman keras)",
    "hadithNumber": "4586",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan, ia berkata; telah menceritakan kepada kami Waki', ia berkata; telah menceritakan kepada kami Sufyan dari Manshur dari Abu Adh Dhuha dari Masruq dari Aisyah, ia berkata; tatkala turun ayat mengenai riba Rasulullah shallallahu 'alaihi wasallam berdiri di atas mimbar kemudian membacakan ayat tersebut kepada manusia, kemudian beliau mengharamkan penjualan minuman keras.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "217",
    "matchingArabicURN": "1146800",
    "last_updated": null
  },
  {
    "indonesianURN": "3245870",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2000",
    "babName": "Jual beli anjing",
    "hadithNumber": "4587",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Al Laits dari Ibnu Syihab dari Abu Bakr bin Abdur Rahman bin Al Harits bin Hisyam bahwa ia mendengar Abu Mas'ud 'Uqbah bin 'Amru, ia berkata; Rasulullah shallallahu 'alaihi wasallam telah melarang dari menjual anjing upah pelacur dan bayaran dukun.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "218",
    "matchingArabicURN": "1146810",
    "last_updated": null
  },
  {
    "indonesianURN": "3245880",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2000",
    "babName": "Jual beli anjing",
    "hadithNumber": "4588",
    "hadithText": "Telah mengabarkan kepada kami Abdur Rahman bin Abdullah bin Abdul Hakam, ia berkata; telah menceritakan kepada kami Sa'id bin Isa, ia berkata; telah memberitakan kepada kami Al Mufadhdhal bin Fadhalah dari Ibnu Juraij dari 'Atho` bin Abu Rabah dari Ibn Abbas ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda mengenai apa saja yang diharamkan: \" Dan menjual anjing.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "219",
    "matchingArabicURN": "1146820",
    "last_updated": null
  },
  {
    "indonesianURN": "3245890",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2001",
    "babName": "Pengecualian",
    "hadithNumber": "4589",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Al Hasan, ia berkata; telah memberitakan kepada kami Hajjaj bin Muhammad dari Hammad bin Salamah dari Abu Az Zubair dari Jabir bin Abdullah bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual anjing dan kucing kecuali anjing pemburu. Abdur Rahman berkata; hadits ini adalah mungkar.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "220",
    "matchingArabicURN": "1146830",
    "last_updated": null
  },
  {
    "indonesianURN": "3245900",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2002",
    "babName": "Jual beli babi",
    "hadithNumber": "4590",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Al Laits dari Yazid bin Abu Habib dari 'Atho` bin Abu Rabah dari Jabir bin Abdullah bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda pada saat penaklukan Mekkah dan beliau berada di Mekkah: \"Sesungguhnya Allah dan RasulNya telah mengharamkan menjual minuman keras, bangkai, babi dan patung.\" Beliau ditanya; wahai Rasulullah, bagaimana pendapat anda mengenai lemak bangkai, sesungguhnya lemak itu bisa digunakan untuk mengecat kapal, dan meminyaki kulit serta digunakan manusia untuk penerangan. Kemudian beliau bersabda: \"Tidak, itu adalah haram.\" Rasulullah shallallahu 'alaihi wasallam pada saat demikian bersabda: \"Semoga Allah 'azza wajalla memerangi orang-orang Yahudi, Allah telah mengharamkan atas mereka lemaknya lalu mereka mencairkannya, kemudian menjualnya dan memakan uangnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "221",
    "matchingArabicURN": "1146840",
    "last_updated": null
  },
  {
    "indonesianURN": "3245910",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2003",
    "babName": "Jual beli sperma unta",
    "hadithNumber": "4591",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Al Hasan dari Hajjaj, ia berkata; telah berkata Ibnu Juraij; telah mengabarkan kepadaku Abu Az Zubair bahwa ia telah mendengar Jabir berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menjual pengawinan unta, dan dari menjual air, menjual tanah bercocok tanam, yaitu seseorang menjual tanahnya dan airnya. Maka dari hal tersebut Nabi shallallahu 'alaihi wasallam melarang.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "222",
    "matchingArabicURN": "1146850",
    "last_updated": null
  },
  {
    "indonesianURN": "3245920",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2003",
    "babName": "Jual beli sperma unta",
    "hadithNumber": "4592",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim, ia berkata; telah menceritakan kepada kami Isma'il bin Ibrahim dari Ali bin Al Hakam, telah menceritakan dan memberikatakan kepada kami Humaid bin Mas'adah, ia berkata; telah menceritakan kepada kami Abdul Warits dari Ali bin Al Hakam dari Nafi' dari Ibnu Umar, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari penyewaan pejantan.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "223",
    "matchingArabicURN": "1146860",
    "last_updated": null
  },
  {
    "indonesianURN": "3245930",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2003",
    "babName": "Jual beli sperma unta",
    "hadithNumber": "4593",
    "hadithText": "Telah mengabarkan kepada kami 'Ishmah bin Al Fadhl, ia berkata; telah menceritakan kepada kami Yahya bin Adam dari Ibrahim bin Humaid Ar Ruwasi, ia berkata; telah menceritakan kepada kami Hisyam bin 'Urwah dari Muhammad bin Ibrahim bin Al Harits dari Anas bin Malik ia berkata; seorang laki-laki dari Bani Sha'q salah satu dari Bani Kilab mendatangi Rasulullah shallallahu 'alaihi wasallam dan bertanya kepada beliau; mengenai penyewakan pejantan. Maka beliau melarang hal itu dan bersabda: \"Sesungguhnya kami memuliakan hal itu.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "224",
    "matchingArabicURN": "1146870",
    "last_updated": null
  },
  {
    "indonesianURN": "3245940",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2003",
    "babName": "Jual beli sperma unta",
    "hadithNumber": "4594",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar dari Muhammad, ia berkata; telah menceritakan kepada kami Syu'bah dari Al Mughirah, ia berkata; saya mendengar Ibnu Abu Nu'm, ia berkata; saya mendengar Abu Hurairah berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari usaha tukang bekam, menjual anjing serta penyewaan pejantan.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "225",
    "matchingArabicURN": "1146880",
    "last_updated": null
  },
  {
    "indonesianURN": "3245950",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2003",
    "babName": "Jual beli sperma unta",
    "hadithNumber": "4595",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Ali bin Maimun, ia berkata; telah menceritakan kepada kami Muhammad, ia berkata; telah menceritakan kepada kami Sufyan dari Hisyam dari Ibnu Abu Nu'm dari Abu Sa'id Said Alkhudri ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari penyewakan pejantan.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "226",
    "matchingArabicURN": "1146890",
    "last_updated": null
  },
  {
    "indonesianURN": "3245960",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2003",
    "babName": "Jual beli sperma unta",
    "hadithNumber": "4596",
    "hadithText": "Telah mengabarkan kepada kami Washil bin Abdul A'la, ia berkata; telah menceritakan kepada kami Ibnu Fudhail dari Al A'masy dari Abu Hazim dari Abu Hurairah ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari jual beli anjing dan penyewaan pejantan.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "227",
    "matchingArabicURN": "1146900",
    "last_updated": null
  },
  {
    "indonesianURN": "3245970",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2004",
    "babName": "Seseorang menjual lantas bangkrut, dan dagangan masih tersisa",
    "hadithNumber": "4597",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah, ia berkata; telah menceritakan kepada kami Al Laits dari Yahya dari Abu Bakr bin Hazm dari Umar bin Abdul Aziz dari Abu Bakr bin Abdur Rahman bin Al Harits bin Hisyam dari Abu Hurairah dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Siapapun orang yang bangkrut kemudian seseorang mendapati barangnya ada padanya maka ia lebih berhak daripada selainnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "228",
    "matchingArabicURN": "1146910",
    "last_updated": null
  },
  {
    "indonesianURN": "3245980",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2004",
    "babName": "Seseorang menjual lantas bangkrut, dan dagangan masih tersisa",
    "hadithNumber": "4598",
    "hadithText": "Telah mengabarkan kepada kami Abdur Rahman bin Khalid dan Ibrahim bin Al Hasan, lafazhnya adalah lafazh Ibrahim, ia berkata; telah menceritakan kepada kami Hajjaj bin Muhammad, ia berkata; telah berkata Ibnu Juraij; telah mengabarkan kepadaku Ibnu Abu Husain bahwa Abu Bakr bin Muhammad bin 'Amru bin Hazm telah mengabarkan kepadanya bahwa Umar bin Abdul Aziz telah menceritakan kepadanya dari Abu Bakr bin Abdur Rahman dari hadits Abu Hurairah dari Nabi shallallahu 'alaihi wasallam mengenai seorang laki-laki yang menjadi miskin, apabila didapatkan bersamanya sebuah barang dan ia mengetahuinya, bahwa barang tersebut adalah untuk pemiliknya yang telah menjualnya.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "229",
    "matchingArabicURN": "1146920",
    "last_updated": null
  },
  {
    "indonesianURN": "3245990",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2004",
    "babName": "Seseorang menjual lantas bangkrut, dan dagangan masih tersisa",
    "hadithNumber": "4599",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin 'Amru bin As Sarh, ia berkata; telah memberitakan kepada kami Ibnu Wahb, ia berkata; telah menceritakan kepadaku Al Laits bin Sa'd dan 'Amru bin Al Harits dari Bukair bin Al Asyajj dari 'Iyadh bin Abdullah dari Abu Sa'id Al Khudri, ia berkata; seeorang pada zaman Rasulullah shallallahu 'alaihi wasallam tertimpa musibah pada buah-buahan yang ia beli sehingga hutangnya menjadi banyak. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bersedekahlah kepadanya.\" Kemudian mereka bersedekah kepadanya dan hal itu belum bisa menutup hutannya, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ambillah apa yang kalian dapatkan, dan kalian tidak memiliki hak kecuali hal itu.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "230",
    "matchingArabicURN": "1146930",
    "last_updated": null
  },
  {
    "indonesianURN": "3246000",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2005",
    "babName": "Seseorang menjual dagangan lantas diklaim milik orang lain",
    "hadithNumber": "4600",
    "hadithText": "Telah mengabarkan kepada kami Harun bin Abdullah, ia berkata; telah menceritakan kepada kami Hammad bin Mas'adah dari Ibnu Juraij dari Ikrimah bin Khalid, ia berkata; telah menceritakan kepadaku Usaid bin Hudhair bin Simak bahwa Rasulullah shallallahu 'alaihi wasallam memutuskan jika ia mendapatkan barangnya ditangan laki-laki yang tidak tertuduh, maka jika mau ia boleh mengambil dengan memberikan harga belinya, dan jika mau ia boleh menuntut orang yang mencurinya. Dan Abu Bakar serta Umar memutuskan hal seperti itu.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "231",
    "matchingArabicURN": "1146940",
    "last_updated": null
  },
  {
    "indonesianURN": "3246010",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2005",
    "babName": "Seseorang menjual dagangan lantas diklaim milik orang lain",
    "hadithNumber": "4601",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Manshur telah menceritakan kepada kami Sa'id bin Dzuaib telah menceritakan kepada kami Abdur Razzaq dari Ibnu Juraij sungguh telah mengabarkan kepadaku Ikrimah bin Khalid bahwa Usaid bin Hudhair Al Anshari kemudian salah seorang Bani Haritsah mengabarkan kepadanya bahwa dia adalah seorang gubernur di daerah Yamamah dan bahwa Marwan telah menulis surat kepadanya bahwa Mu'awiyah telah menulis surat kepadanya bahwa siapapun laki-laki yang kecurian suatu barang curian maka dia lebih berhak terhadap barang tersebut, ketika dia mendapatkannya (kembali). Kemudian Marwan menulis surat tersebut kepadaku, saya pun menulis surat kepada Marwan bahwa Nabi shallallahu 'alaihi wasallam memutuskan bahwasanya apabila orang yang membeli barang dari orang yang mencuri bukanlah orang yang tertuduh maka pemiliknya diberi pilihan, apabila mau dia boleh mengambil barang yang dicuri dengan memberikan harganya, dan apabila dia mau maka dia bisa menuntut orang yang mencurinya. Kemudian Abu Bakar, Umar dan Utsman memutuskan dengan hal tersebut. Lalu Marwan mengirim utusan dengan membawa suratku kepada Mu'awiyah. Dan Mu'awiyah menulis kepada Marwan; \"Sesungguhnya bukan engkau dan bukan Usaid yang memutuskan suatu perkara atas diriku, akan tetapi sayalah yang memutuskan perkara yang dikuasakan kepadaku atas kalian, maka lakukanlah apa yang aku perintahkan kepadamu.\" Kemudian Marwan mengirim surat Mu'awiyah kepadaku, lalu saya katakan; \"Selagi saya menjabat, saya tidak akan memutuskan dengan apa yang dikatakan Mu'awiyah.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "232",
    "matchingArabicURN": "1146950",
    "last_updated": null
  },
  {
    "indonesianURN": "3246020",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2005",
    "babName": "Seseorang menjual dagangan lantas diklaim milik orang lain",
    "hadithNumber": "4602",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Daud telah menceritakan kepada kami 'Amru bin 'Aun telah menceritakan kepada kami Husyaim dari Musa bin As Saib dari Qatadah dari Al Hasan dari Samurah, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seseorang itu lebih berhak terhadap hartanya jika ia mendapatinya, dan seorang penjual menuntut orang yang menjualnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "233",
    "matchingArabicURN": "1146960",
    "last_updated": null
  },
  {
    "indonesianURN": "3246030",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2005",
    "babName": "Seseorang menjual dagangan lantas diklaim milik orang lain",
    "hadithNumber": "4603",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id telah menceritakan kepada kami Ghundar dari Syu'bah dari Qatadah dari Al Hasan dari Samurah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapapun wanita yang dinikahkan oleh dua orang wali maka ia adalah milik orang yang lebih dahulu dari keduanya, dan barang siapa yang menjual sesuatu kepada dua orang maka sesuatu tersebut milik orang yang lebih dahulu dari keduanya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "234",
    "matchingArabicURN": "1146970",
    "last_updated": null
  },
  {
    "indonesianURN": "3246040",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2006",
    "babName": "Mencari pinjaman",
    "hadithNumber": "4604",
    "hadithText": "Telah menceritakan kepada kami 'Amru bin Ali telah menceritakan kepada kami Abdur Rahman dari Sufyan dari Ismail bin Ibrahim bin Abdullah bin Abu Rabi'ah dari ayahnya dari kakeknya, dia berkata; \"Nabi shallallahu 'alaihi wasallam meminjam uang kepadaku sebanyak empat puluh ribu, lalu ketika beliau memiliki harta beliau menyerahkannya kepadaku dan bersabda: \"Semoga Allah memberkahi keluarga dan hartamu, sesungguhnya balasan bagi peminjaman itu adalah pujian dan pemenuhan (pelunasan).\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "235",
    "matchingArabicURN": "1146980",
    "last_updated": null
  },
  {
    "indonesianURN": "3246050",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2007",
    "babName": "Teguran keras masalah hutang",
    "hadithNumber": "4605",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr dari Isma'il telah menceritakan kepada kami Al 'Ala` dari Abu Katsir, budak Muhammad bin Jahsy dari Muhammad bin Jahsy, dia berkata; \"Kami pernah duduk-duduk bersama Rasulullah shallallahu 'alaihi wasallam kemudian beliau mendongakkan kepala beliau ke langit kemudian beliau meletakkan telapak tangan beliau pada kening beliau kemudian bersabda: \"Subhanallah, apakah yang telah diturunkan dari sikap keras?\" kemudian kami diam dan terkejut. Kemudian setelah besok harinya saya bertanya kepada beliau; \"Wahai Rasulullah, sikap keras apakah yang telah diturunkan ini? Beliau bersabda: \"Demi Dzat yang jiwaku ada di tanganNya, seandainya seseorang terbunuh di jalan Allah, kemudian dihidupkan, kemudian terbunuh, kemudian dihidupkan, kemudian terbunuh dan ia memiliki tanggungan hutang maka ia tidak akan masuk Surga hingga terbayarkan hutangnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "236",
    "matchingArabicURN": "1146990",
    "last_updated": null
  },
  {
    "indonesianURN": "3246060",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2007",
    "babName": "Teguran keras masalah hutang",
    "hadithNumber": "4606",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan telah menceritakan kepada kami Abdur Razzaq telah menceritakan kepada kami Ats Tsauri dari ayahnya dari Asy Sya'bi dari Sam'an dari Samurah, dia berkata; \"Kami bersama Rasulullah shallallahu 'alaihi wasallam ketika mengurusi jenazah, lalu beliau bersabda: \"Apakah disini ada seseorang yang berasal dari Bani Fulan, \" sebanyak tiga kali, lalu berdirilah seseorang, kemudian Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Apa yang menghalangimu untuk menjawabku pada kedua panggilan pertama, aku tidak bermaksud kepadamu selain kebaikan, sesungguhnya Fulan (yaitu seseorang diantara mereka) meninggal dalam keadaan tertahan oleh hutangnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "237",
    "matchingArabicURN": "1147000",
    "last_updated": null
  },
  {
    "indonesianURN": "3246070",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2008",
    "babName": "Mudah membayar hutang",
    "hadithNumber": "4607",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Qudamah telah menceritakan kepada kami Jarir dari Manshur dari Ziyad bin 'Amru bin Hindun dari Imran bin Hudzaifah, dia berkata; \" Maimunah adalah orang yang banyak berhutang, keluarganya memperingatkan akan hal itu, mencelanya dan marah kepadanya. Dia lalu berkata; \"Aku tidak akan meninggalkan hutang, sungguh aku telah mendengar kekasihku dan pilihanku shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang yang banyak berhutang dan Allah mengetahui bahwa ia ingin membayarnya kecuali Allah akan membayarkannya di dunia.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "238",
    "matchingArabicURN": "1147010",
    "last_updated": null
  },
  {
    "indonesianURN": "3246080",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2008",
    "babName": "Mudah membayar hutang",
    "hadithNumber": "4608",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Al Mutsanna telah menceritakan kepada kami Wahb bin Jarir telah menceritakan kepada kami ayahku dari Al A'masy dari Hushain bin Abdur Rahman dari 'Ubaidullah bin Abdullah bin 'Utbah bahwa Maimunah isteri Nabi shallallahu 'alaihi wasallam berhutang, kemudian dikatakan kepadanya; \"Wahai Ummul Mukminin, engkau berhutang sedangkan engkau tidak mampu melunasi?\" Dia berkata; \"Sesungguhnya saya telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang mengambil hutang dan dia ingin membayarnya maka Allah 'azza wajalla akan membantunya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "239",
    "matchingArabicURN": "1147020",
    "last_updated": null
  },
  {
    "indonesianURN": "3246090",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2009",
    "babName": "Orang kaya menunda-nunda pembayaran",
    "hadithNumber": "4609",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah bin Sa'id telah menceritakan kepada kami Sufyan dari Abu Az Zinad dari Al A'raj dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila seseorang diantara kalian dipindahkan kepada orang yang kaya maka hendaknya ia mengikuti, kezhaliman adalah orang kaya yang menunda pembayaran hutang tanpa adanya udzur (syar'i).\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "240",
    "matchingArabicURN": "1147030",
    "last_updated": null
  },
  {
    "indonesianURN": "3246100",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2009",
    "babName": "Orang kaya menunda-nunda pembayaran",
    "hadithNumber": "4610",
    "hadithText": "Telah mengabarkan kepadaku Muhammad bin Adam telah menceritakan kepada kami Ibnu Al Mubarak dari Wabr bin Abu Dulailah dari Muhammad bin Maimun dari 'Amru bin Asy Syarid dari ayahnya, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penundaan pembayaran hutan yang dilakukan oleh orang yang mampu membayarnya menghalalkan kehormatan (untuk dighibah) dan hukumannya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "241",
    "matchingArabicURN": "1147040",
    "last_updated": null
  },
  {
    "indonesianURN": "3246110",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2009",
    "babName": "Orang kaya menunda-nunda pembayaran",
    "hadithNumber": "4611",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim telah menceritakan kepada kami Waki' telah menceritakan kepada kami Wabr bin Abu Dulailah Ath Thaify dari Muhammad bin Maimun bin Musaikah dan dia memujinya dengan kebaikan dari 'Amru bin Asy Syarid dari ayahnya dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Penundaan pembayaran hutan yang dilakukan oleh orang yang mampu membayarnya menghalalkan kehormatan (untuk dighibah) dan hukumannya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "242",
    "matchingArabicURN": "1147050",
    "last_updated": null
  },
  {
    "indonesianURN": "3246120",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2010",
    "babName": "Hiwalah (pengalihan hutang)",
    "hadithNumber": "4612",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Salamah dan Al Harits bin Miskin dengan membacakan riwayat sedang saya mendengar, lafazhnya adalah lafazh Al Harits, dari Ibnu Al Qasim telah menceritakan kepadaku Malik dari Abu Az Zinad dari Al A'raj dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penundaan pembayaran hutang yang dilakukan oleh orang yang kaya adalah kezhaliman. Apabila seseorang diantara kalian dipindahkan kepada orang yang kaya maka hendaknya dia mengikuti.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "243",
    "matchingArabicURN": "1147060",
    "last_updated": null
  },
  {
    "indonesianURN": "3246130",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2011",
    "babName": "Menanggung hutang",
    "hadithNumber": "4613",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la telah menceritakan kepada kami Khalid telah menceritakan kepada kami Sa'id dari Utsman bin Abdullah bin Mauhab dari Abdullah bin Abu Qatadah dari ayahnya bahwa seseorang dari kalangan Anshar dihadapkan kepada Nabi shallallahu 'alaihi wasallam agar beliau menshalatinya, kemudian beliau bersabda: \"Sesungguhnya sahabat kalian ini memiliki hutang.\" Kemudian Abu Qatadah berkata; \"Saya yang akan menanggungnya.\" Beliau bersabda: \"Dengan membayarnya?\" Dia berkata; \"Dengan membayarnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "244",
    "matchingArabicURN": "1147070",
    "last_updated": null
  },
  {
    "indonesianURN": "3246140",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2012",
    "babName": "Dorongan agar melunasi hutang dengan baik",
    "hadithNumber": "4614",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim dari Waki' telah menceritakan kepadaku Ali bin Shalih dari Salamah bin Kuhail dari Abu Salamah dari Abu Hurairah dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sebaik-baik kalian adalah yang paling baik dalam membayar (hutang).\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "245",
    "matchingArabicURN": "1147080",
    "last_updated": null
  },
  {
    "indonesianURN": "3246150",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2013",
    "babName": "Interaksi hartawi dengan baik dan santun dalam tagih menagih",
    "hadithNumber": "4615",
    "hadithText": "Telah mengabarkan kepada kami Isa bin Hammad telah menceritakan kepada kami Al Laits dari Ibnu 'Ajlan dari Zaid bin Aslam dari Abu Shalih dari Abu Hurairah dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya terdapat seorang laki-laki yang belum pernah berbuat kebaikan sama sekali, dan dia biasa memberikan hutang kepada orang-orang. Kemudian dia berkata kepada utusannya; \"Ambillah apa yang mudah dan tinggalkan apa yang sulit dan maafkan semoga Allah ta'ala mengampuni kita.\" Kemudian tatkala dia meninggal, Allah 'azza wajalla berfirman kepadanya: \"Apakah engkau pernah mengerjakan kebaikan?\" Dia berkata; \"Tidak, hanya saja saya memiliki seorang pembantu dan saya biasa memberikan hutang kepada orang-orang kemudian apabila saya mengutusnya untuk menagih hutang, saya katakan kepadanya; 'Ambillah apa yang mudah dan tinggalkan apa yang sulit dan maafkan, semoga Allah memaafkan kita.\" Allah ta'ala berfirman: sungguh Aku telah memaafkanmu.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "246",
    "matchingArabicURN": "1147090",
    "last_updated": null
  },
  {
    "indonesianURN": "3246160",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2013",
    "babName": "Interaksi hartawi dengan baik dan santun dalam tagih menagih",
    "hadithNumber": "4616",
    "hadithText": "Telah mengabarkan kepada kami Hisyam bin 'Ammar telah menceritakan kepada kami Yahya telah menceritakan kepada kami Az Zubaidi dari Az Zuhri dari 'Ubaidullah bin Abdullah bahwa dia mendengar Abu Hurairah berkata; \"Sesungguhnya Nabi shallallahu 'alaihi wasallam bersabda: \"Dahulu terdapat seorang laki-laki yang biasa memberikan hutang kepada orang-orang dan apabila ia melihat orang yang dihutangi mengalami kesulitan maka dia berkata kepada pembantunya; \"Maafkan dia, semoga Allah ta'ala memaafkan kita. Kemudian dia bertemu dengan Allah dan Dia pun memaafkannya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "247",
    "matchingArabicURN": "1147100",
    "last_updated": null
  },
  {
    "indonesianURN": "3246170",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2013",
    "babName": "Interaksi hartawi dengan baik dan santun dalam tagih menagih",
    "hadithNumber": "4617",
    "hadithText": "Telah mengabarkan kepada kami Abdullah bin Muhammad bin Ishaq dari Isma'il bin 'Ulayyah dari Yunus dari 'Atho` bin Farrukh dari Utsman bin Affan dia berkata; \"Allah shallallahu 'alaihi wasallam bersabda: \"Allah Azza wa jalla memasukkan kedalam surga seseorang yang memudahkan (dalam) menjual dan membeli, memberikan hutang, dan menagih pembayaran hutangnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "248",
    "matchingArabicURN": "1147110",
    "last_updated": null
  },
  {
    "indonesianURN": "3246180",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2014",
    "babName": "Berserikat bukan harta",
    "hadithNumber": "4618",
    "hadithText": "Telah mengabarkan kepadaku 'Amru bin Ali telah menceritakan kepada kami Yahya dari Sufyan telah menceritakan kepadaku Abu Ishaq dari Abu 'Ubaidah dari Abdullah, dia berkata; \"Saya, 'Ammar dan Sa'd berserikat pada saat perang Badr, kemudian Sa'd datang membawa dua orang tawanan sedang saya dan 'Ammar tidak membawa sesuatupun.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "249",
    "matchingArabicURN": "1147120",
    "last_updated": null
  },
  {
    "indonesianURN": "3246190",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2014",
    "babName": "Berserikat bukan harta",
    "hadithNumber": "4619",
    "hadithText": "Telah mengabarkan kepada kami Nuh bin Habib telah memberitakan kepada kami Abdur Razzaq telah memberitakan kepada kami Ma'mar dari Az Zuhri dari Salim dari ayahnya bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang memerdekakan bagiannya pada seorang budak maka bagian yang tersisa dari hartanya akan disempurnakan apabila dia memiliki harta yang mencapai harga budak tersebut.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "250",
    "matchingArabicURN": "1147130",
    "last_updated": null
  },
  {
    "indonesianURN": "3246200",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2015",
    "babName": "Berserikat dalam budak",
    "hadithNumber": "4620",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Ali telah menceritakan kepada kami Yazid yaitu Ibnu Zurai' telah menceritakan kepada kami Ayyub dari Nafi' dari Ibnu Umar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang memerdekakan bagiannya pada seorang budak padahal dia memiliki harta yang tidak mencapai seluruh harga budak tersebut maka dia dibebaskan dari hartanya tersebut.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "251",
    "matchingArabicURN": "1147140",
    "last_updated": null
  },
  {
    "indonesianURN": "3246210",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2016",
    "babName": "Berserikat dalam pohon kurma",
    "hadithNumber": "4621",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah telah menceritakan kepada kami Sufyan dari Abu Az Zubair dari Jabir bahwa Nabi shallallahu 'alaihi wasallam bersabda: 'Siapapun di antara kalian yang memiliki tanah atau pohon kurma maka janganlah dia menjualnya hingga menawarkannya kepada sekutunya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "252",
    "matchingArabicURN": "1147150",
    "last_updated": null
  },
  {
    "indonesianURN": "3246220",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2017",
    "babName": "Berserikat dalam rumah atau pekarangan",
    "hadithNumber": "4622",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al 'Ala` telah memberitakan kepada kami Ibnu Idris dari Ibnu Juraij dari Abu Az Zubair dari Jabir, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memutuskan dengan hak syuf'ah pada setiap serikat yang belum dibagi, rumah dan kebun. Tidak halal baginya untuk menjualnya hingga dia memberitahukan kepada sekutunya jika mau maka dia mengambilnya dan jika mau maka dia meninggalkannya, dan apabila dia menjual tanpa persetujuan sekutunya maka sekutunya lebih berhak terhadapnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "253",
    "matchingArabicURN": "1147160",
    "last_updated": null
  },
  {
    "indonesianURN": "3246230",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2018",
    "babName": "Syuf'ah dan hukumnya",
    "hadithNumber": "4623",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr telah menceritakan kepada kami Sufyan dari Ibrahim bin Maisarah dari 'Amru bin Asy Syarid dari Abu Rafi', dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tetangga lebih berhak terhadap apa yang dekat dengan rumahnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "254",
    "matchingArabicURN": "1147170",
    "last_updated": null
  },
  {
    "indonesianURN": "3246240",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2018",
    "babName": "Syuf'ah dan hukumnya",
    "hadithNumber": "4624",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim telah menceritakan kepada kami 'Isa bin Yunus telah menceritakan kepada kami Husain Al Mu'allim dari 'Amru bin Syu'aib dari 'Amru bin Asy Syarid dari ayahnya bahwa seseorang berkata; \"Wahai Rasulullah, tidak ada yang berserikat dalam kepemilikan tanahku dan tidak ada yang mendapatkan bagian kecuali hanya tetangga.\" Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang tetangga itu lebih berhak terhadap apa yang dekat dengannya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "255",
    "matchingArabicURN": "1147180",
    "last_updated": null
  },
  {
    "indonesianURN": "3246250",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2018",
    "babName": "Syuf'ah dan hukumnya",
    "hadithNumber": "4625",
    "hadithText": "Telah mengabarkan kepada kami Hilal bin Bisyr telah menceritakan kepada kami Shafwan bin 'Isa dari Ma'mar dari Az Zuhri dari Abu Salamah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hak untuk membeli terlebih dahulu ada pada setiap harta yang belum dibagi, apabila telah dibuat batasan dan telah diketahui jalannya maka tidak ada hak membeli terlebih dahulu.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "256",
    "matchingArabicURN": "1147190",
    "last_updated": null
  },
  {
    "indonesianURN": "3246260",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "2018",
    "babName": "Syuf'ah dan hukumnya",
    "hadithNumber": "4626",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul Aziz bin Abu Rizmah telah menceritakan kepada kami Al Fadhl bin Musa dari Husain yaitu Ibnu Waqid dari Abu Az Zubair dari Jabir, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam telah memutuskan dengan hak membeli terlebih dahulu dan hak tetangga.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "257",
    "matchingArabicURN": "1147200",
    "last_updated": null
  },
  {
    "indonesianURN": "3245111",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1961",
    "babName": "Menerima perak penjualan emas atau menerima emas penjualan perak dan perbedaan lafadz",
    "hadithNumber": "4511",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar telah menceritakan kepada kami Abdur Rahman telah menceritakan kepada kami Sufyan dari Musa Abu Syihab dari Sa'id bin Jubair bahwa dia melihat tidak mengapa walaupun berasal dari hutang.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "139",
    "matchingArabicURN": "1146020",
    "last_updated": null
  },
  {
    "indonesianURN": "3245112",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1961",
    "babName": "Menerima perak penjualan emas atau menerima emas penjualan perak dan perbedaan lafadz",
    "hadithNumber": "4511",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basyar telah menceritakan kepada kami Waki' telah menceritakan kepada kami Musa bin Nafi' dari Sa'id bin Jubair dengan hadits yang semisal. Abu Abdurrahman berkata; \"Demikianlah yang saya dapatkan pada permasalahan ini.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "140",
    "matchingArabicURN": "1146030",
    "last_updated": null
  },
  {
    "indonesianURN": "3245201",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1965",
    "babName": "Menjual makanan sebelum menerima",
    "hadithNumber": "4520",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Harb telah menceritakan kepada kami Qasim dari Sufyan dari Ibnu Thawus dari ayahnya dari Ibnu Abbas, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membeli makanan maka janganlah dia menjualnya hingga menakarnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "149",
    "matchingArabicURN": "1146120",
    "last_updated": null
  },
  {
    "indonesianURN": "3245202",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1965",
    "babName": "Menjual makanan sebelum menerima",
    "hadithNumber": "4520",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Manshur telah memberitakan kepada kami Abdur Rahman dari Sufyan dari 'Amru dari Thawus dari Ibnu Abbas, dia berkata; \"Saya mendengar Nabi shallallahu 'alaihi wasallam (bersabda) dengan hadits seperti itu dan yang sebelumnya hingga dia mengambilnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "150",
    "matchingArabicURN": "1146130",
    "last_updated": null
  },
  {
    "indonesianURN": "3245231",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1965",
    "babName": "Menjual makanan sebelum menerima",
    "hadithNumber": "4523",
    "hadithText": "Telah mengabarkan kepadaku Ibrahim bin Al Hasan dari Hajjaj bin Muhammad telah berkata Ibnu Juraij telah mengabarkan kepadaku 'Atho` dari Shafwan bin Mauhab bahwa dia telah dikabarkan kepadanya dari Abdullah bin Muhammad bin Shaifi dari Hakim bin Hizam, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah engkau menjual makanan hingga engkau membeli dan mengambilnya.\"</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "153",
    "matchingArabicURN": "1146160",
    "last_updated": null
  },
  {
    "indonesianURN": "3245232",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "44",
    "bookName": "Jual-beli",
    "babNumber": "1965",
    "babName": "Menjual makanan sebelum menerima",
    "hadithNumber": "4523",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Al Hasan, ia berkata; telah menceritakan kepada kami Hajjaj, ia berkata; telah berkata Ibnu Juraij dan telah mengabarkan kepadaku 'Atho` dari Abdullah bin 'Ishmah Al Jusyami dari Hakim bin Hizam dari Nabi shallallahu 'alaihi wasallam.</b>",
    "bookID": "44.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "154",
    "matchingArabicURN": "1146170",
    "last_updated": null
  }
]