[
  {
    "indonesianURN": "3253330",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2277",
    "babName": "BAB",
    "hadithNumber": "5333",
    "hadithText": "Telah mengabarkan kepada kami Abu 'Abdurrahman Ahmad bin Syu'aib ia berkata; telah memberitakan kepada kami 'Amru bin Ali ia berkata; telah menceritakan kepada kami Abu Ashim ia berkata; telah menceritakan kepada kami Ibnu Abu Dzi`b ia berkata; telah menceritakan kepadaku Asid bin Abu Asid dari Mu'adz bin Abdullah dari Ayahnya ia berkata, \"Hujan rintik-rintik dan malam yang gelap menggelayuti kami, maka kami pun menunggu-nunggu Rasulullah shallallahu 'alaihi wasallam untuk shalat bersama kami -Lalu ia menyebutkan perkataan yang semakna- Tidak lama kemudian Rasulullah shallallahu 'alaihi wasallam keluar untuk shalat bersama kami, beliau kemudian bersabda: \"Ucapkanlah!\" aku berkata; \"Apa yang harus aku ucapkan?\" beliau bersabda: \"QUL HUWAALLAHU AHAD (Katakanlah: \"Dia-lah Allah, Yang Maha Esa) dan Mu'awidzatain (surat Al falaq dan An Nas) saat sore dan pagi hari sebanyak tiga kali. Maka itu akan mencukupimu dari segala sesuatu.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "1154130",
    "last_updated": null
  },
  {
    "indonesianURN": "3253340",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2277",
    "babName": "BAB",
    "hadithNumber": "5334",
    "hadithText": "Telah mengabarkan kepada kami Yunus bin Abdul A'la ia berkata; telah menceritakan kepada kami Ibnu Wahb ia berkata; telah mengabarkan kepadaku Hafsh bin Maisarah dari Zaid bin Aslam dari Mu'adz bin Khubaib dari Ayahnya ia berkata; \"Aku bersama Rasulullah shallallahu 'alaihi wasallam berada di jalanan Makkah, hingga aku bisa berdua dan lebih dekat dengan Rasulullah shallallahu 'alaihi wasallam. Beliau lalu bersabda: \"Ucapkanlah!\" aku berkata; \"Apa yang harus aku ucapkan?\" beliau bersabda: \"Ucapkanlah!\" aku berkata; \"Apa yang harus aku ucapkan?\" beliau bersabda: 'QUL A'UUDZU BIRABBIL FALAQ (Katakanlah: \"Aku berlindung kepada Tuhan Yang Menguasai subuh) ' hingga beliau menyelesaikan bacaannya. Kemudian beliau bersabda lagi: 'QUL A'UUDZU BIRABBINNAAS (Katakanlah: \"Aku berlindung kepada Tuhan (yang memelihara dan menguasai) manusia) ' hingga beliau menyelesaikan bacaannya. Setelah itu beliau bersabda: \"Tidaklah manusia berlindung dengan sesuatu yang lebih utama dari keduanya.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "1154140",
    "last_updated": null
  },
  {
    "indonesianURN": "3253350",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2277",
    "babName": "BAB",
    "hadithNumber": "5335",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Ali ia berkata; telah menceritakan kepadaku Al Qa'nabi dari Abdul Aziz dari Abdullah bin Sulaiman dari Mu'adz bin Abdullah bin Khubaib dari Ayahnya dari 'Uqbah bin Amir Al Juhani ia berkata; \"Saat aku menuntun kendaraan Rasulullah shallallahu 'alaihi wasallam dalam suatu peperangan, beliau bersabda: \"Wahai 'Uqbah, ucapkanlah!\" aku lalu memasang pendengaranku. Kemudian beliau bersabda: \"Wahai 'Uqbah, ucapkanlah!\" aku lalu memasang pendengaranku. Beliau mengatakan hal itu hingga tiga kali. Maka aku bertanya; \"Apa yang harus aku katakan?\" beliau menjawab: 'QUL HUWAALLAHU AHAD (Katakanlah: \"Dia-lah Allah, Yang Maha Esa) ' beliau lantas membacanya hingga selesai. Kemudian beliau membaca 'QUL A'UUDZU BIRABBIL FALAQ (Katakanlah: \"Aku berlindung kepada Tuhan Yang Menguasai subuh) beliau lantas membacanya hingga selesai. Kemudian beliau membaca 'QUL A'UUDZU BIRABBINNAAS (Katakanlah: \"Aku berlindung kepada Tuhan (yang memelihara dan menguasai) manusia) ' maka aku pun membacanya bersama beliau hingga selesai. Setelah itu beliau bersabda: \"Seseorang tidak akan mendapat sesuatu perlindungan yang setara dengannya (surat-surat tersebut).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "1154150",
    "last_updated": null
  },
  {
    "indonesianURN": "3253360",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2277",
    "babName": "BAB",
    "hadithNumber": "5336",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Utsman bin Hakim ia berkata; telah menceritakan kepada kami Khalid bin Makhlad ia berkata; telah menceritakan kepadaku Abdullah bin Sulaiman Al Aslami dari Mu'adz bin Abdullah bin Khubaib dari Uqbah bin Amir Al Juhani ia berkata; \"Rasulullah shallallahu 'alaihi wasallam berkata kepadaku: \"Katakanlah!\" aku bertanya; \"Apa yang harus aku katakan?\" beliau menjawab: 'QUL HUWAALLAHU AHAD (Katakanlah: \"Dia-lah Allah, Yang Maha Esa), 'QUL A'UUDZU BIRABBIL FALAQ (Katakanlah: \"Aku berlindung kepada Tuhan Yang Menguasai subuh) ' dan 'QUL A'UUDZU BIRABBINNAAS (Katakanlah: \"Aku berlindung kepada Tuhan (yang memelihara dan menguasai) manusia) '.\" Rasulullah shallallahu 'alaihi wasallam kemudian membaca ayat-ayat tersebut, setelah itu beliau bersabda: \"Manusia tidak akan mendapatkan suatu perlindungan yang semisal dengan ayat-ayat tersebut.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "1154160",
    "last_updated": null
  },
  {
    "indonesianURN": "3253370",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2277",
    "babName": "BAB",
    "hadithNumber": "5337",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Khalid ia berkata; telah menceritakan kepada kami Al Walid ia berkata; telah menceritakan kepada kami Abu Amru dari Yahya dari Muhammad bin Ibrahim Ibnu Al Harits ia berkata; telah mengabarkan kepadaku Abu Abdullah bahwa Ibnu Abis Al Juhani mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Wahai Ibnu Abis, maukah aku tunjukkan kepadamu, atau beliau mengatakan: \"Maukah aku kabarkan suatu perlindungan yang lebih utama dari perlindungan yang biasa digunakan oleh mereka (orang-orang yang minta perlindungan)?\" ia menjawab, \"Tentu ya Rasulullah.\" Beliau bersabda: 'QUL A'UUDZU BIRABBIL FALAQ (Katakanlah: \"Aku berlindung kepada Tuhan Yang Menguasai subuh) ' dan QUL A'UUDZU BIRABBINNAAS (Katakanlah: \"Aku berlindung kepada Tuhan (yang memelihara dan menguasai) manusia) '. Dua surat inilah.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "1154170",
    "last_updated": null
  },
  {
    "indonesianURN": "3253380",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2277",
    "babName": "BAB",
    "hadithNumber": "5338",
    "hadithText": "Telah mengabarkan kepadaku Amru bin Utsman ia berkata; telah menceritakan kepada kami Baqiyyah ia berkata; telah menceritakan kepada kami Bahir bin Sa'd dari Khalid bin Ma'dan dari Jubair bin Nufair dari 'Uqbah bin Amir ia berkata, \"Nabi shallallahu 'alaihi wasallam diberi hadiah seekor keledai betina berwarna kelabu, beliau lalu menungganginya sementara 'Uqbah memegangi talinya. Rasulullah shallallahu 'alaihi wasallam kemudian bersabda kepada 'Uqbah: \"Bacalah!\" 'Uqbah bertanya; \"Apa yang harus aku baca ya Rasulullah?\" beliau bersabda: 'QUL A'UUDZU BIRABBIL FALAQ MIN SYARRI MAA KHALAQ (Katakanlah: \"Aku berlindung kepada Tuhan Yang Menguasai subuh dari kejahatan makhluk-Nya) '.\" Beliau terus saja mengulang-ulang untukku hingga aku ikut membacanya. Namun beliau mengetahui bahwa aku kurang begitu semangat, maka beliau bersabda: \"Mungkin karena engkau terlalu meremehkannya. Namun Aku tidak tertarik, yakni dengan surat-surat yang sepertinya.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "1154180",
    "last_updated": null
  },
  {
    "indonesianURN": "3253390",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2277",
    "babName": "BAB",
    "hadithNumber": "5339",
    "hadithText": "Telah mengabarkan kepada kami Musa bin Khizam At Turmudzi ia berkata; telah memberitakan kepada kami Abu Usamah dari Sufyan dari Mu'awiyah bin Shalih dari 'Abdurrahman bin Jubair bin Nufair dari Ayahnya dari 'Uqbah bin Amir bahwa ia pernah bertanya kepada Nabi shallallahu 'alaihi wasallam tentang Mu'awidzatain. 'Uqbah berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah mengimami kami dalam shalat subuh dengan membaca surat tersebut.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "1154190",
    "last_updated": null
  },
  {
    "indonesianURN": "3253400",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2277",
    "babName": "BAB",
    "hadithNumber": "5340",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basyar ia berkata; telah menceritakan kepada kami Abdurrahman ia berkata; telah menceritakan kepada kami Mu'awiyah dari Al 'Ala bin Al Harits dari Makhul dari 'Uqbah ia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah membaca keduanya dalam shalat subuh.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "1154200",
    "last_updated": null
  },
  {
    "indonesianURN": "3253410",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2277",
    "babName": "BAB",
    "hadithNumber": "5341",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin 'Amru ia berkata; telah memberitakan kepada kami Ibnu Wahb ia berkata; telah mengabarkan kepadaku Mu'awiyah bin Shalih dari Ibnul Harits -yaitu Al 'Ala`- dari Al Qasim mantan budak Mu'awiyah, dari 'Uqbah bin Amir ia berkata, \"Aku menuntun hewan tunggangan Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan, Rasulullah shallallahu 'alaihi wasallam lalu bersabda kepadaku: \"Wahai 'Uqbah, maukah jika aku ajarkan kepadamu dua surat pilihan untuk dibaca?\" beliau kemudian mengajariku; 'QUL A'UUDZU BIRABBIL FALAQ (Katakanlah: \"Aku berlindung kepada Tuhan Yang Menguasai subuh) ' dan QUL A'UUDZU BIRABBINNAAS (Katakanlah: \"Aku berlindung kepada Tuhan (yang memelihara dan menguasai) manusia) '. Namun, sepertinya beliau tidak melihat tanda kebahagiaan pada diriku dengan diajari dua surat tersebut. Ketika kami singgah untuk shalat subuh, beliau mengimami orang-orang shalat subuh dengan dua ayat tersebut. Seusai shalat, beliau menoleh ke arahku dan bertanya: \"Wahai 'Uqbah, bagaimana menurutmu?\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "1154210",
    "last_updated": null
  },
  {
    "indonesianURN": "3253420",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2277",
    "babName": "BAB",
    "hadithNumber": "5342",
    "hadithText": "Telah mengabarkan kepadaku Mahmud bin Khalid ia berkata; telah menceritakan kepada kami Al Walid ia berkata; telah menceritakan kepadaku Ibnu Jabir dari Al Qasim Abu 'Abdurrahman dari 'Uqbah bin Amir ia berkata, \"Ketika aku menuntun hewan tunggangan Rasulullah shallallahu 'alaihi wasallam dalam sebuah lembah, beliau bersabda: \"Tidak maukah jika engkau berkendaraan wahai 'Uqbah?\" Maka aku merasa kurang nyaman untuk berkendaraan di sisi Rasulullah shallallahu 'alaihi wasallam. Kemudian beliau bertanya lagi: \"Tidak maukah engkau berkendaraan wahai 'Uqbah?\" Aku lalu menjadi takut jika penolakanku itu dihitung sebagai perbuatan maksiat. Saat beliau turun aku kemudian naik sebentar dan turun lagi. Setelah itu Rasulullah shallallahu 'alaihi wasallam mengendarainya kembali, kemudian beliau bersabda: \"Tidak inginkah jika aku ajarkan kepadamu dua surat yang bagus untuk dibaca oleh manusia?\" beliau lalu membacakan untukku: 'QUL A'UUDZU BIRABBIL FALAQ (Katakanlah: \"Aku berlindung kepada Tuhan Yang Menguasai subuh) ' dan QUL A'UUDZU BIRABBINNAAS (Katakanlah: \"Aku berlindung kepada Tuhan (yang memelihara dan menguasai) manusia) '. Setelah itu iqamah dikumandangkan dan beliau maju ke depan membaca dua surat tersebut. Ketika lewat di depanku beliau bertanya: \"Wahai 'Uqbah bin Amir, bagaimana menurutmu? Bacalah dua surat tersebut saat engkau akan tidur dan akan bangun.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "1154220",
    "last_updated": null
  },
  {
    "indonesianURN": "3253430",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2277",
    "babName": "BAB",
    "hadithNumber": "5343",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah ia berkata; telah menceritakan kepada kami Al Laits dari Ibnu 'Ajlan dari Sa'id Al Maqburi dari 'Uqbah bin Amir ia berkata, \"Aku pernah berjalan bersama Rasulullah shallallahu 'alaihi wasallam, beliau lalu bersabda: \"Wahai 'Uqbah, ucapkanlah.\" Aku bertanya, \"Apa yang harus aku ucapkan ya Rasulullah?\" beliau diam. Kemudian beliau bersabda: \"Wahai 'Uqbah, ucapkanlah.\" Aku bertanya, \"Apa yang harus aku ucapkan ya Rasulullah?\" beliau diam. Lalu aku berkata, \"Ya Allah, gerakkan beliau hingga ia menjawabku.\" Beliau lalu bersabda: \"Wahai 'Uqbah, ucapkanlah.\" Aku bertanya, \"Apa yang harus aku ucapkan ya Rasulullah?\" beliau lalu bersabda: 'QUL A'UUDZU BIRABBIL FALAQ (Katakanlah: \"Aku berlindung kepada Tuhan Yang Menguasai subuh) ' maka aku pun membacanya hingga akhir ayat. Kemudian beliau bersabda lagi: \"Ucapkanlah.\" Aku bertanya, \"Apa yang harus aku ucapkan ya Rasulullah?\" Beliau bersabda: 'QUL A'UUDZU BIRABBINNAAS (Katakanlah: \"Aku berlindung kepada Tuhan (yang memelihara dan menguasai) manusia) ' maka aku pun membacanya hingga akhir surat. Setelah itu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada seorang peminta pun yang meminta setara dengan itu. Dan tidak perlindungan dari seorang peminta yang setara dengan itu.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "1154230",
    "last_updated": null
  },
  {
    "indonesianURN": "3253440",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2277",
    "babName": "BAB",
    "hadithNumber": "5344",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah ia berkata; telah menceritakan kepada kami Al Laits dari Yazid bin Abu Habib dari Abu Imran Aslam dari 'Uqbah bin Amir ia berkata, \"Aku mendatangi Rasulullah shallallahu 'alaihi wasallam saat beliau naik kendaraan. Aku letakkan tanganku pada telapak kakinya seraya berkata, \"Bacakanlah untukku surat Hud dan surat Yusuf.\" Beliau lalu bersabda: \"Engkau tidak akan membaca suatu surat yang lebih baik di sisi Allah Azza Wa Jalla selain: 'QUL A'UUDZU BIRABBIL FALAQ (Katakanlah: \"Aku berlindung kepada Tuhan Yang Menguasai subuh) '.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "1154240",
    "last_updated": null
  },
  {
    "indonesianURN": "3253450",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2277",
    "babName": "BAB",
    "hadithNumber": "5345",
    "hadithText": "Telah mengabarkan kepada kami Muhammad Ibnul Mutsanna ia berkata; telah menceritakan kepada kami Yahya ia berkata; telah menceritakan kepada kami Isma'il ia berkata; telah menceritakan kepada kami Qais dari 'Uqbah bin Amir dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Telah diturunkan kepadaku beberapa ayat yang tidak akan ditemukan bandingannya; 'QUL A'UUDZU BIRABBIL FALAQ (Katakanlah: \"Aku berlindung kepada Tuhan Yang Menguasai subuh) ' hingga akhir surat dan QUL A'UUDZU BIRABBINNAAS (Katakanlah: \"Aku berlindung kepada Tuhan (yang memelihara dan menguasai) manusia) ' hingga akhir surat.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "1154250",
    "last_updated": null
  },
  {
    "indonesianURN": "3253460",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2277",
    "babName": "BAB",
    "hadithNumber": "5346",
    "hadithText": "Telah mengabarkan kepada kami Amru bin Ali ia berkata; telah menceritakan kepada kami Badal ia berkata; telah menceritakan kepada kami Syaddad bin Sa'id Abu Thalhah ia berkata; telah menceritakan kepada kami Sa'id Al Jurairi ia berkata; telah menceritakan kepada kami Abu Nadlrah dari Jabir bin Abdullah ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Wahai Jabir, bacalah.\" Aku menjawab, \"Wahai Rasulullah, demi bapak dan ibuku sebagai tebusanmu, apa yang harus aku baca?\" beliau menjawab: \"Bacalah: 'QUL A'UUDZU BIRABBIL FALAQ (Katakanlah: \"Aku berlindung kepada Tuhan Yang Menguasai subuh) ' dan QUL A'UUDZU BIRABBINNAAS (Katakanlah: \"Aku berlindung kepada Tuhan (yang memelihara dan menguasai) manusia) '.\" Maka aku pun membaca kedua surat tersebut. Setelah itu beliau bersabda: \"Bacalah keduanya, sekali-kali engkau tidak akan dapat membaca yang lebih baik dari keduanya.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "1154260",
    "last_updated": null
  },
  {
    "indonesianURN": "3253470",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2278",
    "babName": "Meminta perlindungan dari hati yang tiudak khusyu'",
    "hadithNumber": "5347",
    "hadithText": "Telah mengabarkan kepada kami Yazid bin Sinan ia berkata; telah menceritakan kepada kami 'Abdurrahman ia berkata; telah memberitakan kepada kami Sufyan dari Abu Sinan dari Abdullah bin Abu Al Hudzail dari Abdullah bin Amru berkata; \"Nabi shallallahu 'alaihi wasallam selalu berlindung dari empat perkara, yaitu; ilmu yang tidak bermanfaat, hati yang tidak khusyu', doa yang tidak didengar dan jiwa yang tidak pernah merasa puas.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "1154270",
    "last_updated": null
  },
  {
    "indonesianURN": "3253480",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2279",
    "babName": "Meminta perlindungan dari fitnah dada",
    "hadithNumber": "5348",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim ia berkata; telah memberitakan kepada kami Ubaidullah ia berkata; telah menceritakan kepada kami Isra'il dari Abu Ishaq dari 'Amru bin Maimun dari Umar ia berkata; \"Nabi shallallahu 'alaihi wasallam berlindung dari sifat pengecut, kikir, mati sebelum taubat dan siksa kubur.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "1154280",
    "last_updated": null
  },
  {
    "indonesianURN": "3253490",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2280",
    "babName": "Meminta perlindungan dari keburukan pendengaran dan penglihatan",
    "hadithNumber": "5349",
    "hadithText": "Telah mengabarkan kepada kami Al Hasan bin Ishaq ia berkata; telah menceritakan kepada kami Abu Nu'aim ia berkata; telah menceritakan kepada kami Sa'd bin Aus ia berkata; telah menceritakan kepadaku Bilal bin Yahya bahwa Syutair bin Syakal mengabarkan kepadanya dari bapaknya Syakal bin Humaid ia berkata, \"Aku datang menemui Nabi shallallahu 'alaihi wasallam, lalu aku berkata; \"Wahai Nabi Allah, ajarkanlah aku suatu perlindungan yang bisa aku gunakan untuk berlindung.\" Beliau lalu meraih tanganku dan bersabda: \"Ucapkanlah: A'UUDZU BIKA MIN SYARRI SAM'I WA SYARRI BASHARI, WA SYARRI LISANI, WA SYARRI QALBI, WA SYARRI MANIYYI (Aku berlindung kepada-Mu dari kejelekkan pendengaranku, dari kejelekkan penglihatanku, dari kejelekkan lisanku, dari kejelekkan hatiku dan dari kejelekkan maniku) ' beliau selalu mengucapkannya hingga aku hafal.\" Sa'd berkata; \"Yang dimaksud mani adalah airnya.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "17",
    "matchingArabicURN": "1154290",
    "last_updated": null
  },
  {
    "indonesianURN": "3253500",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2281",
    "babName": "Meminta perlindungan dari sifat pengecut",
    "hadithNumber": "5350",
    "hadithText": "Telah mengabarkan kepada kami Isma'il bin Mas'ud ia berkata; telah menceritakan kepada kami Khalid ia berkata; telah menceritakan kepada kami Syu'bah dari Abdul Malik bin Umair ia berkata; aku mendengar Mush'ab bin Sa'd dari Ayahnya ia berkata, \"Dia mengajarkan kepada kami lima perkara, katanya; \"Rasulullah shallallahu 'alaihi wasallam biasa mengucapkan dan berdoa dengannya, yaitu; \"ALLAHUMMA INNI A'UUDZU BIKA MINAL BUKHLI, WA A'UUDZU BIKA MINAL JUBNI, WA A'UUDZU BIKA AN URADDA ILAA ARDZALIL 'UMUR WA A'UUDZU BIKA MIN FITNATID DUNYA WA A'UUDZU BIKA MIN ADZAABIL QABRI (Ya Allah, aku berlindung kepada-Mu dari sifat kikir, aku berlindung kepada-Mu dari sifat pengecut, aku berlindung kepada-Mu kepikunan, aku berlindung dari fitnah dunia dan aku berlindung kepada-Mu dari siksa kubur).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "18",
    "matchingArabicURN": "1154300",
    "last_updated": null
  },
  {
    "indonesianURN": "3253510",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2281",
    "babName": "Meminta perlindungan dari sifat pengecut",
    "hadithNumber": "5351",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul Aziz ia berkata; telah menceritakan kepada kami Al Fadll bin Musa dari Zakariya dari Abu Ishaq dari Amru bin Maimun dari Ibnu Mas'ud ia berkata; \"Nabi shallallahu 'alaihi wasallam biasa berlindung dari lima hal; yaitu; dari sifat kikir, pengecut, pikun, mati sebelum bertaubat dan dari siksa kubur.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "19",
    "matchingArabicURN": "1154310",
    "last_updated": null
  },
  {
    "indonesianURN": "3253520",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2281",
    "babName": "Meminta perlindungan dari sifat pengecut",
    "hadithNumber": "5352",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Muhammad ia berkata; telah menceritakan kepada kami Habban bin Hilal ia berkata; telah menceritakan kepada kami Abu 'Awanah dari Abdul Malik bin 'Umair dari 'Amru bin Maimun Al Audi ia berkata; Sa'd biasa mengajarkan kepada anak-anaknya lima perkara tersebut sebagaimana seorang guru mengajarkan kepada anak didiknya. Dia berkata; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam biasa berlindung dengannya setiap selesai shalat; \"ALLAHUMMA INNI A'UUDZU BIKA MINAL BUKHLI, WA A'UUDZU BIKA MINAL JUBNI, WA A'UUDZU BIKA AN URADDA ILAA ARDZALIL 'UMUR WA A'UUDZU BIKA MIN FITNATID DUNYA WA A'UUDZU BIKA MIN ADZAABIL QABRI (Ya Allah, aku berlindung kepada-Mu dari sifat kikir, aku berlindung kepada-Mu dari sifat pengecut, aku berlindung kepada-Mu kepikunan, aku berlindung dari fitnah dunia dan aku berlindung kepada-Mu dari siksa kubur).\" Hal itu aku ceritakan kepada Mush'ab dan ia pun membenarkannya.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "20",
    "matchingArabicURN": "1154320",
    "last_updated": null
  },
  {
    "indonesianURN": "3253530",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2281",
    "babName": "Meminta perlindungan dari sifat pengecut",
    "hadithNumber": "5353",
    "hadithText": "Telah mengabarkan kepada kami Muhammad Ibnu Al Mutsanna dari Mu'adz bin Hisyam ia berkata; telah menceritakan kepada kami Ayahku dari Qatadah dari Anas bahwa Nabi Allah shallallahu 'alaihi wasallam mengucapkan: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL 'AJZI WAL KASALI WAL BUKHLI WAL HARAMI WA 'ADZAABIL QABRI WA FITNATIL MAHYAA WAL MAMAATI (Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kelemahan, kemalasan, kikir, pikun, siksa kubur dan fitnah dunia dan setelah mati).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "21",
    "matchingArabicURN": "1154330",
    "last_updated": null
  },
  {
    "indonesianURN": "3253540",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2282",
    "babName": "Meminta perlindungan dari kesedihan",
    "hadithNumber": "5354",
    "hadithText": "Telah mengabarkan kepada kami Ali Ibnul Mundzir dari Ibnu Fudlail ia berkata; telah menceritakan kepada kami Muhammad bin Ishaq dari Al Minhal bin 'Amru dari Anas bin Malik ia berkata; \"Rasulullah shallallahu 'alaihi wasallam mempunyai doa-doa yang tidak pernah lupa untuk membacanya, beliau selalu membaca: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL HAMMI WAL HAZNI WAL 'AJZI WAL KASALI WA BUKHLI, WAL JUBNI WA GHALABATIR RIJAL (Ya Allah, aku berlindung kepada-Mu dari kegelisahan, kesedihan, kelemahan, kemalasan, kebakhilan, sifat pengecut dan penindasan para penguasa).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "22",
    "matchingArabicURN": "1154340",
    "last_updated": null
  },
  {
    "indonesianURN": "3253550",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2282",
    "babName": "Meminta perlindungan dari kesedihan",
    "hadithNumber": "5355",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim ia berkata; telah memberitakan kepada kami Jarir dari Muhammad bin Ishaq dari Amru bin Abu Amru dari Anas bin Malik ia berkata; \"Rasulullah shallallahu 'alaihi wasallam mempunyai doa-doa yang tidak pernah ditinggalkan untuk membacanya; \"ALLAHUMMA INNI A'UUDZU BIKA MINAL HAMMI WAL HAZNI WAL 'AJZI WAl KASALI WA BUKHLI, WAL JUBNI WAD DAINI WA GHALABATIR RIJAL (Ya Allah, aku berlindung kepada-Mu dari kegelisahan, kesedihan, kelemahan, kemalasan, kebakhilan, sifat pengecut, hutang dan penindasan para penguasa).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "23",
    "matchingArabicURN": "1154350",
    "last_updated": null
  },
  {
    "indonesianURN": "3253560",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2282",
    "babName": "Meminta perlindungan dari kesedihan",
    "hadithNumber": "5356",
    "hadithText": "Telah mengabarkan kepada kami Humaid bin Mas'adah ia berkata; telah menceritakan kepada kami Bisyr dari Humaid ia berkata; Anas berkata, \"Nabi shallallahu 'alaihi wasallam biasa berdoa dengan do'a: \"ALLAHUMMA INNI A'UUDU BIKA MINAL KASALI WAL HARAMI WAL BUKHLI WA FITNATID DAJALI WA 'ADZAABIL QABRI (Ya Allah, aku berlindung kepadak-Mu dari kemalasan, dari kepikunan, sifat pengecut, kebakhilan, fitnah dajjal dan siksa kubur).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "24",
    "matchingArabicURN": "1154360",
    "last_updated": null
  },
  {
    "indonesianURN": "3253570",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2282",
    "babName": "Meminta perlindungan dari kesedihan",
    "hadithNumber": "5357",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la Ash Shan'ani ia berkata; telah menceritakan kepada kami Al Mu'tamir dari Ayahnya dari Anas berkata, \"Nabi shallallahu 'alaihi wasallam biasa berdoa: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL 'AJZI WAL KASALI WAL HARAMI WAL BUKHLI WAL JUBNI WA A'UUDZU BIKA MIN 'ADZAABIL QABRI WA MIN FITNAIL MAHYA WAL MAMAATI (Ya Allah, aku berlindung kepada-Mu dari kelemahan, dari kemalasan, dari kepikunan, dari kebakhilan. Dan aku berlindung dari siksa kubur dan fitnah kehidupan dan fitnah setelah mati).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "25",
    "matchingArabicURN": "1154370",
    "last_updated": null
  },
  {
    "indonesianURN": "3253580",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2282",
    "babName": "Meminta perlindungan dari kesedihan",
    "hadithNumber": "5358",
    "hadithText": "Telah mengabarkan kepada kami Abu Hatim As Sijistani ia berkata; telah menceritakan kepada kami Abdullah bin Raja ia berkata; telah menceritakan kepadaku Sa'id bin Salamah ia berkata; telah menceritakan kepadaku 'Amru bin Abu 'Amru -mantan budak Al Muthallib- dari Abdullah Al Muthallib dari Anas bin Malik dia berkata; \"Jika Rasulullah shallallahu 'alaihi wasallam berdo'a, beliau mengucapkan: \"ALLAHUMMA INNI A'UUDZU MINAL HAMMI WAL HAZANI WAL KASALI WAL BUKHLI WAL JUBNI WA DLALA'ID DAINI WA GHALABATIR RIJALI (Ya Allah, aku berlindung kepada-Mu dari kegelisahan dan kesedihan, kelemahan dan kemalasan, kebakhilan dan sifat pengecut, serta dari himpitan hutang dan penindasan para penguasa) '.\" Abu Abdurrahman berkata; \"Sa'di bin Salamah adalah seorang yang lemah, kami menampilkannya hanya untuk memperlengkap hadits semata.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "26",
    "matchingArabicURN": "1154380",
    "last_updated": null
  },
  {
    "indonesianURN": "3253590",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2283",
    "babName": "Meminta perlindungan dari terlilit hutang dan dosa",
    "hadithNumber": "5359",
    "hadithText": "Telah mengabarkan kepadaku Muhammad bin Utsman bin Abu Shafwan ia berkata; telah menceritakan kepadaku Salamah bin Sa'id bin 'Athiah -ia adalah orang yang paling baik di masanya- ia berkata; telah menceritakan kepada kami Ma'mar dari Az Zuhri dari 'Urwah dari 'Aisyah ia berkata; \"Rasulullah shallallahu 'alaihi wasallam paling sering berlindung dari hutang yang tak terbayar dan sesuatu yang menyebabkan dosa. Aku pernah bertanya; \"Wahai Rasulullah, kenapa engkau sering berlindung dari hutang yang tak terbayar?\" beliau menjawab: \"Sebab orang yang berhutang, ia akan banyak berbicara lalu berdusta, berjanji lalu mengingkari.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "27",
    "matchingArabicURN": "1154390",
    "last_updated": null
  },
  {
    "indonesianURN": "3253600",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2284",
    "babName": "Meminta perlindungan dari keburukan pendengaran dan penglihatan",
    "hadithNumber": "5360",
    "hadithText": "Telah mengabarkan kepada kami Al Hasan bin Ishaq ia berkata; telah memberitakan kepada kami Abu Nu'aim ia berkata; telah menceritakan kepada kami Sa'd bin Aus ia berkata; telah menceritakan kepadaku Bilal bin Yahya bahwa Syutair bin Syakal mengabarkan kepadanya dari bapaknya Syakal bin Humaid ia berkata; \"Aku datang menemui Nabi shallallahu 'alaihi wasallam, lalu aku berkata; \"Wahai Nabiyullah, ajarkanlah aku suatu perlindungan yang bisa aku gunakan untuk berlindung.\" Beliau lalu meraih tanganku dan bersabda: \"Ucapkanlah: A'UUDZU BIKA MIN SYARRI SAM'I WA SYARRI BASHARI, WA SYARRI LISANI, WA SYARRI QALBI, WA SYARRI MANIYYI (Aku berlindung kepada-Mu dari kejelekkan pendengaranku, dari kejelekkan penglihatanku, dari kejelekkan lisanku, dari kejelekkan hatiku dan dari kejelekkan maniku) ' beliau ucapkan hingga aku menghafalnya.\" Sa'd berkata; 'Yang dimaksud mani adalah airnya.' Namun Waki' menyelisihi dalam lafadznya.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "28",
    "matchingArabicURN": "1154400",
    "last_updated": null
  },
  {
    "indonesianURN": "3253610",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2285",
    "babName": "Meminta perlindungan dari keburukan penglihatan",
    "hadithNumber": "5361",
    "hadithText": "Telah mengabarkan kepada kami 'Ubaid bin Waki' bin Al Jarrah ia berkata; telah menceritakan kepada kami Ayahku dari Sa'd bin Aus dari Bilal bin Yahya dari Syutair bin Syakal bin Humaid dari Ayahnya ia berkata; \"Aku berkata; \"Wahai Rasulullah, ajarkanlah aku sebuah doa yang aku bisa ambil manfaatnya.\" Beliau bersabda: 'ALLAHUMMA 'AAFINII MIN SYARRI SAM'I WA BASHARI, WA LISAANI, WA QALBI, WA MIN SYARRI MANIYYI (Ya Allah, selamatkanlah aku dari keburukkan pendengaranku, penglihatan, lisan, hati dan maniku) '. Yakni kemaluannya.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "29",
    "matchingArabicURN": "1154410",
    "last_updated": null
  },
  {
    "indonesianURN": "3253620",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2286",
    "babName": "Meminta perlindungan dari kemalasan",
    "hadithNumber": "5362",
    "hadithText": "Telah mengabarkan kepada kami Muhammad Ibnul Mutsanna dari Khalid ia berkata; telah menceritakan kepada kami Humaid ia berkata; Anas -yakni Ibnu Malik- pernah ditanya tentang siksa kubur dan fitnah Dajjal, ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL KASALI WAL HARAMI WAL BUKHLI WA JUBNI WA FITNAID DAJJALI WA 'ADZAABIL QABRI (Ya Allah, aku berlindung kepada-Mu dari kemalasan, kepikunan, sifat pengecut, kikir, fitnah dajjal dan siksa kubur).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "30",
    "matchingArabicURN": "1154420",
    "last_updated": null
  },
  {
    "indonesianURN": "3253630",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2287",
    "babName": "Meminta perlindungan dari kelemahan",
    "hadithNumber": "5363",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman ia berkata; telah menceritakan kepada kami Muhadlir ia berkata; telah menceritakan kepada kami 'Ashim Al Ahwal dari Abdullah bin Al Harits dari Zaid bin Arqam ia berkata; \"Aku tidak akan mengajarkan kepada kalian kecuali sesuatu yang Rasulullah shallallahu 'alaihi wasallam ajarkan kepada kami. Beliau mengucapkan: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL 'AJZI WAL KASALI WAL BUKHLI WAL JUBNI WAL HARAMI WA 'ADZAABIL QABRI. ALLAHUMMA AATI NAFSII TAQWAAHAA WA ZAKKIHAA ANTA KHAIRU MAN ZAKKAHAA ANTA WALIYYUHAA WA MAULAAHAA. ALLAHUMMA INNI A'UUDZU BIKA MIN QALBIN LAA YAKHSYA' WA MIN NAFSINN LAA TASYBA' WA 'ILMIN LAA YANFA' WA DA'WATINN LAA YUSTAJAABU LAHAA (Ya Allah, aku berlindung kepada-Mu dari kelemahan, kemalasan, kikir, sifat pengecut, pikun dan siksa kubur. Ya Allah, berikanlah ketakwaan jiwaku, sucikanlah ia karena Engkau adalah sebaik-baik Dzat yang mensucikannya. Engkau adalah Pengatur dan Pemiliknya. Ya Allah, aku berlindung kepada-Mu dari hati yang tidak khusyu', jiwa yang tidak merasa puas, ilmu yang tidak bermanfaat, dan doa yang tidak diijabahi).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "31",
    "matchingArabicURN": "1154430",
    "last_updated": null
  },
  {
    "indonesianURN": "3253640",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2287",
    "babName": "Meminta perlindungan dari kelemahan",
    "hadithNumber": "5364",
    "hadithText": "Telah mengabarkan kepada kami Amru bin Ali ia berkata; telah menceritakan kepada kami Mu'adz bin Hisyam ia berkata; telah menceritakan kepadaku Ayahku dari Qatadah dari Anas bahwa Nabi Allah shallallahu 'alaihi wasallam bersabda: 'ALLAHUMMA INNI A'UUDZU BIKA MINAL 'AJZI WAL KASALI WAL BUKHLI WAL JUBNI WAL HARAMI WA 'ADZAABIL QABRI WA FITNATIL MAHYAA WAL MAMAATI (Ya Allah, aku berlindung kepada-Mu dari kelemahan, kemalasan, kikir, sifat pengecut, pikun, siksa kubur, fitnah kehidupan dan fitnah setelah mati) '.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "32",
    "matchingArabicURN": "1154440",
    "last_updated": null
  },
  {
    "indonesianURN": "3253650",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2288",
    "babName": "Meminta perlindungan dari kehinadinaan",
    "hadithNumber": "5365",
    "hadithText": "Telah mengabarkan kepada kami Abu Ashim Khusyaisy bin Ashram ia berkata; telah menceritakan kepada kami Habban ia berkata; telah menceritakan kepada kami Hammad bin Salamah dari Ishaq bin Abdullah bin Abu Thalhah dari Sa'id bin Yasar dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam mengucapkan: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL FAQRI WA A'UUDZU BIKA MINAL QILLATI WADZ DZILLATI WA A'UUDZU BIKA AN AZHLAMA AU UZHLAMA (Ya Allah, aku berlindung kepada-Mu dari kefakiran. Aku berlindung kepada-Mu dari kekurangan dan kehinaan. Dan aku berlindung dari melakukan kezhaliman atau dizhalimi).\" Namun Al Auza'i menyelisihinya.</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "33",
    "matchingArabicURN": "1154450",
    "last_updated": null
  },
  {
    "indonesianURN": "3253660",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2288",
    "babName": "Meminta perlindungan dari kehinadinaan",
    "hadithNumber": "5366",
    "hadithText": "Perawi berkata; telah mengabarkan kepadaku Mahmud bin Khalid ia berkata; telah menceritakan kepada kami Al Walid dari Abu Amru -yaitu Al Auza'i- ia berkata; telah menceritakan kepadaku Ishaq bin Abdullah bin Abu Thalhah ia berkata; telah menceritakan kepadaku Ja'far bin Iyadl ia berkata; telah menceritakan kepadaku Abu Hurairah ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaklah kalian berlindung kepada Allah dari kefakiran, merasa kurang dan kehinaan, berbuat zhalim atau dizhalimi.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "34",
    "matchingArabicURN": "1154460",
    "last_updated": null
  },
  {
    "indonesianURN": "3253670",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2288",
    "babName": "Meminta perlindungan dari kehinadinaan",
    "hadithNumber": "5367",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Nashr ia berkata; telah menceritakan kepada kami Abdu Ash Shamad bin Abdul Warits ia berkata; telah menceritakan kepada kami Hammad bin Salamah dari Ishaq dari Sa'id bin Yasar dari Abu Hurairah ia berkata; \"Nabi shallallahu 'alaihi wasallam mengucapkan: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL FAQRI WADZ DZILLATI WA A'UUDZU BIKA AN AZHLAMA AU UZHLAMA (Ya Allah, aku berlindung kepada-Mu dari kefakiran, kekurangan dan kehinaan. Dan aku berlindung kepada-Mu dari melakukan kezhaliman atau dizhalimi).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "35",
    "matchingArabicURN": "1154470",
    "last_updated": null
  },
  {
    "indonesianURN": "3253680",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2289",
    "babName": "Meminta perlindungan dari keterbatasan",
    "hadithNumber": "5368",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Khalid ia berkata; telah menceritakan kepada kami Umar yakni Ibnu Abdul Wahid dari Al Auza'i ia berkata; telah menceritakan kepadaku Ishaq bin Abdullah ia berkata; telah menceritakan kepadaku Ja'far bin Iyadl ia berkata; telah menceritakan kepadaku Abu Hurairah ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berlindunglah kepada Allah dari kefakiran, merasa kurang, kehinaan, berbuat zhalim atau dizhalimi.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "36",
    "matchingArabicURN": "1154480",
    "last_updated": null
  },
  {
    "indonesianURN": "3253690",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2290",
    "babName": "Meminta perlindungan dari kefakiran",
    "hadithNumber": "5369",
    "hadithText": "Telah mengabarkan kepada kami Yunus bin Abdul A'la ia berkata; telah menceritakan kepada kami Ibnu Wahb ia berkata; telah menceritakan kepadaku Musa bin Syaibah dari Al Auza'i dari Ishaq bin Abdullah bin Abu Thalhah ia berkata; telah menceritakan kepadaku Ja'far bin Iyadl bahwa Abu Hurairah menceritakan kepadanya dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Berlindunglah kepada Allah dari kefakiran, kekurangan dan kehinaan, berbuat zhalim atau dizhalimi.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "37",
    "matchingArabicURN": "1154490",
    "last_updated": null
  },
  {
    "indonesianURN": "3253700",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2290",
    "babName": "Meminta perlindungan dari kefakiran",
    "hadithNumber": "5370",
    "hadithText": "Telah mengabarkan kepada kami Muhammad Ibnul Mutsanna ia berkata; telah menceritakan kepada kami Ibnu Abu Adi ia berkata; telah menceritakan kepada kami Utsman yaitu Asy Syahham ia berkata; telah menceritakan kepada kami Muslim yaitu Ibnu Abu Bakrah bahwa ia pernah mendengar Ayahnya mengucapkan setelah selesai shalat; \"ALLAHUMMA INNI A'UUDZU BIKA MINAL KUFRI WAL FAQRI WA 'ADZAABIL QABRI (Ya Allah, aku berlindung kepada-Mu dari kekafiran, kefakiran dan siksa kubur) '. Lalu aku berdoa dengan doa tersebut. Ayahku lalu bertanya; \"Wahai anakku, dari mana engkau belajar ucapan-ucapan itu?\" Aku menjawab; \"Wahai ayahku, setiap selesai shalat aku mendengarmu membaca itu, maka aku mengamalkan itu darimu!\" Ayahku lalu berkata; \"Wahai anakku, amalkanlah selalu, sebab Nabi shallallahu 'alaihi wasallam selalu membaca doa itu setiap selesai shalat.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "38",
    "matchingArabicURN": "1154500",
    "last_updated": null
  },
  {
    "indonesianURN": "3253710",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2291",
    "babName": "Meminta perlindungan dari keburukan fitnah kubur",
    "hadithNumber": "5371",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdullah ia berkata; telah menceritakan kepada kami Abu Usamah ia berkata; telah menceritakan kepada kami Hisyam bin Urwah dari Ayahnya dari 'Aisyah ia berkata, \"Doa yang sering dibaca oleh Rasulullah shallallahu 'alaihi wasallam adalah: \"ALLAHUMMA INNI A'UUDZU BIKA MIN FITNATINNARI WA FITNATIL QABRI WA SYARRI FITNATIL MASIIHID DAJJAL WA SYARRI FITNATIL FAQRI WA SYARRI FITNATIL GHINA ALLAHUMMA IGHSIL KHATHAAYAAYA BIMA`ITS TSALJI WA BARADI WA ANTIQI QALBI MINAL KHATHAAYAAYA KAMAA ANQAITA ATS TSAUBAL ABYADLA MINAD DANAS WA BAA'ID BAINII WA BAINA KHATHAAYAAYA KAMAA BAA'ATTA BAINAL MASYRIQI WAL MAGHRIBI ALLAHUMMA INNI A'UUDZU BIKA MINAL KASALI WAL HARAMI WAL MA`TSAMI WAL MAGHRAMI (Ya Allah, aku berlindung kepada-Mu dari fitnah neraka dan siksa neraka, fitnah kubur dan siksa kubur, kejelekkan fitnah Al Masih dajjal, kejelekkan fitnah kafakiran dan kejelekkan fitnah kekayaan. Ya Allah, basuhlah kesalahanku dengan air es dan embun, bersihkan hatiku dari kesalahan sebagaimana Engkau bersihkan kain putih dari kotoran. Jauhkanlah antara aku dan kesalahanku sebagaimana Engkau jauhkan antara timur dan barat. Ya Allah, aku berlindung kepada-Mu dari kemalasan, kepikunan, sebab yang mendatangkan dosa dan hutang yang tidak terbayar).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "39",
    "matchingArabicURN": "1154510",
    "last_updated": null
  },
  {
    "indonesianURN": "3253720",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2292",
    "babName": "Meminta perlindungan dari jiwa yang tak pernah puas",
    "hadithNumber": "5372",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah ia berkata; telah menceritakan kepada kami Al Laits dari Sa'id bin Abu Sa'id dari saudaranya Abbad bin Abu Sa'id Bahwasanya ia mendengar Abu Hurairah berkata; \"Rasulullah shallallahu 'alaihi wasallam selalu mengucapkan: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL ARBA'; MIN 'ILMIN LAA YANFA' WA MIN QALBIN LAA YAKHSYA' WA MIN NAFSIN LAA TASYBA' WA MIN DU'AA`IN LAA YUSMA' (Ya Allah, aku berlindung kepada-Mu dari empat hal; ilmu yang tidak bermanfaat, hati yang tidak khusyu', jiwa yang tidak merasa puas dan dari doa yang tidak didengar).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "40",
    "matchingArabicURN": "1154520",
    "last_updated": null
  },
  {
    "indonesianURN": "3253730",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2293",
    "babName": "Meminta perlindungan dari kelaparan",
    "hadithNumber": "5373",
    "hadithText": "Telah mengabarkan kepada kami Muhammad Ibnul 'Ala ia berkata; telah memberitakan kepada kami Ibnu Idris dari Ibnu 'Ajlan dari Al Maqburi dari Abu Hurairah ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya Allah, aku berlindung kepada-Mu dari kelaparan, sebab ia adalah seburuk-buruk teman tidur. Dan aku berlindung kepada-Mu dari berkhianat, sebab itu adalah seburuk-buruk perkara dalam hati.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "41",
    "matchingArabicURN": "1154530",
    "last_updated": null
  },
  {
    "indonesianURN": "3253740",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2294",
    "babName": "Meminta perlindungan dari khianat",
    "hadithNumber": "5374",
    "hadithText": "Telah mengabarkan kepada kami Muhammad Ibnu Al Mutsanna ia berkata; telah menceritakan kepada kami Abdullah bin Idris ia berkata; telah menceritakan kepada kami Ibnu 'Ajlan dan ia menyebutkan orang lain dari Sa'id bin Abu Sa'id dari Abu Hurairah ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya Allah, aku berlindung kepada-Mu dari kelaparan, sebab ia adalah seburuk-buruk teman tidur. Dan aku berlindung kepada-Mu dari sifat khianat, sebab itu adalah seburuk-buruk perkara dalam hati.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "42",
    "matchingArabicURN": "1154540",
    "last_updated": null
  },
  {
    "indonesianURN": "3253750",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2295",
    "babName": "Meminta perlindungan dari perselisihan, kenifakan dan akhlak yang buruk",
    "hadithNumber": "5375",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah ia berkata; telah menceritakan kepada kami Khalaf dari Hafsh dari Anas ia berkata; \"Nabi shallallahu 'alaihi wasallam biasa berdoa dengan doa-doa berikut: \"ALLAHUMMA INNI A'UUDZU BIKA MIN 'ILMIN LAA YANFA' WA QALBIN LAA YAKHSYA' WA DU'A`IN LAA YUSMA' WA NAFSIN LAA TASYBA' (Ya Allah, aku berlindung kepada-Mu dari ilmu yang tidak bermanfaat, hati yang tidak khusyu', doa yang tidak didengar dan jiwa yang tidak merasa puas) '. Kemudian beliau mengucapkan: \"ALLAHUMMA INNI A'UUDZU BIKA MIN HAULAA`IL ARBA' (Ya Allah, aku berlindung kepada-Mu dari empat perkara tersebut).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "43",
    "matchingArabicURN": "1154550",
    "last_updated": null
  },
  {
    "indonesianURN": "3253760",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2295",
    "babName": "Meminta perlindungan dari perselisihan, kenifakan dan akhlak yang buruk",
    "hadithNumber": "5376",
    "hadithText": "Telah mengabarkan kepada kami Amru bin Utsman ia berkata; telah menceritakan kepada kami Baqiyyah ia berkata; telah menceritakan kepada kami Dlubarah dari Duwaid bin Nafi' ia berkata; Abu Shalih berkata; Abu Hurairah berkata; \"Rasulullah shallallahu 'alaihi wasallam mengucapkan doa: \"ALLAHUMMA INNI A'UUDZU BIKA MINSY SYIQAAQI WAN NIFAAQI WA SUU`IL AKHLAAQI (Ya Allah, aku berlindung kepada-Mu dari perpecahan, kenifakan dan akhlak yang buruk).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "44",
    "matchingArabicURN": "1154560",
    "last_updated": null
  },
  {
    "indonesianURN": "3253770",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2296",
    "babName": "Meminta perlindungan dari pengaruh berhutang",
    "hadithNumber": "5377",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim ia berkata; telah memberitakan kepada kami Baqiyyah ia berkata; telah menceritakan kepadaku Abu Salamah Sulaiman bin Abu Sulaim Al 'Himshi ia berkata; telah menceritakan kepadaku Az Zuhri dari 'Urwah yakni Ibnu Az Zubair dari 'Aisyah ia berkata; \"Rasulullah shallallahu 'alaihi wasallam memperbanyak minta perlindungan dari hutang yang tidak terbayar dan sebab yang menimbulkan dosa.\" Lalu dikatakan kepada beliau; \"Wahai Rasulullah, kenapa engkau memperbanyak minta perlindungan dari hutang yang tidak terbayar dan sebab yang menimbulkan dosa?\" beliau menjawab: \"Sebab jika seseorang berhutang, ia akan banyak berbicara lalu dusta, dan berjanji lalu mengingkari.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "45",
    "matchingArabicURN": "1154570",
    "last_updated": null
  },
  {
    "indonesianURN": "3253780",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2297",
    "babName": "Meminta perlindungan dari pengaruh hutang",
    "hadithNumber": "5378",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Abdullah bin Yazid ia berkata; telah menceritakan kepada kami Ayahku ia berkata; telah menceritakan kepada kami Haiwah. Dan ia menyebutkan orang lain; ia berkata; telah menceritakan kepada kami Salim bin Ghailan At Tujibi bahwa ia mendengar Darraj Abu As Samh bahwa ia mendengar Abu Al Haitsam bahwa ia mendengar Abu Sa'id berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam mengucapkan: \"A'UUDZU BILLAHI MINAL KUFRI WAD DAINI (Aku berlindung kepada Allah dari kekufuran dan hutang).\" Seorang laki-laki lalu bertanya; \"Wahai Rasulullah, apakah ada hubungannya antara hutang dengan kekufuran?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Ya.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "46",
    "matchingArabicURN": "1154580",
    "last_updated": null
  },
  {
    "indonesianURN": "3253790",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2297",
    "babName": "Meminta perlindungan dari pengaruh hutang",
    "hadithNumber": "5379",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basyar ia berkata; telah menceritakan kepadaku Abdullah bin Yazid Al Maqburi ia berkata; telah menceritakan kepada kami Haiwah dari Darraj Abu As Samh dari Abu Al Haitsam dari Abu Sa'id dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: A'UUDZU BILLAHI MINAL KUFRI WAD DAINI (Aku berlindung kepada Allah dari kekufuran dan hutang).\" Seorang laki-laki lalu bertanya; \"Wahai Rasulullah, apakah antara hutang dengan kekufuran ada hubungannya?\" beliau menjawab: \"Ya.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "47",
    "matchingArabicURN": "1154590",
    "last_updated": null
  },
  {
    "indonesianURN": "3253800",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2298",
    "babName": "Meminta perlindungan dari terlilit hutang dan dosa",
    "hadithNumber": "5380",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin 'Amru bin As Sarh ia berkata; telah memberitakan kepada kami Ibnu Abu Wahb ia berkata; telah menceritakan kepadaku Huyay bin Abdullah ia berkata; telah menceritakan kepadaku Abu 'Abdurrahman Al Hubuli dari Abdullah bin 'Amru bin Al Ash berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa berdoa dengan kalimat-kalimat tersebut: \"ALLAHUMMA INNI A'UUDZU BIKA MIN GHALABATID DAIN WA GHALABATIL 'ADUI WA SYAAMATIL A'DA (Aku berlindung kepada Allah dari lilitan hutang, penindasan musuh dan kebahagiaan musuh).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "48",
    "matchingArabicURN": "1154600",
    "last_updated": null
  },
  {
    "indonesianURN": "3253810",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2299",
    "babName": "Meminta perlindungan dari jebakan hutang",
    "hadithNumber": "5381",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Harb ia berkata; telah menceritakan kepada kami Al Qasim yaitu Ibnu Yazid Al Jarmi dari Abdul Aziz dia berkata; telah mengabarkan kepadaku 'Amru bin Abu 'Amru dari Anas bin Malik ia berkata; \"Nabi shallallahu 'alaihi wasallam biasa mengucapkan doa: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL HAMMI WAL HAZANI WAL KASALI WAL BUKHLI WAL JUBNI WA DLALA'ID DAINI WA GHALABATIR RIJALI (YA Allah, aku berlindung kepada-Mu dari kegelisahan dan kesedihan, kemalasan dan kebakhilan, sifat pengecut, himpitan hutang dan penindasan para penguasa).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "49",
    "matchingArabicURN": "1154610",
    "last_updated": null
  },
  {
    "indonesianURN": "3253820",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2300",
    "babName": "Meminta perlindungan dari keburukan godaan kekayaan",
    "hadithNumber": "5382",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim ia berkata; telah menceritakan kepada kami Jarir dari Hisyam bin 'Urwah dari Ayahnya dari 'Aisyah ia berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa mengucapkan doa: \"ALLAHUMMA INNI A'UUDZU BIKA MIN 'AADZAABIL QABRI WA FITNATIN NAARI WA FITNATIL QABRI WA ADZAABIL QABRI WA SYARRI FITNATIL MASIIHID DAJJAL WA SYARRI FITNATIL GHINA WA SYARRI FITNATIL FAQRI ALLAHUMMA IGHSIL KHATHAAYAAYA BIMA`ITS TSALJI WA BARADI WA ANTIQI QALBI MINAL KHATHAAYAA KAMAA ANQAITA ATS TSAUBAL ABYADLA MINAD DANAS ALLAHUMMA INNI A'UUDZU BIKA MINAL KASALI WAL HARAMI WAL MAGHRAMI WAL MA`TSAMI (Ya Allah, aku berlindung kepada-Mu dari siksa kubur, fitnah neraka, fitnah kubur dan siksa kubur, kejelekkan fitnah Al Masih dajjal, kejelekkan fitnah kekayaan dan fitnah kejelekkan kafakiran. Ya Allah, basuhlah kesalahanku dengan air es dan embun, bersihkan hatiku dari kesalahan sebagaimana Engkau bersihkan kain putih dari kotoran. Ya Allah, aku berlindung kepada-Mu dari kemalasan, kepikunan, hutang yang tidak terbayar dan sebab yang mendatangkan dosa).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "50",
    "matchingArabicURN": "1154620",
    "last_updated": null
  },
  {
    "indonesianURN": "3253830",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2301",
    "babName": "Meminta perlindungan dari godaan dunia",
    "hadithNumber": "5383",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan ia berkata; telah menceritakan kepada kami Abu Dawud ia berkata; telah menceritakan kepada kami Syu'bah dari Abdul Malik bin 'Umair ia berkata; Aku mendengar Mush'ab bin Sa'd ia berkata, Sa'd pernah mengajari mereka kalimat-kalimat doa dari Nabi shallallahu 'alaihi wasallam: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL BUKHLI WA A'UUDZU BIKA MINAL JUBNI WA A'UUDZU BIKA MIN AN URADDA ILAA ARDALIL 'UMURI WA A'UUDZU BIKA MIN FITNATID DUNYA WA ADZAABIL QABRI (Ya Allah, aku berlindung kepada-Mu dari kebakhilan, aku berlindung kepada-Mu dari sifat pengecut, aku berlindung kepada-Mu dari kepikunan, dan aku berlindung kepada-Mu dari fitnah dunia dan siksa kubur).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "51",
    "matchingArabicURN": "1154630",
    "last_updated": null
  },
  {
    "indonesianURN": "3253840",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2301",
    "babName": "Meminta perlindungan dari godaan dunia",
    "hadithNumber": "5384",
    "hadithText": "Telah mengabarkan kepadaku Hilal Ibnul 'Ala ia berkata; telah menceritakan kepada kami Bapakku ia berkata; telah menceritakan kepada kami Ubaidullah dari Isra'il dari Abdul Malik bin Umair dari Mush'ab bin Sa'd dan 'Amru bin Maimun Al Audi keduanya berkata; Sa'd pernah mengajarkan kalimat-kalimat tersebut kepada anak-anaknya sebagaimana seorang tuan mengajarkan kepada budak-budaknya, ia berkata; \"Rasulullah shallallahu 'alaihi wasallam selalu berlindung dengan kalimat-kalimat terbuat setiap selesai shalat: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL BUKHLI WA A'UUDZU BIKA MINAL JUBNI WA A'UUDZU BIKA MIN AN URADDA ILAA ARDALIL 'UMURI WA A'UUDZU BIKA MIN FITNATID DUNYA WA ADZAABIL QABRI (Ya Allah, aku berlindung kepada-Mu dari kebakhilan, aku berlindung kepada-Mu dari sifat pengecut, aku berlindung kepada-Mu dari kepikunan, dan aku berlindung kepada-Mu dari fitnah dunia dan siksa kubur).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "52",
    "matchingArabicURN": "1154640",
    "last_updated": null
  },
  {
    "indonesianURN": "3253850",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2301",
    "babName": "Meminta perlindungan dari godaan dunia",
    "hadithNumber": "5385",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Fadlalah dari 'Ubaidullah ia berkata; telah memberitakan kepada kami Isra'il dari Abu Ishaq dari 'Amru bin Maimun dari Umar ia berkata; \"Nabi shallallahu 'alaihi wasallam berlindung dari sifat pengecut, kikir, kehidupan yang buruk, mati sebelum bertaubat dan siksa kubur.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "53",
    "matchingArabicURN": "1154650",
    "last_updated": null
  },
  {
    "indonesianURN": "3253860",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2301",
    "babName": "Meminta perlindungan dari godaan dunia",
    "hadithNumber": "5386",
    "hadithText": "Telah mengabarkan kepada kami Sulaiman bin Salm Al Balkhi yaitu Abu Dawud Al Mushahifi ia berkata; telah memberitakan kepada kami An Nadlr ia berkata; telah memberitakan kepada kami Yunus dari Abu Ishaq dari 'Amru bin Maimun ia berkata; \"Aku mendengar Umar Ibnul Khaththab berkata; \"Rasulullah shallallahu 'alaihi wasallam berlindung dari lima perkara: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL JUBNI WAL BUKHLI WA SUU`IL 'UMURI WA FITNATILSH SHADR WA 'ADZAABIL QABRI (Ya Allah, aku berlindung kepada-Mu dari sifat pengecut, kikir, kehidupan yang buruk, mati sebelum taubat dan siksa kubur).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "54",
    "matchingArabicURN": "1154660",
    "last_updated": null
  },
  {
    "indonesianURN": "3253870",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2301",
    "babName": "Meminta perlindungan dari godaan dunia",
    "hadithNumber": "5387",
    "hadithText": "Telah mengabarkan kepadaku Hilal Ibnu Al 'Ala` ia berkata; telah menceritakan kepada kami Husain ia berkata; telah menceritakan kepada kami Zuhair ia berkata; telah menceritakan kepada kami Abu Ishaq dari 'Amru bin Maimun ia berkata; telah menceritakan kepadaku Sahabat-sahabat Muhammad shallallahu 'alaihi wasallam, bahwa Rasulullah shallallahu 'alaihi wasallam berlindung dari sifat kikir, sifat pengecut, mati sebelum taubat dan siksa kubur.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "55",
    "matchingArabicURN": "1154670",
    "last_updated": null
  },
  {
    "indonesianURN": "3253880",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2301",
    "babName": "Meminta perlindungan dari godaan dunia",
    "hadithNumber": "5388",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman ia berkata; telah menceritakan kepada kami Abu Dawud dari Sufyan dari Abu Ishaq dari 'Amru bin Maimun ia berkata; \"Nabi shallallahu 'alaihi wasallam biasa meminta perlindungan.\" Hadits ini mursal.</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "56",
    "matchingArabicURN": "1154680",
    "last_updated": null
  },
  {
    "indonesianURN": "3253890",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2302",
    "babName": "Meminta perlindungan dari keburukan dzikr",
    "hadithNumber": "5389",
    "hadithText": "Telah mengabarkan kepadaku Ubaidullah bin Waki' ia berkata; telah menceritakan kepada kami Ayahku dari Sa'd bin Abu Aus dari Bilal bin Yahya dari Syutair bin Syakal bin Humaid dari Ayahnya ia berkata; \"Aku berkata; \"Wahai Rasulullah, ajarkanlah kepadaku sebuah doa yang bisa aku ambil manfaatnya.\" Beliau bersabda: \"Ucapkanlah: ALLAHUMMA 'AAFINI MIN SYARRI SAM'I WA BASHARI WA LISANI WA QALBI WA SYARRI MANIYYI (Ya Allah, selamatkanlah aku dari keburukkan pendengaranku, penglihatan, lisan dan hatiku. Dan dari keburukkan maniku -yakni kelamaluannya-).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "57",
    "matchingArabicURN": "1154690",
    "last_updated": null
  },
  {
    "indonesianURN": "3253900",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2303",
    "babName": "Meminta perlindungan dari keburukan kekufuran",
    "hadithNumber": "5390",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin 'Amru bin As Sarh ia berkata; telah menceritakan kepada kami Ibnu Wahb ia berkata; telah mengabarkan kepadaku Salim bin Ghailan dari Darraj Abu As Samh dari Abu Al Haitsam dari Abu Sa'id Al khudri dari Rasulullah shallallahu 'alaihi wasallam, bahwa beliau berdoa: \"Ya Allah, aku berlindung kepada-Mu dari kekufuran dan kefakiran.\" Seorang laki-laki bertanya; \"Apakah sama? ' beliau menjawab: \"Ya.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "58",
    "matchingArabicURN": "1154700",
    "last_updated": null
  },
  {
    "indonesianURN": "3253910",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2304",
    "babName": "Meminta perlindungan dari kesesatan",
    "hadithNumber": "5391",
    "hadithText": "Telah mengabarkan kepadaku Muhammad bin Qudamah ia berkata; telah menceritakan kepada kami Jarir dari Manshur dari Asy Sya'bi dari Ummu Salamah berkata; \"Jika Nabi shallallahu 'alaihi wasallam ingin keluar rumah, beliau selalu mengucapkan: \"BISMILLAHI RABBI A'UUDZU BIKA MIN AN AZILLA AU ADILLA AU AZHLIMA AU UZHLAMA AU AJHALA AU YUJHALA 'ALAYYA (Dengan menyebut nama Allah! Ya Allah, aku berlindung kepada-Mu dari berbuat kesalahan, atau kesesatan, atau berbuat zhalim, atau dizhalimi, berbuat bodoh atau dibodohi).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "59",
    "matchingArabicURN": "1154710",
    "last_updated": null
  },
  {
    "indonesianURN": "3253920",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2305",
    "babName": "Meminta perlindungan dari kekuasaan musuh",
    "hadithNumber": "5392",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin 'Amru bin As Sarh ia berkata; telah menceritakan kepadaku Ibnu Wahb ia berkata; telah mengabarkan kepadaku Huyay bin Abdullah ia berkata; telah menceritakan kepadaku Abu 'Abdurrahman Al Hubuli dari Abdullah bin Amru bin Al 'Ash berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa berdoa dengan kalimat-kalimat seperti ini: \"ALLAHUMMA INNI A'UUDZU BIKA MIN GHALABATID DAINI WA GHALABATID 'ADUWWI WA SYAMAATATIL A'DA (Ya Allah, aku berlindung kepada-Mu dari lilitan hutang, penindasan musuh dan kehabagiaan musuh).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "60",
    "matchingArabicURN": "1154720",
    "last_updated": null
  },
  {
    "indonesianURN": "3253930",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2306",
    "babName": "Meminta perlindungan dari cacian musuh",
    "hadithNumber": "5393",
    "hadithText": "Telah mengabarkan kepada kami Yunus bin Abdul A'la ia berkata; telah memberitakan kepada kami Ibnu Wahb ia berkata; Huyay berkata; telah mencertakan kepadaku Abu 'Abdurrahman Al Hubuli dari Abdullah bin 'Amru ia berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa berdoa dengan kalimat-kalimat tersebut: \"ALLAHUMMA INNI A'UUDZU BIKA MIN GHALABATID DAINI WA GHALABATID 'ADUWWI WA SYAMAATATIL A'DA (Ya Allah, aku berlindung kepada-Mu dari lilitan hutang, penindasan musuh dan kehabagiaan musuh).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "61",
    "matchingArabicURN": "1154730",
    "last_updated": null
  },
  {
    "indonesianURN": "3253940",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2307",
    "babName": "Meminta perlindungan dari kepikunan",
    "hadithNumber": "5394",
    "hadithText": "Telah mengabarkan kepada kami Abdullah bin Muhammad bin 'Abdurrahman ia berkata; telah menceritakan kepada kami Hammad bin Mas'adah dari Harun bin Ibrahim dari Muhammad dari Utsman bin Abu Al 'Ash ia berkata; \"Nabi shallallahu 'alaihi wasallam biasa berdoa dengan doa-doa ini: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL KASALI WAL HARAMI WAL JUBNI WAL 'AJZI WA MIN FITNATIL MAHYAA WAL MAMAATI (Ya Allah, aku berlindung kepada-Mu dari kemalasan, pikun, sifar pengecut dan kelemahan. Serta dari fitnah kehidupan dan kematian).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "62",
    "matchingArabicURN": "1154740",
    "last_updated": null
  },
  {
    "indonesianURN": "3253950",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2307",
    "babName": "Meminta perlindungan dari kepikunan",
    "hadithNumber": "5395",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul Karim dari Syu'aib dari Al laits dari Yazid Ibnu Al Had dari Amru bin Syu'aib dari Ayahnya dari Kakeknya ia berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam mengucapkan: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL KASALI WAL HARAMI WAL MAGHRAMI WA MA`TSAMI WA A'UUDZU BIKA MIN SYARRIL MASIIHID DAJJAL WA A'UUDZU BIKA MIN ADZAABIL QABRI WA A'UUDZU BIKA MIN ADZAABIN NAAR (Ya Allah, aku berlindung kepada-Mu dari kemalasan, pikun, hutang yang tidak terbayar, sebab yang mendatangkan dosa. Aku berlindung kepada-Mu dari Al Masih Dajjal. Aku berlindung kepada-Mu dari siksa kubur. Dan aku juga berlindung kepada-Mu dari siksa neraka).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "63",
    "matchingArabicURN": "1154750",
    "last_updated": null
  },
  {
    "indonesianURN": "3253960",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2308",
    "babName": "Meminta perlindungan keburukan takdir",
    "hadithNumber": "5396",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim ia berkata; telah memberitakan kepada kami Sufyan dari Sumay dari Abu Shalih Insyaallah dari Abu Hurairah ia berkata; \"Nabi shallallahu 'alaihi wasallam berlindung dari tiga hal ini, yaitu; mendapati kesulitan (su`ul Khatimah), kebahagiaan musuh, qadla yang buruk dan bencana yang dahsyat.\" Sufyan berkata; \"Dalam hadits itu ada tiga hal, namun aku menyebutkan empat perkara karena aku tidak hafal salah satu yang tidak termasuk di dalamnya.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "64",
    "matchingArabicURN": "1154760",
    "last_updated": null
  },
  {
    "indonesianURN": "3253970",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2309",
    "babName": "Meminta perlindungan dari kepayahan yang menyengsarakan",
    "hadithNumber": "5397",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah ia berkata; telah menceritakan kepada kami Sufyan dari Sumay dari Abu Shalih dari Abu Hurairah ia berkata; \"Nabi shallallahu 'alaihi wasallam berlindung dari ketetapan yang jelek, kebahagiaan musuh, su`ul khatimah dan bencana yang dahsyat.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "65",
    "matchingArabicURN": "1154770",
    "last_updated": null
  },
  {
    "indonesianURN": "3253980",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2310",
    "babName": "Meminta perlindungan dari penyakit gila",
    "hadithNumber": "5398",
    "hadithText": "Telah mengabarkan kepada kami Muhammad Ibnu Al Mutsanna ia berkata; telah menceritakan kepada kami Abu Dawud ia berkata; telah menceritakan kepada kami Hammam dari Qatadah dari Anas ia berkata; \"Nabi shallallahu 'alaihi wasallam mengucapkan: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL JUNUUNI WAL JUDZAAMI WAL BARASHI WA SAYYI`IL ASQAAM (Ya Allah, aku berlindung kepada-Mu dari penyakit gila, lepra, kusta dan penyakit yang ganas).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "66",
    "matchingArabicURN": "1154780",
    "last_updated": null
  },
  {
    "indonesianURN": "3253990",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2311",
    "babName": "Meminta perlindungan dari sorotan mata jahat jin",
    "hadithNumber": "5399",
    "hadithText": "Telah mengabarkan kepada kami Hillal bin Al 'Ala ia berkata; telah menceritakan kepada kami Sa'id bin Sulaiman ia berkata; telah menceritakan kepada kami 'Abbad dari Al Jurairi dari Abu Nadlrah dari Abu Sa'id ia berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa berlindung dari tatapan mata jahat bangsa jin dan manusia. Maka saat turun surat Mu'awwidzatain (surat Al falaq dan surat An Naas) beliau membaca keduanya dan meninggalkan selain itu.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "67",
    "matchingArabicURN": "1154790",
    "last_updated": null
  },
  {
    "indonesianURN": "3254000",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2312",
    "babName": "Meminta perlindungan dari keburukan kesombongan",
    "hadithNumber": "5400",
    "hadithText": "Telah mengabarkan kepada kami Musa bin 'Abdurrahman ia berkata; telah menceritakan kepada kami Husain dari Zaidah dari Humaid dari Anas ia berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa berlindung dari kalimat-kalimat seperti ini: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL KASALI WAL HARAMI WAL JUBNI WAL BUKHLI WA SUU`IL KIBRI WA FITNATID DAJJAL WA ADZAABIL QABRI (Ya Allah, aku berlindung kepada-Mu dari kemalasan, pikun, sifat pengecut, kikir, keburukan takabur, fitnah dajjal dan siksa kubur).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "68",
    "matchingArabicURN": "1154800",
    "last_updated": null
  },
  {
    "indonesianURN": "3254010",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2313",
    "babName": "Meminta perlindungan usia tua yang memayahkan",
    "hadithNumber": "5401",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la ia berkata; telah menceritakan kepada kami Khalid dari Syu'bah dari Abdul Malik bin Umair ia berkata; Aku mendengar Mush'ab bin Sa'd dari Ayahnya ia berkata; \"(Rasulullah) mengajarkan kepada kami lima perkara, dan Rasulullah shallallahu 'alaihi wasallam biasa berdoa dengannya: \"ALLHUMMA INNI A'UUDZU BIKA MINAL BUKHLI WA A'UUDZU BIKA MINAL JUBNI WA A'UUDZU BIKA MIN AN URADDA ILAA ARDZALIL UMURI WA A'UUDZU BIKA MIN ADZAABIL QABRI (Ya Allah, aku berlindung kepada-Mu dari kebakhilan. Aku berlindung kepada-Mu dari sifat pengecut. Aku berlindung kepada-mu dari kepikunan dan aku berlindung kepada-Mu dari siksa kubur).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "69",
    "matchingArabicURN": "1154810",
    "last_updated": null
  },
  {
    "indonesianURN": "3254020",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2314",
    "babName": "Meminta perlindungan dari keburukan umur",
    "hadithNumber": "5402",
    "hadithText": "Telah mengabarkan kepada kami Imran bin Bakar ia berkata; telah menceritakan kepada kami Ahmad bin Khalid ia berkata; telah menceritakan kepada kami Yunus dari Abu Ishaq -yaitu bapaknya- dari 'Amru bin Maimun ia berkata; \"Aku pernah melaksanakan haji bersama Umar, lalu aku mendengar dia berkata kepada sekelompok orang; \"Ketahuilah, sesungguhnya Nabi shallallahu 'alaihi wasallam selalu berlindung dari lima perkara; 'ALLAHUMMA INNI A'UUDZU BIKA MINAL BUKHLI WAL JUBNI WA A'UUDZU BIKA MIN SUU`IL UMURI WA A'UUDZU BIKA MIN FITNATISH SHADRI WA A'UUDZU BIKA MIN ADZAABIL QABRI (Ya Allah, aku berlindung kepada-Mu dari kebakhilan dan sifat pengecut. Aku berlindung kepada-Mu dari kehidupan yang buruk. Aku berlindung kepada-Mu dari kamatian sebelum taubat. Dan aku berlindung kepada-Mu dari siksa kubur).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "70",
    "matchingArabicURN": "1154820",
    "last_updated": null
  },
  {
    "indonesianURN": "3254030",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2315",
    "babName": "Meminta perlindungan dari kekurangan setelah tambahan",
    "hadithNumber": "5403",
    "hadithText": "Telah mengabarkan kepada kami Azhar bin Jamil ia berkata; telah menceritakan kepada kami Khalid Ibnul Harits ia berkata; telah menceritakan kepada kami Syu'bah dari Ashim dari Abdullah bin Sarjis ia berkata; \"Rasulullah shallallahu 'alaihi wasallam jika ingin bepergian mengucapkan: \"ALLAHUMMA INNI A'UUDZU BIKA MIN WA'STAA`IS SAFAR WA KAABATIL MUNQALABI WAL HAURI BA'DAL KAURI WA DA'WATIL MALZHLUUMI WA SUU`IL MANZHARI FIL AHLI WAL MAALI (Ya Allah, aku berlindung kepada-Mu dari kelelahan di perjalanan, kesedihan saat kembali, kekurangan setelah kecukupan, doa orang yang terzhalimi dan pemandangan yang buruk pada keluarga dan harta).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "71",
    "matchingArabicURN": "1154830",
    "last_updated": null
  },
  {
    "indonesianURN": "3254040",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2315",
    "babName": "Meminta perlindungan dari kekurangan setelah tambahan",
    "hadithNumber": "5404",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim ia berkata; telah menceritakan kepada kami Jarir dari 'Ashim dari Abdullah bin Sarjis ia berkata; \"Jika Rasulullah shallallahu 'alaihi wasallam hendak safar, beliau mengucapkan: \"ALLAHUMMA INNI A'UUDZU BIKA MIN WA'STAA`IS SAFAR WA KAABATIL MUNQALABI WAL HAURI BA'DAL KAURI WA DA'WATIL MALZHLUUMI WA SUU`IL MANZHARI FIL AHLI WAL MAALI WAL WALADI (Ya Allah, aku berlindung kepada-Mu dari kelelahan di perjalanan, kesedihan saat kembali, kekurangan setelah kecukupan, doa orang yang terzhalimi dan pemandangan yang buruk pada keluarga, harta dan anak).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "72",
    "matchingArabicURN": "1154840",
    "last_updated": null
  },
  {
    "indonesianURN": "3254050",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2316",
    "babName": "Meminta perlindungan dari doa orang yang teraniaya",
    "hadithNumber": "5405",
    "hadithText": "Telah mengabarkan kepada kami Yusuf bin Hammad ia berkata; telah menceritakan kepada kami Bisyr bin Manshur dari 'Ashim dari Abdullah bin Sarjis ia berkata; \"Jika Nabi shallallahu 'alaihi wasallam hendak melakukan safar, beliau berlindung dari hambatan di perjalanan, kesedihan saat kembali, kekurangan setelah kecukupan, doa orang yang terzhalimi dan pemandangan yang buruk.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "73",
    "matchingArabicURN": "1154850",
    "last_updated": null
  },
  {
    "indonesianURN": "3254060",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2317",
    "babName": "Meminta perlindungan kesudahan yang menyedihkan",
    "hadithNumber": "5406",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin 'Amru bin Umar bin Ali bin Miqdam ia berkata; telah menceritakan kepada kami Ibnu Abu Adi dari Syu'bah dari Abdullah bin Bisyr Al Khasy'ami dari Abu Zur'ah dari Abu Hurairah ia berkata; \"Jika Rasulullah shallallahu 'alaihi wasallam hendak safar, beliau naik kendaraannya. Beliau lalu mengisyarakatkan dengan jarinya -Syu'bah kemudian membentangkan jarinya-, beliau mengucapkan: \"ALLAHUMMA ANTA SHAHIBU FISSAFARI WAL KHALIFATU FIL AHLI WAL MAALI ALLAHUMMA INNI A'UUDZU BIKA MIN WA'TSAA`IS SAFARI WA KAABATIL MANZHARI (Ya Allah, Engkau adalah teman dalam perjalanan dan yang mengurusi dalam keluarga dan harta (ku). Ya Allah aku berlindung kepada-Mu dari kelelahan dalam perjalanan dan pemandangan yang menyedihkan).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "74",
    "matchingArabicURN": "1154860",
    "last_updated": null
  },
  {
    "indonesianURN": "3254070",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2318",
    "babName": "Meminta perlindungan dari tetangga yang buruk",
    "hadithNumber": "5407",
    "hadithText": "Telah mengabarkan kepada kami Amru bin Ali ia berkata; telah menceritakan kepada kami Yahya ia berkata; telah menceritakan kepada kami Muhammad bin 'Ajlan dari Sa'id bin Abu Sa'id Al Maqburi dari Abu Hurairah ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berlindunglah kepada Allah dari tetangga yang jahat di tempat tinggal, sebab tetangga yang nomaden (badui) akan menjauh darimu.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "75",
    "matchingArabicURN": "1154870",
    "last_updated": null
  },
  {
    "indonesianURN": "3254080",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2319",
    "babName": "Meminta perlindungan dari pengaruh orang lain",
    "hadithNumber": "5408",
    "hadithText": "Telah mengabarkan kepada kami Ali bin Hujr ia berkata; telah menceritakan kepada kami Isma'il ia berkata; telah menceritakan kepada kami 'Amru bin Abu 'Amru bahwa ia mendengar Anas bin Malik berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda kepada Abu Thalhah: \"Carikanlah seorang budak dari budak-budakmu untuk membantuku.\" Maka Abu Thalhah membawaku dalam boncengannya, hingga aku pun membantu Rasulullah shallallahu 'alaihi wasallam. setiap kali beliau singgah dalam suatu tempat, beliau selalu mengucapkan: \"ALLAHUMMA INNI A'UUDZU BIKA MINAL HARAMI WAL HUZNI WAL 'AJZI WAL KASALI WAL BUKHLI WAL JUBNI WA DLALA'ID DAINI WA GHALABATIRRIJAL (Ya Allah, aku berlindung kepada-Mu dari kepikunan, kesedihan, kelemahan, kemalasan, kikir, sifat pengecut, himpitan hutang dan penindasan penguasa).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "76",
    "matchingArabicURN": "1154880",
    "last_updated": null
  },
  {
    "indonesianURN": "3254090",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2320",
    "babName": "Meminta perlindungan dari fitnah dajjal",
    "hadithNumber": "5409",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah ia berkata; telah menceritakan kepada kami Sufyan dari Yahya dari Amrah dari 'Aisyah ia berkata; \"Nabi shallallahu 'alaihi wasallam biasa berlindung kepada Allah dari siksa kubur dan fitnah Dajjal.\" perawai berkata; \"Beliau bersabda: \"Sungguh, kalian akan menghadapi fitnah dalam kubur.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "77",
    "matchingArabicURN": "1154890",
    "last_updated": null
  },
  {
    "indonesianURN": "3254100",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2321",
    "babName": "Meminta perlindungan dari siksa jahannam dan keburukan fitnah dajjal",
    "hadithNumber": "5410",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Hafsh bin Abdullah ia berkata; telah menceritakan kepadaku Ayahku ia berkata; telah menceritakan kepadaku Ibrahim dari Musa bin 'Uqbah ia berkata; telah mengabarkan kepadaku Abu Az Zinad dari Abdurrahman bin Hurmuz Al A'raj dari Abu Hurairah ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku berlindung kepada Allah dari siksa jahannam, dari siksa kubur, dan dari keburukan Al Masih Dajjal. Dan aku juga berlindung kepada Allah dari fitnah kehidupan dan kematian.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "78",
    "matchingArabicURN": "1154900",
    "last_updated": null
  },
  {
    "indonesianURN": "3254110",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2321",
    "babName": "Meminta perlindungan dari siksa jahannam dan keburukan fitnah dajjal",
    "hadithNumber": "5411",
    "hadithText": "Telah mengabarkan kepada kami Yahya bin Durusta ia berkata; telah menceritakan kepada kami Abu Isma'il ia berkata; telah menceritakan kepada kami Yahya bin Abu Katsir bahwa Abu Salamah menceritakan kepadanya dari Abu Hurairah dari Rasulullah shallallahu 'alaihi wasallam, bahwa beliau mengucapkan: \"ALLAHUMMA INNI A'UUDZU BIKA MIN ADZAABIL QABRI WA A'UUDZU BIKA MIN ADZAABIN NAARI WA A'UUDZU BIKA MIN FITNATIL MAHYAA WAL MAMAATI WA A'UUDZU BIKA MIN SYARRIL MASIIHID DAJJAL (Ya Allah, aku berlindung kepada-Mu dari siksa kubur, aku berlindung kepada-Mu dari siksa neraka, aku berlindung kepada-Mu dari fitnah kehidupan dan kematian, dan aku berlindung kepada-Mu dari keburukkan Al Masih Dajjal).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "79",
    "matchingArabicURN": "1154910",
    "last_updated": null
  },
  {
    "indonesianURN": "3254120",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2322",
    "babName": "Meminta perlindungan dari keburukan setan manusia",
    "hadithNumber": "5412",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Sulaiman ia berkata; telah menceritakan kepada kami Ja'far bin 'Aun ia berkata; telah menceritakan kepada kami Abdurrahman bin Abdullah dari Abu Umar dari 'Ubaid bin Khasykhasy dari Abu Dzar ia berkata; \"Aku masuk ke dalam masjid sementara Rasulullah shallallahu 'alaihi wasallam sudah berada di dalam. Aku duduk di sisinya, beliau lalu bersabda: \"Wahai Abu Dzar, berlindunglah kepada Allah dari keburukkan setan dari jin dan manusia.\" Aku bertanya; \"Apakah pada jenis manusia juga ada setan?\" beliau menjawab: \"Ya.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "80",
    "matchingArabicURN": "1154920",
    "last_updated": null
  },
  {
    "indonesianURN": "3254130",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2323",
    "babName": "Meminta perlindungan dari fitnah hidup",
    "hadithNumber": "5413",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah ia berkata; telah menceritakan kepada kami Sufyan dan Malik keduanya berkata; telah menceritakan kepada kami Abu Az Zinad dari Al A'raj dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Berlindunglah kepada Allah dari siksa kubur, berlindunglah kepada Allah dari fitnah kehidupan dan kematian. Dan berlindunglah kepada Allah dari fitnah Al Masih Dajjal.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "81",
    "matchingArabicURN": "1154930",
    "last_updated": null
  },
  {
    "indonesianURN": "3254140",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2323",
    "babName": "Meminta perlindungan dari fitnah hidup",
    "hadithNumber": "5414",
    "hadithText": "Telah mengabarkan kepada kami Abdurrahman bin Muhammad ia berkata; telah menceritakan kepada kami Abu Dawud ia berkata; telah menceritakan kepada kami Syu'bah ia berkata; telah mengabarkan kepadaku Ya'la bin 'Atha ia berkata; Aku mendengar Abu 'Alqamah menceritakan dari Abu Hurairah ia berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa berlindung dari lima hal, beliau mengucapkan: \"Berlindunglah kepada Allah dari siksa kubur, dari siksa jahannam, dari fitnah kehidupan dan kematian, serta dari keburukkan Al Masih Dajjal.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "82",
    "matchingArabicURN": "1154940",
    "last_updated": null
  },
  {
    "indonesianURN": "3254150",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2323",
    "babName": "Meminta perlindungan dari fitnah hidup",
    "hadithNumber": "5415",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basyar dan Muhammad -dan ia menyebutkan sebuah kata yang semakna dengannya- ia berkata; telah menceritakan kepada kami Syu'bah dari Ya'la bin 'Atha` ia berkata; aku mendengar Abu 'Alqamah Al Hasyimi berkata; aku mendengar Abu Hurairah berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa taat kepadaku maka ia telah taat kepada Allah, barangsiapa bermaksiat kepadaku maka ia telah bermaksiat kepada Allah.\" Dan beliau biasa berlindung dari siksa kubur, siksa jahannam, fitnah kehidupan dan kematian serta fitnah Al Masih Dajjal.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "83",
    "matchingArabicURN": "1154950",
    "last_updated": null
  },
  {
    "indonesianURN": "3254160",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2323",
    "babName": "Meminta perlindungan dari fitnah hidup",
    "hadithNumber": "5416",
    "hadithText": "Telah mengabarkan kepada kami Abu Dawud ia berkata; telah menceritakan kepada kami Abu Al Walid ia berkata; telah menceritakan kepada kami Abu 'Awanah dari Ya'la bin 'Atha` dari Ayahnya dari Abu 'Alqamah ia berkata; telah menceritakan kepadaku Abu Hurairah -dari mulutnya ke mulutku- ia berkata; \"Nabi shallallahu 'alaihi wasallam bersabda: \"Mintalah perlindungan kepada Allah dari lima hal; dari siksa jahannam, dari siksa kubur, dari fitnah kehidupan dan kematian dan dari fitnah Al Masih Dajjal.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "84",
    "matchingArabicURN": "1154960",
    "last_updated": null
  },
  {
    "indonesianURN": "3254170",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2324",
    "babName": "Meminta perlindungan dari  fitnah kematian",
    "hadithNumber": "5417",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah dari Malik dari Abu Az Zubair dari Thawus dari Abdullah bin Abbas ia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengajarkan doa ini kepada mereka sebagaimana beliau mengajarkan surat Al-Qur'an. Beliau mengatakan: \"Ucapkanlah: sesungguhnya kami berlindung kepada-Mu dari siksa jahannam, dan aku berlindung kepada-Mu dari siksa kubur, dan aku berlindung kepada-Mu dari fitnah Al Masih Dajjal, dan aku berlindung kepada-Mu dari fitnah kehidupan dan kematian.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "85",
    "matchingArabicURN": "1154970",
    "last_updated": null
  },
  {
    "indonesianURN": "3254180",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2324",
    "babName": "Meminta perlindungan dari  fitnah kematian",
    "hadithNumber": "5418",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Maimun dari Sufyan dari Amru dari Thawus dari Abu Hurairah. Dan Abu Az Zinad dari Al A'raj dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Berlindunglah kepada Allah 'azza wajalla dari siksa Allah, berlindunglah kepada Allah dari fitnah kehidupan dan kematian, dari siksa kubur dan dari fitnah Al Masih Dajjal.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "86",
    "matchingArabicURN": "1154980",
    "last_updated": null
  },
  {
    "indonesianURN": "3254190",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2325",
    "babName": "Meminta perlindungan dari  siksa kubur",
    "hadithNumber": "5419",
    "hadithText": "Al Harits bin Miskin berkata dengan membacakannya kepada dia, sementara aku mendengarnya, dari Ibnu Al Qasim dari Malik dari Abu Az Zinad dari Al A'raj dari Abu Hurairah ia berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa mengucapkan dalam doanya: \"ALLAHUMMA INNI A'UUDZU BIKA MIN ADZAABI JAHANNAMA WA A'UUDZU BIKA MIN ADZAABIL QABRI WA A'UUDZU BIKA MIN FITNATIL MASIIHID DAJJAL WA A'UUDZU BIKA MIN FITNATIL MAHYAA WAL MAMAATI (Ya Allah, aku berlindung kepada-Mu dari siksa jahannam, aku berlindung kepada-Mu dari siksa kubur, aku berlindung kepada-Mu dari fitnah Al Masih Dajjal dan aku berlindung kepada-Mu dari fitnah kehidupan dan kematian.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "87",
    "matchingArabicURN": "1154990",
    "last_updated": null
  },
  {
    "indonesianURN": "3254200",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2326",
    "babName": "Meminta perlindungan dari fitnah kuburan",
    "hadithNumber": "5420",
    "hadithText": "Telah mengabarkan kepada kami Abu Ashim ia berkata; telah menceritakan kepada kami Al Qasim bin Katsir Al Muqri dari Al Laits bin Sa'id dari Yazid bin Abu Habib dari Sulaiman bin Yasar Bahwasanya ia mendengar Abu Hurairah berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam berkata dalam doanya: \"ALLAHUMMA INNI A'UUDZU BIKA MIN FITNATIL QABRI WA FITNATILD DAJJAL WA FITNATIL MAHYAA WAL MAMAATI (Ya Allah, aku berlindung kepada-Mu dari fitnah kubur, fitnah Dajjal, serta dari fitnah kehidupan dan kematian).\" Perawi berkata; \"Abu Abdurrahman ini salah, yang benar adalah Sulaiman bin Sinan.</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "88",
    "matchingArabicURN": "1155000",
    "last_updated": null
  },
  {
    "indonesianURN": "3254210",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2327",
    "babName": "Meminta perlindungan dari siksa Allah",
    "hadithNumber": "5421",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Manshur ia berkata; telah menceritakan kepada kami Sufyan dari Abu Az Zinad dari Al A'raj dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Berlindunglah kepada Allah dari siksa Allah, berlindunglah kepada Allah dari siksa kubur, berlindunglah kepada Allah dari fitnah kehidupan dan kematian. Serta berlindunglah kepada Allah dari fitnah Al Masih Dajjal.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "89",
    "matchingArabicURN": "1155010",
    "last_updated": null
  },
  {
    "indonesianURN": "3254220",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2328",
    "babName": "Meminta perlindungan dari siksa jahannam",
    "hadithNumber": "5422",
    "hadithText": "Telah mengabarkan kepada kami Ishaq bin Ibrahim ia berkata; telah memberitakan kepada kami Abu Amir Al 'Aqadi ia berkata; telah menceritakan kepada kami Syu'bah dari Budail bin Maisarah dari Abdullah bin Syaqiq dari Abu Hurairah ia berkata; \"Rasulullah shallallahu 'alaihi wasallam selalu berlindung dari siksa jahannam, siksa kubur dan dari Al Masih Dajjal.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "90",
    "matchingArabicURN": "1155020",
    "last_updated": null
  },
  {
    "indonesianURN": "3254230",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2329",
    "babName": "Meminta perlindungan dari siksa neraka",
    "hadithNumber": "5423",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Khalid ia berkata; telah menceritakan kepada kami Al Walid ia berkata; telah menceritakan kepada kami Abu 'Amru dari Yahya bahwa dia menceritakan kepadanya, ia berkata; telah mengabarkan kepadaku Abu Salamah ia berkata; telah menceritakan kepadaku Abu Hurairah ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berlindunglah kepada Allah dari siksa neraka, siksa kubur, fitnah kehidupan dan kematian serta dari keburukkan Al Masih Dajjal.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "91",
    "matchingArabicURN": "1155030",
    "last_updated": null
  },
  {
    "indonesianURN": "3254240",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2330",
    "babName": "Meminta perlindungan dari panas neraka",
    "hadithNumber": "5424",
    "hadithText": "Telah mengabarkan kepada kami Ahmad bin Hafsh ia berkata; telah menceritakan kepadaku Ayahku ia berkata; telah menceritakan kepadaku Ibrahim dari Sufyan bin Sa'id dari Abu Hassan dari Jasrah dari 'Aisyah bahwa ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"ALLAHUMMA RABBA JIBRA'IL WA MIKAA'IIL WA RABBA ISRAAFIIL A'UUDZU BIKA MIN HARRIN NAARI WA MIN ADZAABIL QABRI (Ya Allah, Rabb Jibril dan Mika'il, Rabb Israfil, aku berlindung kepada-Mu dari panasnya api neraka dan siksa kubur).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "92",
    "matchingArabicURN": "1155040",
    "last_updated": null
  },
  {
    "indonesianURN": "3254250",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2330",
    "babName": "Meminta perlindungan dari panas neraka",
    "hadithNumber": "5425",
    "hadithText": "Telah mengabarkan kepada kami Amru bin Sawwad ia berkata; telah menceritakan kepada kami Ibnu Wahb ia berkata; telah menceritakan kepada kami 'Amru Ibnul Harits dari Yazid bin Abu Habib dari Sulaiman bin Sinan Al Muzanni bahwa ia mendengar Abu Hurairah berkata; \"Aku mendengar Al Qasim shallallahu 'alaihi wasallam mengucapkan dalam shalatnya: \"ALLAHUMMA INNI A'UUDZU BIKA MIN FITNATIL QABRI WA MIN FITNATID DAJJAL WA MIN FITNATIL MAHYAA WAL MAMAATI WA MIN HARRI JAHANNAMA (Ya Allah, aku berlindung kepada-Mu dari fitnah kubur, fitnah Dajjal, fitnah kehidupan dan kematian, dan dari panasnya api jahannam).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "93",
    "matchingArabicURN": "1155050",
    "last_updated": null
  },
  {
    "indonesianURN": "3254260",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2330",
    "babName": "Meminta perlindungan dari panas neraka",
    "hadithNumber": "5426",
    "hadithText": "Telah mengabarkan kepada kami Qutaibah ia berkata; telah menceritakan kepada kami Abu Al Ahwash dari Abu Ishaq dari Buraid bin Abu Maryam dari Anas bin Malik ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa minta surga kepada Allah sebanyak tiga kali, maka surga akan berkata; 'Ya Allah, masukkanlah ia ke dalam surga'. Dan barangsiapa minta agar dijauhkan dari neraka sebanyak tiga kali, maka neraka akan berkata; 'Ya Allah, jauhkanlah ia dari neraka'.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "94",
    "matchingArabicURN": "1155060",
    "last_updated": null
  },
  {
    "indonesianURN": "3254270",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2331",
    "babName": "Meminta perlindungan dari keburukan yang diperbuat dan perbedaan pada Abdullah",
    "hadithNumber": "5427",
    "hadithText": "Telah mengabarkan kepada kami Amru bin Ali ia berkata; telah menceritakan kepada kami Yazid -yaitu Ibnu Zurai'- ia berkata; telah menceritakan kepada kami Husain Al Mu'allim dari Abdullah bin Buraidah dari Busyair bin Ka'b dari Syaddad bin Aus dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya istighfar yang paling baik adalah; jika seorang hamba mengucapkan: \"ALLAHUMMA ANTA RABBI LAA ILAAHA ILLA ANTA KHALAQTANI WA ANA 'ABDUKA WA ANA 'ALA 'AHDIKA WA WA'DIKA MASTATHA'TU A'UUDZU BIKA MIN SYARRI MAA SHANA'TU ABUU`U LAKA BIDZANBI WA ABUU`U LAKA BINI'MATIKA 'ALAYYA FAGHFIRLI FA INNAHU LAA YAGHFIRU ADZ DZUNUUBA ILLA ANTA (Ya Allah, Engkau adalah Tuhanku, tidak ada Tuhan yang berhak diibadahi selain Engkau. Engkau telah menciptakanku dan aku adalah hamba-Mu. Aku menetapi perjanjian-Mu dan janji-Mu sesuai dengan kemampuanku. Aku berlindung kepada-Mu dari keburukan perbuatanku, aku mengakui dosaku kepada-Mu dan aku akui nikmat-Mu kepadaku, maka ampunilah aku. Sebab tidak ada yang dapat mengampuni dosa selain-Mu) '. Jika ia mengucapkan di waktu subuh dengan penuh keyakinan lalu meninggal, maka ia akan masuk surga. Dan jika ia membacanya di waktu sore dengan penuh keyakinan lalu meninggal, maka ia akan masuk surga.\" Namun Al Walid bin Tsa'labah menyelisihi riwayat hadits ini.</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "95",
    "matchingArabicURN": "1155070",
    "last_updated": null
  },
  {
    "indonesianURN": "3254280",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2332",
    "babName": "Meminta perlindungan dari keburukan yang dilakukan dan perbedaan pada Hilal",
    "hadithNumber": "5428",
    "hadithText": "Telah mengabarkan kepada kami Yunus bin Abdul A'la dari Ibnu Wahb ia berkata; telah mengabarkan kepadaku Musa bin Syaibah dari Al Auza'i dari Abdah bin Abu Lubabah bahwa Ibnu Yasaf menceritakan kepadanya, bahwasanya ia pernah bertanya kepada 'Aisyah isteri Nabi shallallahu 'alaihi wasallam; 'Apa yang paling sering dibaca oleh Rasulullah shallallahu 'alaihi wasallam dalam doa sebelum beliau wafat? ' 'Aisyah berkata; \"Yang paling sering beliau baca adalah: 'ALLAHUMMA INNI A'UUDZU BIKA MIN SYARRI MAA 'AMILTU WA MIN SYARRI MAA LAM A'MAL (Ya Allah, aku berlindung kepada-Mu dari keburukkan sesuatu yang telah aku lakukan, dan dari keburukkan sesuatu yang belum aku lakukan).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "96",
    "matchingArabicURN": "1155080",
    "last_updated": null
  },
  {
    "indonesianURN": "3254290",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2332",
    "babName": "Meminta perlindungan dari keburukan yang dilakukan dan perbedaan pada Hilal",
    "hadithNumber": "5429",
    "hadithText": "Telah mengabarkan kepadaku Imran bin Bakkar ia berkata; telah menceritakan kepada kami Abu Al Mughirah ia berkata; telah menceritakan kepada kami Al Auza'i ia berkata; telah menceritakan kepadaku Abdah ia berkata; telah menceritakan kepadaku Ibnu Yasaf ia berkata; 'Aisyah pernah ditanya; 'Apa yang paling sering dibaca oleh Nabi shallallahu 'alaihi wasallam? ' 'Aisyah menjawab; \"Doa yang paling sering dibaca oleh beliau adalah; 'ALLAHUMMA INNI A'UUDZU BIKA MIN SYARRI MAA 'AMILTU WA MIN SYARRI MAA LAM A'MAL BA'DU (Ya Allah, aku berlindung kepada-Mu dari keburukkan sesuatu yang telah aku lakukan, dan dari keburukkan sesuatu yang belum aku lakukan).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "97",
    "matchingArabicURN": "1155090",
    "last_updated": null
  },
  {
    "indonesianURN": "3254300",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2332",
    "babName": "Meminta perlindungan dari keburukan yang dilakukan dan perbedaan pada Hilal",
    "hadithNumber": "5430",
    "hadithText": "Telah mengabarkan kepadaku Muhammad bin Qudamah dari Jarir dari Manshur dari Hilal dari Farwah bin Naufal ia berkata; \"Aku pernah bertanya Ummul Mukminin 'Aisyah, tentang doa yang biasa dibaca oleh Rasulullah shallallahu 'alaihi wasallam untuk berdoa? ' ia menjawab; \"Beliau membaca 'ALLAHUMMA INNI A'UUDZU BIKA MIN SYARRI MAA 'AMILTU WA MIN SYARRI MAA LAM A'MAL (Ya Allah, aku berlindung kepada-Mu dari keburukkan sesuatu yang telah aku lakukan, dan dari keburukkan sesuatu yang belum aku lakukan).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "98",
    "matchingArabicURN": "1155100",
    "last_updated": null
  },
  {
    "indonesianURN": "3254310",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2332",
    "babName": "Meminta perlindungan dari keburukan yang dilakukan dan perbedaan pada Hilal",
    "hadithNumber": "5431",
    "hadithText": "Telah mengabarkan kepada kami Hannad dari Abu Al Ahwash dari Hushain dari Hilal dari Farwah bin Naufal dari 'Aisyah ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"ALLAHUMMA INNI A'UUDZU BIKA MIN SYARRI MAA 'AMILTU WA MIN SYARRI MAA LAM A'MAL (Ya Allah, aku berlindung kepada-Mu dari keburukkan sesuatu yang telah aku lakukan, dan dari keburukkan sesuatu yang belum aku lakukan).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "99",
    "matchingArabicURN": "1155110",
    "last_updated": null
  },
  {
    "indonesianURN": "3254320",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2333",
    "babName": "Meminta perlindungan dari keburukan yang belum dikerjakan",
    "hadithNumber": "5432",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Abdul A'la ia berkata; telah menceritakan kepada kami Al Mu'tamir dari Ayahnya dari Hushain dari Hilal bin Yasaf dari Farwah bin Naufal ia berkata; \"Aku bertanya 'Aisyah, \"Aku katakan, 'Ceritakanlah kepadaku sesuatu yang Rasulullah shallallahu 'alaihi wasallam biasa gunakan untuk berdoa?! Ia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengucapkan: \"ALLAHUMMA INNI A'UUDZU BIKA MIN SYARRI MAA 'AMILTU WA MIN SYARRI MAA LAM A'MAL (Ya Allah, aku berlindung kepada-Mu dari keburukkan sesuatu yang telah aku lakukan, dan dari keburukkan sesuatu yang belum aku lakukan).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "100",
    "matchingArabicURN": "1155120",
    "last_updated": null
  },
  {
    "indonesianURN": "3254330",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2333",
    "babName": "Meminta perlindungan dari keburukan yang belum dikerjakan",
    "hadithNumber": "5433",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan ia berkata; telah menceritakan kepada kami Abu Dawud ia berkata; telah menceritakan kepada kami Syu'bah dari Hushain ia berkata; aku mendengar Hilal bin Yasaf dari Farwah bin Naufal ia berkata; aku berkata kepada 'Aisyah; \"Kabarkanlah kepadaku doa apa yang biasa dibaca oleh Rasulullah shallallahu 'alaihi wasallam?\" 'Aisyah berkata; \"Beliau membaca: ALLAHUMMA INNI A'UUDZU BIKA MIN SYARRI MAA 'AMILTU WA MIN SYARRI MAA LAM A'MAL (Ya Allah, aku berlindung kepada-Mu dari keburukan sesuatu yang telah aku lakukan, dan dari keburukan sesuatu yang belum aku lakukan).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "101",
    "matchingArabicURN": "1155130",
    "last_updated": null
  },
  {
    "indonesianURN": "3254340",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2334",
    "babName": "Meminta perlindungan dari dibenamkan ke bumi",
    "hadithNumber": "5434",
    "hadithText": "Telah mengabarkan kepada kami 'Amru bin Manshur ia berkata; telah menceritakan kepada kami Al Fadll bin Dukain dari 'Ubadah bin Muslim ia berkata; telah menceritakan kepadaku Jubair bin Muth'im bahwa Ibnu Umar berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam membaca: ALLAHUMMA INNI A'UUDZU BIKA BI AZHAMATIKA AN UGHTAALA MIN TAHTII (Ya Allah, aku berlindung dengan keagungan-Mu dari pembunuhan yang dilakukan dengan cara yang tidak diketahui).\" Jubair berkata; \"Yaitu penenggelaman ke dalam dasar bumi.\" 'Ubadah berkata; \"Aku tidak mengetahui, apakah itu sabda Nabi shallallahu 'alaihi wasallam atau ucapan Jubair.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "102",
    "matchingArabicURN": "1155140",
    "last_updated": null
  },
  {
    "indonesianURN": "3254350",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2334",
    "babName": "Meminta perlindungan dari dibenamkan ke bumi",
    "hadithNumber": "5435",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Al Khalil ia berkata; telah menceritakan kepada kami Marwan yaitu Ibnu Mu'awiyah dari Ali bin Abdul Aziz dari 'Ubadah bin Muslim Al Fazari dari Jubair bin Abu Sulaiman dari Ibnu Umar ia berkata; \"Nabi shallallahu 'alaihi wasallam berdoa: \"ALLAHUMMA (Ya Allah..), lalu beliau menyebutkan doa tersebut, dan mengucapkan pada akhir doanya: \"A'UUDZU BIKA AN UGHTAALA MIN TAHTII (aku berlindung kepada-Mu dari pembunuhan dengan cara yang tidak diketahui), yaitu penenggelaman ke dalam perut bumi.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "103",
    "matchingArabicURN": "1155150",
    "last_updated": null
  },
  {
    "indonesianURN": "3254360",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2335",
    "babName": "Meminta perlindungan dari terjatuh dan dihancurkan",
    "hadithNumber": "5436",
    "hadithText": "Telah mengabarkan kepada kami Mahmud bin Ghailan ia berkata; telah menceritakan kepada kami Al fadll bin Musa dari Abdullah bin Sa'id dari Shaifi -mantan budak Abu Ayyub- dari Abu Al Yasaar ia berkata; \"Rasulullah shallallahu 'alaihi wasallam membaca doa: \"Ya Allah, aku berlindung kepada-Mu dari kematian karena jatuh dari tempat yang tinggi, tertimpa reruntuhan, tenggelam, dan terbakar. Dan aku berlindung kepada-Mu dari bujukan setan saat sakaratul maut, kematian saat lari dari perang di jalan-Mu, serta mati karena sengatan binatang melata.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "104",
    "matchingArabicURN": "1155160",
    "last_updated": null
  },
  {
    "indonesianURN": "3254370",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2335",
    "babName": "Meminta perlindungan dari terjatuh dan dihancurkan",
    "hadithNumber": "5437",
    "hadithText": "Telah mengabarkan kepada kami Yunus bin Abdul A'la ia berkata; telah mengabarkan kepadaku Anas bin Iyadl dari Abdullah bin Sa'id dari Shaifi dari Abu Al Yasar ia berkata; \"Rasulullah shallallahu 'alaihi wasallam membaca doa: \"Ya Allah, aku berlindung kepada-Mu dari kematian karena pikun, jatuh dari tempat yang tinggi, tertimpa reruntuhan, kesedihan, kebakaran, dan tenggelam. Dan aku berlindung kepada-Mu dari bujukan setan saat sakaratul maut, kematian saat lari dari perang di jalan-Mu, serta mati karena sengatan binatang melata.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "105",
    "matchingArabicURN": "1155170",
    "last_updated": null
  },
  {
    "indonesianURN": "3254380",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2335",
    "babName": "Meminta perlindungan dari terjatuh dan dihancurkan",
    "hadithNumber": "5438",
    "hadithText": "Telah mengabarkan kepada kami Muhammad Ibnul Mutsanna ia berkata; telah menceritakan kepada kami Muhammad bin Ja'far ia berkata; telah menceritakan kepada kami Abdullah bin Sa'id ia berkata; telah menceritakan kepadaku Shaifi -mantan budak Abu Ayyub Al Anshari- dari Abu Al Aswad As Sulami berkata; \"Rasulullah shallallahu 'alaihi wasallam membaca doa: \"Ya Allah, aku berlindung kepada-Mu dari kematian karena tertimpa reruntuhan, mati karena jatuh dari ketinggian, mati karena tenggelam dan mati karena kebakaran. Dan aku berlindung kepada-Mu dari bujukan setan saat sakaratul maut kematian saat lari dari perang di jalan-Mu, serta mati karena sengatan binatang melata.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "106",
    "matchingArabicURN": "1155180",
    "last_updated": null
  },
  {
    "indonesianURN": "3254390",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2336",
    "babName": "Meminta perlindungan dengan keredhaan Allah dari kemurkaan Allah ta'ala",
    "hadithNumber": "5439",
    "hadithText": "Telah mengabarkan kepada kami Ibrahim bin Ya'qub ia berkata; telah menceritakan kepada kami Al 'Ala bin Hilal ia berkata; telah menceritakan kepada kami 'Ubaidullah dari Zaid dari 'Amru bin Murrah dari Al Qasim bin Abdurrahman dari Masruq Al Ajda' dari 'Aisyah ia berkata; \"Suatu malam aku mencari-cari Rasulullah shallallahu 'alaihi wasallam dari kasurku namun aku tidak menemukannya. Aku lalu memukulkan tanganku ke pangkal kasur hingga tanganku mengenai telapak kaki beliau, ternyata beliau waktu itu sedang sujud. Beliau membaca: \"A'UUDZU BI 'AFWIKA MIN 'IQAABIKA WA A'UUDZU BI RIDLAAKA MIN SAKHATIKA WA A'UUDZU BIKA MINKA (Aku berlindung dengan ampunan-Mu dari siksa-Mu, dengan ridla-Mu dari murka-Mu dan dengan-Mu dari diri-Mu).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "107",
    "matchingArabicURN": "1155190",
    "last_updated": null
  },
  {
    "indonesianURN": "3254400",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2337",
    "babName": "Meminta perlindungan dari kedudukan yang terhimpit hari kiamat",
    "hadithNumber": "5440",
    "hadithText": "Telah mengabarkan kepadaku Ibrahim bin Ya'qub ia berkata; telah menceritakan kepada kami Zaid Ibnul Hubab bahwa Mu'awiyah bin Shalih menceritakan kepadanya; telah menceritakan kepadaku Azhar bin Sa'id disebut juga dengan Al Harazi, seorang dari wilayah Syam dan bagus dalam hal hadits, dari Ashim bin Humaid ia berkata; \"Aku pernah bertanya 'Aisyah tentang sesuatu yang dilakukan oleh Rasulullah shallallahu 'alaihi wasallam sebelum memulai shalat malam. Maka ia menjawab, \"Engkau bertanya terhadap sesuatu yang pernah ditanyakan oleh seseorang kepadaku. Beliau bertakbir sepuluh kali, bertasbih sepuluh kali, dan beristighfar sepuluh kali. Kemudian beliau membaca: 'ALLAHUMMAGHFIRLI WAAHDINII WARZUQNII (Ya Allah, ampunilah aku, berikan aku petunjuk, karuniakan rizki dan kesehatan kepadaku) '. Dan beliau juga berlindung dari kesempitan pada hari kiamat.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "108",
    "matchingArabicURN": "1155200",
    "last_updated": null
  },
  {
    "indonesianURN": "3254410",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2338",
    "babName": "Meminta perlindungan dari doa yang tidak didengar",
    "hadithNumber": "5441",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Adam dari Abu Khalid dari Muhammad bin 'Ajlan dari Sa'id dari Abu Hurairah ia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengucapkan: \"ALLAHUMMA INNI A'UUDZU BIKA MIN 'ILMIN LAA YANFA' WA MIN QALBIN LAA YAKHSYA' WA MIN NAFSIN LAA TASYBA' WA MIN DU'AA IN LAA YUSMA' (Ya Allah, aku berlindung kepada-Mu dari ilmu yang tidak bermanfaat, hati yang tidak khusyu', jiwa yang tidak merasa puas dan doa yang tidak didengar).\" Abu Abdurrahman berkata; \"Sa'id belum pernah mendengarnya dari Abu Hurairah, tetapi ia mendengar dari saudaranya, dari Abu Hurairah.\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "109",
    "matchingArabicURN": "1155210",
    "last_updated": null
  },
  {
    "indonesianURN": "3254420",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2338",
    "babName": "Meminta perlindungan dari doa yang tidak didengar",
    "hadithNumber": "5442",
    "hadithText": "Telah mengabarkan kepada kami Ubaidullah bin Fadlalah bin Ibrahim ia berkata; telah memberitakan kepada kami Yahya yaitu Ibnu Yahya ia berkata; telah memberitakan kepada kami Al Laits bin Sa'd dari Sa'id bin Abu Sa'id dari saudaranya 'Abbad bin Abu Sa'id bahwa ia mendengar Abu Hurairah berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa mengucapkan: \"ALLAHUMMA INNI A'UUDZU BIKA MIN 'ILMIN LAA YANFA' WA MIN QALBIN LAA YAKHSYA' WA MIN NAFSIN LAA TASYBA' WA MIN DU'AA IN LAA YUSMA' (Ya Allah, aku berlindung kepada-Mu dari ilmu yang tidak bermanfaat, hati yang tidak khusyu', jiwa yang tidak merasa puas dan doa yang tidak didengar).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "110",
    "matchingArabicURN": "1155220",
    "last_updated": null
  },
  {
    "indonesianURN": "3254430",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2339",
    "babName": "Meminta perlindungan dari doa yang yang takj dikabulkan",
    "hadithNumber": "5443",
    "hadithText": "Telah mengabarkan kepada kami Washil bin Abdul A'la dari Ibnu Fudlail dari Ashim bin Sulaiman dari Abdullah Ibnul Harits ia berkata; Jika dikatakan kepada Zaid bin Arqam; \"Ceritakanlah kepada kami hadits yang engkau dengar dari Rasulullah shallallahu 'alaihi wasallam!.\" Maka ia berkata; \"Aku tidak akan menceritakan kepada kalian kecuali sesuatu yang Rasulullah shallallahu 'alaihi wasallam ceritakan dan beliau memerintahkan kepada kami (untuk mengucapkan): \"ALLAHUMMA INNI A'UUDZU BIKA MINAL 'AJZI WAL KASALI WAL BUKHLI WAL JUBNI WAL HARAMI WA 'ADZAABIL QABRI. ALLAHUMMA AATI NAFSII TAQWAAHAA WA ZAKKIHAA ANTA KHAIRU MAN ZAKKAHAA ANTA WALIYYUHAA WA MAULAAHAA. ALLAHUMMA INNI A'UUDZU BIKA MIN NAFSIN LAA TASYBA' WA MIN QALBIN LAA YAKHSYA' WA MIN 'ILMIN LAA YANFA' WA DA'WATIN LAA TUSTAJAABU (Ya Allah, aku berlindung kepada-Mu dari kelemahan, kemalasan, sifat kikir, pengecut, pikun dan siksa kubur. Ya Allah, berilah ketakwaan kepada jiwaku, bersihkanlah ia karena Engkau adalah sebaik-baik yang membersihkannya. Engkau Pengatur dan Pemiliknya. Ya Allah, aku berlindung kepada-Mu dari jiwa yang tidak pernah merasa puas, hati yang tidak khusyu', ilmu yang tidak bermanfaat dan doa yang tidak didengar).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "111",
    "matchingArabicURN": "1155230",
    "last_updated": null
  },
  {
    "indonesianURN": "3254440",
    "collection": "nasai",
    "volumeNumber": "1",
    "bookNumber": "50",
    "bookName": "Meminta perlindungan",
    "babNumber": "2339",
    "babName": "Meminta perlindungan dari doa yang yang takj dikabulkan",
    "hadithNumber": "5444",
    "hadithText": "Telah mengabarkan kepada kami Muhammad bin Basysyar ia berkata; telah menceritakan kepada kami Abdurrahman ia berkata; telah menceritakan kepada kami Sufyan dari Manshur dari Asy Sya'bi dari Ummu Salamah ia berkata; \"Nabi shallallahu 'alaihi wasallam jika ingin keluar rumah membaca: \"BISMILLAHI RABBI A'UUDZU BIKA MIN AN AZILLA AU ADILLA AU AZHLIMA AU IZHLAMA AU AJHALA AU YUJHALA 'ALAYYA (Dengan menyebut nama Allah, ya Tuhanku! Aku berlindung kepada-Mu dari keterpelesetan, tersesat, berlaku zhalim atau terzhalimi, berlaku bodoh atau dibodohi).\"</b>",
    "bookID": "50.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "112",
    "matchingArabicURN": "1155240",
    "last_updated": null
  }
]