[
  {
    "indonesianURN": "3016790",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "14",
    "bookName": "Hajji",
    "babNumber": "1087",
    "babName": "Jika orang umrah tertahan",
    "hadithNumber": "1679",
    "hadithText": "Telah menceritakan kepada kami 'Abdullah bin Yusuf telah mengabarkan kepada kami Malik dari Nafi' bahwa 'Abdullah bin 'Umar radliallahu 'anhu ketika berangkat menuju Makkah untuk menunaikan 'umrah pada zaman timbulnya fitnah (kekacauan) dia berkata: \"Jika aku dihalangi dari (ber'ibadah) di Baitullah, maka aku akan melaksanakan 'ibadah 'umrah ini sebagaimana kami pernah melaksanakannya bersama Rasulullah shallallahu 'alaihi wasallam\". Maka dia berihram untuk 'umrahnya dengan mencontoh Rasulullah shallallahu 'alaihi wasallam yang pernah berihram untuk 'umrah pada tahun perjanjian Hudaibiyah.</b>",
    "bookID": "14.3",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "117130",
    "last_updated": null
  },
  {
    "indonesianURN": "3016810",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "14",
    "bookName": "Hajji",
    "babNumber": "1087",
    "babName": "Jika orang umrah tertahan",
    "hadithNumber": "1681",
    "hadithText": "Telah menceritakan kepada kami Muhammad berkata, telah menceritakan kepada kami Yahya bin Shalih telah menceritakan kepada kami Mu'awiyah bin Salam telah menceritakan kepada kami Yahya bin Abu Katsir dari 'Ikrimah berkata, Ibnu 'Abbas radliallahu 'anhuma berkata: Rasulullah Shallallahu'alaihi shallallahu 'alaihi wasallam pernah terhalang melaksanakan haji, maka Beliau mencukur rambut Beliau, mendatangi isterinya dan menyembelih hewan korban. Beliau baru ber'umrah pada tahun berikutnya.</b>",
    "bookID": "14.3",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "117160",
    "last_updated": null
  },
  {
    "indonesianURN": "3016820",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "14",
    "bookName": "Hajji",
    "babNumber": "1088",
    "babName": "Tertahan dari pelaksanaan haji",
    "hadithNumber": "1682",
    "hadithText": "Telah menceritakan kepada kami Ahmad bin Muhammad telah mengabarkan kepada kami 'Abdullah telah mengabarkan kepada kami Yunus dari Az Zuhriy berkata, telah mengabarkan kepada saya Salim berkata; Ibnu'Umar radliallahu 'anhuma berkata: \"Tidak cukupkah bagi kalian sunnah Rasulullah shallallahu 'alaihi wasallam apabila seorang dari kalian terhalang melaksanakan haji, maka hendaklah dia thawaf di Ka'bah Baitullah lalu sa'iy antara bukit Shafaa dan Marwah kemudian bertahallul dari segala sesuatu hingga dia melaksanakan hajinya pada tahun berikutnya, dan dia menyembelih hewan qurban atau shaum jika tidak membawa hewan qurban?\". Dan dari 'Abdullah telah mengabarkan kepada kami Ma'mar dari Az Zuhri berkata, telah menceritakan kepada saya Salim dari Ibnu'Umar radliallahu 'anhuma seperti hadits ini\".</b>",
    "bookID": "14.3",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "117171",
    "last_updated": null
  },
  {
    "indonesianURN": "3016830",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "14",
    "bookName": "Hajji",
    "babNumber": "1089",
    "babName": "Berkurban sebelum mencukur saat terjadi pengepungan",
    "hadithNumber": "1683",
    "hadithText": "Telah menceritakan kepada kami Mahmud telah menceritakan kepada kami 'Abdur Razzaq telah mengabarkan kepada kami Ma'mar dari Az Zuhriy dari 'Urwah dari Al Miswar radliallahu 'anhu bahwa Rasulullah shallallahu 'alaihi wasallam menyembelih hewan qurban sebelum mencukur rambut lalu memerintahkan para sahabat Beliau melakukan hal yang sama.</b>",
    "bookID": "14.3",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "117190",
    "last_updated": null
  },
  {
    "indonesianURN": "3016840",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "14",
    "bookName": "Hajji",
    "babNumber": "1089",
    "babName": "Berkurban sebelum mencukur saat terjadi pengepungan",
    "hadithNumber": "1684",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin 'Abdurrahim telah mengabarkan kepada kami Abu Badar Suja' dari 'Umar bin Muhammad Al 'Umariy berkata; dan Nafi' telah menceritakan bahwa 'Abdullah dan Salim keduanya berbicara kepada 'Abdullah bin 'Umar radliallahu 'anhuma, maka dia ('Abdullah bin 'Umar radliallahu 'anhu) berkata: \"Kami pernah keluar bersama Nabi shallallahu 'alaihi wasallam untuk melaksanakan 'umrah lalu orang-orang Kafir Quraisy menghalangi kami dari Baitullah. Maka Rasulullah shallallahu 'alaihi wasallam menyembelih hewan sembelihannya lalu mencukur rambut Beliau\".</b>",
    "bookID": "14.3",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "117200",
    "last_updated": null
  },
  {
    "indonesianURN": "3016850",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "14",
    "bookName": "Hajji",
    "babNumber": "1090",
    "babName": "Pendapat yang mengatakan \"Bagi orang yang tertahan tidak ada badal (pengganti)…\"",
    "hadithNumber": "1685",
    "hadithText": "Telah menceritakan kepada kami Isma'il berkata, telah menceritakan kepada saya Malik dari Nafi' bahwa 'Abdullah bin 'Umar radliallahu 'anhu berkata, ketika dia hendak berangkat melaksanakan 'umrah saat terjadinya fitnah: Jika aku dihalang-halangi dari Baitullah, kami akan melakukan seperti yang dilakukan Rasulullah shallallahu 'alaihi wasallam, yaitu aku akan berihram untuk 'umrah karena Nabi shallallahu 'alaihi wasallam pernah berihram untuk 'umrah pada tahun perjanjian Hudaibiyah\" Kemudian 'Abdullah bin 'Umar radliallahu 'anhu memandang bahwa urusan keduanya (haji dan 'umrah) tidak lain kecuali satu. Lalu dia mendatangi para shahabatnya seraya berkata: \"Aku bersaksi kepada kalian bahwa aku telah meniatkan hajiku ini bersama 'umrah\". Maka dia thawaf untuk keduanya (haji dan 'umrah) dengan satu thawaf dan memandang bahwa hal itu sudah memadai lalu dia berqurban.</b>",
    "bookID": "14.3",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "117220",
    "last_updated": null
  },
  {
    "indonesianURN": "3016860",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "14",
    "bookName": "Hajji",
    "babNumber": "1091",
    "babName": "Firman Allah \"...Jika ada di antaramu yang sakit atau ada gangguan di kepalanya (lalu ia bercukur), ",
    "hadithNumber": "1686",
    "hadithText": "Telah menceritakan kepada kami 'Abdullah bin Yusuf telah mengabarkan kepada kami Malik dari Humaid bin Qais dari Mujahid dari 'Abdurrahman bin Abu Laila dari Ka'ab bin 'Ujrah radliallahu 'anhu dari Rasulullah shallallahu 'alaihi wasallam bahwa Beliau berkata: \"Barangkali kamu terkena serangga (kutu di kepala)?\". Dia menjawab: \"Benar, wahai Rasulullah\". Maka Rasulullah shallallahu 'alaihi wasallam berkata: \"Cukurlah rambutmu, lalu shaum tiga hari atau berilah makan enam orang miskin atau berqurban dengan seekor kambing\".</b>",
    "bookID": "14.3",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "117230",
    "last_updated": null
  },
  {
    "indonesianURN": "3016870",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "14",
    "bookName": "Hajji",
    "babNumber": "1092",
    "babName": "Firman Allah \"...atau bersedekah..\" yaitu memberi makan enam puluh orang miskin",
    "hadithNumber": "1687",
    "hadithText": "Telah menceritakan kepada kami Abu Nu'aim telah menceritakan kepada kami Sayf berkata, telah menceritakan kepada saya Mujahid berkata, aku mendengar 'Abdurrahman bin Abu Laila bahwa Ka'ab bin 'Ujrah radliallahu 'anhu berkata: \"Rasulullah shallallahu 'alaihi wasallam menghampiriku di Hudaibiyah ketika kepalaku dipenuhi kutu, Beliau berkata: \"Barangkali kamu terkena serangga (kutu di kepala)?\". Aku jawab: \"Benar, wahai Rasulullah\". Maka Beliau berkata: \"Cukurlah rambutnu\". Atau dia berkata: \"Ayat ini turun untukku\" (QS Al Baqarah ayat 196 yang artinya): (\"....Maka barangsiapa dari kalian yang sakit atau tertimpa sesuatu pada kepalanya...) hingga akhir ayat. Maka Nabi shallallahu 'alaihi wasallam berkata: \"Laksanakanlah shaum tiga hari atau bershadaqah sebanyak faraq (tiga sha') terhadap enam orang atau berqurban dengan yang mudah buatmu\".</b>",
    "bookID": "14.3",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "117240",
    "last_updated": null
  },
  {
    "indonesianURN": "3016880",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "14",
    "bookName": "Hajji",
    "babNumber": "1093",
    "babName": "Memberi makan sebagai fidyah adalah setengah sha'",
    "hadithNumber": "1688",
    "hadithText": "Telah menceritakan kepada kami Abu Al Walid telah menceritakan kepada kami Syu'bah dari 'Abdurrahman bin Al Ashbahaniy dari 'Abdullah bin Aku mendengar 'qil berkata; 'Aku duduk dekat dengan Ka'ab bin 'Ujrah radliallahu 'anhu lalu aku bertanya kepadanya tentang fidyah, maka dia menawab: \"Ayat itu turun untukku secara khusus dan buat kalian secara umum, yaitu aku pernah dibawa kepada Rasulullah shallallahu 'alaihi wasallam sementara wajahku banyak dipenuhi kutu, maka Beliau berkata: \"Mengapa aku melihat kamu dalam keadaan sakit sedemikian parah yang belum pernah aku lihat sebelumnya? dan mengapa aku melihat kamu dalam keadaan kepayahan sedemikian memuncak yang belum pernah aku lihat sebelumnya? apakah kamu memiliki kambing?\". Aku jawab: \"Benar\". Maka Beliau berkata: \"Laksanakanlah shaum tiga hari atau berilah makan enam orang miskin yang untuk setiap satu orang miskin sebanyak setengah sha'\".</b>",
    "bookID": "14.3",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "117250",
    "last_updated": null
  },
  {
    "indonesianURN": "3016900",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "14",
    "bookName": "Hajji",
    "babNumber": "1095",
    "babName": "Firman Allah \"...maka tidak boleh rafats …\"",
    "hadithNumber": "1690",
    "hadithText": "Telah menceritakan kepada kami Sulaiman bin Harb telah menceritakan kepada kami Syu'bah dari Manshur aku mendengar Abu Hazim dari Abu Hurairah radliallahu 'anhu berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang menunaikan haji di Baitullah ini kemudian tidak berkata, -kata kotor dan tidak berbuat fasiq maka bila dia kembali keadaannya seperti saat dilahirkan oleh ibunya\".</b>",
    "bookID": "14.3",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "117280",
    "last_updated": null
  },
  {
    "indonesianURN": "3016910",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "14",
    "bookName": "Hajji",
    "babNumber": "1096",
    "babName": "Firman Allah \"...berbuat fasik dan berbantah bantahan di dalam masa mengerjakan haji…\"",
    "hadithNumber": "1691",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Yusuf telah menceritakan kepada kami Sufyan dari Manshur dari Abu Hazim dari Abu Hurairah radliallahu 'anhu berkata, Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang menunaikan haji di Baitullah ini kemudian tidak berkata-kata kotor dan tidak berbuat fasiq maka bila dia kembali keadaannya seperti saat dilahirkan oleh ibunya\".</b>",
    "bookID": "14.3",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "117290",
    "last_updated": null
  },
  {
    "indonesianURN": "3016801",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "14",
    "bookName": "Hajji",
    "babNumber": "1087",
    "babName": "Jika orang umrah tertahan",
    "hadithNumber": "1680",
    "hadithText": "Telah menceritakan kepada kami 'Abdullah bin Muhammad bin Asma' telah menceritakan kepada kami Juwairiyah dari Nafi' bahwa 'Ubaidullah bin 'Abdullah dan Salim bin 'Abdullah keduanya mengabarkan kepadanya bahwa keduanya pernah berbicara dengan 'Abdullah bin 'Umar radliallahu 'anhu pada suatu malam saat datangnya pasukan Ibnu Az Zubair. Keduanya berkata: \"Tidak memberikan madharat kepadamu seandainya kamu tidak menunaikan haji pada tahun ini karena kami khawatir akan terjadi penghalangan buatmu menuju Baitullah\". Maka 'Abdullah bin 'Umar radliallahu 'anhu berkata: \"Kami pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam lalu Kafir Quraisy menghalangi kami dari Baitullah. Kemudian Nabi shallallahu 'alaihi wasallam menyembelih hewan qurban dan mencukur rambut Beliau. Dan aku bersaksi kepada kalian bahwa aku telah mewajibkan (berniat untuk) 'umrah ini, dan insya Allah aku akan berangkat. Jika aku diberi kebebasan, aku akan laksanakan thawaf di Baitullah, namun bila aku dihalangi, aku akan melaksanakan sebagaimana Nabi shallallahu 'alaihi wasallam pernah melaksanakannya yang saat itu aku bersama Beliau yang berihram untuk 'umrah dari Dzul Hulaifah kemudian berjalan sesaat lalu berkata: \"Sesungguhnya pelaksanaan haji dan 'umrah satu. Dan aku bersaksi kepada kalian bahwa aku telah mewajibkan diriku untuk berihram haji bersama 'umrahku\". Dan Beliau tidak bertahallul dari keduanya hingga Beliau bertahallul pada hari Nahar sesaat setelah menyembelih hewan qurban\". Dan dia 'Abdullah bin 'Umar radliallahu 'anhu berkata: \"Beliau tidak bertahallul ketika menyelesaikan thawaf yang satu pada hari memasuki Makkah\".</b>",
    "bookID": "14.3",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "117140",
    "last_updated": null
  },
  {
    "indonesianURN": "3016802",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "14",
    "bookName": "Hajji",
    "babNumber": "1087",
    "babName": "Jika orang umrah tertahan",
    "hadithNumber": "1680",
    "hadithText": "Telah menceritakan kepada saya Musa bin Isma'il telah menceritakan kepada kami Juwairiyah dari Nafi'; Bahwa ada sebagian dari anak-anak 'Abdullah berkata, kepadanya: \"Seandainya kamu menunaikan ini.\"</b>",
    "bookID": "14.3",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "117150",
    "last_updated": null
  },
  {
    "indonesianURN": "3016891",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "14",
    "bookName": "Hajji",
    "babNumber": "1094",
    "babName": "Kurban dengan satu kambing",
    "hadithNumber": "1689",
    "hadithText": "Telah menceritakan kepada kami Ishaq telah menceritakan kepada kami Rauh telah menceritakan kepada saya Syibil dari Ibnu Abu Najih dari Mujahid berkata, telah menceritakan kepada saya 'Abdurrahman bin Abu Laila dari Ka'ab bin 'Ujrah radliallahu 'anhu bahwa Rasulullah shallallahu 'alaihi wasallam melihatnya sedang pada wajahnya banyak berjatuhan serangga. Beliau bertanya: \"Barangkali kamu terkena serangga (kutu di kepala)?\". Dia menjawab: \"Benar\". Maka Beliau memerintahkannya agar mencukur rambutnya. Saat itu Beliau sedang berada di Hudaibiyah dan belum menjelaskan kepada mereka bahwa mereka harus bertahallul disana sedangkan Beliau sangat ingin agar mereka dapat memasuki Makkah. Maka Allah menurunkan ayat tentang fidyah. Maka Rasulullah shallallahu 'alaihi wasallam memerintahkannya agar bershadaqah sebanyak faraq (tiga sha') atau berqurban dengan seekor kambing atau shaum tiga hari.</b>",
    "bookID": "14.3",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "117260",
    "last_updated": null
  },
  {
    "indonesianURN": "3016892",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "14",
    "bookName": "Hajji",
    "babNumber": "1094",
    "babName": "Kurban dengan satu kambing",
    "hadithNumber": "1689",
    "hadithText": "Dan dari Muhammad bin Yusuf telah menceritakan kepada kami Warqa' dari Ibnu Abu Najih dari Mujahid telah mengabarkan kepada kami 'Abdurrahman bin Abu Laila dari Ka'ab bin 'Ujrah radliallahu 'anhu bahwa Rasulullah shallallahu 'alaihi wasallam melihatnya (Ka'ab bin 'Ujrah radliallahu 'anhu) dalam keadaan wajahnya dipenuhi kutu yang berjatuhan, dan terus seperti diatas.</b>",
    "bookID": "14.3",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "117270",
    "last_updated": null
  }
]