[
  {
    "indonesianURN": "3021000",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1349",
    "babName": "Menyewa seseorang yang shalih",
    "hadithNumber": "2100",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Yusuf telah menceritakan kepada kami Sufyan dari Abu Burdah berkata, telah mengabarkan kepada saya kakekku Abu Burdah dari Bapaknya Abu Musa Al Anshariy radliallahu 'anhu berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Bendahara yang terpercaya yang menunaikan tugas yang diembannya dengan baik adalah terhitung salah satu Al Mutashaddiqin (orang yang bersedekah) \".</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "121800",
    "last_updated": null
  },
  {
    "indonesianURN": "3021010",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1349",
    "babName": "Menyewa seseorang yang shalih",
    "hadithNumber": "2101",
    "hadithText": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Yahya dari Qurrah bin Khalid berkata, telah menceritakan kepada saya Humaid bin Hilal telah menceritakan kepada kami Abu Burdah dari Abu Musa radliallahu 'anhu berkata; Aku menghadap menemui Nabi shallallahu 'alaihi wasallam bersama dua orang suku Al Asyariyyin, aku bertanya: \"Apa yang harus aku lakukan bila keduanya mengharapkan pekerjaan?\" Beliau bersabda: \"Sekali-kali jangan atau janganlah engkau memperkerjakan dalam urusan kita ini orang yang berambisi menginginkannya\".</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "121810",
    "last_updated": null
  },
  {
    "indonesianURN": "3021020",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1350",
    "babName": "Mengembala kambing dengan upah beberpa qirath",
    "hadithNumber": "2102",
    "hadithText": "Telah menceritakan kepada kami Ahmad bin Muhammad Al Makkiy telah menceritakan kepada kami 'Amru bin Yahya dari kakeknya dari Abu Hurairah radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam bersabda: \"Tidaklah Allah mengutus seorang Nabi melainkan dia mengembalakan kambing\". Para sahabat bertanya: \"Termasuk engkau juga?\" Maka Beliau menjawab: \"Ya, aku pun mengembalakannya dengan upah beberapa qirat (keping dinar) milik penduduk Makkah\".</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "121820",
    "last_updated": null
  },
  {
    "indonesianURN": "3021030",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1351",
    "babName": "Memperkerjakan orang musyrik dalam kondisi darurat, atau ketika orang-orang Islam tidak ada",
    "hadithNumber": "2103",
    "hadithText": "Telah menceritakan kepada kami Ibrahim bin Musa telah mengabarkan kepada kami Hisyam dari Ma'mar dari Az Zuhriy dari 'Urwah bin Az Zubair dari 'Aisyah radliallahu 'anha: Nabi shallallahu 'alaihi wasallam dan Abu Bakar menyewa seorang dari suku Ad-Dil kemudian dari suku 'Abdi bin 'Adiy sebagai petunjuk jalan dan yang mahir menguasai seluk beluk perjalanan yang sebelumnya dia telah diambil sumpahnya pada keluarga Al 'Ash bin Wa'il dan masih memeluk agama kafir Quraisy. Maka keduanya mempercayakan kepadanya perjalanan keduanya lalu keduanya meminta kepadanya untuk singgah di gua Tsur setelah perjalanan tiga malam. Lalu orang itu meneruskan perjalanan keduanya waktu shubuh malam ketiga, maka keduanya melanjutkan perjalanan dan berangkat pula bersama keduanya 'Amir bin Fuhairah dan petunjuk jalan suku Ad-Diliy tersebut. Maka petunjuk jalan tersebut mengambil jalan dari belakang kota Makkah yaitu menyusuri jalan laut.</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "121830",
    "last_updated": null
  },
  {
    "indonesianURN": "3021040",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1352",
    "babName": "Memperkerjakan seseorang untuk bekerja tiga hari kemudian, sebulan atau setahun kemudian. Dan keduan",
    "hadithNumber": "2104",
    "hadithText": "Telah menceritakan kepada kami Yahya bin Bukair telah menceritakan kepada kami Al Laits dari 'Uqail berkata, Ibnu Syihab telah mengabarkan kepada saya 'Urwah bin Az Zubair bahwa 'Aisyah radliallahu 'anha isteri Nabi shallallahu 'alaihi wasallam berkata: Rasulullah shallallahu 'alaihi wasallam dan Abu Bakar menyewa seorang dari suku Ad-Dil sebagai petunjuk jalan yang dipercaya yang orang itu masih memeluk agama kafir Quraisy. Maka keduanya mempercayakan kepadanya perjalanan keduanya lalu keduanya meminta kepadanya untuk singgah di gua Tsur setelah perjalanan tiga malam.</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "121840",
    "last_updated": null
  },
  {
    "indonesianURN": "3021050",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1353",
    "babName": "Menyewa orang dalam peperangan",
    "hadithNumber": "2105",
    "hadithText": "Telah menceritakan kepada kami Ya'qub bin Ibrahim telah menceritakan kepada kami Isma'il bin 'Ulayyah telah mengabarkan kepada kami Ibnu Juraij berkata, telah mengabarkan kepada saya 'Atha' dari Shafwan bin Ya'laa dari Ya'laa bin Umayyah radliallahu 'anhu berkata; Aku ikut perang dalam pasukan masa paceklik (pasukan perang Tabuk) dan itu merupakan amalku yang paling berkesan dalam jiwaku. Saat itu aku memiliki orang bayaran lalu dia memerangi seorang musuh salah satu diantaranya menggigit jari lawannya hingga jari lawannya putus lalu jatuh. Lalu dia menemui Nabi shallallahu 'alaihi wasallam lalu Beliau tidak menerapkan diyat atau tebusan kepada salah satunya dan bersabda: \"Apakah dia melepaskan jarinya dalam mulutmu?\" Orang itu berkata: \"Aku kira begitu\". Lalu Beliau bersabda: \"Seperti unta mengigitnya\". Berkata, Ibnu Juraij dan telah menceritakan kepada saya 'Abdullah bin Abi Mulaikah dari kakeknya seperti redaksi hadits ini, yang salah seorang menggigit jari lawannya lalu dibebasakan dari segala tuntutan oleh Abu Bakar radliallahu 'anhu.</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "121851",
    "last_updated": null
  },
  {
    "indonesianURN": "3021060",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1354",
    "babName": "Menyewa seseorang untuk menegakkan pagar yang akan roboh,",
    "hadithNumber": "2106",
    "hadithText": "Telah menceritakan kepada kami Ibrahim bin Musa telah mengabarkan kepada kami Hisyam bin Yusuf bahwa Ibnu Juraij mengabarkan mereka berkata, telah mengabarkan kepada saya Ya'laa bin Muslim dan 'Amru bin Dinar dari Sa'id bin Jubair salah satu diantara keduanya menambahkan kepada temannya dan selain keduanya berkata, aku mendengar dia menceritakan dari Sa'id berkata; Berkata, kepadaku Ibnu 'Abbas radliallahu 'anhuma telah menceritakan kepada saya Ubay bin Ka'ab berkata, telah bersabda Rasulullah shallallahu 'alaihi wasallam: \"(Keduanya berangkat lalu mendapatkan dinding yang hampir roboh lalu ditegakkan kembali\"). Berkata, Sa'id: \"Ditegakkan dengan tangannya begini\". Maka Beliau mengangkat tangannya maka dinding itu kembali tegak kokoh\". Ya'laa berkata: \"Aku menduga bahwa Sa'id berkata: Maka diusapnya dinding itu dengan tangannya lalu tegak kembali\". (\"Seandainya engkau mau kamu berhak atas upah\"), Berkata, Sa'id: Upah yang bisa kita nikmati\".</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "121870",
    "last_updated": null
  },
  {
    "indonesianURN": "3021070",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1355",
    "babName": "Menyewa hingga waktu setengah hari",
    "hadithNumber": "2107",
    "hadithText": "Telah menceritakan kepada kami Sulaiman bin Harb telah menceritakan kepada kami Hammad dari Ayyub dari Nafi' dari Ibnu'Umar radliallahu 'anhuma dari Nabi shallallahu 'alaihi wasallam bersabda: \"Perumpamaan kalian dibandingkan Ahul Kitab seperti seseorang yang menyewa para pekerja yang dia berkata; \"Siapa yang mau bekerja untukku dari pagi hingga pertengahan siang dengan upah satu qirath, maka orang-orang Yahudi melaksanakannya. Kemudian dia berkata, \"Siapa yang mau bekerja untukku dari pertengahan siang hingga shalat 'Ashar dengan upah satu qirath, maka orang-orang Nashrani mengerjakannya. Kemudain orang itu berkata, lagi: \"Siapa yang mau bekerja untukku dari 'Ashar hinga terbenamnya matahari dengan upah dua qirath, maka kalianlah orang yang mengerjakannya. Maka orang-orang Yahudi dan Nashrani marah seraya berkata: \"Bagaimana bisa, kami yang mengerjakan lebih banyak pekerjaan namun lebih sedikit upah yang kami terima!\" Lalu orang itu berkata: \"Apakah ada hak kalian yang aku kurangi?\" Mereka menjawab: \"Tidak ada\". Orang itu berkata: \"Itulah karunia dariku yang aku memberikannya kepada siapa yang aku kehendaki\".</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "121880",
    "last_updated": null
  },
  {
    "indonesianURN": "3021080",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1356",
    "babName": "Menyewa seseorang hingga waktu asar",
    "hadithNumber": "2108",
    "hadithText": "Telah menceritakan kepada kami Isma'il bin Abi Uwais berkata, telah menceritakan kepadaku Malik dari 'Abdullah bin Dinar, maula 'Abdullah bin 'Umar dari 'Abdullah bin 'Umar bin Al Khaththab radliallahu 'anhuma bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya perumpamaan kalian dibandingkan orang-orang Yahudi dan Nashrani seperti seseorang yang memperkerjakan para pekerja yang dia berkata; \"Siapa yang mau bekerja untukku hingga pertengahan siang dengan upah satu qirath, maka orang-orang Yahudi melaksanakannya dengan upah satu qirath per satu qirath. Lalu orang-orang Nashrani mengerjakannya dengan upah satu qirath per satu qirath. Kemudian kalian mengerjakan mulai dari shalat 'Ashar hingga terbenamnya matahari dengan upah dua qirath per dua qirath. Maka orang-orang Yahudi dan Nashrani marah seraya berkata: \"Kami yang lebih banyak amal namun lebih sedikit upah!\" Lalu orang itu berkata; \"Apakah ada yang aku zhalimi dari hak kalian?\" Mereka menjawab; \"Tidak ada\". Orang itu berkata; \"Itulah karunia dari-Ku yang Aku memberikannya kepada siapa yang aku kehendaki\".</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "121890",
    "last_updated": null
  },
  {
    "indonesianURN": "3021090",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1357",
    "babName": "Dosa bagi orang yang menahan bayaran buruh",
    "hadithNumber": "2109",
    "hadithText": "Telah menceritakan kepada saya Yusuf bin Muhammad berkata, telah menceritakan kepada saya Yahya bin Sulaim dari Isma'il bin Umayyah dari Sa'id bin Abi Sa'id dari Abu Hurairah radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam bersabda: \"Allah Ta'ala berfirman: Ada tiga jenis orang yag aku berperang melawan mereka pada hari qiyamat, seseorang yang bersumpah atas namaku lalu mengingkarinya, seseorang yang berjualan orang merdeka lalu memakan (uang dari) harganya dan seseorang yang memperkerjakan pekerja kemudian pekerja itu menyelesaikan pekerjaannya namun tidak dibayar upahnya\".</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "121900",
    "last_updated": null
  },
  {
    "indonesianURN": "3021100",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1358",
    "babName": "Menyewa dari waktu asar hingga malam hari",
    "hadithNumber": "2110",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Al 'Alaa' telah menceritakan kepada kami Abu Usamah dari Buraid dari Abu Burdah dari Abu Musa radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam bersabda: \"Perumpamaan Kaum Muslimin dibandingkan orang-orang Yahudi dan Nashrani seperti seseorang yang memperkerjakan kaum yang bekerja untuknya pada suatu hari hingga malam dengan upah yang ditentukan. Maka diantara mereka ada yang melaksanakan pekerjaan hingga pertengahan siang lalu berkata: Kami tidak memerlukan upah darimu sebagaimana yang kamu persyaratkan kepada kami (bekerja hingga malam) dan apa yang telah kami kerjakan biarlah nggak apa-apa\". Maka orang itu berkata: \"Selesaikanlah sisa pekerjaan, nanti baru kalian boleh mengambil upahnya dengan penuh\". Maka mereka tidak mau dan tidak melanjutkan pekerjaan mereka. Kemudian dia memperkerjakan dua orang pekerja setelah mereka untuk menuntaskan sisa pekerjaan dan berkata, kepada keduanya: \"Selesaikanlah sisa waktu hari kalian ini dan bagi kalian berdua akan mendapatkan upah sebagaimana yang aku syaratkan kepada mereka. Maka mereka berdua mengerjakannya hingga ketika sampai saat shalat 'Ashar, keduanya berkata, \" Tidaklah yang kami telah kerjakan sia-sia dan kamu wajib membayar upah seperti yang kamu janjikan kepada kami berdua\". Maka orang itu berkata, kepada keduanya: \"Selesaikanlah sisa pekerjaan kalian berdua yang tidak sampai separuh hari ini\". Namun kedua orang itu enggan melanjutkannya. Lalu orang itu memperkerjakan suatu kaum yang mengerjakan sisa hari. Maka kaum itu mengerjakan sisa pekerjaan hingga terbenam matahari dan mereka mendapatkan upah secara penuh termasuk upah dari pekerjaan yang sudah dikerjakan oleh dua golongan orang sebelum mereka. Itulah perumpamaan mereka dan mereka ang menerima cahaya (Islam) ini\".</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "121910",
    "last_updated": null
  },
  {
    "indonesianURN": "3021110",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1359",
    "babName": "Seseorang menyewa pekerja, lalu pekerja tersebut meninggalan bayarannya. Kemudian pihak penyewa meng",
    "hadithNumber": "2111",
    "hadithText": "Telah menceritakan kepada kami Abu Al Yaman telah mengabarkan kepada kami Syu'aib dari Az Zuhriy telah menceritakan kepada saya Salim bin 'Abdullah bahwa 'Abdullah bin 'Umar radliallahu 'anhuma berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada tiga orang dari kalangan orang sebelum kalian yang sedang bepergian hingga ketika mereka singgah dalam gua lalu mereka memasuki gua tersebut hingga akhirnya ada sebuah batu yang jatuh dari gunung hingga metutupi gua. Mereka berkata; Tidak akan ada yang dapat menyelamatkan kalian dari batu ini kecuali bila kalian berdoa meminta kepada Allah dengan perantaraan kebaikan amal kalian. Maka seorang diantara mereka berkata; \"Ya Allah, aku memiliki kedua orangtua yang sudah renta. Dan aku tidaklah pernah memberi minum susu keluargaku pada akhir siang sebelum keduanya. Suatu hari aku keluar untuk mencari sesuatu dan aku tidak beristirahat mencarinya hingga keduanya tertidur, aku pulang namun aku dapati keduanya sudah tertidur dan aku tidak mau mendahului keduanya meminum susu untuk keluargaku. Maka kemudian aku terlena sejenak dengan bersandar kepada kedua tanganku sambil aku menunggu keduanya bangun sampai fajar terbit, lalu keduanya terbangun dan meminum susu jatah akhir siangnya. Ya Allah seandainya aku kerjakan itu semata mencari ridhoMu, maka bukakanlah celah batu ini. Maka batu itu sedikit bergeser namun mereka belum dapat keluar. Nabi shallallahu 'alaihi wasallam berkata: Kemudian berkata, yang lain: \"Ya Allah, bersamaku ada putri pamanku yang menjadi orang yang paling mencintaiku. Suatu hari aku menginginkannya namun dia menolak aku. Kemudian berlalu masa beberapa tahun hingga kemudian dia datang kepadaku lalu aku berikan dia seratus dua puluh dinar agar aku dan dia bersenang-senang lalu dia setuju hiingga ketika aku sudah menguasainya dia berkata; tidak dihalalkan bagimu merusak keperawanan kecuali dengan cara yang haq. Maka aku selamat dari kejadian itu. Lalu aku pergi meninggalkannya padahal dia wanita yang paling aku cintai dan aku tinggalkan pula emas perhiasan yang aku berikan kepadanya. Ya Allah seandainya apa yang aku kerjakan itu semata mencari ridhoMu, maka bukakanlah celah pintu gua ini dimana kami terjebak didalamnya. Maka terbukalah sedikit batu itu namun mereka tetap belum bisa keluar. Bersabda Nabi shallallahu 'alaihi wasallam: Kemudian orang yang ketiga berkata: Ya Allah aku pernah memperkerjakan orang-orang lalu aku memberi upah mereka kecuali satu orang dari mereka yang meninggalkan haknya lalu dia pergi. Kemudian upah orang tersebut aku kembangkan hingga beberapa waktu kemudian ketika sudah banyak harta dari hasil yang aku kembangkan tersebut orang itu datang kepadaku lalu berkata; \"wahai 'Abdullah, berikanlah hak upah saya!\" Lalu aku katakan kepadanya; Itulah semua apa yang kamu lihat adalah upahmu berupa unta, sapi, kambing dan pengembalanya\". Dia berkata; \"wahai 'Abdullah, kamu jangan mengolok-olok aku!\" Aku katakan: Aku tidak mengolok-olok!\" Maka orang itu mengambil seluruhnya dan tidak ada yang disisakan sedikitpun. Ya Allah seandainya apa yang aku kerjakan itu semata mencari ridhoMu, maka bukakanlah celah batu gua yang kami terjebak didalamnya\". Maka batu itu terbuka akhirnya mereka dapat keluar dan pergi\".</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "121920",
    "last_updated": null
  },
  {
    "indonesianURN": "3021120",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1360",
    "babName": "Orang yang menyewa untuk dirinya sendiri untuk memikul di atas punggungnya, lalu ia mensedekahkannya",
    "hadithNumber": "2112",
    "hadithText": "Telah menceritakan kepada kami Sa'id bin Yahya bin Sa'id Al Qurasyiy telah menceritakan kepada kami bapakku telah menceritakan kepada kami Al A'masy dari Syaqiq dari Abu Mas'ud Al Anshariy radliallahu 'anhu berkata: \"Adalah Nabi shallallahu 'alaihi wasallam bila memerintahkan kami bershadaqah, maka seseorang dari kami akan berangkat menuju pasar lalu dia bekerja dengan sungguh-sungguh hingga mendapatkan rezeki satu mud. Ada sebagian dari mereka bisa mendapatkan seratus ribu kalinya\". Dia berkata: \"Tidaklah kamu melihatnya melainkan adalah dirinya sendiri\".</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "121930",
    "last_updated": null
  },
  {
    "indonesianURN": "3021130",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1361",
    "babName": "Upah makelar",
    "hadithNumber": "2113",
    "hadithText": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami 'Abdul Wahid telah menceritakan kepada kami Ma'mar dari Ibnu Thowus dari bapaknya dari Ibnu 'Abbas radliallahu 'anhuma; Rasulullah shallallahu 'alaihi wasallam melarang menyongsong (mencegat) kafilah dagang (sebelum mereka tahu harga di pasar) dan melarang pula orang kota menjual kepada orang desa. Aku bertanya kepada Ibnu 'Abbas radliallahu 'anhuma: \"Apa arti sabda Beliau \" dan janganlah orang kota menjual kepada orang desa \". Dia menjawab: \"Janganlah seseorang jadi perantara bagi orang kota\".</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "121940",
    "last_updated": null
  },
  {
    "indonesianURN": "3021140",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1362",
    "babName": "Apakah seseorang boleh menyewakan dirinya untuk orang musyrik di wilayah perang?",
    "hadithNumber": "2114",
    "hadithText": "Telah menceritakan kepada kami 'Umar bin Hafsh telah menceritakan kepada kami bapakku telah menceritakan kepada kami Al A'masy dari Muslim dari Masruq telah menceritakan kepada kami Khabbab berkata: \"Pada masa Jahiliyyah aku adalah seorang tukang besi dan emas lalu aku bekerja pada Al 'Ash bin Wa'il lalu upahku aku kumpulkan kepadanya kemudian aku menagih agar dia membayarnya. Dia berkata: \"Demi Allah, aku tidak akan membayarnya kepadamu kecuali kamu mau mengingkari (kufur) Muhammad shallallahu 'alaihi wasallam \". Aku katakan: \"Adapun aku, demi Allah tidak akan kufur sampai kamu mati lalu kamu dibangkitkan. Dia berkata: \"Biarkanlah aku sampai aku mati lalu dibangkitkan\". Aku katakan: Baik kalau begitu\". Dia berkata: \"Sungguh aku akan mendapatkan harta dan anak lalu aku akan bayar hutang kepadamu\". Maka Allah Ta'ala menurunkan QS Maryam ayat yang artinya: (\" Maka apakah kamu telah melihat orang yang kafir kepada ayat-ayat kami dan ia mengatakan \"pasti Aku akan diberi harta dan anak\") (QS. Maryam 77).</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "121950",
    "last_updated": null
  },
  {
    "indonesianURN": "3021150",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1363",
    "babName": "Sesuatu yang diberikan karena sebab meruqyah beberapa suku Arab dengan bacaan Al Fatihah",
    "hadithNumber": "2115",
    "hadithText": "Telah menceritakan kepada kami Abu An-Nu'man telah menceritakan kepada kami Abu 'Awanah dari Abu Bisyir dari Abu Al Mutawakkil dari Abu Sa'id radliallahu 'anhu berkata; Ada rombongan beberapa orang dari sahabat Nabi shallallahu 'alaihi wasallam yang bepergian dalam suatu perjalanan hingga ketika mereka sampai di salah satu perkampungan Arab penduduk setempat mereka meminta agar bersedia menerima mereka sebagai tamu peenduduk tersebut namun penduduk menolak. Kemudian kepala suku kampung tersebut terkena sengatan binatang lalu diusahakan segala sesuatu untuk menyembuhkannya namun belum berhasil. Lalu diantara mereka ada yang berkata: \"Coba kalian temui rambongan itu semoga ada diantara mereka yang memiliki sesuatu. Lalu mereka mendatangi rambongan dan berkata: \"Wahai rambongan, sesunguhnya kepala suku kami telah digigit binatang dan kami telah mengusahakan pengobatannya namun belum berhasil, apakah ada diantara kalian yang dapat menyembuhkannya?\" Maka berkata, seorang dari rambongan: \"Ya, demi Allah aku akan mengobati namun demi Allah kemarin kami meminta untuk menjadi tamu kalian namun kalian tidak berkenan maka aku tidak akan menjadi orang yang mengobati kecuali bila kalian memberi upah. Akhirnya mereka sepakat dengan imbalan puluhan ekor kambing. Maka dia berangkat dan membaca Alhamdulillah rabbil 'alamiin (QS Al Fatihah) seakan penyakit lepas dari ikatan tali padahal dia pergi tidak membawa obat apapun. Dia berkata: \"Maka mereka membayar upah yang telah mereka sepakati kepadanya. Seorang dari mereka berkata: \"Bagilah kambing-kambing itu!\" Maka orang yang mengobati berkata: \"Jangan kalain bagikan hingga kita temui Nabi shallallahu 'alaihi wasallam lalu kita ceritakan kejadian tersebut kepada Beliau shallallahu 'alaihi wasallam dan kita tunggu apa yang akan Beliau perintahkan kepada kita\". Akhirnya rombongan menghadap Rasulullah shallallahu 'alaihi wasallam lalu mereka menceritakan peristiwa tersebut. Beliau berkata: \"Kamu tahu dari mana kalau Al Fatihah itu bisa sebagai ruqyah (obat)?\" Kemudian Beliau melanjutkan: \"Kalian telah melakukan perbuatan yang benar, maka bagilah upah kambing-kambing tersebut dan masukkanlah aku dalam sebagai orang yangmenerima upah tersebut\". Maka Rasulullah shallallahu 'alaihi wasallam tertawa. Abu 'Abdullah Al Bukhariy berkata, dan berkata, Syu'bah telah menceritakan kepada kami Abu Bisyir aku mendengar Abu Al Mutawakkil seperti hadits ini.</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "121960",
    "last_updated": null
  },
  {
    "indonesianURN": "3021160",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1364",
    "babName": "Pajak pendapatan budak dan perjanjian dengan budak  wanita",
    "hadithNumber": "2116",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Yusuf telah menceritakan kepada kami Sufyan dari Humaid Ath-Thowil dari Anas bin Malik radliallahu 'anhu berkata; Rasulullah shallallahu 'alaihi wasallam pernah dibekam oleh Abu Thoyyibah lalu Beliau memberi upah kepadanya dengan satu sha' atau dua sha' makanan dan berbicara kepada penarik pajaknya untuk meringankan pajaknya.</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "17",
    "matchingArabicURN": "121970",
    "last_updated": null
  },
  {
    "indonesianURN": "3021170",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1365",
    "babName": "Pendapatan tukang bekam",
    "hadithNumber": "2117",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Wuhaib telah menceritakan kepada kami Ibnu Thowus dari bapaknya dari Ibnu 'Abbas radliallahu 'anhuma berkata; Nabi shallallahu 'alaihi wasallam berbekam dan memberi upah tukang bekamnya.</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "18",
    "matchingArabicURN": "121980",
    "last_updated": null
  },
  {
    "indonesianURN": "3021180",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1365",
    "babName": "Pendapatan tukang bekam",
    "hadithNumber": "2118",
    "hadithText": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Yazid bin Zurai' dari Khalid dari 'Ikrimah dari Ibnu 'Abbas radliallahu 'anhuma berkata; Nabi shallallahu 'alaihi wasallam berbekam dan memperi upah tukang bekamnya. Seandainya Beliau mengetahui bahwa berbekam makruh tentu Beliau tidak memberi upah.</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "19",
    "matchingArabicURN": "121990",
    "last_updated": null
  },
  {
    "indonesianURN": "3021190",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1365",
    "babName": "Pendapatan tukang bekam",
    "hadithNumber": "2119",
    "hadithText": "Telah menceritakan kepada kami Abu Nu'aim telah menceritakan kepada kami Mis'ar dari 'Amru bin 'Amir berkata; Aku mendengar Anas radliallahu 'anhu berkata; Nabi shallallahu 'alaihi wasallam berbekam dan Beliau tidak pernah menzhalimi upah seorangpun.</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "20",
    "matchingArabicURN": "122000",
    "last_updated": null
  },
  {
    "indonesianURN": "3021200",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1366",
    "babName": "Orang yang berbicara kepada majikan budak agar mereka meringankan pajak pendapatan budaknya",
    "hadithNumber": "2120",
    "hadithText": "Telah menceritakan kepada kami Adam telah menceritakan kepada kami Syu'bah dari Humaid Ath-Thowil dari Anas bin Malik radliallahu 'anhu berkata; Rasulullah shallallahu 'alaihi wasallam memanggil seorang budak tukang bekam. Maka dia membekam Bel; iau dan Beliau memberi satu sha' atau dua sha atau satu mud atau dua mud dan berpesan agar pajaknya diringankan.</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "21",
    "matchingArabicURN": "122010",
    "last_updated": null
  },
  {
    "indonesianURN": "3021210",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1367",
    "babName": "Profesi pelacur, dan budak perempuan",
    "hadithNumber": "2121",
    "hadithText": "Telah menceritakan kepada kami Qutaibah bin Sa'id dari Malik dari Ibnu Syihab dari Abu Bakar bin 'Abdurrahman bin Al Harits bin Hisyam dari Abu Mas'ud Al Anshariy radliallahu 'anhu bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang uang hasil jual beli anjing, mahar seorang pezina dan upah bayaran dukun.</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "22",
    "matchingArabicURN": "122020",
    "last_updated": null
  },
  {
    "indonesianURN": "3021220",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1367",
    "babName": "Profesi pelacur, dan budak perempuan",
    "hadithNumber": "2122",
    "hadithText": "Telah menceritakan kepada kami Muslim bin Ibrahim telah menceritakan kepada kami Syu'bah dari Muhammad bin Juhadah dari Abu Hazim dari Abu Hurairah radliallahu 'anhu berkata; Nabi shallallahu 'alaihi wasallam telah melarang uang bayaran zina.</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "23",
    "matchingArabicURN": "122030",
    "last_updated": null
  },
  {
    "indonesianURN": "3021230",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1368",
    "babName": "Hasil kelamin hewan jantan",
    "hadithNumber": "2123",
    "hadithText": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami 'Abdul Warits dan Isma'il bin Ibrahim dari 'Ali bin Al Hakam dari Nafi' dari Ibnu'Umar radliallahu 'anhuma berkata; Nabi shallallahu 'alaihi wasallam telah melarang uang bayaran zina.</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "24",
    "matchingArabicURN": "122040",
    "last_updated": null
  },
  {
    "indonesianURN": "3021240",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "21",
    "bookName": "Al-Ijarah (sewa menyewa dan jasa)",
    "babNumber": "1369",
    "babName": "Jika menyewan lahan, kemudian salah seorang dari keduanya (yang melakukan akad) meninggal",
    "hadithNumber": "2124",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Juwairiyah bin Asma' dari Nafi' dari 'Abdullah radliallahu 'anhu berkata; Rasulullah shallallahu 'alaihi wasallam mengadakan kerjasama kepada orang Yahudi dari tanah khaibar agar dimanfaatkan dan dijadikan ladang pertanian dan mereka mendapat separuh hasilnya. Dan bahwa Ibnu'Umar radliallahu 'anhuma menceritakan kepadanya bahwa ladang pertanian tersebut disewakan untuk sesuatu yang lain, yang disebutkan oleh Nafi', tapi aku lupa. Dan bahwa Rafi' bin Khadij menceritakan bahwa Nabi shallallahu 'alaihi wasallam melarang menyewakan ladang pertanian (untuk usaha selaian bercocok tanam). Dan berkata, 'Ubaidullah dari Nafi' dari Ibnu'Umar radliallahu 'anhuma; Hingga akhirnya 'Umar mengusir mereka (orang Yahudi).</b>",
    "bookID": "21.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "25",
    "matchingArabicURN": "122051",
    "last_updated": null
  }
]