[
  {
    "indonesianURN": "3021250",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "22",
    "bookName": "Al-Hawalah (pengalihan hutang)",
    "babNumber": "1370",
    "babName": "Akad hawalah, dan apakah seseorang dapat menarik kembali hawalahnya?",
    "hadithNumber": "2125",
    "hadithText": "Telah menceritakan kepada kami 'Abdullah bin Yusuf telah mengabarkan kepada kami Malik dari Abu Az Zanad dari Al A'raj dari Abu Hurairah radliallahu 'anhu bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Menunda membayar hutang bagi orang kaya adalah kezhaliman dan apabila seorang dari kalian hutangnya dialihkan kepada orang kaya, hendaklah dia ikuti\".</b>",
    "bookID": "22.1",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "122070",
    "last_updated": null
  },
  {
    "indonesianURN": "3021260",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "22",
    "bookName": "Al-Hawalah (pengalihan hutang)",
    "babNumber": "1371",
    "babName": "Jika hutang dipindahkan kepada orang yang mampu maka ia tidak boleh menolak",
    "hadithNumber": "2126",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Yusuf telah menceritakan kepada kami Sufyan dari Ibnu Dzakwan dari Al A'raj dari Abu Hurairah radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam bersabda: \"Menunda membayar hutang bagi orang kaya adalah kezhaliman dan apabila seorang dari kalian hutangnya dialihkan kepada orang kaya, hendaklah ia ikuti\".</b>",
    "bookID": "22.1",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "122080",
    "last_updated": null
  },
  {
    "indonesianURN": "3021270",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "22",
    "bookName": "Al-Hawalah (pengalihan hutang)",
    "babNumber": "1372",
    "babName": "Memindahkan hutang orang yang sudah meninggal itu dibolehkan",
    "hadithNumber": "2127",
    "hadithText": "Telah menceritakan kepada kami Al Makkiy bin Ibrahim telah menceritakan kepada kami Yazid bin Abi 'Ubaid dari Salamah bin Al Akwa' radliallahu 'anhu berkata: \"Kami pernah duduk bermajelis dengan Nabi shallallahu 'alaihi wasallam ketika dihadirkan kepada Beliau satu jenazah kemudian orang-orang berkata: \"Shalatilah jenazah ini\". Maka Beliau bertanya: \"Apakah orang ini punya hutang?\" Mereka berkata: \"Tidak\". Kemudian Beliau bertanya kembali: \"Apakah dia meninggalkan sesuatu?\" Mereka menjawab: \"Tidak\". Akhirnya Beliau menyolatkan jenazah tersebut. Kemudian didatangkan lagi jenazah lain kepada Beliau, lalu orang-orang berkata: \"Wahai Rasulullah shallallahu 'alaihi wasallam, holatilah jenazah ini\". Maka Beliau bertanya: \"Apakah orang ini punya hutang?\" Dijawab: \"Ya\". Kemudian Beliau bertanya kembali: \"Apakah dia meninggalkan sesuatu?\" Mereka menjawab: \"Ada, sebanyak tiga dinar\". Maka Beliau bersabda: \"Shalatilah saudaramu ini\". Berkata, Abu Qatadah: \"Shalatilah wahai Rasulullah, nanti hutangnya aku yang menanggungnya\". Maka Beliau shallallahu 'alaihi wasallam menyolatkan jenazah itu.</b>",
    "bookID": "22.1",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "122090",
    "last_updated": null
  },
  {
    "indonesianURN": "3021280",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "22",
    "bookName": "Al-Hawalah (pengalihan hutang)",
    "babNumber": "1373",
    "babName": "Firman Allah \"Dan (jika ada) orang-orang yang kamu telah bersumpah setia..\"",
    "hadithNumber": "2128",
    "hadithText": "Telah menceritakan kepada kami Ash-Shaltu bin Muhammad telah menceritakan kepada kami Abu Usamah dari Idris dari Tholhah bin Musharrif dari Said bin Jubair dari Ibnu 'Abbas radliallahu 'anhuma: Firman Allah yang berbunyi (Dan bagi harta peninggalan kami jadikan para pewaris), dia berkata; artinya: itulah warisan. Dan ayat (Dan orang-orang yang kamu telah bersumpah setia dengan mereka) ia berkata: ketika orang-orang muhajirin sampai di Madinah, seorang Muhajir mewarisi orang Anshar yang tidak memiliki hubungan kekeluargaan karena persaudaraan yang dipersaudarakan oleh Nabi shallallahu 'alaihi wasallam diantara mereka. Ketika ayat ini turun maka ayat ini menghapus ketentuan tersebut. Dan ayat tidak dipraktekkan lagi kecuali saling tolong menolong (antara Muhajirin - Anshar), pemberian dan nasehat sedangkan warisan telah dihapus dan diberi wasiat.</b>",
    "bookID": "22.1",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "0",
    "last_updated": null
  }
]