[
  {
    "indonesianURN": "3002400",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "166",
    "babName": "Berwudlu' sebelum mandi",
    "hadithNumber": "240",
    "hadithText": "Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari Hisyam bin 'Urwah dari Bapaknya dari 'Aisyah isteri Nabi shallallahu 'alaihi wasallam, bahwa jika Nabi shallallahu 'alaihi wasallam mandi karena janabat, beliau memulainya dengan mencuci kedua telapak tangannya, kemudian berwudlu sebagaimana wudlu untuk shalat, kemudian memasukkan jari-jarinya ke dalam air lalu menggosokkannya ke kulit kepalanya, kemudian menyiramkan air ke atas kepalanya dengan cidukan kedua telapak tangannya sebanyak tiga kali, kemudian beliau mengalirkan air ke seluruh kulitnya.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "102490",
    "last_updated": null
  },
  {
    "indonesianURN": "3002410",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "166",
    "babName": "Berwudlu' sebelum mandi",
    "hadithNumber": "241",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Yusuf berkata, telah menceritakan kepada kami Sufyan dari Al A'masy dari Salim bin Abu Al Ja'd dari Kuraib dari Ibnu 'Abbas dari Maimunah isteri Nabi shallallahu 'alaihi wasallam, ia berkata, \"Nabi shallallahu 'alaihi wasallam berwudlu sebagaimana wudlunya untuk shalat, kecuali kedua kakinya. Beliau lalu mencuci kemaluan dan apa yang terkena kotoran (mani), kemudian menyiramkan air ke atasnya, kemudian mengakhirinya dengan menyela dan mencuci kedua kakinya. Itulah cara beliau mandi dari janabat.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "102500",
    "last_updated": null
  },
  {
    "indonesianURN": "3002420",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "167",
    "babName": "Seorang suami mandi bersama istrinya",
    "hadithNumber": "242",
    "hadithText": "Telah menceritakan kepada kami Adam bin Abu Iyas berkata, telah menceritakan kepada kami Ibnu Abu Dzi'b dari Az Zuhri dari 'Urwah dari 'Aisyah berkata, \"Aku pernah mandi bersama Nabi shallallahu 'alaihi wasallam dari satu ember terbuat dari tembikar yang disebut Al Faraq.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "102510",
    "last_updated": null
  },
  {
    "indonesianURN": "3002430",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "168",
    "babName": "Mandi dengan air sebanyak satu sha' atau seukuran dengan itu",
    "hadithNumber": "243",
    "hadithText": "Telah menceritakan kepada kami 'Abdullah bin Muhammad berkata, telah menceritakan kepadaku 'Abdush Shamad berkata, telah menceritakan kepadaku Syu'bah berkata, telah menceritakan kepadaku Abu Bakar bin Hafsh berkata, aku mendengar Abu Salamah berkata, \"Aku dan saudara 'Aisyah menemui 'Aisyah, lalu saudaranya bertanya kepadanya tentang cara Nabi shallallahu 'alaihi wasallam mandi (dari janabat). 'Aisyah lalu minta diambilkan satu bejana air setara dengan ukuran satu sha'. Kemudian mandi dan menuangkan air ke atas kepalanya, sementara antara kami dengannya terhalang oleh hijab.\" Abu 'Abdullah berkata, Yazid bin Harun dan Bahz dan Al Juddi menyebutkan dari Syu'bah, \"Sekadar satu sha'.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "102520",
    "last_updated": null
  },
  {
    "indonesianURN": "3002440",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "168",
    "babName": "Mandi dengan air sebanyak satu sha' atau seukuran dengan itu",
    "hadithNumber": "244",
    "hadithText": "Telah menceritakan kepada kami 'Abdullah bin Muhammad berkata, telah menceritakan kepada kami Yahya bin Adam berkata, telah menceritakan kepada kami Zuhair dari Abu Ishaq berkata, telah menceritakan kepada kami Abu Ja'far bahwasanya ia berada di sisi Jabir bin 'Abdullah -dia dan ayahnya (Ali bin Al Hasan) -, dan di dekat Jabir juga ada sekelompok orang yang bertanya kepadanya tentang cara mandi. Jabir bin Abdullah lalu menjawab, \"Cukup bagimu dengan satu sha' air.\" Tiba-tiba ada seorang yang berkata, \"Bagiku tidak cukup!\" Maka Jabir pun berkata, \"Seukuran itu cukup buat orang yang lebih lebat rambutnya darimu, dan yang lebih baik darimu.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "102530",
    "last_updated": null
  },
  {
    "indonesianURN": "3002450",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "168",
    "babName": "Mandi dengan air sebanyak satu sha' atau seukuran dengan itu",
    "hadithNumber": "245",
    "hadithText": "Telah menceritakan kepada kami Abu Nu'aim berkata, telah menceritakan kepada kami Ibnu 'Uyainah dari 'Amru dari Jabir bin Zaid dari Ibnu 'Abbas, bahwa Nabi shallallahu 'alaihi wasallam dan Maimunah mandi bersama dari satu ember.\" Abu 'Abdullah berkata, \"Terakhir Ibnu 'Uyainah meriwayatkan dari Ibnu Abbas dari Maimunah, padahal yang benar adalah apa yang diriwayatkan oleh Abu Nu'aim.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "102540",
    "last_updated": null
  },
  {
    "indonesianURN": "3002460",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "169",
    "babName": "Orang yang mandi menyiram kepalanya tiga kali",
    "hadithNumber": "246",
    "hadithText": "Telah menceritakan kepada kami Abu Nu'aim berkata, telah menceritakan kepada kami Zuhair dari Abu Ishaq berkata, telah menceritakan kepadaku Sulaiman bin Shurad berkata, telah menceritakan kepadaku Jubair bin Muth'im berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku menyiram kepalaku sebanyak tiga kali.\" Beliau memberi isyarat dengan kedua telapak tangannya.</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "102550",
    "last_updated": null
  },
  {
    "indonesianURN": "3002470",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "169",
    "babName": "Orang yang mandi menyiram kepalanya tiga kali",
    "hadithNumber": "247",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Basyar berkata, telah menceritakan kepada kami Ghundar berkata, telah menceritakan kepada kami Syu'bah dari Mikhwal bin Rasyid dari Muhammad bin 'Ali dari Jabir bin 'Abdullah berkata, \"Nabi shallallahu 'alaihi wasallam menguyurkan air ke atas kepala sebanyak tiga kali.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "102560",
    "last_updated": null
  },
  {
    "indonesianURN": "3002480",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "169",
    "babName": "Orang yang mandi menyiram kepalanya tiga kali",
    "hadithNumber": "248",
    "hadithText": "Telah menceritakan kepada kami Abu Nu'aim berkata, telah menceritakan kepada kami Ma'mar bin Yahya bin Sam telah menceritakan kepadaku Abu Ja'far berkata, Jabir bin 'Abdullah berkata kepadaku, \"Anak pamanmu telah datang kepadaku -mengisahkan Hasan bin Muhammad bin Al Hanafiah-, ia bertanya, \"Bagaimana cara mandi janabat? Aku menjawab, \"Nabi shallallahu 'alaihi wasallam mengambil air dengan tiga ciduk telapak tangannya lalu menyiramkannya ke atas kepalanya, kemudian menyiramkan ke seluruh tubuh.\" Al Hasan lalu berkata kepadaku, \"Aku adalah seorang laki-laki yang rambutnya lebat!\" Aku lalu menjawab, \"Nabi shallallahu 'alaihi wasallam rambutnya lebih lebah dari rambutmu.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "102570",
    "last_updated": null
  },
  {
    "indonesianURN": "3002490",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "170",
    "babName": "Mandi satu kali",
    "hadithNumber": "249",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il berkata, telah menceritakan kepada kami 'Abdul Wahid dari Al A'masy dari Salim bin Abu Al Ja'd dari Kuraib dari Ibnu 'Abbas berkata, Maimunah berkata, \"Aku menyiapkan air mandi untuk Nabi shallallahu 'alaihi wasallam, beliau mencuci kedua telapak tangannya dua atau tiga kali. Kemudian beliau menuangkan air ke telapak tangan kirinya dan membasuh kemaluannya, kemudian beliau usapkan tangannya ke tanah, kemudian berkumur dan memasukkan air ke dalam hidung, lalu membasuh wajah dan kedua tangannya. kemudian beliau mengguyur seluruh tubuhnya. Setelah itu beliau bergeser dari tempatnya semula, lalu mencuci kedua kakinya.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "102580",
    "last_updated": null
  },
  {
    "indonesianURN": "3002500",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "171",
    "babName": "Orang yang ketika mandi memulainya dengan hilab atau wewangian",
    "hadithNumber": "250",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Al Mutsanna berkata, telah menceritakan kepada kami Abu 'Ashim dari Hanzhalah dari Al Qasim dari 'Aisyah berkata, \"Jika Nabi shallallahu 'alaihi wasallam mandi janabat, beliau minta diambilkan bejana sebesar bejana yang digunakan untuk memerah susu. Beliau lalu mengambil air dengan telapak tangannya dan mengguyurkannya dimulai dari sisi sebelah kanan lalu sebelah kiri. Kemudian menuangkan dengan keduanya pada bagian tengah kepala.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "102590",
    "last_updated": null
  },
  {
    "indonesianURN": "3002510",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "172",
    "babName": "Berkumur dan memasukkan air ke hidung ketika mandi",
    "hadithNumber": "251",
    "hadithText": "Telah menceritakan kepada kami 'Umar bin Hafsh bin Ghiyats berkata, telah menceritakan kepada kami Bapakku telah menceritakan kepada kami Al A'masy berkata, telah menceritakan kepadaku Salim dari Kuraib dari Ibnu 'Abbas berkata, telah menceritakan kepada kami Maimunah berkata, \"Aku menuangkan air untuk mandi Nabi shallallahu 'alaihi wasallam, lalu dengan tangan kanannya beliau menuangkan air pada tangan kirinya lalu membasuh keduanya. Kemudian mencuci kemaluannya, lalu menyentuhkan tangannya ke bumi dan mengusapnya dengan tanah, lalu mencucinya dengan air. Kemudian berkumur-kumur dan memasukkan air ke hidung, kemudian membasuh muka dan menyiramkan air ke atas kepalanya. Kemudian beliau bergeser untuk mencuci kedua telapak kakinya. Setelahitu beliau diberi handuk, tapi beliau tidak mengeringkan badannya dengan handuk tersebut.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "102600",
    "last_updated": null
  },
  {
    "indonesianURN": "3002520",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "173",
    "babName": "Menggosokkan tangan ke tanah agar lebih bersih",
    "hadithNumber": "252",
    "hadithText": "Telah menceritakan kepada kami 'Abdullah bin Az Zubair Al Humaidi berkata, telah menceritakan kepada kami Sufyan berkata, telah menceritakan kepada kami Al A'masy dari Salim bin Abu Al Ja'd dari Kuraib dari Ibnu 'Abbas dari Maimunah, bahwa Nabi shallallahu 'alaihi wasallam mandi janabat, beliau lalu mencuci kemaluannya dengan tangan, lalu beliau menyentuhkan tangannya ke dinding, lalu mencucinya dengan air. Kemudian berwudlu sebagaimana wudlu untuk shalat, selesai mandi beliau mencuci kedua kakinya.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "102610",
    "last_updated": null
  },
  {
    "indonesianURN": "3002530",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "174",
    "babName": "Bolehkan seseorang yang junub memasukkan tangannya ke dalam air sebelum mencucinya",
    "hadithNumber": "253",
    "hadithText": "Telah menceritakan kepada kami 'Abdullah bin Maslamah telah mengabarkan kepada kami Aflah bin Humaid dari Al Qasim dari 'Aisyah berkata, \"Aku pernah mandi bersama Nabi shallallahu 'alaihi wasallam dari satu bejana, dan tangan kami saling bersentuhan.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "102620",
    "last_updated": null
  },
  {
    "indonesianURN": "3002540",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "174",
    "babName": "Bolehkan seseorang yang junub memasukkan tangannya ke dalam air sebelum mencucinya",
    "hadithNumber": "254",
    "hadithText": "Telah menceritakan kepada kami Musaddad berkata, telah menceritakan kepada kami Hammad dari Hisyam dari Bapaknya dari 'Aisyah berkata, \"Jika Nabi shallallahu 'alaihi wasallam mandi janabat beliau membasuh tangannya.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "102630",
    "last_updated": null
  },
  {
    "indonesianURN": "3002550",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "174",
    "babName": "Bolehkan seseorang yang junub memasukkan tangannya ke dalam air sebelum mencucinya",
    "hadithNumber": "255",
    "hadithText": "Telah menceritakan kepada kami Abu Al Walid berkata, telah menceritakan kepada kami Syu'bah dari Abu Bakar bin Hafsh dari 'Urwah dari 'Aisyah berkata, \"Aku pernah mandi junub bersama Nabi shallallahu 'alaihi wasallam dalam satu bejana.\" Dan dari 'Abdurrahman bin Al Qasim dari Bapaknya dari 'Aisyah seperti itu.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "102640",
    "last_updated": null
  },
  {
    "indonesianURN": "3002560",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "174",
    "babName": "Bolehkan seseorang yang junub memasukkan tangannya ke dalam air sebelum mencucinya",
    "hadithNumber": "256",
    "hadithText": "Telah menceritakan kepada kami Abu Al Walid berkata, telah menceritakan kepada kami Syu'bah dari 'Abdullah bin 'Abdullah bin Jabr berkata, aku mendengar Anas bin Malik berkata, \"Nabi shallallahu 'alaihi wasallam dan salah seorang dari isterinya mandi dalam satu bejana.\" Muslim dan Wahb bin Jarir dari Syu'bah menambahkan, \"Karena junub.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "17",
    "matchingArabicURN": "102650",
    "last_updated": null
  },
  {
    "indonesianURN": "3002570",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "175",
    "babName": "Memisahkan mandi dan wudlu'",
    "hadithNumber": "257",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Mahbub berkata, telah menceritakan kepada kami 'Abdul Wahid berkata, telah menceritakan kepada kami Al A'masy dari Salim bin Abu Al Ja'd dari Kuraib mantan budak Ibnu 'Abbas, dari Ibnu 'Abbas berkata, Maimunah berkata, \"Aku menyediakan air mandi untuk Rasulullah shallallahu 'alaihi wasallam, beliau lalu menuangkan air pada kedua tangannya dan mencuci keduanya dua kali dua kali atau tiga kali. Lalu dengan tangan kanannya beliau menuangkan air pada telapak tangan kirinya lalu mencuci kemaluannya, setelah itu menyentuhkan tangannya ke tanah. Kemudian berkumur-kumur dan memasukkan air ke hidung. Kemudian membasuh muka dan kedua tangannya, lalu membasuh kepalanya tiga kali dan mengguyur seluruh badannya. Setelah itu beliau bergeser dari posisi semula lalu mencuci kedua telapak kakinya.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "18",
    "matchingArabicURN": "102660",
    "last_updated": null
  },
  {
    "indonesianURN": "3002580",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "176",
    "babName": "Menyiramkan air ke tangan kiri dengan tangan kanan ketika mandi junub",
    "hadithNumber": "258",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il berkata, telah menceritakan kepada kami Abu 'Awanah telah menceritakan kepada kami Al A'masy dari Salim bin Abu Al Ja'di dari Kuraib sahaya Ibnu 'Abbas dari Ibnu 'Abbas radliallahu 'anhu dari Maimunah binti Al Harits radliallahu 'anhu berkata,: \"Aku menyediakan air untuk Rasulullah shallallahu 'alaihi wasallam untuk mandi, dan aku menutupinya. Maka Beliau menuangkan air dengan telapak tangan kanannya lalu mencuci keduanya satu atau dua kali. Lalu menuangkan air dengan telapak tangan kanannya ke atas telapak tangan kirinya kemudian mencuci kemaluannya lalu menyentuhkan tangannya ke tanah. Kemudian berkumur-kumur dan memasukkan air ke hidung. Kemudian membasuh mukanya dan kedua tangannya dan membasuh kepalanya tiga kali kemudian mengguyur seluruh badannya. Kemudian di akhirnya Beliau bergeser dari posisi semula lalu mencuci kedua telapak kakinya\".</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "19",
    "matchingArabicURN": "102670",
    "last_updated": null
  },
  {
    "indonesianURN": "3002590",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "177",
    "babName": "Bersetubuh dengan istri  lalu mengulanginya lagi, atau menggilir di istri-istri dengan sekali mandi",
    "hadithNumber": "259",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Basysyar berkata, telah menceritakan kepada kami Ibnu Abu 'Ady dan Yahya bin Sa'id dari Syu'bah dari Ibrahim bin Muhammad bin Al Muntasyir dari bapaknya berkata,: \"Aku menceritakan tentang (perkataan Ibnu 'Abbas) kepada 'Aisyah, maka jawabnya: \"Semoga Allah merahmati Abu 'Abdurrahman. Sungguh aku pernah memakaikan wewangian kepada Rasulullah shallallahu 'alaihi wasallam kemudian Beliau mendatangi isteri-isterinya. Dan pada pagi harinya Beliau mengenakan pakain ihram dalam keadaan wangi semerbak\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "20",
    "matchingArabicURN": "102680",
    "last_updated": null
  },
  {
    "indonesianURN": "3002600",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "177",
    "babName": "Bersetubuh dengan istri  lalu mengulanginya lagi, atau menggilir di istri-istri dengan sekali mandi",
    "hadithNumber": "260",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Basysyar berkata, telah menceritakan kepada kami Mu'adz bin Hisyam berkata, telah menceritakan kepada saya bapakku dari Qatadah berkata, telah menceritakan kepada kami Anas bin Malik radliallahu 'anhu berkata,: \"Adalah Nabi shallallahu 'alaihi wasallam. mendatangi isterinya pada waktu yang sama di malam hari atau siang hari, saat itu jumlah isteri-isteri Beliau sebelas orang\". Aku bertanya kepada Anas bin Malik radliallahu 'anhu: \"Apakah Beliau mampu?\". Jawabnya: \"Beliau diberikan kekuatan setara tiga puluh lelaki\". Berkata, Sa'id dari Qatadah bahwa Anas radliallahu 'anhu menerangkan kepada mereka bahwa jumlah isteri-isteri Beliau shallallahu 'alaihi wasallam. saat itu sembilan orang\".</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "21",
    "matchingArabicURN": "102690",
    "last_updated": null
  },
  {
    "indonesianURN": "3002610",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "178",
    "babName": "Mencuci madzi dan berwudlu' disebabkan keluarnya madzi",
    "hadithNumber": "261",
    "hadithText": "Telah menceritakan kepada kami Abu Al Walid berkata, telah menceritakan kepada kami Za'idah dari Abi Hushain dari Abu 'Abdurrahman dari 'Ali berkata,: \"Dulu aku adalah seorang yang sering mengeluarkan madzi. Maka aku minta seseorang untuk bertanya kepada Nabi shallallahu 'alaihi wasallam. karena kedudukan putri Beliau shallallahu 'alaihi wasallam. Maka orang itu bertanya, lalu Jawab Nabi shallallahu 'alaihi wasallam.: \"Baginya wudlu' dan mencuci kemaluannya\".</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "22",
    "matchingArabicURN": "102700",
    "last_updated": null
  },
  {
    "indonesianURN": "3002620",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "179",
    "babName": "Siapa yang memakai wewangian lalu mandi namun aromanya masih tersisa",
    "hadithNumber": "262",
    "hadithText": "Telah menceritakan kepada kami Abu AN-Nu'man berkata, telah menceritakan kepada kami Abu 'Awanah dari Ibrahim bin Muhammad bin Al Muntasyir dari bapaknya: \"Aku bertanya kepada 'Aisyah radliallahu 'anhu lalu aku ceritakan tentang ucapan Ibnu 'Umar radliallahu 'anhu yang mengatakan: \"aku tidak suka bila berpakaian ihram juga memakai wewangian\". Maka 'Aisyah radliallahu 'anhu berkata,: \"Sungguh aku pernah memberikan wewangian kepada Rasulullah shallallahu 'alaihi wasallam. lalu Beliau mendatangi isteri-isterinya. Kemudian Beliau mengenakan pakain ihram\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "23",
    "matchingArabicURN": "102710",
    "last_updated": null
  },
  {
    "indonesianURN": "3002630",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "179",
    "babName": "Siapa yang memakai wewangian lalu mandi namun aromanya masih tersisa",
    "hadithNumber": "263",
    "hadithText": "Telah menceritakan kepada kami Adam bin Abu Iyas berkata, telah menceritakan kepada kami Syu'bah berkata, telah menceritakan kepada kami Al Hakam dari Ibrahim dari Al Aswad dari 'Aisyah radliallahu 'anhu berkata,: \"Seakan aku melihat kilauan wewangian dari rambut Nabi shallallahu 'alaihi wasallam saat Beliau sedang berihram\".</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "24",
    "matchingArabicURN": "102720",
    "last_updated": null
  },
  {
    "indonesianURN": "3002640",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "180",
    "babName": "Menyela-nyela rambut ketika seseorang mandi junub hingga bila merasa sudah membasahi kulit kepalanya",
    "hadithNumber": "264",
    "hadithText": "Telah menceritakan kepada kami 'Abdan berkata, telah mengabarkan kepada kami 'Abdullah berkata, telah mengabarkan kepada kami Hisyam bin 'Urwah dari bapaknya dari 'Aisyah berkata,: \"Adalah Nabi Rasulullah shallallahu 'alaihi wasallam. jika mandi janabat, mencuci tangannya dan berwudlu' sebagaimana wudlu' unmtuk shalat. Kemudian mandi dengan menggosok-gosokkan tangannya ke rambut kepalanya hingga bila telah yakin merata mengenai dasar kulit kepalanya Beliau mengguyurkan air ke atasnya tiga kali. Lalu membasuh seluruh badannya\". 'Aisyah berkata,: \"Aku pernah mandi bersama Rasulullah shallallahu 'alaihi wasallam. dari satu bejana dimana kami saling mengambil (menciduk) air bersamaan\".</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "25",
    "matchingArabicURN": "102731",
    "last_updated": null
  },
  {
    "indonesianURN": "3002650",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "181",
    "babName": "Siapa yang berwudlu' dalam keadaan junub lalu mandi dengan membasuh seluruh badannya tidak perlu men",
    "hadithNumber": "265",
    "hadithText": "Telah menceritakan kepada kami Yusuf bin 'Isa berkata, telah mengabarkan kepada kami Al Fadlol bin Musa berkata, telah mengabarkan kepada kami Al A'masy dari Salim dari Kuraib sahaya Ibnu 'Abbas dari Ibnu 'Abbas radliallahu 'anhu dari Maimunah berkata,: \"Rasulullah shallallahu 'alaihi wasallam. mengambil seember air untuk mandi janabat. Beliau menuangkan dengan telapak tangan kanannya ke atas telapak tangan kirinya lalu mencucinya dua kali atau tiga kali. Lalu mencuci kemaluannya lalu memukulkan tangannya ke tanah atau dinding dua kali atau tiga kali. Kemudian berkumur-kumur dan memasukkan air ke hidung lalu mencuci wajahnyaKemudian berkumur-kumur dan memasukkan air ke hidung lalu mencuci wajahnya dan kedua lengannya. Kemudian mengguyurkan air ke atas kepalanya lalu membasuh badannya dan mengakhirinya dengan membasuh kedua telapak kakinya\". 'Aisyah berkata,: \"Maka aku berikan potongan kain tapi Beliau tidak memerlukannya, dan Beliau mengeringkan (membersihkan air dari) badannya dengan tangannya\".</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "26",
    "matchingArabicURN": "102750",
    "last_updated": null
  },
  {
    "indonesianURN": "3002660",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "182",
    "babName": "Jika seseorang berada di masjid dan teringat bahwa dia sedang junub maka dia keluar (untuk mandi) se",
    "hadithNumber": "266",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Muhammad berkata, telah menceritakan kepada kami 'Utsman bin 'Umar berkata, telah mengabarkan kepada kami Yunus dari Az Zuhry dari Abu Salamah dari Abu Hurairah radliallahu 'anhu berkata,: \"Qamat untuk shalat telah dikumandangkan dan shaf telah diluruskan, lalu keluarlah Rasulullah shallallahu 'alaihi wasallam. Setelah sampai di tempat shalat Beliau baru teringat bahwa Beliau sedang junub, lalu berkata, kepada kami; \"tetaplah di tempat kalian\". Maka Beliau kembali lalu mandi. Kemudian datang dalam keadaan kapalanya basah. Lalu Beliau bertakbir, maka kamipun shalat bersamanya\". Hadits ini juga diriwayatkan oleh Abdul A'laa dari Ma'mar dari Az Zuhry dan diriwayatkan juga oleh Al Auza'i dari Az Zuhry.</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "27",
    "matchingArabicURN": "102760",
    "last_updated": null
  },
  {
    "indonesianURN": "3002670",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "183",
    "babName": "Mengeringkan air dari badan setelah mandi junub dengan tangan",
    "hadithNumber": "267",
    "hadithText": "Telah menceritakan kepada kami 'Abdan berkata, telah mengabarkan kepada kami Abu Hamzah berkata, aku mendengar Al A'masy dari Salim bin Abu AL Ja'di dari Kuraib dari Ibnu 'Abbas berkata, telah berkata, Maimunah radliallahu 'anhu.: \"Aku memberi air untuk mandi kepada Nabi shallallahu 'alaihi wasallam. lalu aku tutupi Beliau dengan kain. Maka Beliau menuangkan air ke tangannya lalu mencuci keduanya. Kemudian menuangkan air dengan tangan kanannya ke tangan kirinya lalu mencuci kemaluannya, lalu tangannya dipukulkannya ke tanah kemudian mengusapnya lalu mencucinya. Kemudian berkumur-kumur dan memasukkan air ke hidung. Kemudian membasuh mukanya dan kedua lengannya lalu mengguyur kepalanya lalu menyiram seluruh badannya dan diakhiri dengan mencuci kedu telapak kaikinya. Lalu aku sodorkan kain (sebagai pengering) tapi Beliau tidak mengambilnya, lalu Beliau pergi dengan mengeringkan air dari badannya dengan tangannya\".</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "28",
    "matchingArabicURN": "102770",
    "last_updated": null
  },
  {
    "indonesianURN": "3002680",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "184",
    "babName": "Memulai mandi junub dengan menggosok kepala bagian kanan",
    "hadithNumber": "268",
    "hadithText": "Telah menceritakan kepada kami Khallad bin Yahya berkata, telah menceritakan kepada kami Ibrahim bin Nafi' dari Al Hasan bin Muslim dari Shafiyah binti Syaibah dari 'Aisyah berkata, \"Jika salah seorang dari kami mengalami haid, maka ia mengambil air dengan kedua tangannya dan disiramkan ke atas kepala, lalu mengambil air dengan tangannya dan disiramkan ke bagian badan sebelah kanan, lalu kembali mengambil air dengan tangannya yang lain dan menyiramkannya ke bagian badan sebelah kiri.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "29",
    "matchingArabicURN": "102780",
    "last_updated": null
  },
  {
    "indonesianURN": "3002690",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "185",
    "babName": "Mandi dalam keadaan telanjang di tempat yang sepi dan bila dapat menggunakan tutup lebih baik",
    "hadithNumber": "269",
    "hadithText": "Telah menceritakan kepada kami Ishaq bin Nashir berkata, telah menceritakan kepada kami Abdurrazaq dari Ma'mar dari Hammam bin Munabbih dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam bersabda: \"Orang-orang bani Israil jika mandi maka mereka mandi dengan telanjang, hingga sebagian melihat sebagian yang lainnya. Sedangkan Nabi Musa 'Alaihis Salam lebih suka mandi sendirian. Maka mereka pun berkata, \"Demi Allah, tidak ada menghalangi Musa untuk mandi bersama kita kecuali karena ia adalah seorang laki-laki yang kemaluannya kena hernia. Lalu pada suatu saat Musa pergi mandi dan meletakkan pakaiannya pada sebuah batu, lalu batu tersebut lari dengan membawa pakaiannya. Maka Musa lari mengejar batu tersebut sambil berkata 'Wahai batu, kembalikan pakaianku! ' sehingga orang-orang bani Israil melihat Musa. Mereka lalu berkata, 'Demi Allah, pada diri Musa tidak ada yang ganjil.' Musa kemudian mengambil pakaiannya dan memukul batu tersebut dengan satu pukulan.\" Abu Hurairah berkata, \"Demi Allah, sungguh pada batu tersebut terdapat bekas pukulan enam atau tujuh akibat pukulannya.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "30",
    "matchingArabicURN": "102790",
    "last_updated": null
  },
  {
    "indonesianURN": "3002700",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "185",
    "babName": "Mandi dalam keadaan telanjang di tempat yang sepi dan bila dapat menggunakan tutup lebih baik",
    "hadithNumber": "270",
    "hadithText": "Dan (masih dari jalur periwayatan yang sama dengan hadits sebelumnya) dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tatkala Ayyub mandi dalam keadaan telanjang, tiba-tiba muncul belalang dari emas. Lalu Ayyub mengumpulkan dan memasukkannya ke dalam baju. Maka Raabnya memanggilnya: 'Wahai Ayyub, bukankah aku sudah memberimu kecukupan sebagaimana kau lihat? ' Ayyub menjawab, 'Benar, dan demi segala kemuliaan-Mu. Tetapi aku tidak pernah merasa puas dari limpahan barakah-Mu'.\" Ibrahim juga meriwayatkan dari Musa bin 'Uqbah dari Shafwan bin Sulaim dari 'Atha' bin Yasar dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Ketika Ayyub mandi dalam keadaan telanjang.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "31",
    "matchingArabicURN": "102800",
    "last_updated": null
  },
  {
    "indonesianURN": "3002710",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "186",
    "babName": "Berlindung (menggunakan tutup) ketika mandi di tengah orang",
    "hadithNumber": "271",
    "hadithText": "Telah menceritakan kepada kami 'Abdullah bin Maslamah bin Qa'nab dari Malik dari Abu An Nadlr mantan budak 'Umar bin 'Ubaidullah, bahwa Abu Murrah mantan budak Ummu Hani' binti Abu Thalib, telah mengabarkan kepadanya, bahwa ia mendengar Ummu Hani' binti Abu Thalib berkata, \"Aku pergi menemui Rasulullah shallallahu 'alaihi wasallam saat pembukaan Kota Makkah, lalu aku dapati beliau sedang mandi dan Fatimah menutupinya. Beliau lalu bertanya: \"Siapa ini?\" Aku menjawab, \"Ummu Hani'.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "32",
    "matchingArabicURN": "102810",
    "last_updated": null
  },
  {
    "indonesianURN": "3002720",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "186",
    "babName": "Berlindung (menggunakan tutup) ketika mandi di tengah orang",
    "hadithNumber": "272",
    "hadithText": "Telah menceritakan kepada kami 'Abdan berkata, telah mengabarkan kepada kami 'Abdullah berkata, telah mengabarkan kepada kami Sufyan dari Al A'masy dari Salim bin Abu Al Ja'd dari Kuraib dari Ibnu 'Abbas dari Maimunah ia berkata, \"Aku menutupi Nabi shallallahu 'alaihi wasallam saat beliau sedang mandi junub. Beliau mencuci kedua tangannya, lalu dengan tangan kanannya beliau menuangkan air pada tangan kirinya, lalu mencuci kemaluannya dan apa yang terkena (mani). Beliau kemudian menggosokkan tangannya ke dinding atau tanah. Kemudian berwudlu sebagaimana wudlu untuk shalat kecuali kedua kakinya. Kemudian beliau mengguyurkan air ke seluruh badannya. Kemudian menyudahi dengan mencuci kedua kakinya.\" Hadits ini dikuatkan oleh Abu 'Awanah dan Ibnu Fudlail dalam masalah tabir (penutup).\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "33",
    "matchingArabicURN": "102820",
    "last_updated": null
  },
  {
    "indonesianURN": "3002730",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "187",
    "babName": "Jika seorang wanita bermimpi (basah)",
    "hadithNumber": "273",
    "hadithText": "Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari Hisyam bin 'Urwah dari Bapaknya dari Zainab binti Abu Salamah dari Ummu Salamah Ummul Mukminin, bahwa ia berkata, \"Ummu Sulaim, isteri Abu Thalhah, datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, sesungguhnya Allah tidak malu dengan kebenaran. Apakah seorang wanita wajib mandi bila bermimpi?\" Maka Rasulullah shallallahu 'alaihi wasallam menjawab: \"Ya. Jika dia melihat air.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "34",
    "matchingArabicURN": "102830",
    "last_updated": null
  },
  {
    "indonesianURN": "3002740",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "188",
    "babName": "Keringat orang yang junub dan bahwa seorang muslim (badannya) tidaklah najis",
    "hadithNumber": "274",
    "hadithText": "Telah menceritakan kepada kami 'Ali bin 'Abdullah berkata, telah menceritakan kepada kami Yahya berkata, telah menceritakan kepada kami Humaid berkata, telah menceritakan kepada kami Bakar dari Abu Rafi' dari Abu Hurairah, bahwa Nabi shallallahu 'alaihi wasallam pernah berjumpa dengannya di salah satu jalan Madinah, sementara ia dalam keadaan junub.\" Abu Hurairah berkata, 'Aku malu dan pergi diam-diam'. Abu Hurairah lalu pergi mandi dan kembali lagi setelah itu, beliau lalu bertanya: \"Kemana saja kamu tadi wahai Abu Hurairah?\" Abu Hurairah menjawab: \"Aku tadi junub. Dan aku tidak suka bersama Tuan sedang aku dalam keadaan tidak suci.\" Beliau pun bersabda: \"Subhaanallah! Sesungguhnya seorang Muslim itu tidak itu najis.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "35",
    "matchingArabicURN": "102840",
    "last_updated": null
  },
  {
    "indonesianURN": "3002750",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "189",
    "babName": "Orang yang junub boleh keluar rumah dan mendatangi pasar atau lainnya",
    "hadithNumber": "275",
    "hadithText": "Telah menceritakan kepada kami 'Abdul A'la bin Hammad telah menceritakan kepada kami Abdul A'la bin Abdul A'la berkata, telah menceritakan kepada kami Yazid bin Zurai' berkata, telah menceritakan kepada kami Sa'id dari Qatadah bahwa Anas bin Malik menceritakan kepada mereka, bahwa Nabi shallallahu 'alaihi wasallam menggilir semua isterinya dalam satu malam, padahal saat itu isteri beliau ada sembilan orang.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "36",
    "matchingArabicURN": "102850",
    "last_updated": null
  },
  {
    "indonesianURN": "3002760",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "189",
    "babName": "Orang yang junub boleh keluar rumah dan mendatangi pasar atau lainnya",
    "hadithNumber": "276",
    "hadithText": "Telah menceritakan kepada kami 'Ayyasy berkata, telah menceritakan kepada kami 'Abdul A'la telah menceritakan kepada kami Humaid dari Bakar dari Abu Rafi' dari Abu Hurairah berkata, \"Rasulullah shallallahu 'alaihi wasallam berjumpa dengan aku padahal aku dalam keadaan junub. Beliau menggandeng tanganku hingga aku pun berjalan bersama beliau hingga beliau duduk. Aku lantas pergi diam-diam kembali ke rumah untuk mandi. Kemudian kembali lagi dan beliau masih duduk. Beliau lalu bertanya: \"Kemana saja kamu tadi wahai Abu Hurairah?\" Maka aku ceritakan pada beliau. Beliau lalu bersabda: \"Subhaanallah! Wahai Abu Hurairah, seorang Muslim itu tidaklah najis.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "37",
    "matchingArabicURN": "102860",
    "last_updated": null
  },
  {
    "indonesianURN": "3002770",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "190",
    "babName": "Keberadaan orang yang junub di rumah jika sudah berwudlu namun belum mandi",
    "hadithNumber": "277",
    "hadithText": "Telah menceritakan kepada kami Abu An Nu'aim berkata, telah menceritakan kepada kami Hisyam dan Syaiban dari Yahya bin Abu Katsir dari Abu Salamah berkata, Aku bertanya kepada 'Aisyah, \"Apakah Nabi shallallahu 'alaihi wasallam tidur dalam keadaan junub?\" 'Aisyah menjawab, \"Ya, setelah berwudlu.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "38",
    "matchingArabicURN": "102870",
    "last_updated": null
  },
  {
    "indonesianURN": "3002780",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "191",
    "babName": "Orang junub yang tidur",
    "hadithNumber": "278",
    "hadithText": "Telah menceritakan kepada kami Qutaibah berkata, telah menceritakan kepada kami Al Laits dari Nafi' dari Ibnu 'Umar bahwa 'Umar bin Al Khaththab bertanya kepada Rasulullah shallallahu 'alaihi wasallam, \"Apakah boleh seorang dari kami tidur dalam keadaan dia junub?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Ya. Jika salah seorang dari kalian berwudlu, maka hendaklah ia tidur meskipun dalam keadaan junub.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "39",
    "matchingArabicURN": "102880",
    "last_updated": null
  },
  {
    "indonesianURN": "3002790",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "192",
    "babName": "Orang yang junub berwudlu' lalu tidur",
    "hadithNumber": "279",
    "hadithText": "Telah menceritakan kepada kami Yahya bin Bukair berkata, telah menceritakan kepada kami Al Laits dari 'Ubaidullah bin Abu Ja'far dari Muhammad bin 'Abdurrahman dari 'Urwah dari 'Aisyah berkata, \"Jika Nabi shallallahu 'alaihi wasallam hendak tidur saat dirinya dalam kondisi junub, maka beliau membasuh kemaluannya dan berwudlu sebagaimana wudlu untuk shalat.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "40",
    "matchingArabicURN": "102890",
    "last_updated": null
  },
  {
    "indonesianURN": "3002800",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "192",
    "babName": "Orang yang junub berwudlu' lalu tidur",
    "hadithNumber": "280",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il berkata, telah menceritakan kepada kami Juwairiyah dari Nafi' dari 'Abdullah berkata, \"'Umar minta fatwa kepada Nabi shallallahu 'alaihi wasallam, \"Apakah salah seorang dari kami boleh tidur saat junub?\" Beliau menjawab: \"Ya. Jika ia berwudlu.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "41",
    "matchingArabicURN": "102900",
    "last_updated": null
  },
  {
    "indonesianURN": "3002810",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "192",
    "babName": "Orang yang junub berwudlu' lalu tidur",
    "hadithNumber": "281",
    "hadithText": "Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari 'Abdullah bin Dinar dari 'Abdullah bin 'Umar bahwa ia berkata, \"'Umar bin Al Khaththab menceritakan kepada Rasulullah shallallahu 'alaihi wasallam bahwa ia junub di malam hari. Rasulullah shallallahu 'alaihi wasallam lalu berkata kepadanya: \"Wudlu dan cucilah kemaluanmu, kemudian tidurlah.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "42",
    "matchingArabicURN": "102910",
    "last_updated": null
  },
  {
    "indonesianURN": "3002820",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "193",
    "babName": "Apabila dua kemaluan bertemu",
    "hadithNumber": "282",
    "hadithText": "Telah menceritakan kepada kami Mu'adz bin Fadlalah berkata, telah menceritakan kepada kami Hisyam. (dalam jalur lain disebutkan) Telah menceritakan kepada kami Abu Nu'aim dari Hisyam dari Qatadah dari Al Hasan dari Abu Rafi' dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika seseorang duduk di antara empat anggota badannya, lalu bersungguh-sungguh kepadanya, maka wajib banginya mandi.\" Hadits ini dikuatkan oleh 'Amru bin Marzuq dari Syu'bah seperti hadits tersebut. Dan Musa berkata, telah menceritakan kepada kami Aban berkata, telah menceritakan kepada kami Qatadah telah mengabarkan kepada kami Al Hasan seperti hadits tersebut.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "43",
    "matchingArabicURN": "102920",
    "last_updated": null
  },
  {
    "indonesianURN": "3002830",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "194",
    "babName": "Mencuci bagian badan yang terkena sesuatu yang keluar dari kemaluan wanita",
    "hadithNumber": "283",
    "hadithText": "Telah menceritakan kepada kami Abu Ma'mar telah menceritakan kepada kami 'Abdul Warits dari Al Husain, Yahya berkata, dan telah mengabarkan kepadaku Abu Salamah bahwa 'Atha' bin Yasar mengabarkan kepadanya, bahwa Zaid bin Khalid Al Juhaini mengabarkan kepadanya, bahwa dia bertanya kepada 'Utsman bin 'Affan, \"Bagaimana pendapatmu bila seseorang berhubungan dengan isterinya tapi tidak keluar air mani?\" 'Utsman bin 'Affan menjawab, \"Hendaknya ia berwudlu sebagaimana wudlu untuk shalat, lalu mencuci kemaluannya.\" 'Utsman lalu melanjutkan ucapannya, \"Aku mendengarnya dari Rasulullah shallallahu 'alaihi wasallam, dan aku juga pernah bertanya kepada 'Ali bin Abu Thalib, Az Zubair bin Al 'Awam, Thalhah bin 'Ubaidullah dan Ubay bin Ka'b? radliallahu 'anhum. Mereka semua memerintahkan seperti itu.\" Yahya berkata, telah mengabarkan kepadaku Abu Salamah bahwa 'Urwah bin Az Zubair mengabarkan kepadanya, bahwa Abu Ayyub mengabarkan kepadanya, bahwa ia mendengar seperti itu dari Rasulullah shallallahu 'alaihi wasallam.\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "44",
    "matchingArabicURN": "102930",
    "last_updated": null
  },
  {
    "indonesianURN": "3002840",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "5",
    "bookName": "Mandi",
    "babNumber": "194",
    "babName": "Mencuci bagian badan yang terkena sesuatu yang keluar dari kemaluan wanita",
    "hadithNumber": "284",
    "hadithText": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Yahya dari Hisyam bin 'Urwah berkata, telah mengabarkan kepadaku Bapakku ia berkata, telah mengabarkan kepadaku Abu Ayyub berkata, telah mengabarkan kepadaku Ubay bin Ka'b bahwa ia berkata, \"Wahai Rasulullah, bagaimana jika seseorang berhubungan dengan isterinya namun tidak keluar (mani)?\" beliau menjawab: \"Hendaklah ia cuci apa yang mengenai isterinya (kemaluan), lalu wudlu dan shalat.\" Abu 'Abdullah Al Bukhari berkata, \"Mandi adalah sikap yang lebih berhati-hati.\" Inilah akhir dari penjelasan bab ini, dan kami telah menerangkan perbedaan pendapat mereka (para imam).\"</b>",
    "bookID": "5.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "45",
    "matchingArabicURN": "102940",
    "last_updated": null
  }
]