[
  {
    "indonesianURN": "3053360",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2936",
    "babName": "Firman Allah \"Siapa yang  mau mengharamkan perhiasan Allah yang Allah keluarkan untuk hamba-Nya\"",
    "hadithNumber": "5337",
    "hadithText": "Telah menceritakan kepadaku Isma'il dia berkata; telah menceritakan kepadaku Malik dari Nafi' dan Abdullah bin Dinar serta Zaid bin Aslam mereka telah mengabarkan kepadanya dari Ibnu Umar radliallahu 'anhuma bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah tidak akan melihat orang yang menjulurkan pakaiannya dengan sombong.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "149890",
    "last_updated": null
  },
  {
    "indonesianURN": "3053370",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2937",
    "babName": "Menjulurkan kain bukan karena sombong",
    "hadithNumber": "5338",
    "hadithText": "Telah menceritakan kepada kami Ahmad bin Yunus telah menceritakan kepada kami Zuhair telah menceritakan kepada kami Musa bin 'Uqbah dari Salim bin Abdullah dari Ayahnya radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Siapa yang menjulurkan pakaiannya (hingga ke bawah mata kaki) dengan sombong, maka Allah tidak akan melihatnya pada hari Kiamat kelak.\" Lalu Abu Bakar berkata; \"Wahai Rasulullah, sesungguhnya salah satu dari sarungku terkadang turun sendiri, kecuali jika aku selalu menjaganya?\" lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Engkau bukan termasuk orang yang melakukan hal itu karena sombong.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "149900",
    "last_updated": null
  },
  {
    "indonesianURN": "3053380",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2937",
    "babName": "Menjulurkan kain bukan karena sombong",
    "hadithNumber": "5339",
    "hadithText": "Telah menceritakan kepadaku Muhammad telah mengabarkan kepada kami Abdul A'la dari Yunus dari Al Hasan dari Abu Bakrah radliallahu 'anhu dia berkata; \"Ketika kami berada di samping Nabi shallallahu 'alaihi wasallam, tiba-tiba terjadi gerhana Matahari, maka beliau segera berdiri menuju masjid, dan menarik pakainnya karena tergesa-gesa hingga tiba dimasjid. Lalu orang-orang pun segera berdiri di sisinya dan beliau mengerjakan shalat dua rakaat. Setelah matahari terang, beliau berkhutbah di hadapan kami seraya bersabda: \"Matahari dan bulan tidak mengalami gerhana karena kematian atau kelahiran seseorang, tetapi keduanya merupakan tanda diantara tanda-tanda kebesaran Allah. Jika kalian melihat kedua gerhana tersebut, maka shalatlah dan berdoalah hingga gerhana tersingkap dari kalian (nampak kembali).\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "149910",
    "last_updated": null
  },
  {
    "indonesianURN": "3053390",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2938",
    "babName": "Menyingsingkan baju",
    "hadithNumber": "5340",
    "hadithText": "Telah menceritakan kepadaku Ishaq telah mengabarkan kepada kami Ibnu Syumail telah mengabarkan kepada kami Umar bin Abu Za`idah telah mengabarkan kepada kami 'Aun bin Abu Juhaifah dari ayahnya Abu Juhaifah dia berkata; \"Lalu aku melihat Bilal datang dengan membawa tongkat (berujung runcing) dan menancapkan tongkat tersebut, kemudian dia mengumandangkan iqamah, setelah itu saya melihat Rasulullah shallallahu 'alaihi wasallam keluar (rumah) dengan menyingsingkan pakaiannya, lalu beliau shalat dua raka'at di hadapan tongkat tersebut, dan saya melihat orang-orang dan binatang pun lewat di hadapan beliau di belakang tongkat tersebut.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "149920",
    "last_updated": null
  },
  {
    "indonesianURN": "3053400",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2939",
    "babName": "Apa yang dibawah kaki adalah bagian neraka",
    "hadithNumber": "5341",
    "hadithText": "Telah menceritakan kepada kami Adam telah menceritakan kepada kami Syu'bah telah menceritakan kepada kami Sa'id bin Abu Sa'id Al Maqburi dari Abu Hurairah radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa menjulurkan kain sarungnya hingga dibawah mata kaki, maka tempatnya adalah neraka.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "149930",
    "last_updated": null
  },
  {
    "indonesianURN": "3053410",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2940",
    "babName": "Siapa yang menjulurkan kain karena sombong",
    "hadithNumber": "5342",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Yusuf telah mengabarkan kepada kami Malik dari Abu Az Zinnad dari Al A'raj dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada hari kiamat kelak, Allah tidak akan melihat orang yang menjulurkan kain sarungnya karena sombong.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "149940",
    "last_updated": null
  },
  {
    "indonesianURN": "3053420",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2940",
    "babName": "Siapa yang menjulurkan kain karena sombong",
    "hadithNumber": "5343",
    "hadithText": "Telah menceritakan kepada kami Adam telah menceritakan kepada kami Syu'bah telah menceritakan kepada kami Muhammad bin Ziyad dia berkata; saya mendengar Abu Hurairah berkata; Nabi shallallahu 'alaihi wasallam bersabda atau Abu Qasim shallallahu 'alaihi wasallam bersabda: \"Ketika seorang lelaki berjalan dengan menggunakan jubah yang ia kenakan, dan berjalan dengan rasa ta'ajub, lalu ia ditelan (oleh bumi), dan ia akan tetap berguncang-guncang (di dalam perut bumi) hingga datang hari kiamat.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "0",
    "last_updated": null
  },
  {
    "indonesianURN": "3053430",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2940",
    "babName": "Siapa yang menjulurkan kain karena sombong",
    "hadithNumber": "5344",
    "hadithText": "Telah menceritakan kepada kami Sa'id bin 'Ufair dia berkata; telah menceritakan kepadaku Al Laits dia berkata; telah menceritakan kepadaku Abdurrahman bin Khalid dari Ibnu Syihab dari Salim bin Abdullah bahwa Ayahnya telah menceritakan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Katika ada seseorang yang menjulurkan kain sarungnya maka dia akan berguncang-guncang (diadzab) di perut bumi hingga datangnya hari Kiamat.\" Hadits ini juga diperkuat oleh riwayat Yunus dari Az Zuhri namun dia tidak merafa'kannya (sanadnya tersambung sampai kepada Nabi shallallahu 'alaihi wasallam) yaitu dari Syu'aib dari Az Zuhri. Telah menceritakan kepadaku Abdullah bin Muhammad telah menceritakan kepada kami Wahb bin Jarir telah mengabarkan kepada kami Ayahku dari pamannya Jarir bin Zaid dia berkata; saya pernah bersama Salim bin Abdullah bin Umar berada di depan pintunya, lalu dia berkata; saya mendengar bahwa Abu Hurairah mendengar Nabi shallallahu 'alaihi wasallam bersabda seperti hadits di atas.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "149961",
    "last_updated": null
  },
  {
    "indonesianURN": "3053440",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2940",
    "babName": "Siapa yang menjulurkan kain karena sombong",
    "hadithNumber": "5345",
    "hadithText": "Telah menceritakan kepada kami Mathar bin Al Fadl telah menceritakan kepada kami Syababah telah menceritakan kepada kami Syu'bah dia berkata; saya berjumpa Muharib bin Ditsar di atas kudanya, ketika ia datang di tempat untuk memutuskan suatu perkara, lalu aku bertanya tentang suatu hadits, maka dia menceritakan kepadaku, katanya; saya mendengar Abdullah bin Umar radliallahu 'anhuma berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menjulurkan kainnya karena sombong, maka Allah tidak akan melihatnya pada hari Kiamat kelak.\" Lalu tanyaku kepada Muharib; \"Apakah beliau menyebutkan kain sarung?\" dia menjawab; \"Beliau tidak mengkhususkan kain sarung ataukah jubah.\" Hadits ini juga diperkuat oleh riwayat Jabalah bin Suhaim dan Zaid bin Aslam serta Zaid bin Abdullah dari Ibnu Umar dari Nabi Shallallahu 'alaihi. Al Laits mengatakan; dari Nafi' dari Ibnu Umar seperti itu. Dan diperkuat pula oleh riwayat Musa bin 'Uqbah, Umar bin Muhammad dan Qudamah bin Musa dari Salim dari Ibnu Umar dari Nabi shallallahu 'alaihi wasallam yaitu dengan redaksi: \"Barangsiapa menjulurkan pakainnya....\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "149980",
    "last_updated": null
  },
  {
    "indonesianURN": "3053450",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2941",
    "babName": "Sarung yang berumbai-umbai (berjuntai)",
    "hadithNumber": "5346",
    "hadithText": "Telah menceritakan kepada kami Abu Al Yaman telah mengabarkan kepada kami Syu'aib dari Az Zuhri telah mengabarkan kepadaku 'Urwah bin Az Zubair bahwa Aisyah radliallahu 'anha isteri Nabi shallallahu 'alaihi wasallam berkata; \"Telah datang isteri Rifa'ah Al Qurazhi kepada Nabi shallallahu 'alaihi wasallam, sementara diriku sedang duduk dan Abu Bakr ada di sisi beliau. Isteri Rifa'ah berkata; \"Wahai Rasulullah, sesungguhnya saya dahulu dibawah naungan Rifa'ah Al Qurazhi, kemudian ia menceraiku sama sekali (talak tiga). Kemudian saya menikah dengan Abdur Rahman bin Az Zubair, dan demi Allah wahai Rasulullah, tidaklah aku bersamanya melainkan ia tidak memiliki kemampuan kecuali seperti ujung pakaian ini.\" -seraya mengambil ujung jilbabnya, - sementara Khalid bin Sa'id ada di depan pintu, belum di izinkan masuk oleh beliau, Aisyah melanjutkan; \"Lantas Khalid berkata; \"Wahai Abu Bakr, tidakkah engkau menahan wanita ini berkata keji dengan apa yang ia katakan di sisi Rasulullah shallallahu 'alaihi wasallam?\" dan Rasulullah shallallahu 'alaihi wasallam hanya tersenyum mendengarnya, kemudian beliau bersabda: \"Sepertinya dirimu ingin kembali kepada Rifa'ah, Tidak, hingga kamu merasakan kenikmatannya dan ia merasakan kenikmatanmu.\" Maka hal itu menjadi ajaran beliau.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "149990",
    "last_updated": null
  },
  {
    "indonesianURN": "3053460",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2942",
    "babName": "Selempang / selendang",
    "hadithNumber": "5347",
    "hadithText": "Telah menceritakan kepada kami 'Abdan telah mengabarkan kepada kami Abdullah telah mengabarkan kepada kami Yunus dari Az Zuhri telah mengabarkan kepadaku Ali bin Husain bahwa Husain bin Ali telah mengabarkan kepadanya, bahwa Ali radliallahu 'anhu berkata; \"...lalu Nabi shallallahu 'alaihi wasallam meminta jubahnya kemudian beliau pergi berjalan, aku dan Zaid bin Haritsah pun turut mengikuti beliau hingga beliau tiba di Ka'bah yang di dalamnya ada Hamzah, kemudian beliau meminta izin, dan dia pun mengizinkan masuk.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "150000",
    "last_updated": null
  },
  {
    "indonesianURN": "3053470",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2943",
    "babName": "Gamis",
    "hadithNumber": "5348",
    "hadithText": "Telah menceritakan kepada kami Qutaibah telah menceritakan kepada kami Hammad dari Ayyub dari Nafi' dari Ibnu Umar radliallahu 'anhuma bahwa seorang laki-laki bertanya; \"Wahai Rasulullah, pakaian yang bagaimanakah yang tidak boleh dikenakan oleh orang yang berihram?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Ia tidak boleh memakai jubah, celana panjang, baju panjang yang bertutup kepala, dan tidak memakai sepatu kecuali bagi orang yang tidak mendapatkan dua sandal, hendaknya ia memotongnya hingga dibawah kedua mata kaki.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "150010",
    "last_updated": null
  },
  {
    "indonesianURN": "3053480",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2943",
    "babName": "Gamis",
    "hadithNumber": "5349",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Utsman telah mengabarkan kepada kami Ibnu 'Uyainah dari 'Amru dia mendengar Jabir bin Abdullah radliallahu 'anhuma berkata; \"Nabi shallallahu 'alaihi wasallam pernah mendatangi kuburan Abdullah bin Ubay setelah ia dikuburkan, beliau kemudian menyuruh untuk mengeluarkannya, lalu diletakkan di atas lututnya, beliau kemudian meniup sedikit air liurnya dan memakaikan bajunya.\" Wallahhu Ta'ala A'lam.</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "150020",
    "last_updated": null
  },
  {
    "indonesianURN": "3053490",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2943",
    "babName": "Gamis",
    "hadithNumber": "5350",
    "hadithText": "Telah menceritakan kepada kami Shadaqah telah mengabarkan kepada kami Yahya bin Sa'id dari 'Ubaidullah dia berkata; telah mengabarkan kepadaku Nafi' dari 'Abdullah dia berkata; Setelah Abdullah bin Ubay meninggal dunia, anaknya datang menemui Nabi shallallahu 'alaihi wasallam, dan berkata; 'Wahai Rasulullah, berikanlah baju engkau kepadaku hingga aku mengkafaninya dengan baju itu, shalatkanlah ia dan mintalah ampunan untuknya!\" lalu beliau memberikan baju beliau kepadanya. Kemudian beliau bersabda: \"Jika kalian telah selesai, beritahulah aku.\" Ketika telah selesai, maka anaknya Abdullah bin Ubay memberitahukan kepada beliau, lalu beliau datang untuk menshalatinya. Maka Umar menariknya seraya berkata; 'Tidakkah Allah telah melarang engkau untuk menshalatkan orang-orang munafik'. Namun beliau membaca ayat: \"Mintakanlah ampun untuk mereka atau kamu tidak memintakan ampun untuk mereka, sama saja jika kamu memintakan ampun untuk mereka sebanyak tujuh puluh kali maka Allah tidak akan mengampuni mereka.\" Lalu turunlah ayat, Dan janganlah kamu sekali-kali menshalatkan (jenazah) seorang yang mati diantara mereka, dan janganlah kamu berdiri (mendoakan) di kuburnya'. Akhirnya beliaupun tidak lagi menshalatkan mereka.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "0",
    "last_updated": null
  },
  {
    "indonesianURN": "3053500",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2944",
    "babName": "Saku baju semenjak dada dan lainnya",
    "hadithNumber": "5351",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Muhammad telah menceritakan kepada kami Abu 'Amir telah menceritakan kepada kami Ibrahim bin Nafi' dari Al Hasan dari Thawus dari Abu Hurairah dia berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam membuat perumpamaan orang yang bakhil dan orang yang suka bersedekah seperti dua orang yang memakai dua jubah dari besi, mulai dari payudara (dada) sampai tulang selangka mereka berdua. Jika orang tersebut ingin berinfak, maka baju besinya melebar atau bergerak hingga menutupi ujung jarinya dan menghilangkan bekas jalannya. Jika orang yang bakhil ingin berinfak, baju besinya mengerut, dan setiap baju besi tetap di tempatnya (tidak melebar) hingga mengambilnya dengan tulang selangkanya atau dengan lehernya.\" Abu Hurairah berkata; 'Aku menyaksikan bahwa ia melihat Rasulullah Shalallahu 'Alaihi Wa Sallam memberi isyarat dengan jari-jarinya dengan melebarkan tameng besi, namun aku melihat baju tersebut tidak melebar.' Hadits ini juga diperkuat oleh Ibnu Thawus dari Ayahnya dan Abu Az Zinnad dari Al A'raj mengenai dua jubah, sedangkan Hanzhalah mengatakan; aku mendengar Thawus saya mendengar Abu Hurairah mengatakan dua jubah, Ja'far bin Hayyan mengatakan dari Al A'raj yaitu dua jubah.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "150040",
    "last_updated": null
  },
  {
    "indonesianURN": "3053510",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2945",
    "babName": "Siapa yang memakai jubah yang lengannya sempit ketika safar",
    "hadithNumber": "5352",
    "hadithText": "Telah menceritakan kepada kami Qais bin Hafsh telah menceritakan kepada kami Abdul Wahid telah menceritakan kepada kami Al A'masy dia berkata; telah menceritakan kepadaku Abu Adl Dluha dia berkata; telah menceritakan kepadaku Masruq dia berkata; telah menceritakan kepadaku Al Mughirah bin Syu'bah dia berkata; \"Nabi shallallahu 'alaihi wasallam pergi untuk suatu kebutuhan, lalu beliau datang dan akupun langsung menemui beliau dengan membawa air, kemudian beliau berwudlu', waktu itu beliau sedang mengenakan jubah dari Syam, lalu beliau berkumur-kumur dan beristinsyaq (memasukkan air ke dalam hidung) serta membasuh wajahnya, beliau berusaha mengeluarkan kedua tangannya dari kedua lengan bajunya, karena sempit maka beliau mengeluarkan kedua tangan beliau melalui bawah jubahnya, lalu beliau membasuh kedua tangan beliau dan mengusap kepala beliau serta kedua sepatu beliau.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "150050",
    "last_updated": null
  },
  {
    "indonesianURN": "3053520",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2946",
    "babName": "Memakai jubah woll ketika perang",
    "hadithNumber": "5353",
    "hadithText": "Telah menceritakan kepada kami Abu Nu'aim telah menceritakan kepada kami Zakariya dari 'Amir dari 'Urwah bin Al Mughirah dari Ayahnya radliallahu 'anhu dia berkata; \"Pada suatu malam saya bersama Nabi shallallahu 'alaihi wasallam mengadakan suatu perjalanan, lalu beliau bersabda: \"Apakah kamu membawa air?\" jawabku; \"Ya.\" Kemudian beliau turun dari kendaraannya dan berjalan hingga menjauh dariku di gelapnya malam, setelah itu beliau kembali dan akupun menuangkan air dari wadah, kemudian beliau membasuh wajahnya dan tangannya, karena beliau mengenakan jubah dari shuf (bulu domba) beliau tidak dapat mengeluarkan kedua tangan beliau, akhirnya beliau mengeluarkannya dari bawah jubahnya, kemudian beliau membasuh kedua lengannya dan mengusap kepalanya, lalu aku jongkok hendak melepas sepatunya, namun beliau bersabda: \"Biarkanlah, karena aku mengenakan sepatu tersebut dalam kedaan suci.\" Lalu beliau sekedar mengusapnya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "17",
    "matchingArabicURN": "150060",
    "last_updated": null
  },
  {
    "indonesianURN": "3053530",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2947",
    "babName": "Kain yang lengannya sempit dan belakang dibelah berbahan sutera",
    "hadithNumber": "5354",
    "hadithText": "Telah menceritakan kepada kami Qutaibah bin Sa'id telah menceritakan kepada kami Al Laits dari Ibnu Abu Mulaikah dari Al Miswar bin Makhramah dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah membagi-bagikan aqbiah (sejenis jubah), namun beliau tidak memberi Makhramah sesuatu pun. Makhramah lalu berkata, \"Wahai anakku, mari ikut kami pergi menemui Rasulullah shallallahu 'alaihi wasallam.\" Maka aku pun pergi bersamanya. Makhramah berkata, \"Masuk dan mintakanlah untukku.\" Miswar berkata, \"Aku lalu memintakannya, hingga beliau keluar menemuinya (Makhramah) dengan membawa Quba (sejenis jubah). Beliau bersabda: \"Aku sembunyikan ini khusus untukmu.\" Makhramah pun melihat jubah tersebut dan berkata; \"Makhramah telah ridla.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "18",
    "matchingArabicURN": "150070",
    "last_updated": null
  },
  {
    "indonesianURN": "3053540",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2947",
    "babName": "Kain yang lengannya sempit dan belakang dibelah berbahan sutera",
    "hadithNumber": "5355",
    "hadithText": "Telah menceritakan kepada kami Qutaibah bin Sa'id telah menceritakan kepada kami Al Laits dari Yazid bin Abu Habib dari Abu Al Khair dari 'Uqbah bin 'Amir radliallahu 'anhu bahwa dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah diberi hadiah baju yang terbuat dari kain sutera, lalu beliau mengenakannya untuk shalat, seusai shalat beliau melepasnya dengan paksa seakan-akan beliau benci mengenakan baju tersebut, kemudian beliau bersabda: \"Baju ini tidak layak dipakai oleh orang-orang yang bertakwa.\" Hadits ini juga dikuatkan oleh Abdullah bin Yusuf dari Al Laits, dan yang lainnya juga mengatakan; \"Farraujun min hariirin (baju yang terbuat dari sutera).\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "19",
    "matchingArabicURN": "150080",
    "last_updated": null
  },
  {
    "indonesianURN": "3053550",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2948",
    "babName": "Tudung kepala",
    "hadithNumber": "5356",
    "hadithText": "Telah menceritakan kepada kami Isma'il dia berkata; telah menceritakan kepadaku Malik dari Nafi' dari Abdullah bin Umar bahwa seorang laki-laki berkata; \"Wahai Rasulullah, pakaian yang bagaimanakah yang dikenakan oleh orang yang berihram?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Ia tidak boleh memakai gamis (jubah), surban, celana panjang, baju panjang yang bertutup kepala, dan tidak memakai sepatu kecuali bagi orang yang tidak mendapatkan dua sandal, hendaknya ia memakai sepatu dan memotongnya hingga dibawah kedua mata kaki, dan janganlah kalian mengenakan pakaian yang dicampur dengan minyak za'faron dan tidak pula wars (sejenis tumbuhan yang berwarna kuning atau kunyit).\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "21",
    "matchingArabicURN": "150100",
    "last_updated": null
  },
  {
    "indonesianURN": "3053560",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2949",
    "babName": "Celana",
    "hadithNumber": "5357",
    "hadithText": "Telah menceritakan kepada kami Abu Nu'aim telah menceritakan kepada kami Sufyan dari 'Amru dari Jabir bin Zaid dari Ibnu Abbas dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa tidak mendapat sarung (ketika berihram), hendaknya ia mengenakan celana panjang, dan siapa yang tidak mendapatkan sandal, hendaknya ia mengenakan sepatu.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "22",
    "matchingArabicURN": "150110",
    "last_updated": null
  },
  {
    "indonesianURN": "3053570",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2949",
    "babName": "Celana",
    "hadithNumber": "5358",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Juwairiyah dari Nafi' dari Abdullah dia berkata; seorang laki-laki berdiri dan berkata; \"Wahai Rasulullah, pakaian apakah yang engkau perintahkan untuk kami kenakan ketika berihram?\" beliau bersabda: \"Janganlah kalian mengenakan gamis (jubah), celana panjang, surban, baju panjang yang bertutup kepala dan tidak pula sepatu kecuali jika seseorang tidak mendapatkan sandal, maka ia boleh mengenakan sepatu di bawah mata kaki, dan janganlah kalian mengenakan pakaian yang dicampuri dengan minyak za'faran dan tidak juga wars (sejenis tumbuhan yang berwarna kuning atau kunyit).\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "23",
    "matchingArabicURN": "150120",
    "last_updated": null
  },
  {
    "indonesianURN": "3053580",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2950",
    "babName": "mantel",
    "hadithNumber": "5359",
    "hadithText": "Telah menceritakan kepada kami Ali bin Abdullah telah menceritakan kepada kami Sufyan dia berkata; aku mendengar Az Zuhri, dia berkata; telah mengabarkan kepadaku Salim dari Ayahnya dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah seorang yang berihram mengenakan kain gamis (jubah), surban, celana panjang, baju lengan panjang yang bertutup kepala dan tidak pula pakaian yang tercampuri dengan minyak za'faran dan wars (sejenis tumbuhan berwarna kuning atau kunyit) serta tidak pula mengenakan sepatu, kecuali jika ia tidak mendapatkan sandal, dan harus memotongnya lebih rendah dari kedua mata kaki.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "24",
    "matchingArabicURN": "150130",
    "last_updated": null
  },
  {
    "indonesianURN": "3053590",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2951",
    "babName": "Cadar",
    "hadithNumber": "5360",
    "hadithText": "Telah menceritakan kepada kami Ibrahim bin Musa telah mengabarkan kepada kami Hisyam dari Ma'mar dari Az Zuhri dari 'Urwah dari Aisyah radliallahu 'anha dia berkata; \"Kaum Muslimin berhijrah ke negeri Habsyah, sementara Abu Bakar tengah mempersiapkan dirinya untuk berhijrah, maka Nabi shallallahu 'alaihi wasallam bersabda: \"Tunggulah, dan aku berharap supaya diizinkan untuk berhijrah.\" Lantas Abu Bakar berkata; \"Demi ayahku, apakah engkau berharap seperti itu?\" beliau menjawab; \"Ya.\" Maka Abu Bakr mengurungkan dirinya supaya dapat menyertai Nabi shallallahu 'alaihi wasallam berhijrah, dia pun memberi makan kedua untanya dengan dedaunan selama empat bulan, Urwah berkata; Aisyah melanjutkan; \"Di waktu menjelang siang, ketika kami sedang duduk-duduk di rumah, tiba-tiba seseorang berkata kepada Abu Bakr; \"Ini Nabi shallallahu 'alaihi wasallam ingin bertemu, dan beliau datang sambil menutupi sebagian kepala dan wajah beliau, dan beliau tidak pernah datang kepada kami di saat-saat seperti itu.\" Abu Bakr berkata; Demi ayah dan ibuku sebagai tebusannya, tidaklah beliau datang di waktu-waktu seperti ini melainkan ada sesuatu yang sangat penting.\" Lalu Nabi shallallahu 'alaihi wasallam datang dan meminta izin, maka Abu Bakr pun mengizinkannya masuk. Ketika beliau masuk, beliau berkata kepada Abu Bakr; \"Suruhlah orang-orang yang ada di sini untuk keluar.\" Abu Bakr menjawab; \"Demi ayahmu wahai Rasulullah, mereka semua adalah keluarga anda.\" Beliau bersabda: \"Sesungguhnya aku telah diizinkan untuk keluar (hijrah).\" Abu Bakr berkata; \"Demi ayah dan ibuku, apakah aku yang menyertai engkau wahai Rasulullah?\" beliau menjawab; \"Ya.\" Abu Bakr berkata; \"Kalau begitu, demi ayahku, ambillah salah satu tunggangan ini wahai Rasulullah.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Yang terbaik.\" Aisyah melanjutkan; \"Lalu kami mempersiapkan untuknya bekal dengan cepat dan sigap, kami membuat untuk keduanya Sufroh (tempat membawa makanan untuk musafir) dalam Jirab (bejana tempat menaruh perbekalan).\" Kemudian Asma' binti Abu Bakr memotong ikat pinggangnya, dan mengikatkan ke bejana tersebut. Dari situlah ia dinamai dengan dzatunnithaq (yang memiliki ikat pinggang). Kemudian, Rasulullah shallaallahu 'alaihi wa sallam dan Abu Bakr berangkat menuju gua di salah satu pegunungan yang dikenal dengan nama Tsur, mereka tinggal di sana selama tiga malam. Sementara Abdullah bin Abu Bakr juga ikut menginap bersama keduanya, dia adalah seorang pemuda yang cerdas dan berwawasan tinggi, ketika menjelang waktu sahur dia keluar (dari gua) dan berbaur dengan orang-orang Quraisy Makkah di pagi harinya untuk mencari informasi, dan tidaklah seseorang mendengar perkara tersebut melainkan ia akan menyimpan rahasia tersebut dan datang kepada keduanya untuk menyampaikan berita ketika malam telah gelap, sementara 'Amir bin Fuhairah bekas budak Abu Bakr sebagai penggembala domba untuk menghilangkan jejak, ia berangkat pada waktu Isya' dan bermalam di tempat penggembalaan sampai 'Amir bin Fuhairah datang membangunkannya di akhir malam (menjelang subuh), hal itu ia lakukan setiap malam hingga berlalu tiga malam.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "25",
    "matchingArabicURN": "150140",
    "last_updated": null
  },
  {
    "indonesianURN": "3053600",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2952",
    "babName": "Topi besi",
    "hadithNumber": "5361",
    "hadithText": "Telah menceritakan kepada kami Abu Al Walid telah menceritakan kepada kami Malik dari Az Zuhri dari Anas radliallahu 'anhu bahwa Nabi shallallahu 'alaihi wasallam masuk kota Makkah ketika penaklukan kota Makkah dengan mengenakan topi baju besi di kepalanya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "26",
    "matchingArabicURN": "150150",
    "last_updated": null
  },
  {
    "indonesianURN": "3053610",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2953",
    "babName": "Burud, Hibaroh dan Syamlah",
    "hadithNumber": "5362",
    "hadithText": "Telah menceritakan kepada kami Isma'il bin Abdullah dia berkata; telah menceritakan kepadaku Malik dari Ishaq bin Abdullah bin Abu Thalhah dari Anas bin Malik dia berkata; \"Saya berjalan bersama Rasulullah Shallallahu'alaihi wa Sallam, ketika itu beliau mengenakan kain (selimut) Najran yang tebal ujungnya, lalu ada seorang Arab badui (dusun) yang menemui beliau. Langsung ditariknya Rasulullah dengan kuat hingga saya melihat permukaan bahu beliau membekas lantaran ujung selimut akibat tarikan Arab badui yang kasar. Arab badui tersebut berkata; \"Wahai Muhammad berikan kepadaku dari harta yang diberikan Allah padamu\", maka Rasulullah Shallallahu'alaihi wa Sallam menoleh kepadanya diiringi senyum serta menyuruh salah seorang sahabat untuk memberikan sesuatu kepadanya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "27",
    "matchingArabicURN": "150160",
    "last_updated": null
  },
  {
    "indonesianURN": "3053620",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2953",
    "babName": "Burud, Hibaroh dan Syamlah",
    "hadithNumber": "5363",
    "hadithText": "Telah menceritakan kepada kami Qutaibah bin Sa'id telah menceritakan kepada kami Ya'qub bin Abdurrahman dari Abu Hazim dari Sahl bin Sa'd dia berkata; \"Seorang wanita datang sambil membawa selimut bersulam yang ada rendanya. Sahal berkata; Apa kamu tahu selimut apakah itu? Abu Hazm menjawab: Ya, ia adalah mantel bertutup kepala yang ujungnya berenda. Wanita itu berkata; \"Wahai Rasulullah! Aku menenun selimut ini dengan tanganku, aku membawanya untuk mengenakannya pada baginda. Lalu Rasulullah shallallahu 'alaihi wasallam mengambilnya karena memang membutuhkannya. Lalu beliau keluar menemui kami ternyata selimut itu berupa kain sarung, kemudian seseorang dari suatu kaum datang menemui beliau dan berkata; \"Kenakanlah untukku wahai Rasulullah! Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya.\" Kemudian beliau duduk di majlis sebagaimana yang di kehendaki Allah, lalu pulang. Setelah itu beliau melipat kain tersebut dan memberikannya pada orang itu. Orang-orang berkata pada orang itu; \"Demi Allah, kau berlaku kurang ajar. Kamu telah memintanya dia saat beliau memerlukannya, padahal kau tahu beliau tidak pernah menolak seorang peminta pun.\" Orang itu berkata; \"Demi Allah, aku tidak memintanya melainkan untuk aku jadikan sebagai kafanku pada saat aku meninggal.\" Sahal berkata; \"Maka selimut itu dijadikan kafannya saat ia meninggal.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "28",
    "matchingArabicURN": "150170",
    "last_updated": null
  },
  {
    "indonesianURN": "3053630",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2953",
    "babName": "Burud, Hibaroh dan Syamlah",
    "hadithNumber": "5364",
    "hadithText": "Telah menceritakan kepada kami Abu Al Yaman telah mengabarkan kepada kami Syu'aib dari Az Zuhri dia berkata; telah menceritakan kepadaku Sa'id bin Al Musayyab bahwa Abu Hurairah radliallahu 'anhu berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada satu rombongan dari umatku yang akan masuk surga, jumlah mereka tujuh puluh ribu, wajah mereka bersinar seperti rembulan di malam purnama, \" lalu Ukasyah bin Mihshan Al Asadi mengangkat namirah (semacam kain wool) yang ia kenakan seraya berkata; \"Wahai Rasulullah, do'akanlah aku agar termasuk dari mereka, \" maka beliau bersabda: \"Ya Allah, jadikanlah ia termasuk dari mereka, \" kemudian seorang laki-laki dari Anshar bangun dan berkata; \"Wahai Rasulullah, do'akanlah aku agar termasuk dari mereka, \" maka beliau bersabda: \"Engkau telah didahului Ukasyah.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "29",
    "matchingArabicURN": "150180",
    "last_updated": null
  },
  {
    "indonesianURN": "3053640",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2953",
    "babName": "Burud, Hibaroh dan Syamlah",
    "hadithNumber": "5365",
    "hadithText": "Telah menceritakan kepada kami 'Amru bin 'Ashim telah menceritakan kepada kami Hammam dari Qatadah dari Anas, (Qatadah) bertanya kepadanya; \"Pakaian apakah yang paling disukai Nabi shallallahu 'alaihi wasallam?\" dia menjawab; \"Al hibarah (kain yang direnda atau bergaris).\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "0",
    "last_updated": null
  },
  {
    "indonesianURN": "3053650",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2953",
    "babName": "Burud, Hibaroh dan Syamlah",
    "hadithNumber": "5366",
    "hadithText": "Telah menceritakan kepadaku Abdullah bin Abu Al Aswad telah menceritakan kepada kami Mu'adz dia berkata; telah menceritakan kepadaku Ayahku dari Qatadah dari Anas bin Malik radliallahu 'anhu dia berkata; \"Pakaian yang paling disukai oleh Nabi shallallahu 'alaihi wasallam adalah memakai hibarah (kain yang direnda atau bergaris).\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "31",
    "matchingArabicURN": "150200",
    "last_updated": null
  },
  {
    "indonesianURN": "3053660",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2953",
    "babName": "Burud, Hibaroh dan Syamlah",
    "hadithNumber": "5367",
    "hadithText": "Telah menceritakan kepada kami Abu Al Yaman telah mengabarkan kepada kami Syu'aib dari Az Zuhri dia berkata; telah mengabarkan kepadaku Abu Salamah bin Abdurrahman bin Auf bahwa Aisyah radliallahu 'anha isteri Nabi shallallahu 'alaihi wasallam telah mengabarkan kepadanya bahwa ketika Rasulullah shallallahu 'alaihi wasallam meninggal dunia, beliau ditutupi dengan kain hibarah (kain yang direnda atau bergaris).</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "32",
    "matchingArabicURN": "150210",
    "last_updated": null
  },
  {
    "indonesianURN": "3053670",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2954",
    "babName": "Kain dan Khamisah",
    "hadithNumber": "5368",
    "hadithText": "Telah menceritakan kepada kami Yahya bin Bukair telah menceritakan kepada kami Al Laits dari 'Uqail dari Ibnu Syihab dia berkata; telah mengabarkan kepadaku 'Ubaidullah bin Abdullah bin 'Utbah bahwa Aisyah dan Abdullah bin Abbas radliallahu 'anhum berkata; \"Tatkala diturunkan kepada Rasulullah Shallallahu'alaihi wasallam (penyakit yang mengakibatkan kematiannya) maka beliau menutupkan kain di wajahnya, ketika beliau tidak bisa keluar maka beliau membuka selimutnya dari wajahnya. Lalu beliau bersabda: \"Allah melaknat orang-orang Yahudi dan Nasrani yang telah menjadikan kuburan nabi-nabi mereka sebagai masjid.\" Beliau memberi peringatan atas perbuatan mereka.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "33",
    "matchingArabicURN": "150220",
    "last_updated": null
  },
  {
    "indonesianURN": "3053680",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2954",
    "babName": "Kain dan Khamisah",
    "hadithNumber": "5369",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Ibrahim bin Sa'd telah menceritakan kepada kami Ibnu Syihab dari 'Urwah dari Aisyah dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah shalat dengan mengenakan pakaian bercorak (bergaris atau berbatik), lalu beliau melihat corak tersebut (ketika shalat), seusai salam beliau Shallallahu'alaihi wasallam bersabda: 'Pergilah kalian dengan pakaianku ini kepada Abu Jahm, karena ia telah mengganggu shalatku tadi, dan ambilkan untukku baju lain yang tidak bercorak atau berbatik milik Abu Jahm bin Hudzaifah bin Ghanim dari Bani 'Adi bin Ka'b.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "34",
    "matchingArabicURN": "150230",
    "last_updated": null
  },
  {
    "indonesianURN": "3053690",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2954",
    "babName": "Kain dan Khamisah",
    "hadithNumber": "5370",
    "hadithText": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Isma'il telah menceritakan kepada kami Ayyub dari Humaid bin Hilal dari Abu Burdah dia berkata; Aisyah penah mengeluarkan pakaian dan kain sarung yang kasar, lalu dia berkata; \"Ruhnya Nabi shallallahu 'alaihi wasallam diambil ketika beliau mengenakan dua kain ini.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "35",
    "matchingArabicURN": "150240",
    "last_updated": null
  },
  {
    "indonesianURN": "3053700",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2955",
    "babName": "Memakai baju tanpa lengan",
    "hadithNumber": "5371",
    "hadithText": "Telah menceritakan kepadaku Muhammad bin Basyar telah menceritakan kepada kami Abdul Wahab telah menceritakan kepada kami 'Ubaidullah dari Khubaib dari Hafsh bin 'Ashim dari Abu Hurairah radliallahu 'anhu dia berkata; Nabi shallallahu 'alaihi wasallam melarang (praktek jual beli) dengan system Mulamasah (wajib membeli jika ada pembeli yang menyentuh barang penjual) dan Munabadzah (wajib membeli jika ada penjual yang melempar dagangannya ke pembeli tanpa memeriksa terlebih dahulu), dan melarang shalat (sunnah) setelah subuh hingga matahari meninggi dan shalat setelah Ashar hingga matahari terbenam, dan melarang duduk ihtiba' (dengan menekuk kedua lututnya dan menempelkan ke dadanya) dengan mengenakan satu kain yang menengadahkan kemaluannya ke langit, dan melarang isytimalus shama' (seseorang berselimut dengan bajunya dan tidak memberikan celah sedikitpun, hingga jika tersingkap auratnya rawan terbuka).</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "36",
    "matchingArabicURN": "150250",
    "last_updated": null
  },
  {
    "indonesianURN": "3053710",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2955",
    "babName": "Memakai baju tanpa lengan",
    "hadithNumber": "5372",
    "hadithText": "Telah menceritakan kepada kami Yahya bin Bukair telah menceritakan kepada kami AL Laits dari Yunus dari Ibnu Syihab dia berkata; telah mengabarkan kepadaku 'Amir bin Sa'd bahwa Abu Sa'id Al khudri berkata; Rasulullah shallallahu 'alaihi wasallam melarang mengenakan dua pakaian dan dua transaksi jual beli, melarang mulamasah dan munabadzah dalam jual beli, sedangkan mulamasah adalah seseorang yang memegang pakaian orang lain pada malam hari atau siang hari dan tidak membalikkannya (memeriksanya) kecuali dengan itu, dan Munabadzah ialah seseorang melempar pakaiannya ke orang lain dan sebaliknya, lalu terjadilah transaksi jual beli tanpa boleh memeriksa dan juga kerelaan dari dua belah ihak. dan melarang mengenakan dua pakaian yaitu isytimalus shama', shama' ialah meletakkan (menggantungkan) pakaiannya disalah satu pundaknya dan membuka salah satu betisnya tanpa mengenakan pakaian (dalam) lainnya, dan yang lain adalah menutup (seluruh badannya) dengan kainnya sambil duduk, sementara kemaluannya tidak mengenakan apa-apa.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "37",
    "matchingArabicURN": "150260",
    "last_updated": null
  },
  {
    "indonesianURN": "3053720",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2956",
    "babName": "Duduk ihtiba' dengan satu kain",
    "hadithNumber": "5373",
    "hadithText": "Telah menceritakan kepada kami Isma'il dia berkata; telah menceritakan kepadaku Malik dari Abu Az Zinad dari Al A'raj dari Abu Hurairah radliallahu 'anhu dia berkata; Rasulullah shallallahu 'alaihi wasallam melarang mengenakan dua kain yaitu seseorang menutup seluruh badannya dengan kain (sarung) nya sementara kemaluannya tidak ditutupi (dengan sesuatu yang lain) dan berselimutkan kain tanpa menutup salah satu dari betisnya, dan melarang mulamasah (wajib membeli jika ada pembeli yang menyentuh barang penjual) dan Munabadzah (wajib membeli jika ada penjual yang melempar dagangannya ke pembeli tanpa memeriksa terlebih dahulu),</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "38",
    "matchingArabicURN": "150270",
    "last_updated": null
  },
  {
    "indonesianURN": "3053730",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2956",
    "babName": "Duduk ihtiba' dengan satu kain",
    "hadithNumber": "5374",
    "hadithText": "Telah menceritakan kepadaku Muhammad dia berkata; telah mengabarkan kepadaku Makhlad telah mengabarkan kepada kami Ibnu Juraij dia berkata; telah mengabarkan kepadaku Ibnu Syihab dari 'Ubaidullah bin Abdullah dari Abu Sa'id Al Khudri radliallahu 'anhu bahwa Nabi shallallahu 'alaihi wasallam melarang isytimalus shama' (seseorang berselimut dengan bajunya dan tidak memberikan celah sedikitpun, hingga jika tersingkap auratnya rawan terbuka) dan seseorang yang berselimutkan kain satu lembar tanpa mengenakan kemaluannya dengan kain yang lain.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "39",
    "matchingArabicURN": "150280",
    "last_updated": null
  },
  {
    "indonesianURN": "3053740",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2957",
    "babName": "Khamisah hitam",
    "hadithNumber": "5375",
    "hadithText": "Telah menceritakan kepada kami Abu Nu'aim telah menceritakan kepada kami Ishaq bin Sa'id dari ayahnya Sa'id bin Fulan yaitu 'Amru bin Sa'id bin Al 'Ash dari Ummu Khalid binti Khalid bahwa Nabi shallallahu 'alaihi wasallam pernah diberi kain kecil yang ada renda suteranya. Lalu beliau bertanya: \"Menurut kalian siapa yang paling berhak untuk mendapat kain ini?\", orang-orang pun diam. Beliau lalu bersabda: \"Datangkanlah Ummu Khalid kepadaku.\" Beliau lantas memberikan kain tersebut dan memakaikannya kepadanya. Setelah itu beliau bersabda: 'Semoga tahan lama hingga Allah menggantinya dengan yang baru (panjang umur).' Beliau kemudian melihat corak berwarna hijau atau kuning yang ada pada kain bersulam sutera tersebut, beliau bersabda: \"Wahai Ummu Khalid, ini sanah, sanah.\" Sanah adalah perkataan bahasa Habasyah yang berarti bagus.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "40",
    "matchingArabicURN": "150290",
    "last_updated": null
  },
  {
    "indonesianURN": "3053750",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2957",
    "babName": "Khamisah hitam",
    "hadithNumber": "5376",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Al Mutsanna dia berkata; telah menceritakan kepadaku Ibnu Abu 'Adi dari Ibnu 'Aun dari Muhammad dari Anas radliallahu 'anhu dia berkata; Ketika Ummu Sulaim melahirkan, dia berkata kepadaku; \"Wahai Anas, lihatlah bayi kecil ini, dan jangan sampai ia mendapatkan sesuatu (untuk dimakan) sehingga besok pagi kita menemui nabi shallallahu 'alaihi wasallam supaya beliau mentahniknya (mengunyahkan buah kurma kemudian dimasukkan ke dalam mulut bayi), keesokan harinya aku bersamanya menemui Nabi, ketika itu beliau tengah berada di kebun, beliau mengenakan kain yang ada renda suteranya dan tengah membuat tanda pada binatang yang diberikan kepada beliau di hari penaklukan kota Makkah.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "41",
    "matchingArabicURN": "150300",
    "last_updated": null
  },
  {
    "indonesianURN": "3053760",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2958",
    "babName": "Baju hijau",
    "hadithNumber": "5377",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Basyar telah menceritakan kepada kami Abdul Wahhab telah mengabarkan kepada kami Ayyub dari Ikrimah bahwa Rifa'ah telah menceraikan isterinya, kemudian isterinya menikah dengan Abdurrahman bin Zubair Al Qurdli, Aisyah berkata; \"Ketika itu mantan isteri Rifa'ah tengah mengenakan kerudung hijau, lalu mantan isteri Rifa'ah mengadukan permasalahannya kepada Aisyah, mantan isteri Rifaah memperlihatkan bekas hijau di kulitnya. Ketika Rasulullah shallallahu 'alaihi wasallam datang -kala itu para wanita membela satu sama lainnya. Kata 'Aisyah 'Sungguh yang kulihat padanya, seperti yang ditemui wanita mukminah lainnya, sungguh kulitnya jauh lebih hijau dari pada bajunya. Kata Ikrimah, tiba-tiba Abdurrahman datang bersama dua anaknya yang di hasilkan bukan dari isteri keduanya (mantan isteri Rifa'ah). Isterinya berkata; \"Demi Allah, tidaklah aku berdosa ketika bersamanya melainkan karena ia tidak dapat memuaskan diriku.\" Sambil memegang ujung kainnya. Abdurrahman berkata; \"Demi Allah, ia dusta wahai Rasulullah, sesungguhnya aku dapat memuaskannya, akan tetapi ia berbuat nusyuz (membangkang terhadap perintah suami) karena ia hendak kembali kepada Rifa'ah. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila seperti itu, maka kamu tidak halal bagi Rifa'ah atau tidak sah bagi Rifa'ah hingga ia (suami kedua) merasakan madumu.\" Ikrimah berkata; \"Lalu Abdurrahman memperlihatkan kedua anaknya, beliau pun bersabda: \"Apakah mereka semua anak-anakmu?\" Abdurrahman menjawab; \"Ya.\" Beliau bersabda: \"Demi Allah, ini adalah sesuatu yang kamu sangka? demi Allah, mereka lebih menyerupai dengan ayahnya dari pada burung gagak dengan induknya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "42",
    "matchingArabicURN": "150310",
    "last_updated": null
  },
  {
    "indonesianURN": "3053770",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2959",
    "babName": "Baju putih",
    "hadithNumber": "5378",
    "hadithText": "Telah menceritakan kepada kami Ishaq bin Ibrahim Al Hanzhali telah mengabarkan kepada kami Muhammad bin Bisyr telah menceritakan kepada kami Mis'ar dari Sa'd bin Ibrahim dari Ayahnya dari Sa'd dia berkata; saya melihat di samping kanan dan kiri Nabi shallallahu 'alaihi wasallam dua orang laki-laki tengah mengenakan pakaian serba putih pada waktu perang Uhud, aku tidak pernah melihat sebelum dan sesudahnya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "43",
    "matchingArabicURN": "150320",
    "last_updated": null
  },
  {
    "indonesianURN": "3053780",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2959",
    "babName": "Baju putih",
    "hadithNumber": "5379",
    "hadithText": "Telah menceritakan kepada kami Abu Ma'mar telah menceritakan kepada kami Abdul Warits dari Al Husain dari Abdullah bin Buraidah dari Yahya bin Ya'mar dia menceritakan kepadanya bahwa Abu Aswad Ad Du`ali telah menceritakan kepadanya bahwa Abu Dzar radliallahu 'anhu telah menceritakan kepadanya, dia berkata; \"Saya pernah menemui Nabi shallallahu 'alaihi wasallam sementara beliau sedang tidur sambil mengenakan baju putih, lalu aku datang menemuinya dan beliau pun terbangun, beliau bersabda: \"Tidaklah seorang hamba yang mengucapkan \"LA ILAAHA ILLALLAH\" kemudian mati karena itu melainkan ia akan masuk surga.\" Tanyaku selanjutnya; \"Walaupun dia berzina dan mencuri?\" beliau menimpali: \"Walaupun dia pernah berzina dan mencuri.\" Tanyaku lagi; \"Walaupun dia pernah berzina dan mencuri?\" beliau menjawab: \"Walaupun dia pernah berzina dan mencuri.\" Tanyaku lagi; 'Walaupun dia pernah berzina dan mencuri?\" beliau menjawab: \"Walaupun dia pernah berzina dan mencuri.\" -walaupun sepertinya Abu Dzar kurang puas- Apabila Abu Dzar menceritakan hal ini, maka dia akan mengatakan; \"Walaupun\" sepertinya Abu Dzar kurang puas. Abu Abdullah mengatakan; \"Hal ini jika terjadi ketika seorang hamba itu meninggal atau sebelum dia meninggal lalu bertaubat dan menyesali perbuatannya serta mengucapkan \"LAA ILAAHA ILLALLAH\", maka dosa-dosanya akan terampuni.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "44",
    "matchingArabicURN": "150330",
    "last_updated": null
  },
  {
    "indonesianURN": "3053790",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2960",
    "babName": "Memakai sutera dan dihamparkan untuk laki-laki",
    "hadithNumber": "5380",
    "hadithText": "Telah menceritakan kepada kami Adam telah menceritakan kepada kami Syu'bah telah menceritakan kepada kami Qatadah dia berkata; saya mendengar Abu Utsman An Nahdi telah datang dengan membawa kitabnya Umar sementara kami waktu itu tengah bersama Utbah bin Farqad di Adrabijan bahwa Rasulullah shallallahu 'alaihi wasallam melarang mengenakan kain sutera kecuali hanya sebatas ini dan ini, dan beliau mengisyaratkan dengan kedua jarinya yaitu jari telunjuk dan jari tengah, Abu Utsman mengatakan; \"Sebagaimana yang kami ketahui yang di maksud itu adalah coraknya atau garis-garis.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "45",
    "matchingArabicURN": "150340",
    "last_updated": null
  },
  {
    "indonesianURN": "3053800",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2960",
    "babName": "Memakai sutera dan dihamparkan untuk laki-laki",
    "hadithNumber": "5381",
    "hadithText": "Telah menceritakan kepada kami Ahmad bin Yunus telah menceritakan kepada kami Zuhair telah menceritakan kepada kami 'Ashim dari Abu Utsman dia berkata; Umar pernah mengirim surat kepada kami ketika kami berada di Adribijan bahwa Nabi shallallahu 'alaihi wasallam melarang mengenakan kain sutera kecuali hanya sebatas ini, dan Nabi shallallahu 'alaihi wasallam mengisyarakan dengan kedua jarinya, lalu Zuhair mengangkat jari telunjuk dan jari tengahnya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "46",
    "matchingArabicURN": "150350",
    "last_updated": null
  },
  {
    "indonesianURN": "3053810",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2960",
    "babName": "Memakai sutera dan dihamparkan untuk laki-laki",
    "hadithNumber": "5382",
    "hadithText": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Yahya dari At Taimi dari Abu Utsman dia berkata; \"Ketika kami tengah bersama Utbah, Umar radliallahu 'anhu menulis surat kepadanya bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang mengenakan kain sutera ketika di dunia, melainkan tidak akan dikenakan kepadanya kelak di Akhirat.\" Telah menceritakan kepada kami Al Hasan bin Umar telah menceritakan kepada kami Mu'tamir telah menceritakan kepada kami Ayahku telah menceritakan kepada kami Abu Utsman kemudian Abu Utsman mengisyaratkan dengan jari telunjuknya dan jari tengahnya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "47",
    "matchingArabicURN": "150360",
    "last_updated": null
  },
  {
    "indonesianURN": "3053820",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2960",
    "babName": "Memakai sutera dan dihamparkan untuk laki-laki",
    "hadithNumber": "5383",
    "hadithText": "Telah menceritakan kepada kami Sulaiman bin Harb telah menceritakan kepada kami Syu'bah dari Al Hakam dari Ibnu Abu Laila dia berkata; \"Ketika Hudzaifah berada di negeri Mada'in, dia meminta air minum, lalu Dihqan (kepala suku) memberinya air dari tempat yang terbuat dari perak, maka Hudzaifah langsung melemparnya sambil berkata; \"Sesungguhnya aku tidak melemparnya melainkan aku telah melarangnya, namun ia tidak juga jera (menggunakan tempat minum dari perak) padahal Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Emas, perak, kain sutera dan dibaj (campuran kain sutera) adalah milik mereka (orang-orang kafir) semasa di dunia, dan untuk kalian di Akhirat.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "48",
    "matchingArabicURN": "150380",
    "last_updated": null
  },
  {
    "indonesianURN": "3053830",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2960",
    "babName": "Memakai sutera dan dihamparkan untuk laki-laki",
    "hadithNumber": "5384",
    "hadithText": "Telah menceritakan kepada kami Adam telah menceritakan kepada kami Syu'bah telah menceritakan kepada kami Abdul Aziz bin Shuhaib dia berkata; saya mendengar Anas bin Malik, Syu'bah berkata; \"Tentang apakah nabi shallallahu 'alaihi wasallam marah?\" Anas menjawab; \"Nabi shallallahu 'alaihi wasallam sangat marah sekali, dia melanjutkan; \"yaitu barangsiapa mengenakan kain sutera di dunia, maka ia tidak akan memakainya di Akhirat kelak.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "49",
    "matchingArabicURN": "150390",
    "last_updated": null
  },
  {
    "indonesianURN": "3053840",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2960",
    "babName": "Memakai sutera dan dihamparkan untuk laki-laki",
    "hadithNumber": "5385",
    "hadithText": "Telah menceritakan kepada kami Sulaiman bin Harb telah menceritakan kepada kami Hammad bin Zaid dari Tsabit dia berkata; saya mendengar Ibnu Zubair berkhutbah, katanya; \"Muhammad shallallahu 'alaihi wasallam telah bersabda: \"Barangsiapa mengenakan kain sutera di dunia, maka ia tidak akan memakainya di Akhirat kelak.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "50",
    "matchingArabicURN": "150400",
    "last_updated": null
  },
  {
    "indonesianURN": "3053850",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2960",
    "babName": "Memakai sutera dan dihamparkan untuk laki-laki",
    "hadithNumber": "5386",
    "hadithText": "Telah menceritakan kepada kami Ali bin Al Ja'd telah mengabarkan kepada kami Syu'bah dari Abu Dzibyan Khalifah bin Ka'b dia berkata; saya mendengar Ibnu Az Zubair berkata; saya mendengar Umar berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"barangsiapa mengenakan kain sutera di dunia, maka tidak akan dikenakan kepadanya di Akhirat kelak.\" Abu Ma'mar mengatakan; telah menceritakan kepada kami Abdul Warits dari Yazid, Mu'adzah mengatakan; telah menceritakan kepadaku Ummu 'Amru binti Abdullah saya mendengar Abdullah bin Zubair mendengar Umar bahwa dia mendengar Nabi shallallahu 'alaihi wasallam seperti hadits di atas.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "51",
    "matchingArabicURN": "150411",
    "last_updated": null
  },
  {
    "indonesianURN": "3053860",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2960",
    "babName": "Memakai sutera dan dihamparkan untuk laki-laki",
    "hadithNumber": "5387",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Basyar telah menceritakan kepada kami Utsman bin Umar telah menceritakan kepada kami Ali bin Al Mubarrak dari Yahya bin Abu Katsir dari Imran bin Hitthan dia berkata; saya bertanya kepada Aisyah mengenai kain sutera, lalu dia berkata; datanglah kepada Ibnu Abbas dan bertanyalah kepadanya, Imran berkata; \"lalu aku bertanya kepada Ibnu Abbas, namun dia menjawab; \"Tanyakanlah kepada Ibnu Umar, Imran melanjutkan; \"Lalu saya bertanya kepada Ibnu Umar, dia menjawab; telah mengabarkan kepadaku Abu Hafsh Umar bin AL Khatthab bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hanya saja yang mengenakan kain sutera di dunia, yaitu orang yang tidak mendapatkan bagiannya di akhirat kelak.\" Maka kataku; \"Benar, dan Abu Hafsh tidak mungkin berdusta atas nama Rasulullah shallallahu 'alaihi wasallam.\" Abdullah bin Raja` mengatakan; telah menceritakan kepada kami Harb dari Yahya telah menceritakan kepadaku Imran lalu dia menceritakan hadits tersebut.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "52",
    "matchingArabicURN": "150430",
    "last_updated": null
  },
  {
    "indonesianURN": "3053870",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2961",
    "babName": "Menyentuh sutera dengan tanpa memakai",
    "hadithNumber": "5388",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Musa dari Isra`il dari Abu Ishaq dari Al Barra` radliallahu 'anhu dia berkata; Nabi shallallahu 'alaihi wasallam diberi hadiah sepotong kain sutera, kamipun memegangnya dan merasa heran dengan kain tersebut, maka Nabi shallallahu 'alaihi wasallam bersabda: \"Apakah kalian heran dengan kain ini?\" kami menjawab; \"Ya.\" Beliau bersabda: \"Saputangan Mu'adz di surga lebih bagus dari pada ini.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "53",
    "matchingArabicURN": "150440",
    "last_updated": null
  },
  {
    "indonesianURN": "3053880",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2962",
    "babName": "Sutera untuk alas (kasur, hamparan)",
    "hadithNumber": "5389",
    "hadithText": "Telah menceritakan kepada kami Ali telah menceritakan kepada kami Wahb bin Jarir telah menceritakan kepada kami Ayahku dia berkata; saya mendengar Ibnu Abu Najih dari Mujahid dari Ibnu Abu Laila dari Hudzaifah radliallahu 'anhu dia berkata; \"Nabi shallallahu 'alaihi wasallam melarang kami minum dari tempat yang terbuat dari emas dan perak, beliau juga melarang kami makan dari tempat tersebut, memakai kain sutera dan dibaj (kain sutera campuran) serta melarang duduk di atas kain tersebut.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "54",
    "matchingArabicURN": "150450",
    "last_updated": null
  },
  {
    "indonesianURN": "3053890",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2963",
    "babName": "Sutera yang diistilahkan Alqassi",
    "hadithNumber": "5390",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Muqatil telah mengabarkan kepada kami Abdullah telah mengabarkan kepada kami Sufyan dari Asy'ats bin Abu Asy Sya'tsa' telah menceritakan kepada kami Mu'awiyah bin Suwaid bin Muqarrin dari Al Barra` bin 'Azib dia berkata; \"Nabi shallallahu 'alaihi wasallam melarang kami mengenakan tirai yang terbuat dari sutera dan Qasiy (sutera campuran).\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "55",
    "matchingArabicURN": "150460",
    "last_updated": null
  },
  {
    "indonesianURN": "3053900",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2964",
    "babName": "Rukhsah kaum laki-laki memakai sutera karena gatal",
    "hadithNumber": "5391",
    "hadithText": "Telah menceritakan kepada kami Muhammad telah mengabarkan kepada kami Waki' telah mengabarkan kepada kami Syu'bah dari Qatadah dari Anas dia berkata; Nabi shallallahu 'alaihi wasallam pernah memberi izin kepada Zubair dan Abdurrahman untuk memakai kain sutera karena penyakit gatal yang dideritanya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "56",
    "matchingArabicURN": "150470",
    "last_updated": null
  },
  {
    "indonesianURN": "3053910",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2965",
    "babName": "Sutera untuk wanita",
    "hadithNumber": "5392",
    "hadithText": "Telah menceritakan kepada kami Sulaiman bin Harb telah menceritakan kepada kami Syu'bah. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku Muhammad bin Basysyar telah menceritakan kepada kami Ghundar telah menceritakan kepada kami Syu'bah dari Abdul Malik bin Maisarah dari Zaid bin Wahb dari Ali bin Abu Thalib radliallahu 'anhu dia berkata; \"Nabi shallallahu 'alaihi wasallam memberiku sejenis mantel yang bersulam sutera, kemudian aku keluar dengan mengenakannya, namun aku melihat kemarahan di wajah beliau, maka baju itu kubagikan kepada para saudara-saudara perempuanku.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "57",
    "matchingArabicURN": "150480",
    "last_updated": null
  },
  {
    "indonesianURN": "3053920",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2965",
    "babName": "Sutera untuk wanita",
    "hadithNumber": "5393",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il dia berkata; telah menceritakan kepadaku Juwairiyah dari Nafi' dari Abdullah bahwa Umar radliallahu 'anhu pernah melihat sejenis mantel yang bersulam sutera dijual, lalu dia berkata; \"Wahai Rasulullah, andaikan baginda mau membelinya dan memakainya untuk menemui para utusan ketika berkunjung menemui anda atau untuk dikenakan waktu shalat Jum'at.\" Beliau lalu bersabda: \"Yang memakai pakaian ini hanyalah mereka yang tidak mendapatkan bagian di akhirat.\" Hari berikutnya beliau memberi Umar sejenis mantel yang terbuat dari sutera, Umar pun protes; \"Wahai Rasulullah! Anda memberikannya kepadaku padahal anda berujar tidak boleh memakainya.\" Beliau menjawab: \"Saya memberikan kepadamu bukan untuk dipakai, tetapi agar kamu jual atau kamu berikan kepada istrimu.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "58",
    "matchingArabicURN": "150490",
    "last_updated": null
  },
  {
    "indonesianURN": "3053930",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2965",
    "babName": "Sutera untuk wanita",
    "hadithNumber": "5394",
    "hadithText": "Telah menceritakan kepada kami Abu Al Yaman telah mengabarkan kepada kami Syu'aib dari Az Zuhri dia berkata; telah mengabarkan kepadaku Anas bin Malik bahwa dia pernah melihat Ummu Kultsum 'alaiha salam puteri Rasulullah shallallahu 'alaihi wasallam mengenakan kain yang bersulam sutera.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "59",
    "matchingArabicURN": "150500",
    "last_updated": null
  },
  {
    "indonesianURN": "3053940",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2966",
    "babName": "Pakaian yang biasa dipakai nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "5395",
    "hadithText": "Telah menceritakan kepada kami Sulaiman bin Harb telah menceritakan kepada kami Hammad bin Zaid dari Yahya bin Sa'id dari 'Ubaid bin Hunain dari Ibnu Abbas radliallahu 'anhuma dia berkata; telah setahun lamanya saya hendak bertanya kepada Umar bin Khattab tentang dua isteri Nabi shallallahu 'alaihi wasallam yang bersekongkol menentang kebijaksanaan beliau, tiba-tiba aku merasa segan kepadanya. Suatu hari, ia singgah di suatu tempat, lalu dia masuk ke semak-semak (untuk buang hajat), ketika dia keluar, akupun langsung menanyakan hal itu kepadanya, dia menjawab; \"Mereka adalah Aisyah dan Hafshah.\" Lalu dia melanjutkan kisahnya; Di masa Jahiliyah dulu, kami tidak pernah mengikut sertakan wanita dalam suatu urusan, namun ketika Islam datang, sehingga Allah menyebutkan kebenaran peranan mereka atas kami daripada kami tidak mengikut sertakan mereka pada urusan kami, suatu ketika terjadi percekcokan antara aku dan istriku yang menyebabkan istriku bersikeras kepadaku, maka kukatakan padanya; \"Kamu tidak usah ikut campur memikirkan urusanku.\" istriku berkata; \"Kamu mengatakan seperti ini! Padahal putrimu tengah menyakiti hati Nabi shallallahu 'alaihi wasallam.\" kemudian saya pergi menemui Hafshah dan bertanya kepadanya; \"Sesungguhnya aku memperingatimu, betulkah kamu telah bermaksiat kepada Allah dan Rasul-Nya (maksudnya membantah Nabi)? Lalu aku pun memperingatkan kepadanya akibat dari menyakiti nabi. Kemudian saya menemui Ummu Salamah, dan kuceritakan (kasus tersebut) kepadanya; maka dia berkata kepadaku; \"Sungguh aneh kamu wahai Umar, kamu telah mencampuri segala urusan sampai kepada urusan rumah tangga Rasulullah shallallahu 'alaihi wasallam dan para istrinya.\" perkataan (Ummu Salamah) sangat menyinggung perasaanku. Dan saya memiliki seorang sahabat dari Anshar, apabila dia tidak hadir dari Rasulullah shallallahu 'alaihi wasallam sementara aku hadir, maka aku menemuinya dan memberitahukannya sesuatu yang kudapat dari beliau, begitu sebaliknya, bila saya tidak hadir dari Rasulullah shallallahu 'alaihi wasallam sedangkan dia hadir, maka dia akan menemuiku dan menyampaikan apa yang ia dapat dari Rasulullah shallallahu 'alaihi wasallam. Ketika itu kami sedang berjaga-jaga di sekitar Rasulullah shallallahu 'alaihi wasallam dari raja Ghassan yang berada di Syam, kami sangat khawatir bila raja Ghassan tiba-tiba menyerang kami. Hati kami waktu itu terpusat (pada serangan tersebut), tiba-tiba sahabat Ansharku datang sambil berkata; \"Telah terjadi suatu perkara yang penting!.\" Aku pun bertanya kepadanya; \"apakah perkara itu? Apakah pasukan Ghassan telah datang? Dia menjawab; bahkan lebih dari itu, Rasulullah shallallahu 'alaihi wasallam telah menceraikan para istri beliau.\" Maka aku pun datang, dan aku mendengarkan tangisan dari kamar-kamar mereka (isteri Nabi) sementara Nabi shallallahu 'alaihi wasallam tengah berada di suatu ruangan yang dapat naik dengan tangga, dan pelayan beliau berada di depan ruangan itu, lalu saya mendatanginya dan berkata; \"Izinkanlah saya!.\" Lalu beliau memberi izin, setelah itu saya masuk, tiba-tiba saya melihat Nabi shallallahu 'alaihi wasallam berada di atas alas, terlihat jelas bekas tikar pada pinggang beliau dan di bawah kepala beliau terdapat bantal kulit yang terbuat dari sabut, sementara dekat kepalanya tergantung kulit yang baru disamak. Setelah itu aku sampaikan ucapanku terhadap Hafshah dan Ummu Salamah, serta jawaban Ummu Salamah terhadapku, mendengar itu Rasulullah shallallahu 'alaihi wasallam tersenyum, akhirnya beliau menetap di ruangan itu selama dua sembilan hari, setelah itu beliau turun.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "60",
    "matchingArabicURN": "150510",
    "last_updated": null
  },
  {
    "indonesianURN": "3053950",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2966",
    "babName": "Pakaian yang biasa dipakai nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "5396",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Muhammad telah menceritakan kepada kami Hisyam telah mengabarkan kepada kami Ma'mar dari Az Zuhri telah mengabarkan kepadaku Hindun binti Al Harits dari Ummu Salamah dia berkata; \"Pada suatu malam Nabi shallahu'alaihi wa sallam bangun sambil menuturkan; 'Tiada ilah kecuali Allah, fitnah apakah yang diturunkan di malam hari? Dan perbendaharaan apakah yang diturunkan pada orang yang membangunkan para penghuni kamar, dan berapa banyak orang yang mengenakan pakaian di dunia, tapi telanjang di akhirat.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "61",
    "matchingArabicURN": "150520",
    "last_updated": null
  },
  {
    "indonesianURN": "3053960",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2967",
    "babName": "Doa untuk yang memakai pakaian baru",
    "hadithNumber": "5397",
    "hadithText": "Telah menceritakan kepada kami Abu Al Walid telah menceritakan kepada kami Ishaq bin Sa'id bin 'Amru bin Sa'id Al 'Ash dia berkata; telah menceritakan kepadaku Ayahku telah menceritakan kepadaku Ummu Khalid binti Khalid dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah diberi baju yang bersulam sutera, lalu beliau bersabda: \"Menurut kalian siapa yang paling berhak untuk memakai kain ini?\", orang-orang pun diam. Beliau lalu bersabda: \"Datangkanlah Ummu Khalid kepadaku.\" Beliau lantas memberikan kain tersebut dan memakaikannya kepadanya. Setelah itu beliau bersabda: 'Semoga tahan lama hingga Allah menggantinya dengan yang baru (panjang umur).' Beliau mengatakannya hingga dua kali, lalu beliau melihat corak warna baju itu, sambil menunjukkan tangannya kepadaku beliau bersabda: \"Wahai Ummu Khalid, ini sanah, wahai Ummu Khalid ini sanah.\" Sanah bagai orang-orang Habasyah bermakna bagus.\" Ishaq mengatakan; telah menceritakan kepadaku seorang wanita dari keluargaku bahwa dia pernah melihat Ummu Khalid mengenakan pakaian tersebut.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "62",
    "matchingArabicURN": "150530",
    "last_updated": null
  },
  {
    "indonesianURN": "3053970",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2968",
    "babName": "Larangan memakai za'faran untuk orang laki-laki",
    "hadithNumber": "5398",
    "hadithText": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Abdul Warits dari Abdul Aziz dari Anas dia berkata; Nabi shallallahu 'alaihi wasallam melarang seorang laki-laki memakai minyak za'faran.</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "63",
    "matchingArabicURN": "150540",
    "last_updated": null
  },
  {
    "indonesianURN": "3053980",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2969",
    "babName": "Baju dengan diolesi za'faran",
    "hadithNumber": "5399",
    "hadithText": "Telah menceritakan kepada kami Abu Nu'aim telah menceritakan kepada kami Sufyan dari Abdullah bin Dinar dari Ibnu Umar radliallahu 'anhuma dia berkata; \"Nabi shallallahu 'alaihi wasallam melarang orang yang berihram mengenakan pakaian yang diwarnai dengan wars (sejenis tanaman yang barbau harum dan berwarna kuning) atau dengan minyak za'faran.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "64",
    "matchingArabicURN": "150550",
    "last_updated": null
  },
  {
    "indonesianURN": "3053990",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2970",
    "babName": "Baju merah",
    "hadithNumber": "5400",
    "hadithText": "Telah menceritakan kepada kami Abu Al Walid telah menceritakan kepada kami Syu'bah dari Abu Ishaq dia mendengar Al Barra` radliallahu 'anhu berkata; \"Rasulullah shallallahu 'alaihi wasallam adalah seorang laki-laki yang berperawakan sedang (tidak tinggi dan tidak pendek), saya melihat beliau mengenakan pakaian merah, dan saya tidak pernah melihat orang yang lebih bagus dari beliau.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "65",
    "matchingArabicURN": "150560",
    "last_updated": null
  },
  {
    "indonesianURN": "3054000",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2971",
    "babName": "Pelana sutera",
    "hadithNumber": "5401",
    "hadithText": "Telah menceritakan kepada kami Qabishah telah menceritakan kepada kami Sufyan dari Asy'ats dari Mu'awiyah bin Suwaid bin Muqarrin dari Al Barra' radliallahu 'anhu dia berkata; \"Nabi shallallahu 'alaihi wasallam memerintahkan tujuh perkara diantaranya menjenguk orang sakit, mengiringi jenazah, mendo'akan orang yang bersin. Dan melarang tujuh perkara, yaitu memakai kain sutera, dibaj, Qasiy, istabraq, mayasir dan al humr (jenis kain sutera yang direnda).\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "66",
    "matchingArabicURN": "150570",
    "last_updated": null
  },
  {
    "indonesianURN": "3054010",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2972",
    "babName": "Sandal yang tidak berbulu dan lainnya",
    "hadithNumber": "5402",
    "hadithText": "Telah menceritakan kepada kami Sulaiman bin Harb telah menceritakan kepada kami Hammad bin Zaid dari Sa'id Abu Maslamah dia berkata; saya bertanya kepada Anas \"Apakah Nabi shallallahu 'alaihi wasallam pernah shalat dengan menggunakan sandal?\" Dia menjawab; 'Ya, pernah.'</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "67",
    "matchingArabicURN": "150580",
    "last_updated": null
  },
  {
    "indonesianURN": "3054020",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2972",
    "babName": "Sandal yang tidak berbulu dan lainnya",
    "hadithNumber": "5403",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Maslamah dari Malik dari Sa'id Al Maqburi dari 'Ubaid bin Juraij bahwa dia berkata kepada Abdullah bin Umar radliallahu 'anhuma; \"Aku melihatmu mengerjakan empat perkara yang belum pernah kulihat dari para sahabatmu melakukan hal itu.\" Ibnu Umar bertanya; 'Apa perkara itu wahai Ibnu Juraij? ' Ibnu Juraij menjawab; 'Aku melihatmu tidak menyentuh rukun kecuali dua rukun yamani, aku melihat engkau memakai sandal sibti (yang tidak berbulu), dan aku melihat engkau mencelup dengan shufrah (minyak yang terbuat dari campuran kunyit dan yang lainnya), dan aku melihat engkau apabila berada di Mekkah orang-orang bertalbiyah apabila melihat hilal sementara engkau tidak bertalbiyah hingga hari Tarwiyah (yaitu tanggal delapan Dzul Hijjah). Kemudian Abdullah bin Umar berkata kepadanya; 'Adapun rukun, maka sesungguhnya aku tidak melihat Rasulullah shallallahu 'alaihi wasallam menyentuh kecuali dua rukun Yamani, adapun sandal sibti (sandal yang tidak berbulu), maka sesungguhnya aku melihat Rasulullah shallallahu 'alaihi wasallam memakai sandal yang tidak berbulu, dan berwudlu dengan memakai sandal tersebut maka aku ingin memakainya, adapun shufrah, sesungguhnya aku telah melihat Rasulullah shallallahu 'alaihi wasallam mencelup rambut dengan shufrah, maka aku ingin mencelup dengannya, adapun talbiyah, sesungguhnya aku tidak melihat Rasulullah shallallahu 'alaihi wasallam bertalbiyah hingga kendaraan beliau berdiri.'</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "68",
    "matchingArabicURN": "150590",
    "last_updated": null
  },
  {
    "indonesianURN": "3054030",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2972",
    "babName": "Sandal yang tidak berbulu dan lainnya",
    "hadithNumber": "5404",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Yusuf; telah mengabarkan kepada kami Malik dari Abdullah bin Dinar dari Abdullah bin Umar radliallahu 'anhuma dia berkata; Rasulullah shallallahu 'alaihi wasallam melarang orang yang berihram mengenakan pakaian yang dicelup dengan minyak za'faran atau wars (sejenis tanaman yang barbau harum dan berwarna kuning), dan beliau bersabda: \"Barangsiapa tidak mendapatkan dua sandal hendaknya ia mengenakan sepatu dan dipotong hingga di bawah mata kaki.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "69",
    "matchingArabicURN": "150600",
    "last_updated": null
  },
  {
    "indonesianURN": "3054040",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2972",
    "babName": "Sandal yang tidak berbulu dan lainnya",
    "hadithNumber": "5405",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Yusuf telah menceritakan kepada kami Sufyan dari 'Amru bin Dinar dari Jabir bin Zaid dari Ibnu Abbas radliallahu 'anhuma dia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa tidak mendapatkan kain sarung, hendaknya ia mengenakan celana panjang, dan barangsiapa tidak mendapatkan sandal, hendaknya ia mengenakan sepatu (bagi yang berihram -red).\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "70",
    "matchingArabicURN": "150610",
    "last_updated": null
  },
  {
    "indonesianURN": "3054050",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2973",
    "babName": "Memulai dengan sandal yamani",
    "hadithNumber": "5406",
    "hadithText": "Telah menceritakan kepada kami Hajjaj bin Minhal telah menceritakan kepada kami Syu'bah dia berkata; telah mengabarkan kepadaku Asy'ats bin Sulaim saya mendengar Ayahku menceritakan dari Masruq dari 'Aisyah radliallahu 'anha dia berkata; \"Nabi shallallahu 'alaihi wasallam menyukai tayamun (mendahulukan yang kanan) ketika bersuci, menyisir rambut dan memakai sandal.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "71",
    "matchingArabicURN": "150620",
    "last_updated": null
  },
  {
    "indonesianURN": "3054060",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2974",
    "babName": "Melepas sandal kiri",
    "hadithNumber": "5407",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Maslamah dari Malik dari Abu Az Zinnad dari Al A'raj dari Abu Hurairah radliallahu 'anhu bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian memakai sandal, hendaknya memulai dengan yang kanan, dan apabila melepas hendaknya mulai dengan yang kiri, supaya yang kanan pertama kali mengenakan sandal dan yang terakhir melepasnya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "72",
    "matchingArabicURN": "150630",
    "last_updated": null
  },
  {
    "indonesianURN": "3054070",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2975",
    "babName": "Tidak boleh berjalan dengan satu sandal",
    "hadithNumber": "5408",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Maslamah dari Malik dari Abu Az Zinnad dari Al A'raj dari Abu Hurairah bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian berjalan dengan satu sandal, hendaknya ia melepas semua atau memakai semua.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "73",
    "matchingArabicURN": "150640",
    "last_updated": null
  },
  {
    "indonesianURN": "3054080",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2976",
    "babName": "Dua tali dalam sandal, dan siapa yang berpendapat satu tali saja",
    "hadithNumber": "5409",
    "hadithText": "Telah menceritakan kepada kami Hajjaj bin Minhal telah menceritakan kepada kami Hammam dari Qatadah telah menceritakan kepada kami Anas radliallahu 'anhu bahwa sandal Nabi shallallahu 'alaihi wasallam memiliki dua utas tali.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "0",
    "last_updated": null
  },
  {
    "indonesianURN": "3054090",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2976",
    "babName": "Dua tali dalam sandal, dan siapa yang berpendapat satu tali saja",
    "hadithNumber": "5410",
    "hadithText": "Telah menceritakan kepadaku Muhammad telah mengabarkan kepada kami Abdullah telah mengabarkan kepada kami Isa bin Thuhman dia berkata; Anas bin Malik keluar menemui kami dengan mengenakan sandal yang memiliki dua utas tali, lantas Tsabit Al Bunani mengatakan; \"Ini adalah sandal Nabi shallallahu 'alaihi wasallam.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "75",
    "matchingArabicURN": "150660",
    "last_updated": null
  },
  {
    "indonesianURN": "3054100",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2977",
    "babName": "Kubah  (tenda) merah dari kulit",
    "hadithNumber": "5411",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin 'Ar'arah dia berkata; telah menceritakan kepadaku Umar bin Abu Za`idah dari 'Aun bin Abu Juhaifah dari Ayahnya dia berkata; saya menemui Nabi shallallahu 'alaihi wasallam ketika beliau tengah berada di tenda besar yang terbuat dari kulit, dan saya melihat Bilal tengah mengambilkan tempat air wudlu Nabi shallallahu 'alaihi wasallam sementara orang-orang berlomba-lomba untuk mendapatkan bekas wudlu beliau, dan siapa yang mendapatkannya maka ia akan membasuhkannya namun bagi yang tidak mendapatkannya, maka ia mengambil dari sisa air yang menetes dari temannya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "76",
    "matchingArabicURN": "150670",
    "last_updated": null
  },
  {
    "indonesianURN": "3054110",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2977",
    "babName": "Kubah  (tenda) merah dari kulit",
    "hadithNumber": "5412",
    "hadithText": "Telah menceritakan kepada kami Abu Al Yaman telah mengabarkan kepada kami Syu'aib dari Az Zuhri telah mengabarkan kepadaku Anas bin Malik dan Al Laits mengatakan; telah menceritakan kepadaku Yunus dari Ibnu Syihab dia berkata; telah mengabarkan kepadaku Anas bin Malik radliallahu 'anhu dia berkata; \"Nabi shallallahu 'alaihi wasallam menyuruh seseorang menemui orang-orang Anshar, sementara mereka tengah berkumpul di dalam kemah besar yang terbuat dari kulit.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "77",
    "matchingArabicURN": "150680",
    "last_updated": null
  },
  {
    "indonesianURN": "3054120",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2978",
    "babName": "Duduk diatas tikar dan semisalnya",
    "hadithNumber": "5413",
    "hadithText": "Telah menceritakan kepadaku Muhammad bin Abu Bakr telah menceritakan kepada kami Mu'tamir dari 'Ubaidullah dari Sa'id bin Abu Sa'id dari Abu Salamah bin Abdurrahman dari Aisyah radliallahu 'anha bahwa pada suatu malam Nabi shallallahu 'alaihi wasallam pernah membuat sekat (di dalam masjid) dengan tikar lalu shalat di dalamnya, dan menghamparkannya di siang hari untuk duduk, ternyata orang-orang berkumpul di sekeliling Nabi shallallahu 'alaihi wasallam untuk mengerjakan shalat sebagaimana beliau shalat, hingga orang-orang semakin banyak, lalu beliau menghadap (kepada mereka) dan bersabda: \"Wahai sekalian manusia, beramalah menurut yang kalian sanggupi, sesungguhnya Allah tidak akan bosan sehingga kalian merasa bosan, sesungguhnya amalan yang paling dicintai Allah adalah yang dikerjakan secara kontinyu walaupun sedikit.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "78",
    "matchingArabicURN": "150690",
    "last_updated": null
  },
  {
    "indonesianURN": "3054130",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2979",
    "babName": "Cincin emas",
    "hadithNumber": "5414",
    "hadithText": "Telah menceritakan kepada kami Adam telah menceritakan kepada kami Syu'bah telah menceritakan kepada kami Asy'ats bin Sulaim dia berkata; saya mendengar Mu'awiyah bin Suwaid bin Muqarrin berkata; saya mendengar Barra` bin 'Azib radliallahu 'anhuma berkata; \"Nabi shallallahu 'alaihi wasallam melarang kami tujuh perkara yaitu melarang mengenakan cincin dari emas atau kalung dari emas, memakai kain sutera, istibraq, dibaj, misarah, hamra`, Qasiy (sejenis kain sutera campuran) dan tempat air dari perak, dan memerintahkan kami tujuh perkara, yaitu menjenguk orang sakit, mengiringi jenazah, mendo'akan orang bersin, menjawab salam, memenuhi undangan, menunaikan sumpah dan menolong orang yang terzhalimi.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "80",
    "matchingArabicURN": "150710",
    "last_updated": null
  },
  {
    "indonesianURN": "3054140",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2979",
    "babName": "Cincin emas",
    "hadithNumber": "5415",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Basyar telah menceritakan kepada kami Ghundar telah menceritakan kepada kami Syu'bah dari Qatadah dari Nadlr bin Anas dari Basyir bin Nahik dari Abu Hurairah radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam bahwa beliau melarang mengenakan cincin emas. 'Amru mengatakan; Telah mengabarkan kepada kami Syu'bah dari Qatadah bahwa dia mendengar Nadlr; dia mendengar Basyir seperti hadits di atas.</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "81",
    "matchingArabicURN": "150720",
    "last_updated": null
  },
  {
    "indonesianURN": "3054150",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2979",
    "babName": "Cincin emas",
    "hadithNumber": "5416",
    "hadithText": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Yahya dari 'Ubaidullah dia berkata; telah menceritakan kepadaku Nafi' dari Abdullah radliallahu 'anhu bahwa Rasulullah shallallahu 'alaihi wasallam pernah membuat cincin dari emas dan menghadapkan mata cincinnya ke arah telapak tangan, orang-orang lalu ikut memakai cincin hingga Nabi shallallahu 'alaihi wasallam membuang cincin tersebut dan membuat dari perak.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "82",
    "matchingArabicURN": "150730",
    "last_updated": null
  },
  {
    "indonesianURN": "3054160",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2980",
    "babName": "Cincin perak",
    "hadithNumber": "5417",
    "hadithText": "Telah menceritakan kepada kami Yusuf bin Musa telah menceritakan kepada kami Abu Usamah telah menceritakan kepada kami 'Ubaidullah dari Nafi' dari Ibnu Umar radliallahu 'anhuma bahwa Rasulullah shallallahu 'alaihi wasallam pernah membuat cincin dari emas atau perak, dan menghadapkan mata cincinnya di telapak tangan serta mengukirnya dengan tulisan \"Muhammad Rasulullah\", maka orang-orang pun membuat seperti itu juga, ketika beliau mengetahui orang-orang membuatnya, maka beliau langsung melempar cincin tersebut sambil bersabda: \"Saya tidak akan memakainya selama-lamanya.\" Setelah itu beliau membuatnya dari perak dan orang-orang pun ikut membuat cincin dari perak, Ibnu Umar mengatakan; \"Cincin itu dipakai oleh Abu Bakr setelah Nabi shallallahu 'alaihi wasallam, kemudian Umar dan Utsman, sehingga Utsman menjatuhkannya di sumur Aris.</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "83",
    "matchingArabicURN": "150740",
    "last_updated": null
  },
  {
    "indonesianURN": "3054170",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2980",
    "babName": "Cincin perak",
    "hadithNumber": "5418",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Maslamah dari Malik dari Abdullah bin Dinar dari Abdullah bin Umar radliallahu 'anhuma dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah memakai cincin emas, kemudian beliau membuangnya sambil bersabda: \"Saya tidak akan memakainya lagi selama-lamanya.\" Maka orang-orang pun ikut membuang cincin yang mereka kenakan.</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "84",
    "matchingArabicURN": "150750",
    "last_updated": null
  },
  {
    "indonesianURN": "3054180",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2980",
    "babName": "Cincin perak",
    "hadithNumber": "5419",
    "hadithText": "Telah menceritakan kepadaku Yahya bin Bukair telah menceritakan kepada kami Al Laits dari Yunus dari Ibnu Syihab dia berkata; telah menceritakan kepadaku Anas bin Malik radliallahu 'anhu bahwa dia pernah melihat Rasulullah shallallahu 'alaihi wasallam memakai cincin perak di tangannya selama satu hari, kemudian orang-orang pun ikut membuat cincin dari perak dan memakainya, lalu Rasulullah shallallahu 'alaihi wasallam pun membuang cincin tersebut dan orang-orang pun ikut membuang cincin yang mereka kenakan.\" Hadits ini juga diperkuat dengan riwayat Ibrahim bin Sa'd, Ziyad dan Syu'aib dari Az Zuhri. Ibnu Musafir mengatakan; dari Az Zuhri bahwa pendapatku itu adalah cincin yang terbuat dari perak.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "85",
    "matchingArabicURN": "150760",
    "last_updated": null
  },
  {
    "indonesianURN": "3054190",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2981",
    "babName": "Mata cincin",
    "hadithNumber": "5420",
    "hadithText": "Telah menceritakan kepada kami 'Abdan telah mengabarkan kepada kami Yazid bin Zurai' telah mengabarkan kepada kami Humaid dia berkata; Anas pernah ditanya; \"Apakah Nabi shallallahu 'alaihi wasallam pernah membuat (mengenakan) cincin? Dia menjawab; 'Beliau pernah mengakhirkan shalat Isya' sampai menjelang tengah malam, kemudian beliau menemui kami, seakan-akan saya melihat kilauan cincin beliau, beliau bersabda: Orang-orang telah melaksanakan shalat dan tidur, sementara kalian senantiasa dalam keadaan shalat selagi kalian menunggu shalat.'</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "86",
    "matchingArabicURN": "150770",
    "last_updated": null
  },
  {
    "indonesianURN": "3054200",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2981",
    "babName": "Mata cincin",
    "hadithNumber": "5421",
    "hadithText": "Telah menceritakan kepada kami Ishaq telah mengabarkan kepada kami Mu'tamir dia berkata; saya mendengar Humaid bercerita dari Anas radliallahu 'anhu bahwa Nabi shallallahu 'alaihi wasallam memiliki cincin yang terbuat dari perak sedangkan batu cincinnya dari perak juga.\" Yahya bin Ayyub mengatakan; telah menceritakan kepadaku Humaid dia mendengar Anas dari Nabi shallallahu 'alaihi wasallam.</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "87",
    "matchingArabicURN": "150780",
    "last_updated": null
  },
  {
    "indonesianURN": "3054210",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2982",
    "babName": "Cincin besi",
    "hadithNumber": "5422",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Maslamah telah menceritakan kepada kami Abdul Aziz bin Abdul Abu Hazim dari Ayahnya bahwa dia mendengar Sahl berkata; seorang wanita datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; \"Saya datang kepada anda untuk menyerahkan diriku kepada anda, \" Beliau lalu berdiri lama dan menelitinya dengan seksama, ketika beliau berdiri lama seorang laki-laki berkata; 'Wahai Rasulullah, jika anda tidak berkenan dengannya, maka nikahkanlah aku dengannya.' Rasulullah shallallahu 'alaihi wasallam bertanya kepada laki-laki tersebut: 'Apakah kamu mempunyai sesuatu yang dapat dijadikan mahar untuknya? ' Laki-laki itu menjawab; 'Tidak.' Beliau bersabda: 'Carilah terlebih dahulu.' Lalu laki-laki itu pergi, sesaat kemudian dia kembali dan berkata; 'Demi Allah, aku tidak mendapatkan sesuatupun.' Beliau bersabda: 'Pergi dan carilah lagi walaupun hanya dengan cincin dari besi.' Kemudian laki-laki itu pergi, tidak berapa lama dia kembali sambil berkata; 'Aku tidak mendapatkan apa-apa walau cincin dari besi.' -Saat itu laki-laki tersebut tengah mengenakan kain sarung, lantas dia berkata; 'Aku akan menjadikan kain sarung ini sebagai mahar.' Maka Nabi shallallahu 'alaihi wasallam bersabda: 'Jika kamu memakaikan kain sarung itu padanya, maka kamu tidak memakai apa-apa, sementara jika kamu yang memakai sarung tersebut, dia tidak memakai apa-apa.' Laki-laki itu duduk termenung, ternyata Nabi shallallahu 'alaihi wasallam melihatnya berpaling, lalu beliau memerintahkan seseorang untuk memanggilnya, maka dipanggilah laki-laki tersebut, beliau bertanya: 'Apakah kamu mempunyai hafalan dari Al Qur'an? ' Laki-laki itu menjawab; 'Ya, saya telah hafal surat ini dan ini.' Lalu beliau bersabda: 'Maka aku nikahkan kamu dengan wanita itu, dengan mahar apa yang telah engkau hafal dari surat Al Qur'an.'</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "88",
    "matchingArabicURN": "150790",
    "last_updated": null
  },
  {
    "indonesianURN": "3054220",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2983",
    "babName": "Ukiran cincin",
    "hadithNumber": "5423",
    "hadithText": "Telah menceritakan kepada kami Abdul A'la telah menceritakan kepada kami Yazid bin Zurai' telah menceritakan kepada kami Sa'id dari Qatadah dari Anas bin Malik radliallahu 'anhu bahwa Nabiyullah shallallahu 'alaihi wasallam hendak menulis surat kepada pemuka kaum atau sekelompok orang asing, lantas diberitahukan kepada beliau; \"Sesungguhnya mereka tidak akan menerima surat anda kecuali jika surat tersebut dibubuhi stempel, maka Nabi shallallahu 'alaihi wasallam membuat stempel (cincin) dari perak yang diukir dengan tulisan 'Muhammad Rasulullah', seolah-olah saya melihat kilauan atau kilatan cincin berada di jari tangan Nabi shallallahu 'alaihi wasallam atau di telapak tangan beliau.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "89",
    "matchingArabicURN": "150800",
    "last_updated": null
  },
  {
    "indonesianURN": "3054230",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2983",
    "babName": "Ukiran cincin",
    "hadithNumber": "5424",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Salam telah mengabarkan kepada kami Abdullah bin Numair dari 'Ubaidullah dari Nafi' dari Ibnu Umar radliallahu 'anhuma dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah membuat cincin dari perak, cincin tersebut masih berada di tangan beliau, setelah (beliau meninggal) cincin tersebut pindah ke tangan Abu Bakr, lalu setelah Abu Bakr pindah ke tangan Umar, setelah Umar pindah ke tangan Utsman hingga setelah itu Utsman menjatuhkannya di sumur Aris, cincin itu bertuliskan 'Muhammad Rasulullah'.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "90",
    "matchingArabicURN": "150810",
    "last_updated": null
  },
  {
    "indonesianURN": "3054240",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2984",
    "babName": "Cincin di jari manis",
    "hadithNumber": "5425",
    "hadithText": "Telah menceritakan kepada kami Abu Ma'mar telah menceritakan kepada kami Abdul Warits telah menceritakan kepada kami Abdul Aziz bin Shuhaib dari Anas radliallahu 'anhu dia berkata; \"Nabi shallallahu 'alaihi wasallam pernah membuat cincin, lalu beliau bersabda: 'Sesungguhnya kami telah membuat cincin yang kami ukir dengan suatu tulisan, maka janganlah salah seorang dari kalian mengukir seperti itu.' Anas melanjutkan; 'Sungguh saya pernah melihat kilatan dari cincin tersebut berada di jari manis beliau.'</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "91",
    "matchingArabicURN": "150820",
    "last_updated": null
  },
  {
    "indonesianURN": "3054250",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2985",
    "babName": "Memakai setempel untuk  surat",
    "hadithNumber": "5426",
    "hadithText": "Telah menceritakan kepada kami Adam bin Abu Iyas telah menceritakan kepada kami Syu'bah dari Qatadah dari Anas bin Malik radliallahu 'anhu dia berkata; \"Ketika Nabi shallallahu 'alaihi wasallam hendak menulis surat ke raja Romawi, maka diberitahukan kepada beliau; 'Sesungguhnya mereka tidak akan mau membaca surat anda karena tidak ada stempel.' Setelah itu beliau membuat cincin (stempel) yang terbuat dari perak dan mengukirnya dengan tulisan 'Muhammad Rasulullah' seakan-akan saya melihat putihnya (cahaya) dari tangan beliau.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "92",
    "matchingArabicURN": "150830",
    "last_updated": null
  },
  {
    "indonesianURN": "3054260",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2986",
    "babName": "Memasang mata cincin dalam telapak tangan",
    "hadithNumber": "5427",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Juwairiyah dari Nafi' bahwa Abdullah pernah menceritakan kepadanya bahwa Nabi shallallahu 'alaihi wasallam pernah membuat cincin dari emas, dan menghadapkan mata cincinnya ke telapak tangan beliau apabila beliau mengenakannya, maka orang-orang pun ramai membuat cincin dari emas, lalu beliau naik mimbar, setelah memuji Allah dan menyanjung-Nya beliau bersabda: \"Sesungguhnya saya telah membuat cincin dari emas, dan sungguh saat ini saya tidak akan mengenakannya.\" Maka orang-orang pun membuang cincin mereka. Juwairiyah mengatakan; 'Aku tidak mengira lagi kecuali Nafi' mengatakan; 'Beliau mengenakannya di tangan kanan beliau.'</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "93",
    "matchingArabicURN": "150840",
    "last_updated": null
  },
  {
    "indonesianURN": "3054270",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2987",
    "babName": "Ucapan Nabi Shallallahu'alaihiwasallam ; Tak boleh ada ukiran pada ukiran cincinnya",
    "hadithNumber": "5428",
    "hadithText": "Telah menceritakan kepada kami Musaddad Telah menceritakan kepada kami Hammad dari Abdul Aziz bin Shuhaib dari Anas bin Malik radliallahu 'anhu bahwa Rasulullah shallallahu 'alaihi wasallam pernah membuat cincin dari perak dan mengukirnya dengan tulisan \"Muhammad Rasulullah\" kemudian beliau bersabda: \"Sesungguhnya saya telah membuat cincin dari perak dan telah kuukir dengan tulisan 'Muhammad Rasulullah' maka janganlah kalian mengukir dengan ukiran seperti itu.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "94",
    "matchingArabicURN": "150850",
    "last_updated": null
  },
  {
    "indonesianURN": "3054280",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2988",
    "babName": "Apakah ukiran cincin dengan tiga garis?",
    "hadithNumber": "5429",
    "hadithText": "Telah menceritakan kepadaku Muhammad bin Abdullah Al Anshari dia berkata; telah menceritakan kepadaku Ayahku dari Tsumamah dari Anas bahwa ketika Abu Bakr diangkat menjadi Khalifah dia menulis surat kepadanya (tentang zakat) sedangkan ukiran pada cincin tersebut terdapat tiga baris, baris pertama bertuliskan Muhammad, baris kedua bertuliskan Rasul dan dibaris ketiga bertuliskan Allah, \" Abu Abdullah mengatakan; \"Sedangkan Ahmad menambahkan kepadaku telah menceritakan kepada kami Al Anshari dia berkata; telah menceritakan kepadaku Ayahku dari Tsumamah dari Anas dia berkata; \"Cincin Nabi shallallahu 'alaihi wasallam berada di tangan beliau, lalu di tangan Abu Bakr, lalu di tangan Umar, ketika berada di tangan Utsman, dia duduk-duduk di dekat sumur Aris (Anas) melanjutkan; 'Lalu dia mengeluarkan cincin tersebut (dari tangannya) dan mempermainkannya, tiba-tiba cincin tersebut terjatuh ke dalam sumur, lalu kami berusaha mencarinya bersama Utsman selama tiga hari, dengan mengeluarkan air sumur tersebut sedikit demi sedikit, namun tidak juga menemukannya.'</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "0",
    "last_updated": null
  },
  {
    "indonesianURN": "3054290",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2989",
    "babName": "Cincin untuk perempuan",
    "hadithNumber": "5430",
    "hadithText": "Telah menceritakan kepada kami Abu 'Ashim telah mengabarkan kepada kami Ibnu Juraij telah mengabarkan kepada kami Al Hasan bin Muslim dari Thawus dari Ibnu Abbas radliallahu 'anhuma; \"Saya pernah mengikuti shalat Ied bersama Nabi shallallahu 'alaihi wasallam, beliau mengerjakan shalat sebelum berkhutbah.\" Abu Abdullah berkata; Ibnu Wahb menambahkan dari Ibnu Juraij; 'Kemudian beliau menemui para wanita, lantas para wanita segera melempar cincin mereka baik yang kecil maupun yang besar ke kainnya Bilal.'</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "97",
    "matchingArabicURN": "150880",
    "last_updated": null
  },
  {
    "indonesianURN": "3054300",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2990",
    "babName": "Kalung dan wewangian yang dikalungkan",
    "hadithNumber": "5431",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin 'Ar'arah telah menceritakan kepada kami Syu'bah dari 'Adi bin Tsabit dari Sa'id bin Jubair dari Ibnu Abbas radliallahu 'anhuma dia berkata; \"Nabi shallallahu 'alaihi wasallam keluar untuk mengerjakn shalat Ied, kemudian beliau shalat dua raka'at, tidak shalat baik sebelum dan sesudahnya, setelah itu beliau mendatangi para wanita dan memerintahkan mereka untuk bersedekah, hingga para wanita ramai-ramai menyedekahkan anting dan kalung mereka.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "98",
    "matchingArabicURN": "150890",
    "last_updated": null
  },
  {
    "indonesianURN": "3054310",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2991",
    "babName": "Meminjam cincin",
    "hadithNumber": "5432",
    "hadithText": "Telah menceritakan kepada kami Ishaq bin Ibrahim telah menceritakan kepada kami 'Abdah telah menceritakan kepada kami Hisyam bin Urwah dari Ayahnya dari Aisyah radliallahu 'anha dia berkata; \"Kalung Asma` pernah hilang, lalu Nabi shallallahu 'alaihi wasallam mengutus beberapa orang laki-laki untuk mencarinya, sementara waktu shalat telah tiba sedangkan mereka tidak ada yang membawa air untuk berwudlu', lantas mereka mengerjakan shalat tanpa berwudlu', setelah itu mereka memberitahukan peristiwa tersebut kepada Nabi shallallahu 'alaihi wasallam, maka Allah menurunkan ayat tayammum.\" Ibnu Numair menambahkan dari Hisyam dari Ayahnya dari Aisyah bahwa dialah yang meminjam kalungnya Asma'.</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "99",
    "matchingArabicURN": "150900",
    "last_updated": null
  },
  {
    "indonesianURN": "3054320",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2992",
    "babName": "Anting-anting untuk wanita",
    "hadithNumber": "5433",
    "hadithText": "Telah menceritakan kepada kami Hajjaj bin Minhal telah menceritakan kepada kami Syu'bah dia berkata; telah mengabarkan kepadaku 'Adi dia berkata; saya mendengar Sa'id dari Ibnu Abbas radliallahu 'anhuma bahwa Nabi shallallahu 'alaihi wasallam shalat Ied dua raka'at, beliau tidak mengerjakan shalat (sunnah) sebeum maupun sesudahnya, kemudian beliau menemui para wanita bersama Bilal, beliau memerintahkan mereka untuk bersedekah, hingga para wanita banyak yang melempar anting mereka.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "100",
    "matchingArabicURN": "150910",
    "last_updated": null
  },
  {
    "indonesianURN": "3054330",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2993",
    "babName": "Wewangian yang dikalungkan untuk anak-anak",
    "hadithNumber": "5434",
    "hadithText": "Telah menceritakan kepadaku Ishaq bin Ibrahim Al Handlali telah mengabarkan kepada kami Yahya bin Adam telah menceritakan kepada kami Warqa`bin Umar dari 'Ubaidullah bin Abu Yazid dari Nafi' bin Jubair dari Abu Hurairah radliallahu 'anhu dia berkata; \"Aku pernah bersama Nabi shallallahu 'alaihi wasallam di salah satu pasar Madinah, lalu beliau pergi dan akupun ikut pergi bersama beliau, kemudian beliau bersabda: 'Dimanakah anak kecil, -beliau memangil-manggil sampai tiga kali- Panggillah Al Hasan bin Ali Lalu datanglah Al Hasan bin Ali sambil berjalan, sementara pada lehernya terdapat sikha` (benang yang dibentuk semacam kalung), maka Rasulullah shallallahu 'alaihi wasallam mendekapnya dan ia juga mendekap, lalu beliau bersabda: 'Ya Allah, sesungguhnya aku mencintainya maka cintailah ia dan cintailah orang-orang yang mencintainya.' Abu Hurairah mengatakan; 'Maka tidak ada seorang pun yang lebih aku cintai daripada Al Hasan bin Ali setelah aku mendengar sabda Rasulullah shallallahu 'alaihi wasallam tersebut.'</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "101",
    "matchingArabicURN": "150920",
    "last_updated": null
  },
  {
    "indonesianURN": "3054340",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2994",
    "babName": "Laki-laki menyerupai wanita dan sebaliknya",
    "hadithNumber": "5435",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Basyar telah menceritakan kepada kami Ghundar telah menceritakan kepada kami Syu'bah dari Qatadah dari Ikrimah dari Ibnu Abbas radliallahu 'anhuma dia berkata; \"Allah melaknat laki-laki yang menyerupai wanita dan wanita yang meyerupai laki-laki.\" Hadits ini diperkuat juga dengan hadits 'Amru telah mengabarkan kepada kami Syu'bah.</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "102",
    "matchingArabicURN": "150930",
    "last_updated": null
  },
  {
    "indonesianURN": "3054350",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2995",
    "babName": "Mengusir waria dari rumah",
    "hadithNumber": "5436",
    "hadithText": "Telah menceritakan kepada kami Mu'adz bin Fadlalah telah menceritakan kepada kami Hisyam dari Yahya dari Ikrimah dari Ibnu Abbas dia berkata; Nabi shallallahu 'alaihi wasallam melaknat para laki-laki yang menyerupai wanita dan para wanita yang menyerupai laki-laki, sabdanya: \"Keluarkanlah mereka dari rumah kalian.\"Ibnu Abbas melanjutkan; 'Maka Nabi shallallahu 'alaihi wasallam pernah mengeluarkan seorang fulan begitu juga dengan Umar.'</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "103",
    "matchingArabicURN": "150940",
    "last_updated": null
  },
  {
    "indonesianURN": "3054360",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2995",
    "babName": "Mengusir waria dari rumah",
    "hadithNumber": "5437",
    "hadithText": "Telah menceritakan kepada kami Malik bin Isma'il telah menceritakan kepada kami Zuhair telah menceritakan kepada kami Hisyam bin 'Urwah bahwa 'Urwah telah mengabarkan kepadanya bahwa Zainab binti Abu Salamah telah mengabarkan kepadanya bahwa Ummu Salamah telah mengabarkan kepadanya bahwa Nabi shallallahu 'alaihi wasallam pernah berada di sisinya, sementara di rumah dia ada banci, maka beliau bersabda kepada Abdullah yaitu saudara laki-laki Ummu Salamah: \"Wahai Abdullah, sekiranya esok hari Allah memenangkan Tha'if buat kalian, maka aku akan menunjukkan kepadamu anak perempuan Ghailan, karena dia menghadap dengan empat muka dan membelakangi dengan delapan.\" Nabi shallallahu 'alaihi wasallam melanjutkan: 'Maka jangan sampai mereka itu masuk ke rumah kalian.' Abu Abdullah mengatakan; 'Maksud dari menghadap dengan empat dan membelakangi dengan delapan adalah gerutan yang ada di perut karena terlalu gemuk, dan maksud dari membelakangi dengan delapan maksudnya adalah ujung dari empat gerutan tersebut, sebab hal itu akan terlihat bergerut apabila dari samping hingga melekat. Perawi mengatakan; 'Bitsamanin (dengan delapan) dan tidak mengatakan; 'Bitsamaniyah' karena mufradnya 'athraf' mudzakar, karena itu perawi tidak mengatakan 'Tsamaniyata athraf'.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "104",
    "matchingArabicURN": "150950",
    "last_updated": null
  },
  {
    "indonesianURN": "3054370",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2996",
    "babName": "Memendekkan kumis",
    "hadithNumber": "5438",
    "hadithText": "Telah menceritakan kepada kami Al Makki bin Ibrahim dari Hanzhalah dari Nafi', dan diriwayatkan dari jalur lain, sahabat-sahabat kami mengatakan; dari Al Makki dari Ibnu Umar radliallahu 'anhuma dari Nabi shallallahu 'alaihi wasallam bersabda: \"Termasuk dari (sunnah) fitrah adalah mencukur kumis.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "0",
    "last_updated": null
  },
  {
    "indonesianURN": "3054380",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2996",
    "babName": "Memendekkan kumis",
    "hadithNumber": "5439",
    "hadithText": "Telah menceritakan kepada kami Ali telah menceritakan kepada kami Sufyan, Az Zuhri mengatakan; telah menceritakan kepada kami dari Sa'id bin Musayyab dari Abu Hurairah secara periwayatan, (sunnah-sunnah) fitrah itu ada lima, atau lima dari sunnah-sunnah fitrah, yaitu; berkhitan, mencukur bulu kemaluan, mencabut bulu ketiak, memotong kuku dan mencukur kumis.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "106",
    "matchingArabicURN": "150970",
    "last_updated": null
  },
  {
    "indonesianURN": "3054390",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2997",
    "babName": "Memotong kuku",
    "hadithNumber": "5440",
    "hadithText": "Telah menceritakan kepada kami Ahmad bin Abu Raja` telah menceritakan kepada kami Ishaq bin Sulaiman dia berkata; saya mendengar Hanzhalah dari Nafi' dari Ibnu Umar radliallahu 'anhuma bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Termasuk sunnah-sunnah fitrah adalah mencukur bulu kemaluan, memotong kuku dan mencukur kumis.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "107",
    "matchingArabicURN": "150980",
    "last_updated": null
  },
  {
    "indonesianURN": "3054400",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2997",
    "babName": "Memotong kuku",
    "hadithNumber": "5441",
    "hadithText": "Telah menceritakan kepada kami Ahmad bin Yunus telah menceritakan kepada kami Ibrahim bin Sa'd telah menceritakan kepada kami Ibnu Syihab dari Sa'id bin Musayyab dari Abu Hurairah radliallahu 'anhu saya mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Sunnah-sunnah fitrah itu ada lima, yaitu; berkhitan, mencukur bulu kemaluan, memotong kumis, memotong kuku dan mencabut bulu ketiak.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "108",
    "matchingArabicURN": "150990",
    "last_updated": null
  },
  {
    "indonesianURN": "3054410",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2997",
    "babName": "Memotong kuku",
    "hadithNumber": "5442",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Minhal telah menceritakan kepada kami Yazid bin Zurai' telah menceritakan kepada kami Umar bin Muhammad bin Zaid dari Nafi' dari Ibnu Umar dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Selisihilah orang-orang musyrik, panjangkanlah jenggot dan cukurlah kumis kalian.\" Sedangkan apabila Ibnu Umar berhaji atau Umrah dia memegang jenggotnya dan memotong selebihnya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "109",
    "matchingArabicURN": "151000",
    "last_updated": null
  },
  {
    "indonesianURN": "3054420",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2998",
    "babName": "Memelihara dan melebatkan jenggot",
    "hadithNumber": "5443",
    "hadithText": "Telah menceritakan kepadaku Muhammad telah mengabarkan kepada kami Abdah telah mengabarkan kepada kami Ubaidullah bin Umar dari Nafi' dari Ibnu Umar radliallahu 'anhuma dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Cukurlah kumis kalian dan biarkanlah jenggot kalian (panjang).\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "110",
    "matchingArabicURN": "151010",
    "last_updated": null
  },
  {
    "indonesianURN": "3054430",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2999",
    "babName": "Uban",
    "hadithNumber": "5444",
    "hadithText": "Telah menceritakan kepada kami Mu'alla bin Asad telah menceritakan kepada kami Wuhaib dari Ayyub dari Muhammad bin Sirin dia berkata; saya bertanya kepada Anas \"Apakah Nabi shallallahu 'alaihi wasallam pernah menyemir rambutnya?\" dia menjawab; \"Beliau tidak menyemir rambut karena ubannya kecuali hanya sedikit.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "111",
    "matchingArabicURN": "151020",
    "last_updated": null
  },
  {
    "indonesianURN": "3054440",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2999",
    "babName": "Uban",
    "hadithNumber": "5445",
    "hadithText": "Telah menceritakan kepada kami Sulaiman bin Harb telah menceritakan kepada kami Hammad bin Zaid dari Tsabit dia berkata; Anas di tanya mengenai semir rambut nabi shallallahu 'alaihi wasallam, Anas menjawab; \"Beliau tidak menyemirnya, jika aku mau maka saya akan menghitung rambut hitam yang bercampur di rambut putih pada jenggot beliau.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "112",
    "matchingArabicURN": "151030",
    "last_updated": null
  },
  {
    "indonesianURN": "3054450",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2999",
    "babName": "Uban",
    "hadithNumber": "5446",
    "hadithText": "Telah menceritakan kepada kami Malik bin Isma'il telah menceritakan kepada kami Isra`il dari Utsman bin Abdullah bin Mauhab berkata; \"Keluargaku pernah menyuruhku menemui Ummu Salamah isteri Nabi shallallahu 'alaihi wasallam dengan membawa mangkuk berisi air, sementara Isra'il memegang mangkuk tersebut menggunakan tiga jarinya yang didalamnya terdapat beberapa helai rambut Nabi shallallahu 'alaihi wasallam yang diikat, apabila ada seseorang yang terkena sihir atau sesuatu, maka tempat mewarnai rambut beliau diberikan kepada Ummu Salamah, lalu aku mendongakkan kepala ke wadah yang menyerupai lonceng, aku melihat rambut beliau sudah berubah merah.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "113",
    "matchingArabicURN": "151040",
    "last_updated": null
  },
  {
    "indonesianURN": "3054470",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3000",
    "babName": "Khidhab (Hena, Semir)",
    "hadithNumber": "5448",
    "hadithText": "Telah menceritakan kepada kami Al Humaidi telah menceritakan kepada kami Sufyan telah menceritakan kepada kami Az Zuhri dari Abu Salamah dan Sulaiman bin Yasar dari Abu Hurairah radliallahu 'anhu, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang-orang Yahudi dan Nashrani tidak mewarnai rambut mereka, maka selisihilah mereka.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "116",
    "matchingArabicURN": "151070",
    "last_updated": null
  },
  {
    "indonesianURN": "3054480",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3001",
    "babName": "Keriting",
    "hadithNumber": "5449",
    "hadithText": "Telah menceritakan kepada kami Isma'il dia berkata; telah menceritakan kepadaku Malik bin Anas dari Rabi'ah bin Abu Abdurrahman dari Anas bin Malik radliallahu 'anhu bahwa dia mendengar Anas berkata; \"Rasulullah shallallahu 'alaihi wasallam adalah orang yang berpawakan tidak tinggi sekali dan tidak pula pendek, (kulitnya) tidak putih bule dan tidak pula terlalu coklat, (rambutnya) tidak keriting dan tidak pula lurus, beliau diutus Allah ketika berusia empat puluh tahun, tinggal di Makkah selama sepuluh tahun dan di Madinah sepuluh tahun, sementara rambut yang putih di kepala dan jenggot beliau tidak sampai berjumlah dua puluh helai.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "117",
    "matchingArabicURN": "151080",
    "last_updated": null
  },
  {
    "indonesianURN": "3054490",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3001",
    "babName": "Keriting",
    "hadithNumber": "5450",
    "hadithText": "Telah menceritakan kepada kami Malik bin Isma'il telah menceritakan kepada kami Isra`il dari Abu Ishaq saya mendengar Al Barra` berkata; saya belum pernah melihat seseorang yang paling bagus dari Nabi shallallahu 'alaihi wasallam ketika mengenakan baju berwarna merah, Sebagian sahabatku mengatakan; dari Malik bahwa rambut beliau menjuntai hingga mendekati kedua bahunya.\" Abu Ishaq mengatakan; bahwa saya mendengar ia menceritakan hadits ini tidak hanya sekali, dan tidaklah ia menceritakan hal ini kecuali ia tersenyum.\" Syu'bah mengatakan; \"Bahwa rambut beliau hingga melebihi kedua telinganya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "118",
    "matchingArabicURN": "151090",
    "last_updated": null
  },
  {
    "indonesianURN": "3054500",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3001",
    "babName": "Keriting",
    "hadithNumber": "5451",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Yusuf telah mengabarkan kepada kami Malik dari Nafi' dari Abdullah bin Umar radliallahu 'anhuma bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Di saat saya tengah bermimpi pada malam hari di dekat Ka'bah saya melihat seorang laki-laki yang berkulit sawo matang, berperawakan sangat rupawan yang pernah saya lihat dari seorang laki-laki dan berambut lurus, dipapah dua orang laki-laki atau berada di antara dua pundak laki-laki dan rambutnya meneteskan air, tengah thawaf di Ka'bah, Saya bertanya, 'Siapa orang ini? ' di beritahukan, 'Ibnu Maryam.' Tiba-tiba ada seorang lelaki berambut keriting, dan buta mata kanannya, seolah-olah matanya seperti buah anggur yang menjorok. Lalu Saya bertanya, 'Siapakah orang ini? ' diberitahukan; 'Ad Dajjal.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "119",
    "matchingArabicURN": "151100",
    "last_updated": null
  },
  {
    "indonesianURN": "3054510",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3001",
    "babName": "Keriting",
    "hadithNumber": "5452",
    "hadithText": "Telah menceritakan kepada kami Ishaq telah mengabarkan kepada kami Hibban telah menceritakan kepada kami Hammam telah menceritakan kepada kami Qatadah telah menceritakan kepada kami Anas bahwa Rambut Nabi shallallahu 'alaihi wasallam menjuntai sampai ke kedua bahu beliau.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "120",
    "matchingArabicURN": "151110",
    "last_updated": null
  },
  {
    "indonesianURN": "3054520",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3001",
    "babName": "Keriting",
    "hadithNumber": "5453",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Hammam dari Qatadah dari Anas bahwa rambut Nabi shallallahu 'alaihi wasallam menjuntai hingga kebahu beliau.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "121",
    "matchingArabicURN": "151120",
    "last_updated": null
  },
  {
    "indonesianURN": "3054530",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3001",
    "babName": "Keriting",
    "hadithNumber": "5454",
    "hadithText": "Telah menceritakan kepadaku 'Amru bin Ali telah menceritakan kepada kami Wahb bin Jarir dia berkata; telah menceritakan kepadaku Ayahku dari Qatadah dia berkata; saya bertanya kepada Anas bin Malik radliallahu 'anhu mengenai rambut Rasulullah shallallahu 'alaihi wasallam, dia berkata; \"Rambut Rasulullah shallallahu 'alaihi wasallam tidak lurus dan tidak pula keriting yaitu (menjuntai) antara kedua telinga hingga bahu beliau.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "122",
    "matchingArabicURN": "151130",
    "last_updated": null
  },
  {
    "indonesianURN": "3054540",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3001",
    "babName": "Keriting",
    "hadithNumber": "5455",
    "hadithText": "Telah menceritakan kepada kami Muslim telah menceritakan kepada kami Jarir dari Qatadah dari Anas dia berkata; \"Nabi shallallahu 'alaihi wasallam adalah seseorang yang berlengan kekar, aku tidak pernah melihat orang yang menyerupainya, sedangkan rambut Nabi shallallahu 'alaihi wasallam ikal, tidak terlalu lurus dan tidak pula keriting.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "123",
    "matchingArabicURN": "151140",
    "last_updated": null
  },
  {
    "indonesianURN": "3054550",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3001",
    "babName": "Keriting",
    "hadithNumber": "5456",
    "hadithText": "Telah menceritakan kepada kami Abu An Nu'man telah menceritakan kepada kami Jarir bin Hazim dari Qatadah dari Anas radliallahu 'anhu dia berkata; Nabi shallallahu 'alaihi wasallam adalah seseorang yang lengan dan kakinya besar, bagus wajahnya, saya belum pernah melihat orang yang menyerupainya baik sebelum dan sesudahnya, telapak tangan beliau juga lebar.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "124",
    "matchingArabicURN": "151150",
    "last_updated": null
  },
  {
    "indonesianURN": "3054560",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3001",
    "babName": "Keriting",
    "hadithNumber": "5457",
    "hadithText": "Telah menceritakan kepadaku 'Amru bin Ali telah menceritakan kepada kami Mu'adz bin Hani' telah menceritakan kepada kami Hammam telah menceritakan kepada kami Qatadah dari Anas bin Malik atau dari seorang laki-laki dari Abu Hurairah dia berkata; \"Nabi shallallahu 'alaihi wasallam adalah seorang yang besar kakinya, bagus perawakannya, saya belum pernah melihat seseorang seperti itu sesudah beliau.\" Hisyam mengatakan; dari Ma'mar dari Qatadah dari Anas bahwa Nabi shallallahu 'alaihi wasallam adalah seseorang yang lebar telapak kaki dan telapak tangannya.\" Abu Hilal mengatakan; telah menceritakan kepada kami Qatadah dari Anas atau Jabir bin Abdullah bahwa Nabi shallallahu 'alaihi wasallam adalah seseorang yang lebar telapak tangan dan telapak kakinya, saya belum pernah melihat orang yang menyerupai setelah beliau.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "0",
    "matchingArabicURN": "0",
    "last_updated": null
  },
  {
    "indonesianURN": "3054570",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3001",
    "babName": "Keriting",
    "hadithNumber": "5458",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Al Mutsanna dia berkata; telah menceritakan kepadaku Ibnu Abu 'Adi dari Ibnu 'Aun dari Mujahid dia berkata; Kami pernah berada di samping Ibnu Abbas radliallahu 'anhuma, lalu orang-orang menyebut-nyebut Dajjal, lantas Ibnu Abbas mengatakan; \"Sesungguhnya di antara kedua mata Dajjal tertulis \"Kafir\", Ibnu Abbas mengatakan; \"Namun saya belum pernah mendengar beliau (secara langsung) mengatakan hal itu, akan tetapi beliau (Nabi) mengatakan: \"Adapun Ibrahim, maka lihatlah pada teman kalian, sedangkan Musa, ia adalah seorang laki-laki (berkulit) kecoklatan dan bertubuh kekar tengah (menunggang) unta merah yang kendalinya terbuat dari sabut kurma, seolah-olah aku melihat kepadanya ketika menuruni lembah sambil bertalbiyah.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "128",
    "matchingArabicURN": "151210",
    "last_updated": null
  },
  {
    "indonesianURN": "3054580",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3002",
    "babName": "Memakai sorban",
    "hadithNumber": "5459",
    "hadithText": "Telah menceritakan kepada kami Abu Al Yaman telah mengabarkan kepada kami Syu'aib dari Az Zuhri dia berkata; telah mengabarkan kepadaku Salim bin Abdullah bahwa Abdullah bin Umar berkata; saya mendengar Umar radliallahu 'anhu berkata; \"Barangsiapa mengepang rambutnya hendaknya ia mencukurnya (ketika haji) dan janganlah ia seperti orang yang mengikat rambutnya (menguncir), sementara Ibnu Umar mengatakan; \"Sesungguhnya saya pernah melihat Rasulullah shallallahu 'alaihi wasallam mengikat (menguncir) rambutnya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "129",
    "matchingArabicURN": "151220",
    "last_updated": null
  },
  {
    "indonesianURN": "3054590",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3002",
    "babName": "Memakai sorban",
    "hadithNumber": "5460",
    "hadithText": "Telah menceritakan kepada kami Hibban bin Musa dan Ahmad bin Muhammad keduanya mengatakan; telah mengabarkan kepada kami Abdullah telah mengabarkan kepada kami Yunus dari Az Zuhri dari Salim dari Ibnu Umar radliallahu 'anhuma dia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bertalbiyah dengan mengikat rambutnya (menguncir) sambil mengucapkan: \"LABBAIKALLAAHUMMA LABBAIK LABBAIKALAA SYARIIKA LABBAIK INNAL HAMDA WAN NI'MATA LAKA WAL MULK LAA SYARIIKALAK\" dan tidak lebih dari mengucapkan kalimat tersebut.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "130",
    "matchingArabicURN": "151230",
    "last_updated": null
  },
  {
    "indonesianURN": "3054600",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3002",
    "babName": "Memakai sorban",
    "hadithNumber": "5461",
    "hadithText": "Telah menceritakan kepadaku Isma'il dia berkata; telah menceritakan kepadaku Malik dari Nafi' dari Abdullah bin Umar dari Hafshah radliallahu 'anha isteri Nabi shallallahu 'alaihi wasallam dia berkata; saya bertanya; \"Wahai Rasulullah, kenapa orang-orang telah bertahallul dari umrahnya sedangkan anda belum bertahallul dari umrahmu? Beliau menjawab: \"Saya telah mengikat kepalaku dan mengalungi hewan kurbanku, dan saya tidak akan bertahallul hingga menyembelih kurban.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "131",
    "matchingArabicURN": "151240",
    "last_updated": null
  },
  {
    "indonesianURN": "3054610",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3003",
    "babName": "Menyisir rambut di bagian tengah",
    "hadithNumber": "5462",
    "hadithText": "Telah menceritakan kepada kami Ahmad bin Yunus telah menceritakan kepada kami Ibrahim bin Sa'd telah menceritakan kepada kami Ibnu Syihab dari 'Ubaidullah bin Abdullah dari Ibnu Abbas radliallahu 'anhuma berkata; \"Nabi shallallahu 'alaihi wasallam suka menyamai Ahli Kitab di sebagian perkara yang tidak diperintahkan, Ahli Kitab suka mengurai rambut mereka, sedangkan orang-orang Musyrik biasa membelah rambut mereka, maka beliau lebih suka mengurai rambut bagian depannya, lalu beliau membelahnya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "132",
    "matchingArabicURN": "151250",
    "last_updated": null
  },
  {
    "indonesianURN": "3054620",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3003",
    "babName": "Menyisir rambut di bagian tengah",
    "hadithNumber": "5463",
    "hadithText": "Telah menceritakan kepada kami Abu Al Walid dan Abdullah bin Raja' keduanya berkata; telah menceritakan kepada kami Syu'bah dari Al Hakam dari Ibrahim dari Al Aswad dari 'Aisyah radliallahu 'anha berkata; \"Seakan-akan saya melihat kilatan minyak yang berada di ubun-ubun (rambut) Nabi shallallahu 'alaihi wasallam ketika beliau tengah berihram.\" Abdullah mengatakan; \"Di ubun-ubun (rambut) Nabi.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "133",
    "matchingArabicURN": "151260",
    "last_updated": null
  },
  {
    "indonesianURN": "3054630",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3004",
    "babName": "Memintal rambut",
    "hadithNumber": "5464",
    "hadithText": "Telah menceritakan kepada kami Ali bin Abdullah telah menceritakan kepada kami Al Fadl bin 'Anbasah telah mengabarkan kepada kami Husyaim telah mengabarkan kepada kami Abu Bisyr. Dan di riwayatkan dari jalur lain, telah menceritakan kepada kami Qutaibah telah menceritakan kepada kami Husyaim dari Abu Bisyr dari Sa'id bin Jubair dari Ibnu Abbas radliallahu 'anhuma dia berkata; \"Saya pernah bermalam di rumah bibiku yaitu Maimunah binti Al Harits, sementara Rasulullah shallallahu 'alaihi wasallam malam itu berada di sampingnya, Ibnu Abbas melanjutkan; \"Lalu beliau mengerjakan shalat malam dan akupun ikut shalat di sebelah kirinya, Ibnu Abbas menuturkan; \"Kemudian beliau memegang rambutku yang terkuncir dan memposisikanku di sebelah kanannya.\" Telah menceritakan kepada kami 'Amru bin Muhammad telah menceritakan kepada kami Husyaim telah mengabarkan kepada kami Abu Bisyr dengan hadits ini, dia mengatakan; \"(memegang) kuncir rambutku atau kepalaku.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "134",
    "matchingArabicURN": "151271",
    "last_updated": null
  },
  {
    "indonesianURN": "3054640",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3005",
    "babName": "Qaza', mencukur sebagian dan membiarkan sebagian",
    "hadithNumber": "5465",
    "hadithText": "Telah menceritakan kepada kami Muhammad dia berkata; telah mengabarkan kepadaku Makhlad dia berkata; telah mengabarkan kepadaku Ibnu Juraij dia berkata; telah mengabarkan kepadaku 'Ubaidullah bin Hafsh bahwa Umar bin Nafi' mengabarkan kepadanya dari Nafi' bekas budak Abdullah pernah mendengar Ibnu Umar radliallahu 'anhuma berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam melarang dari qaza' (mencukur sebagian rambut kepala dan membiarkan sebagian yang lain).\" 'Ubaidullah mengatakan; \"saya bertanya; \"Apakah qaza' itu\" 'Ubaidullah lalu mengisyaratkan kepada kami sambil mengatakan; \"Jika rambut anak kecil dicukur, lalu membiarkan sebagian yang ini, yang ini dan yang ini.\" 'Ubaidullah menunjukkan kepada kami pada ubun-ubun dan samping (kanan dan kiri) kepalanya.\" Ditanyakan kepada 'Ubaidullah; \"Apakah hal itu berlaku untuk anak laki-laki dan perempuan?\" dia menjawab; \"Saya tidak tahu yang seperti ini.\" Penanya bertanya lagi; \"Apakah khusus untuk anak laki-laki.\" 'Ubaidullah mengatakan (kepada syaikhnya); \"Pertanyaan itu pernah juga aku ulangi (kepada syaikhku), lalu dia berkata; \"Dan tidak mengapa (membiarkan) rambut depan kepala dan rambut tengkuk bagi anak-anak, akan tetapi maksud qaza' adalah membiarkan sebagian rambut yang ada di ubun-ubun, hingga di kepala hanya tersisa itu, begitu pula dengan memangkas rambut kepalanya ini dan ini.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "135",
    "matchingArabicURN": "151290",
    "last_updated": null
  },
  {
    "indonesianURN": "3054650",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3005",
    "babName": "Qaza', mencukur sebagian dan membiarkan sebagian",
    "hadithNumber": "5466",
    "hadithText": "Telah menceritakan kepada kami Muslim bin Ibrahim telah menceritakan kepada kami Abdullah bin Mutsanna bin Abdullah bin Anas bin Malik telah menceritakan kepada kami Abdullah bin Dinar dari Ibnu Umar bahwa Rasulullah shallallahu 'alaihi wasallam melarang qaza' (mencukur sebagian rambut kepala dan membiarkan sebagian yang lain).\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "136",
    "matchingArabicURN": "151300",
    "last_updated": null
  },
  {
    "indonesianURN": "3054660",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3006",
    "babName": "Wanita memberi wewangian suaminya dengan tangannya",
    "hadithNumber": "5467",
    "hadithText": "Telah menceritakan kepadaku Ahmad bin Muhammad telah mengabarkan kepada kami Abdullah telah mengabarkan kepada kami Yahya bin Sa'id telah mengabarkan kepada kami Abdurrahman bin Al Qasim dari Ayahnya dari Aisyah dia berkata; \"Saya pernah meminyaki Nabi shallallahu 'alaihi wasallam ketika ihramnya, dan saya juga pernah meminyaki beliau sebelum beliau mengerjakan ifadlah (dalam haji).\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "137",
    "matchingArabicURN": "151310",
    "last_updated": null
  },
  {
    "indonesianURN": "3054670",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3007",
    "babName": "Wewangian di kepala dan jenggot",
    "hadithNumber": "5468",
    "hadithText": "Telah menceritakan kepada kami Ishaq bin Nashr telah menceritakan kepada kami Yahya bin Adam telah menceritakan kepada kami Isra'il dari Abu Ishaq dari Abdurrahman bin Al Aswad dari Ayahnya dari Aisyah dia berkata; \"Saya pernah memberi minyak wangi kepada Nabi shallallahu 'alaihi wasallam dengan minyak wangi yang terbaik yang saya dapatkan sehingga saya dapati kilauan minyak wangi tersebut di kepala beliau dan jenggot beliau.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "138",
    "matchingArabicURN": "151320",
    "last_updated": null
  },
  {
    "indonesianURN": "3054680",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3008",
    "babName": "Bersisir",
    "hadithNumber": "5469",
    "hadithText": "Telah menceritakan kepada kami Adam bin Abu Iyas telah menceritakan kepada kami Ibnu Abu Dzi'b dari Az Zuhri dari Sahl bin Sa'd bahwa seorang laki-laki sedang mengintip dari kamar rumah Nabi shallallahu 'alaihi wasallam, sementara Nabi shallallahu 'alaihi wasallam tengah menyisir rambutnya dengan midra (sejenis sisir), maka beliau bersabda: \"Sekiranya aku mengetahui kamu mengintip, sungguh aku akan mencolok kedua matamu, bukankah diberlakukannya meminta ijin demi pandangan.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "139",
    "matchingArabicURN": "151330",
    "last_updated": null
  },
  {
    "indonesianURN": "3054690",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3009",
    "babName": "isteri menyisiri suami",
    "hadithNumber": "5470",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Yusuf telah mengabarkan kepada kami Malik dari Ibnu Syihab dari Urwah bin Zubair dari Aisyah radliallahu 'anha dia berkata; \"Saya pernah menyisir rambut Rasulullah shallallahu 'alaihi wasallam sementara diriku sedang haidl.\" Telah menceritakan kepada kami Abdullah bin Yusuf telah mengabarkan kepada kami Malik dari Hisyam dari Ayahnya dari Aisyah seperti hadits di atas.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "140",
    "matchingArabicURN": "151341",
    "last_updated": null
  },
  {
    "indonesianURN": "3054700",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3010",
    "babName": "Menyisir dan mendahulukan sebelah kanan",
    "hadithNumber": "5471",
    "hadithText": "Telah menceritakan kepada kami Abu Al Walid telah menceritakan kepada kami Syu'bah dari Asy'ats bin Sulaim dari Ayahnya dari Masruq dari Aisyah dari Nabi shallallahu 'alaihi wasallam bahwa beliau menyukai tayamun (mendahulukan yang kanan) ketika menyisir rambut dan berwudlu'.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "141",
    "matchingArabicURN": "151360",
    "last_updated": null
  },
  {
    "indonesianURN": "3054710",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3011",
    "babName": "Berwewangian",
    "hadithNumber": "5472",
    "hadithText": "Telah menceritakan kepadaku Abdullah bin Muhammad telah menceritakan kepada kami Hisyam telah mengabarkan kepada kami Ma'mar dari Az Zuhri dari Ibnu Musayyab dari Abu Hurairah radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Semua amalan bani Adam adalah untuknya kecuali puasa, sesungguhnya puasa adalah untuk-Ku (Allah), dan Aku lah yang membalasnya, sungguh bau mulut orang yang berpuasa itu lebih wangi di sisi Allah dari pada harumnya minyak wangi.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "142",
    "matchingArabicURN": "151370",
    "last_updated": null
  },
  {
    "indonesianURN": "3054720",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3012",
    "babName": "Wewangian yang disunnahkan",
    "hadithNumber": "5473",
    "hadithText": "Telah menceritakan kepada kami Musa telah menceritakan kepada kami Wuhaib telah menceritakan kepada kami Hisyam dari Utsman bin Urwah dari Ayahnya dari Aisyah radliallahu 'anha dia berkata; \"Saya pernah memberi minyak wangi kepada Nabi shallallahu 'alaihi wasallam ketika beliau berihram dengan sebaik-baik minyak wangi yang saya dapatkan.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "143",
    "matchingArabicURN": "151380",
    "last_updated": null
  },
  {
    "indonesianURN": "3054730",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3013",
    "babName": "Tidak menolak wewangian",
    "hadithNumber": "5474",
    "hadithText": "Telah menceritakan kepada kami Abu Nu'aim telah menceritakan kepada kami Azrah bin Tsabit Al Anshari dia berkata; telah menceritakan kepadaku Tsumamah bin Abdullah dari Anas radliallahu 'anhu bahwa dia tidak pernah menolak (pemberian) minyak wangi, dan dia mengira bahwa Nabi shallallahu 'alaihi wasallam juga tidak pernah menolak (pemberian) minyak wangi.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "144",
    "matchingArabicURN": "151390",
    "last_updated": null
  },
  {
    "indonesianURN": "3054740",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3014",
    "babName": "Dzarirah (Minyak wangi yang dioplos)",
    "hadithNumber": "5475",
    "hadithText": "Telah menceritakan kepada kami Utsman bin Haitsam atau Muhammad dari Ibnu Juraij telah menceritakan kepadaku Umar bin Abdullah bin Urwah dia mendengar Urwah dan Al Qasim keduanya mengabarkan dari Aisyah dia berkata; \"Saya pernah memberi minyak wangi dzarirah (sejenis minyak wangi) kepada Rasulullah shallallahu 'alaihi wasallam untuk tahallul dan ihramnya ketika haji wada'.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "145",
    "matchingArabicURN": "151400",
    "last_updated": null
  },
  {
    "indonesianURN": "3054750",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3015",
    "babName": "Memangkur gigi untuk kecantikan",
    "hadithNumber": "5476",
    "hadithText": "Telah menceritakan kepada kami Utsman telah menceritakan kepada kami Jarir dari Manshur dari Ibrahim dari Alqamah, Abdullah mengatakan; \"Allah melaknat orang yang mentato dan orang yang meminta ditato, orang yang mencukur habis alis dan merenggangkan gigi untuk kecantikan dengan merubah ciptaan Allah Ta'ala, kenapa saya tidak melaknat orang yang dilaknat Nabi shallallahu 'alaihi wasallam sementara dalam kitabullah telah termaktub Dan sesuatu yang datang dari rasul, maka ambillah (QS Al Hasyr; 7).\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "146",
    "matchingArabicURN": "151410",
    "last_updated": null
  },
  {
    "indonesianURN": "3054770",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3016",
    "babName": "Menyambung rambut",
    "hadithNumber": "5478",
    "hadithText": "Telah menceritakan kepada kami Adam telah menceritakan kepada kami Syu'bah dari 'Amru bin Murrah dia berkata; saya mendengar Al Hasan bin Muslim bin Yannaq menceritakan dari Shafiyah binti Syaibah dari Aisyah radliallahu 'anha bahwa seorang budak perempuan milik orang Anshar hendak menikah, sementara dirinya tengah sakit hingga rambutnya rontok, maka orang-orang pun hendak menyambungnya, lalu mereka bertanya kepada Nabi shallallahu 'alaihi wasallam, beliau pun bersabda: \"Allah melaknat orang yang menyambung rambutnya dan yang minta disambung rambutnya.\" Hadits ini diperkuat oleh riwayat Ibnu Ishaq dari Aban bin Shalih dari Al Hasan dari Shafiyyah dari Aisyah.</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "149",
    "matchingArabicURN": "151440",
    "last_updated": null
  },
  {
    "indonesianURN": "3054780",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3016",
    "babName": "Menyambung rambut",
    "hadithNumber": "5479",
    "hadithText": "Telah menceritakan kepadaku Ahmad bin Miqdam telah menceritakan kepada kami Fudlail bin Sulaiman telah menceritakan kepada kami Manshur bin Abdurrahman dia berkata; telah menceritakan kepadaku ibuku dari Asma` binti Abu Bakr radliallahu 'anhuma bahwa seorang wanita datang kepada Rasulullah shallallahu 'alaihi wasallam seraya berkata; \"Sesungguhnya saya hendak menikahkan putriku, ternyata putriku menderita suatu penyakit yang menyebabkan rambutnya rontok sedangkan calon suaminya sangat kasihan kepadanya, apakah saya boleh menyambung rambutnya?\" maka Rasulullah shallallahu 'alaihi wasallam mencela orang yang menyambung rambutnya dan yang minta disambung rambutnya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "150",
    "matchingArabicURN": "151450",
    "last_updated": null
  },
  {
    "indonesianURN": "3054790",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3016",
    "babName": "Menyambung rambut",
    "hadithNumber": "5480",
    "hadithText": "Telah menceritakan kepada kami Adam telah menceritakan kepada kami Syu'bah dari Hisyam bin 'Urwah dari isterinya, Fathimah dari Asma' binti Abu Bakr dia berkata; Nabi shallallahu 'alaihi wasallam melaknat orang yang menyambung rambut dan yang minta disambung rambutnya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "151",
    "matchingArabicURN": "151460",
    "last_updated": null
  },
  {
    "indonesianURN": "3054800",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3016",
    "babName": "Menyambung rambut",
    "hadithNumber": "5481",
    "hadithText": "Telah menceritakan kepadaku Muhammad bin Muqatil telah mengabarkan kepada kami Abdullah telah mengabarkan kepada kami 'Ubaidullah dari Nafi' dari Ibnu Umar radliallahu 'anhuma bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah melaknat orang yang menyambung rambutnya dan yang minta disambung rambutnya serta melaknat orang yang mentato dan yang minta ditato.\" Nafi' mengatakan; \"Terkadang mentato itu juga bisa di gusi (membikin gigi bagus dengan memberi kawat dll).\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "152",
    "matchingArabicURN": "151470",
    "last_updated": null
  },
  {
    "indonesianURN": "3054810",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3016",
    "babName": "Menyambung rambut",
    "hadithNumber": "5482",
    "hadithText": "Telah menceritakan kepada kami Adam telah menceritakan kepada kami Syu'bah telah menceritakan kepada kami 'Amru bin Murrah saya mendengar Sa'id bin Musayyab berkata; Mu'awiyah tiba di Madinah yaitu di akhir ia tiba di Madinah, kemudian dia berkhutbah di hadapan kami, sambil mengeluarkan sambungan rambut, katanya; \"Saya tidak pernah melihat seorangpun yang mengenakan ini kecuali orang Yahudi dan sesungguhnya Nabi shallallahu 'alaihi wasallam menamakan ini dengan az zuur yaitu sambungan pada rambut.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "153",
    "matchingArabicURN": "151480",
    "last_updated": null
  },
  {
    "indonesianURN": "3054820",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3017",
    "babName": "Mencukur alias wajah",
    "hadithNumber": "5483",
    "hadithText": "Telah menceritakan kepada kami Ishaq bin Ibrahim telah mengabarkan kepada kami Jarir dari Manshur dari Ibrahim dari 'Alqamah dia berkata; Abdullah melaknat orang yang mentato, mencukur habis alis mata, merenggangkan gigi (denga kawat dll) untuk kecantikan dengan merubah ciptaan Allah, Ummu Ya'qub berkata; \"Apa maksudnya ini?\" Abdullah mengatakan; \"Bagaimana aku tidak melaknat orang yang dilaknat Rasulullah dan telah tercatat pula dalam kitabullah. Ummu Ya'qub berkata; \"Saya telah membaca dalam mushaf, namun saya tidak mendapatkan hal itu.\" Abdullah berkata; \"Demi Allah, sekiranya kamu membacanya, niscaya kamu akan mendapatkannya yaitu Dan sesuatu yang datang dari Rasul maka ambillah dan yang di larang olehnya maka jauhilah QS Al Hasyr: 7.</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "154",
    "matchingArabicURN": "151490",
    "last_updated": null
  },
  {
    "indonesianURN": "3054830",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3018",
    "babName": "Disambung rambutnya",
    "hadithNumber": "5484",
    "hadithText": "Telah menceritakan kepadaku Muhammad telah menceritakan kepada kami 'Abdah dari 'Ubaidullah dari Nafi' dari Ibnu Umar radliallahu 'anhuma dia berkata; Nabi shallallahu 'alaihi wasallam melaknat orang yang menyambung rambutnya dan yang minta disambung rambutnya, dan orang yang mentato dan orang yang minta ditato.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "155",
    "matchingArabicURN": "151500",
    "last_updated": null
  },
  {
    "indonesianURN": "3054840",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3018",
    "babName": "Disambung rambutnya",
    "hadithNumber": "5485",
    "hadithText": "Telah menceritakan kepada kami Al Humaidi telah menceritakan kepada kami Sufyan telah menceritakan kepada kami Hisyam bahwa dia mendengar Fathimah binti Mundzir berkata; saya mendengar Asma' berkata; seorang wanita bertanya kepada Nabi shallallahu 'alaihi wasallam katanya; \"Wahai Rasulullah, sesungguhnya puteriku menderita penyakit gatal (cacar) hingga rambutnya rontok, sementara saya hendak menikahkannya, apakah saya boleh menyambung rambutnya? Beliau bersabda: \"Sesungguhnya Allah melaknat orang yang menyambung rambutnya dan yang minta disambung.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "156",
    "matchingArabicURN": "151510",
    "last_updated": null
  },
  {
    "indonesianURN": "3054850",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3018",
    "babName": "Disambung rambutnya",
    "hadithNumber": "5486",
    "hadithText": "Telah menceritakan kepadaku Yusuf bin Musa telah menceritakan kepada kami Al Fadhl bin Dukain telah menceritakan kepada kami Shakhr bin Juwairiyah dari Nafi' dari Abdullah bin Umar radliallahu 'anhuma saya mendengar Nabi shallallahu 'alaihi wasallam atau Nabi shallallahu 'alaihi wasallam bersabda: \"Orang yang mentato dan yang minta ditato serta orang yang menyambung rambutnya dan yang minta disambung rambutnya.\" Maksudnya adalah Nabi shallallahu 'alaihi wasallam melaknatnya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "157",
    "matchingArabicURN": "151520",
    "last_updated": null
  },
  {
    "indonesianURN": "3054860",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3018",
    "babName": "Disambung rambutnya",
    "hadithNumber": "5487",
    "hadithText": "Telah menceritakan kepadaku Muhammad bin Muqatil telah mengabarkan kepada kami Abdullah telah mengabarkan kepada kami Sufyan dari Manshur dari Ibrahim dari 'Alqamah dari Ibnu Mas'ud radliallahu 'anhu dia berkata; \"Allah melaknat orang yang mentato dan yang minta ditato dan mencukur habis alis mata serta merenggangkan gigi (dengan kawat dll) untuk kecantikan dengan merubah ciptaan Allah, kenapa saya tidak melaknat orang yang dilaknat Rasulullah shallallahu 'alaihi wasallam sementara telah tertulis dalam kitabullah.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "158",
    "matchingArabicURN": "151530",
    "last_updated": null
  },
  {
    "indonesianURN": "3054880",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3019",
    "babName": "Tato",
    "hadithNumber": "5489",
    "hadithText": "Telah menceritakan kepada kami Sulaiman bin Harb telah menceritakan kepada kami Syu'bah dari 'Aun bin Abu Juhaifah dia berkata; aku pernah melihat Ayahku berkata; sesungguhnya Nabi shallallahu 'alaihi wasallam melarang hasil (menjual) darah dan hasil penjualan anjing, memakan riba dan yang memberi makan dan yang mentato dan yang meminta ditato.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "161",
    "matchingArabicURN": "151560",
    "last_updated": null
  },
  {
    "indonesianURN": "3054890",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3020",
    "babName": "Minta ditato",
    "hadithNumber": "5490",
    "hadithText": "Telah menceritakan kepada kami Zuhair bin Harb telah menceritakan kepada kami Jarir dari 'Umarah dari Abu Zar'ah dari Abu Hurairah dia berkata; \"Umar pernah menemui seorang wanita yang mentato, lalu Umar berdiri dan berkata; \"Saya peringatkan kepada kalian, siapakah di antara kalian yang mendengar dari Nabi shallallahu 'alaihi wasallam tentang tato?\" Abu Hurairah berkata; \"Lalu aku berdiri dan berkata; \"Saya pernah mendengarnya wahai Amirul mukminin.\" Dia berkata; \"Apa yang pernah kamu dengar?\" Abu Hurairah berkata; \"Saya mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mentato dan jangan pula minta untuk ditato.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "162",
    "matchingArabicURN": "151570",
    "last_updated": null
  },
  {
    "indonesianURN": "3054900",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3020",
    "babName": "Minta ditato",
    "hadithNumber": "5491",
    "hadithText": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Yahya bin Sa'id dari 'Ubaidullah telah mengabarkan kepadaku Nafi' dari Ibnu Umar dia berkata; Nabi shallallahu 'alaihi wasallam melaknat orang yang menyambung rambutnya dan yang minta disambung rambutnya serta orang yang mentato dan yang minta ditato.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "163",
    "matchingArabicURN": "151580",
    "last_updated": null
  },
  {
    "indonesianURN": "3054910",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3020",
    "babName": "Minta ditato",
    "hadithNumber": "5492",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Al Mutsanna telah menceritakan kepada kami Abdurrahman dari Sufyan dari Manshur dari Ibrahim dari Alqamah dari Abdullah radliallahu 'anhu bahwa Allah melaknat wanita yang mentato dan yang minta ditato dan wanita yang mencukur alis matanya serta yang merenggangkan giginya (dengan kawat dll) untuk kecantikan dengan merubah ciptaan Allah, kenapa saya tidak melaknat orang yang dilaknat Rasulullah shallallahu 'alaihi wasallam sementara telah tertulis dalam kitabullah.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "164",
    "matchingArabicURN": "151590",
    "last_updated": null
  },
  {
    "indonesianURN": "3054920",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3021",
    "babName": "Gambar",
    "hadithNumber": "5493",
    "hadithText": "Telah menceritakan kepada kami Adam telah menceritakan kepada kami Ibnu Abu Dzi`b dari Az Zuhri dari 'Ubaidullah bin Abdullah bin 'Utbah dari Ibnu Abbas dari Abu Thalhah radliallahu 'anhum dia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Malaikat tidak akan masuk ke rumah yang di dalamnya terdapat anjing dan patung.\" Al Laits berkata; telah menceritakan kepadaku Yunus dari Ibnu Syihab telah mengabarkan kepadaku 'Ubaidullah dia mendengar Ibnu Abbas bahwa saya mendengar Abu Thalhah bahwa saya mendengar Nabi shallallahu 'alaihi wasallam.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "165",
    "matchingArabicURN": "151601",
    "last_updated": null
  },
  {
    "indonesianURN": "3054930",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3022",
    "babName": "Siksa bagi penggambar pada hari kiamat",
    "hadithNumber": "5494",
    "hadithText": "Telah menceritakan kepada kami Al Humaidi telah menceritakan kepada kami Sufyan telah menceritakan kepada kami Al A'masy dari Muslim dia berkata; Kami bersama Masruq berada di rumah Yasar bin Numair, lantas dia melihat patung di dalam (gambar) patung rumahnya, lantas Masruq berkata; \"Saya pernah mendengar Abdullah berkata; saya mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang yang paling keras siksaannya di sisi Allah pada hari Kiamat adalah orang-orang yang suka menggambar.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "166",
    "matchingArabicURN": "151620",
    "last_updated": null
  },
  {
    "indonesianURN": "3054940",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3022",
    "babName": "Siksa bagi penggambar pada hari kiamat",
    "hadithNumber": "5495",
    "hadithText": "Telah menceritakan kepada kami Ibrahim bin Al Mundzir telah menceritakan kepada kami Anas bin Iyadl dari 'Ubaidullah dari Nafi' bahwa Abdullah bin Umar radliallahu 'anhuma telah mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang-orang yang membuat gambar-gambar ini akan disiksa di hari Kiamat, di katakan kepadanya; \"Hidupkanlah apa yang telah kamu gambar ini.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "167",
    "matchingArabicURN": "151630",
    "last_updated": null
  },
  {
    "indonesianURN": "3054950",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3023",
    "babName": "Mencopot gambar",
    "hadithNumber": "5496",
    "hadithText": "Telah menceritakan kepada kami Mu'adz bin Fadlalah telah menceritakan kepada kami Hisyam dari Yahya dari 'Imran bin Hithan bahwa Aisyah radliallahu 'anhu telah menceritakan kepadanya bahwa Nabi shallallahu 'alaihi wasallam tidak pernah meninggalkan (gambar) salib melainkan beliau akan menghancurkannya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "168",
    "matchingArabicURN": "151640",
    "last_updated": null
  },
  {
    "indonesianURN": "3054960",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3023",
    "babName": "Mencopot gambar",
    "hadithNumber": "5497",
    "hadithText": "Telah menceritakan kepada kami Musa telah menceritakan kepada kami Abdul Wahid telah menceritakan kepada kami 'Umarah telah menceritakan kepada kami Abu Zar'ah dia berkata; saya masuk rumah (milik salah seorang) penduduk Madinah bersama Abu Hurairah, lalu dia melihat ke atap rumah ada sesuatu yang bergambar, dia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Dan siapakah yang lebih lalim dari pada orang-orang yang pergi untuk membuat ciptaan seperti halnya ciptaan-Ku. Maka hendaklah mereka menciptakan jagung, atau biji-bijian atau biji gandum'\"!. Kemudian Abu Hurairah meminta tempat air wudlu dan beliaupun berwudlu, mencuci kedua tangannya hingga ketiaknya, saya bertanya; \"Wahai Abu Hurairah, apakah anda mendengar sesuatu dari Rasulullah shallallahu 'alaihi wasallam (tentang hal ini)? Dia menjawab: \"inilah yang akan menjadi cahaya di hari kiamat.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "169",
    "matchingArabicURN": "151650",
    "last_updated": null
  },
  {
    "indonesianURN": "3054970",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3024",
    "babName": "Gambar yang diinjak-injak",
    "hadithNumber": "5498",
    "hadithText": "Telah menceritakan kepada kami Ali bin Abdullah telah menceritakan kepada kami Sufyan dia berkata; saya mendengar Abdurrahman bin Al Qasim -dan tidak ada seorang pun di Madinah yang lebih utama dari pada dia- dia berkata; saya mendengar Ayahku berkata; saya mendengar Aisyah radliallahu 'anha menemui Rasulullah shallallahu 'alaihi wasallam sekembalinya beliau dari safarnya, waktu itu saya telah membuat pembatas (satir) dari kain yang bergambar dalam ruanganku, ketika Rasulullah shallallahu 'alaihi wasallam melihatnya beliau langsung memotongnya sambil bersabda: \"Sesungguhnya orang-orang yang paling keras siksanya pada hari kiamat adalah orang-orang yang membuat sesuatu yang menyamai ciptaan Allah.\" Aisyah melanjutkan; \"Kemudian saya membuatnya menjadi satu bantal atau dua bantal.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "170",
    "matchingArabicURN": "151660",
    "last_updated": null
  },
  {
    "indonesianURN": "3054990",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3025",
    "babName": "Dimakruhkan duduk diatas gambar",
    "hadithNumber": "5500",
    "hadithText": "Telah menceritakan kepadaku Hajjaj bin Minhal telah menceritakan kepada kami Juwairiyah dari Nafi' dari Al Qasim dari Aisyah radliallahu 'anha bahwa dia telah membeli numruqah (bantal yang digunakan untuk duduk) yang ada gambarnya. Nabi shallallahu 'alaihi wasallampun berdiri di depan pintu dan tidak masuk ke dalam rumah. maka saya bertanya; \"Wahai Rasulullah, aku bertaubat kepada Allah, sebenarnya dosa apa yang telah aku perbuat?\" beliau bersabda: \"Bantal apakah ini?\" Dia menjawab; \"Aku telah membelinya agar anda duduk di atasnya atau anda jadikan sebagai bantal.\" Beliau bersabda: \"Sesungguhnya orang yang menggambar gambar ini akan disiksa pada Hari Kiamat. Dikatakan kepada mereka; 'Hidupkan yang telah kalian buat, ' (beliau bersabda): \"Sesungguhnya malaikat tidak akan masuk ke dalam rumah yang ada gambarnya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "173",
    "matchingArabicURN": "151690",
    "last_updated": null
  },
  {
    "indonesianURN": "3055000",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3025",
    "babName": "Dimakruhkan duduk diatas gambar",
    "hadithNumber": "5501",
    "hadithText": "Telah menceritakan kepada kami Qutaibah telah menceritakan kepada kami Al Laits dari Bukair dari Busr bin Sa'id dari Zaid bin Khalid dari Abu Thalhah seorang sahabat Rasulullah shallallahu 'alaihi wasallam dia berkata; Sesungguhnya Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Sesungguhnya Malaikat tidak akan masuk ke rumah yang di dalamnya ada gambar.\" Busr berkata; kemudian Zaid menderita sakit, maka kami pun menjenguknya, ternyata di pintunya terdapat tirai yang bergambar, lantas kataku kepada Ubaidullah anak tiri Maimunah isteri nabi shallallahu 'alaihi wasallam; \"Tidakkah Zaid pernah mengabarkan kepada kami tentang gambar di hari pertama?\" Ubaidullah menjawab; \"Apakah kamu tidak mendengarnya waktu dia mengatakan; \"Kecuali nomer di pakaian?\" Ibnu Wahb berkata; telah mengabarkan kepada kami 'Amru yaitu Ibnu Al Harits telah menceritakan kepadanya Bukair telah menceritakan kepadanya Busr telah menceritakan kepadanya Zaid telah menceritakan kepadanya Abu Thalhah dari Nabi shallallahu 'alaihi wasallam.</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "174",
    "matchingArabicURN": "151701",
    "last_updated": null
  },
  {
    "indonesianURN": "3055010",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3026",
    "babName": "Dimakruhkan shalat dalam gambar",
    "hadithNumber": "5502",
    "hadithText": "Telah menceritakan kepada kami Imran bin Maisarah telah menceritakan kepada kami Abdul Warits telah menceritakan kepada kami Abdul Aziz bin Shuhaib dari Anas radliallahu 'anhu dia berkata; \"Bahwa Aisyah memiliki sehelai kain yang bergambar dan digunakan sebagai tabir rumahnya, lalu Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Singkirkanlah ia dariku, karena gambarnya selalu memalingkanku dalam shalat.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "175",
    "matchingArabicURN": "151720",
    "last_updated": null
  },
  {
    "indonesianURN": "3055020",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3027",
    "babName": "Malaikat tidak rumah yang didalamnya ada gambar",
    "hadithNumber": "5503",
    "hadithText": "Telah menceritakan kepada kami Yahya bin Sulaiman dia berkata; telah menceritakan kepadaku Ibnu Wahb dia berkata; telah menceritakan kepadaku Umar yaitu Ibnu Muhammad dari Salim dari Ayahnya dia berkata; \"Jibril pernah berjanji kepada Nabi shallallahu 'alaihi wasallam, namun Jibril terlambat datang hingga Nabi shallallahu 'alaihi wasallam menunggu sangat lama, lalu Nabi shallallahu 'alaihi wasallam keluar dan menemuinya lalu menanyakan sebenarnya apa yang tengah terjadi, maka Jibril berkata kepada beliau: \"Sesungguhnya kami tidak memasuki rumah yang di dalamnya terdapat gambar dan anjing.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "176",
    "matchingArabicURN": "151730",
    "last_updated": null
  },
  {
    "indonesianURN": "3055030",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3028",
    "babName": "Seseorang yang tak masuk rumah karena ada gambar",
    "hadithNumber": "5504",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Maslamah dari Malik dari Nafi' dari Al Qasim bin Muhammad dari Aisyah radliallahu 'anha isteri Nabi shallallahu 'alaihi wasallam, bahwa dia mengabarkan kepadanya; bahwa dirinya pernah membeli numruqah (bantal yang digunakan untuk duduk) yang ada gambarnya. Nabi shallallahu 'alaihi wasallampun berdiri di depan pintu dan tidak masuk ke dalam rumah. Seolah-olah Aisyah melihat kemarahan di wajah beliau, maka dia bertanya; \"Wahai Rasulullah, aku bertaubat kepada Allah dan kepada Rasul-Nya, sebenarnya dosa apa yang telah aku perbuat?\" beliau bersabda: \"Ada apa dengan bantal ini?\" Dia menjawab; \"Aku telah membelinya agar anda duduk di atasnya atau anda jadikan sebagai bantal.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang yang menggambar gambar ini akan disiksa pada hari Kiamat. Dikatakan kepada mereka; 'Hidupkan yang telah kalian buat, ' kemudian beliau bersabda: \"Sesungguhnya malaikat tidak akan masuk ke dalam rumah yang ada gambarnya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "177",
    "matchingArabicURN": "151740",
    "last_updated": null
  },
  {
    "indonesianURN": "3055040",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3029",
    "babName": "Yang melaknat penggambar",
    "hadithNumber": "5505",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Al Mutsanna dia berkata; telah menceritakan kepadaku Ghundar telah menceritakan kepada kami Syu'bah dari 'Aun bin Abu Juhaifah dari Ayahnya bahwa dia pernah membeli seorang budak tukang bekam, lalu dia berkata; \"Sesungguhnya Nabi shallallahu 'alaihi wasallam melarang hasil penjualan darah, hasil penjualan anjing dan hasil pelacuran, beliau juga melaknat pemakan riba dan yang memberi makan, orang yang mentato dan yang minta ditato serta melaknat penggambar.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "178",
    "matchingArabicURN": "151750",
    "last_updated": null
  },
  {
    "indonesianURN": "3055050",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3030",
    "babName": "Siapa yang menggambar manusia dan jin, pada hari kiamat diperintahkan untuk menghidupkan",
    "hadithNumber": "5506",
    "hadithText": "Telah menceritakan kepada kami Ayyas bin Al Walid telah menceritakan kepada kami Abdul A'la telah menceritakan kepada kami Sa'id dia berkata; saya mendengar An Nadlr bin Anas bin Malik bercerita kepada Ibnu Abbas, katanya; \"Saya pernah berada di sisi Ibnu Abbas sementara orang-orang bertanya tanpa menyebutkan Nabi shallallahu 'alaihi wasallam hingga dia di tanya, lantas Ibnu Abbas menjawab: \"Barangsiapa menggambar suatu gambar di dunia, maka pada hari Kiamat akan dibebankan baginya untuk meniupkan ruh padahal ia tidak akan mampu meniupkan ruh.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "179",
    "matchingArabicURN": "151760",
    "last_updated": null
  },
  {
    "indonesianURN": "3055060",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3031",
    "babName": "Menunggang hewan",
    "hadithNumber": "5507",
    "hadithText": "Telah menceritakan kepada kami Qutaibah telah menceritakan kepada kami Abu Shafwan dari Yunus bin Yazid dari Ibnu Syihab dari 'Urwah dari Usamah bin Zaid radliallahu 'anhuma bahwa Rasulullah shallallahu 'alaihi wasallam menaiki keledainya yang berpelana dari kain fadak, sementara Usamah membonceng di belakangnya.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "180",
    "matchingArabicURN": "151770",
    "last_updated": null
  },
  {
    "indonesianURN": "3055070",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3032",
    "babName": "Menunggang hewan dengan bertiga",
    "hadithNumber": "5508",
    "hadithText": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Yazid bin Zurai' telah menceritakan kepada kami Khalid dari Ikrimah dari Ibnu Abbas radliallahu 'anhuma dia berkata; \"Setibanya Nabi shallallahu 'alaihi wasallam di Makkah, beliau disambut anak-anak Bani Abdul Mutthalib, lalu beliau menggendong salah satu diantara mereka di depan dan yang lain di belakang beliau.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "181",
    "matchingArabicURN": "151780",
    "last_updated": null
  },
  {
    "indonesianURN": "3055080",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3033",
    "babName": "Pemilik hewan menumpangkan orang lain di hewan tunggangannya",
    "hadithNumber": "5509",
    "hadithText": "Telah menceritakan kepadaku Muhammad bin Basyar telah menceritakan kepada kami Abdul Wahhab telah menceritakan kepada kami Ayyub dia menyebutkan tiga keburukan di samping Ikrimah, lalu dia berkata; Ibnu Abbas berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah datang sambil menggendong Qutsam di hadapannya dan Al Fadl di depannya atau Qutsam di belakangnya dan Al Fadl di depannya, lalu manakah diantara mereka yang jelek atau manakah di antara keduanya yang lebih utama.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "182",
    "matchingArabicURN": "151790",
    "last_updated": null
  },
  {
    "indonesianURN": "3055090",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3034",
    "babName": "Laki-laki membonceng laki-laki",
    "hadithNumber": "5510",
    "hadithText": "Telah menceritakan kepada kami Hudbah bin Khalid telah menceritakan kepada kami Hammam telah menceritakan kepada kami Qatadah telah menceritakan kepada kami Anas bin Malik dari Mu'adz bin Jabal radliallahu 'anhu dia berkata; \"Ketika saya membonceng Nabi shallallahu 'alaihi wasallam dan tidak ada yang menengahi keduanya melainkan hanya kursi kecil diatas pelana. Beliau bersabda, \"Wahai Muadz bin Jabal!\" Jawabku, \"Ya wahai Rasulullah! saya penuhi pangilan anda\", kemudian berjalan sesaat lalu bertanya, \"Wahai Muadz bin Jabal!\" jawabku, \"Ya, wahai Rasulullah saya penuhi panggilan anda\", kemudian beliau berjalan sesaat dan bertanya, \"Wahai Mua'dz bin Jabal.\" Jawabku, \"Ya wahai Rasulullah! saya penuhi pangilan anda\", beliau bersabda: \"Apakah engkau tahu apa hak Allah atas para hamba?\" Jawabku, \"Allah dan Rasul-Nya yang lebih tahu.\" Beliau bersabda: \"Hak Allah atas para hamba-Nya adalah agar mereka beribadah kepada-Nya semata dan tidak menyekutukan-Nya dengan suatu apapun\", Kemudian beliau berjalan sesaat dan bersertu, \"Wahai Mua'adz bin Jabal.\" Jawabku; \"Ya wahai Rasulullah, saya penuhi panggilan anda.\" Beliau bersabda: \"Apakah engkau tahu hak hamba atas Allah, jika mereka melakukan itu?\" Jawabku; \"Allah dan Rasul-Nya yang lebih tahu\", beliau bersabda: \"Hak para hamba atas Allah adalah Dia tidak akan menyiksa mereka.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "183",
    "matchingArabicURN": "151800",
    "last_updated": null
  },
  {
    "indonesianURN": "3055100",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3035",
    "babName": "Wanita membonceng laki-laki",
    "hadithNumber": "5511",
    "hadithText": "Telah menceritakan kepada kami Al Hasan bin Muhammad bin Shabah telah menceritakan kepada kami Yahya bin 'Abbad telah menceritakan kepada kami Syu'bah telah mengabarkan kepadaku Yahya bin Abu Ishaq dia berkata; saya mendengar Anas bin Malik radliallahu 'anhu berkata; \"Kami bersama Rasulullah shallallahu 'alaihi wasallam pernah kembali dari Khaibar, sedangkan saya membonceng Abu Thalhah yang sedang berjalan (dengan berkendara) sementara sebagian isteri Rasulullah shallallahu 'alaihi wasallam ada yang membonceng di belakang Rasulullah shallallahu 'alaihi wasallam, tiba-tiba unta beliau terjatuh, spontan aku berkata; \"Seorang wanita...\" lalu aku pun turun, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya ia adalah ibu kalian.\" Lalu aku mempersiapkan kendaraan beliau dan Rasulullah shallallahu 'alaihi wasallam pun menaikinya, ketika Madinah telah dekat dan terlihat oleh kami, beliau bersabda: \"Kami kembali dengan bertaubat, beribadah dan memuji Rabb kami.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "184",
    "matchingArabicURN": "151810",
    "last_updated": null
  },
  {
    "indonesianURN": "3055110",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3036",
    "babName": "Telentang, dan meletakkan kaki diatas yang lain",
    "hadithNumber": "5512",
    "hadithText": "Telah menceritakan kepada kami Ahmad bin Yunus telah menceritakan kepada kami Ibrahim bin Sa'd telah menceritakan kepada kami Ibnu Syihab dari 'Abbad bin Tamim dari Pamannya bahwa dia pernah melihat Nabi shallallahu 'alaihi wasallam tengah terlentang di masjid sambil meletakkan salah satu kakinya di atas kaki yang lain.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "185",
    "matchingArabicURN": "151820",
    "last_updated": null
  },
  {
    "indonesianURN": "3054461",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2999",
    "babName": "Uban",
    "hadithNumber": "5447",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Sallam dari Utsman bin Abdullah bin Mauhab dia berkata; aku pernah menemui Ummu Salamah lalu dia mengeluarkan kepada kami beberapa helai rambut Nabi shallallahu 'alaihi wasallam yang telah diwarnai dengan inai.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "114",
    "matchingArabicURN": "151050",
    "last_updated": null
  },
  {
    "indonesianURN": "3054462",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "2999",
    "babName": "Uban",
    "hadithNumber": "5447",
    "hadithText": "Abu Nu'aim berkata kepada kami; telah menceritakan kepada kami Nushair bin Abu Al Asy'ats dari Ibnu Mauhab bahwa Ummu Salamah pernah memperlihatkan rambut Nabi shallallahu 'alaihi wasallam berwarna merah.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "115",
    "matchingArabicURN": "151060",
    "last_updated": null
  },
  {
    "indonesianURN": "3054761",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3016",
    "babName": "Menyambung rambut",
    "hadithNumber": "5477",
    "hadithText": "Telah menceritakan kepada kami Isma'il dia berkata; telah menceritakan kepadaku Malik dari Ibnu Syihab dari Humaid bin Abdurrahman bin 'Auf bahwa dia mendengar Mu'awiyah bin Abu Sufyan berkhutbah di atas mimbar ketika musim haji, sambil memeggang seikat rambut (sambungan rambut) dari tangan pengawalnya, katanya; \"Dimanakah ulama kalian! Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam melarang dari yang seperti ini, beliau bersabda: \"Bani Isra'il celaka ketika wanita-wanita mereka mengambil (memakai) yang seperti ini.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "147",
    "matchingArabicURN": "151420",
    "last_updated": null
  },
  {
    "indonesianURN": "3054762",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3016",
    "babName": "Menyambung rambut",
    "hadithNumber": "5477",
    "hadithText": "Ibnu Abu Syaibah mengatakan; telah menceritakan kepada kami Yunus bin Muhammad telah menceritakan kepada kami Fulaih dari Zaid bin Aslam dari 'Atha` bin Yasar dari Abu Hurairah radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Allah melaknat orang yang menyambung rambutnya dan yang minta disambung rambutnya dan melaknat orang yang mentato dan yang minta ditato.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "148",
    "matchingArabicURN": "151430",
    "last_updated": null
  },
  {
    "indonesianURN": "3054871",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3019",
    "babName": "Tato",
    "hadithNumber": "5488",
    "hadithText": "Telah menceritakan kepadaku Yahya telah menceritakan kepada kami Abdurrazaq dari Ma'mar dari Hammam dari Abu Hurairah radliallahu 'anhu dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"penyakit ain (gangguan jin atau sihir) adalah benar adanya, \" dan beliau melarang mentato.</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "159",
    "matchingArabicURN": "151540",
    "last_updated": null
  },
  {
    "indonesianURN": "3054872",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3019",
    "babName": "Tato",
    "hadithNumber": "5488",
    "hadithText": "Telah menceritakan kepadaku Ibnu Basyar telah menceritakan kepada kami Ibnu Mahdi telah menceritakan kepada kami Sufyan dia berkata; saya menyebutkan haditsnya Manshur kepada Abdurrahman bin Abis dari Ibrahim dari 'Alqamah dari Abdullah, maka dia berkata; \"Saya juga pernah mendengar hadits tersebut dari Ummu Ya'qub dari Abdullah seperti haditsnya Manshur.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "160",
    "matchingArabicURN": "151550",
    "last_updated": null
  },
  {
    "indonesianURN": "3054981",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3024",
    "babName": "Gambar yang diinjak-injak",
    "hadithNumber": "5499",
    "hadithText": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Abdullah bin Daud dari Hisyam dari ayahnya dari Aisyah dia berkata; \"Setibanya Nabi shallallahu 'alaihi wasallam dari safar (bepergian), saya menggantungkan satir pembatas yang bergambar, lalu beliau memerintahkanku melepas satir tersebut, maka aku pun melepasnya.</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "171",
    "matchingArabicURN": "151670",
    "last_updated": null
  },
  {
    "indonesianURN": "3054982",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "57",
    "bookName": "Pakaian",
    "babNumber": "3024",
    "babName": "Gambar yang diinjak-injak",
    "hadithNumber": "5499",
    "hadithText": "Aisyah juga berkata: Dan saya juga mandi bersama Nabi shallallahu 'alaihi wasallam dari satu wadah.\"</b>",
    "bookID": "57.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "172",
    "matchingArabicURN": "151680",
    "last_updated": null
  }
]