[
  {
    "indonesianURN": "3061300",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3350",
    "babName": "\"Allah tidak menyiksa sumpah yang kalian lakukan dengan main-main\"",
    "hadithNumber": "6131",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Muqatil Abul Hasan telah mengabarkan kepada kami Abdullah telah mengabarkan kepada kami Hisyam bin Urwah dari ayahnya dari Aisyah, bahwasanya Abu Bakr radliallahu 'anhu belum pernah bersumpah hingga Allah menurunkan kaffarat sumpah, dan dia mengatakan; 'Tidaklah aku bersumpah, kemudian aku melihat yang lainnya lebih baik, melainkan aku melakukan yang lebih baik dan aku membayar kaffarat sumpahku.'</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "157350",
    "last_updated": null
  },
  {
    "indonesianURN": "3061310",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3350",
    "babName": "\"Allah tidak menyiksa sumpah yang kalian lakukan dengan main-main\"",
    "hadithNumber": "6132",
    "hadithText": "Telah menceritakan kepada kami Abu Nu'man Muhammad bin Fadhl telah menceritakan kepada kami Jarir bin Hazim telah menceritakan kepada kami Al Hasan telah menceritakan kepada kami Abdurrahman bin Samurah mengatakan, Nabi shallallahu 'alaihi wasallam bersabda: \"Wahai Abdurrahman bin Samurah, Janganlah kamu meminta jabatan, sebab jika engkau diberi (jabatan) karena meminta, kamu akan ditelantarkan, dan jika kamu diberi dengan tidak meminta, kamu akan ditolong, dan jika kamu melakukan sumpah, kemudian kamu melihat suatu yang lebih baik, bayarlah kaffarat sumpahmu dan lakukanlah yang lebih baik.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "157360",
    "last_updated": null
  },
  {
    "indonesianURN": "3061320",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3350",
    "babName": "\"Allah tidak menyiksa sumpah yang kalian lakukan dengan main-main\"",
    "hadithNumber": "6133",
    "hadithText": "Telah menceritakan kepada kami Abu Nu'man telah menceritakan kepada kami Hammad bin Zaid dari Ghailan bin Jarir dari Abu Burdah dari ayahnya menuturkan; aku pernah mendatangi Nabi shallallahu 'alaihi wasallam di tengah-tengah rombongan orang-orang asy'ari, saya meminta agar bisa membawa kami. Tapi Nabi mengatakan: \"demi Allah kami tidak bisa mengikut sertakan kalian dan kami tidak mempunyai kendaraan untuk mengangkut kalian.\" Dia melanjutkan; maka kami pun tinggal sekehendak Allah, dan kami diberi tiga unta yang punggungnya putih, sehingga beliau bisa mengangkut kami dengan unta-unta itu. Tatkala kami berjalan, kami atau sebagian kami mengatakan; 'Demi Allah, kita tak akan memperoleh barakah karena kita mendatangi Nabi Shallalahu'alaihi wasallam meminta diikusertakan menumpang, namun beliau terus bersumpah untuk tidak mengikutkan kita menumpang, namun selanjutnya beliau memberi kendaraan untuk mengangkut kami, maka kembalilah sekarang kepada Nabi shallallahu 'alaihi wasallam, kemudian kita utarakan kepada beliau! ' Maka kami mendatangi beliau, dan Nabi menjawab: \"Bukan kami yang mengangkut kalian, namun Allahlah yang menyediakan kendaraan untuk mengangkut kalian.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "157370",
    "last_updated": null
  },
  {
    "indonesianURN": "3061330",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3350",
    "babName": "\"Allah tidak menyiksa sumpah yang kalian lakukan dengan main-main\"",
    "hadithNumber": "6134",
    "hadithText": "Telah menceritakan kepadaku Ishaq bin Ibrahim telah mengabarkan kepada kami Abdurrazaaq telah mengabarkan kepada kami Ma'mar dari Hammam bin Munabbih mengatakan, inilah yang diceritakan Abu Hurairah kepada kami dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Kita adalah orang-orang yang terakhir, namun lebih dahulu masuk surga di hari kiamat.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "157380",
    "last_updated": null
  },
  {
    "indonesianURN": "3061340",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3350",
    "babName": "\"Allah tidak menyiksa sumpah yang kalian lakukan dengan main-main\"",
    "hadithNumber": "6135",
    "hadithText": "Dan (masih dari jalur periwayatan yang sama dengan hadits sebelumnya -dari Abu Hurairah-) Rasulullah Shallallahu'alaihiwasallam bersabda: \"Demi Allah, salah seorang diantara kalian terus-menerus bersama keluarganya dengan sumpahnya, lebih berdosa baginya disisi Allah daripada ia memberikan kaffarat sumpahnya yang Allah wajibkan baginya.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "157390",
    "last_updated": null
  },
  {
    "indonesianURN": "3061350",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3350",
    "babName": "\"Allah tidak menyiksa sumpah yang kalian lakukan dengan main-main\"",
    "hadithNumber": "6136",
    "hadithText": "Telah menceritakan kepadaku Ishaq yaitu bin Ibrahim telah menceritakan kepada kami Yahya bin Shalih telah menceritakan kepada kami Mu'awiyah dari Yahya dari Ikrimah dari Abu Hurairah mengatakan, Rasulullah Shallallahu'alaihiwasallam bersabda: \"Siapa yang terus menerus dalam keluarganya dengan disertai sumpah, itu lebih besar dosanya daripada sekedar membayar kaffarat.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "157400",
    "last_updated": null
  },
  {
    "indonesianURN": "3061360",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3351",
    "babName": "Sabda Nabi Shallallahu'alaihiwasallam \"Demi Allah\"",
    "hadithNumber": "6137",
    "hadithText": "Telah menceritakan kepada kami Qutaibah bin Sa'd dari Isma'il bin Ja'far dari Abdullah bin Dinar dari Ibnu Umar radliallahu 'anhuma mengatakan, suatu kali Rasulullah Shallallahu'alaihi wa sallam mengutus utusan dan mengangkat Usamah bin Zaid sebagai komandan mereka, tetapi sebagian sahabat mencela habis-habisan kepemimpinannya. Maka Rasulullah Shallallahu'alaihiwasallam berdiri dan bersabda: \"Kalaulah kalian mencela kepemimpinannya, dahulu kalian telah mencela kepemimpinan ayahnya. Demi Allah, ia adalah orang yang paling ideal memegang kepemimpinan, dan ayahnya dahulu adalah diantara manusia yang paling kucintai, dan anaknya sekarang diantara manusia yang paling kucintai sepeninggal ayahnya.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "157410",
    "last_updated": null
  },
  {
    "indonesianURN": "3061370",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3352",
    "babName": "Bagaimana sumpah nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "6138",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Yusuf dari Sufyan dari Musa bin 'Uqbah dari Salim dari Ibnu Umar mengatakan, sumpah Nabi shallallahu 'alaihi wasallam adalah: \"tidak, demi Dzat yang membolak-balikkan hati.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "157420",
    "last_updated": null
  },
  {
    "indonesianURN": "3061380",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3352",
    "babName": "Bagaimana sumpah nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "6139",
    "hadithText": "Telah menceritakan kepada kami Musa Telah menceritakan kepada kami Abu 'Awanah dari Abdul Malik dari Jabir bin Samurah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika Kaisar telah meninggal, tak akan ada kaisar lagi sepeninggalnya, dan jika Kisra meninggal, maka tak akan ada lagi Kisra sepeninggalnya. Demi Dzat yang jiwaku berada di Tangan-Nya, perbendaharaan kekayaan keduanya akan terbelanjakan fi sabilillah.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "157430",
    "last_updated": null
  },
  {
    "indonesianURN": "3061390",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3352",
    "babName": "Bagaimana sumpah nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "6140",
    "hadithText": "Telah menceritakan kepadaku Abul Yaman telah mengabarkan kepada kami Syu'aib dari Az Zuhri telah mengabarkan kepada kami Sa'id bin Al Musayyab bahwa Abu Hurairah menuturkan; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika Kaisar telah meninggal, tak akan ada kaisar lagi sepeninggalnya, dan jika Kisra meninggal, maka tak akan ada lagi Kisra sepeninggalnya. Demi Dzat yang jiwa Muhammad berada di Tangan-Nya, perbendaharaan kekayaan keduanya akan terbelanjakan fi sabilillah.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "157440",
    "last_updated": null
  },
  {
    "indonesianURN": "3061400",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3352",
    "babName": "Bagaimana sumpah nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "6141",
    "hadithText": "Telah menceritakan kepadaku Muhammad Telah memberitakan kepada kami 'Abdah dari Hisyam bin 'Urwah dari Ayahnya dari 'Aisyah radliyallahu'anhuma, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Wahai umat Muhammad, demi Allah, kalaulah kalian tahu yang aku tahu, niscaya kalian banyak menangis dan sedikit tertawa.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "157450",
    "last_updated": null
  },
  {
    "indonesianURN": "3061410",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3352",
    "babName": "Bagaimana sumpah nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "6142",
    "hadithText": "Telah menceritakan kepada kami Yahya bin Sulaiman menuturkan; telah menceritakan kepadaku Ibnu Wahab menuturkan; telah telah mengabarkan kepadaku Haiwah mengatakan; telah menceritakan kepadaku Abu Uqail Zuhra bin Ma'bad bahwasanya ia mendengar kakeknya, Abdullah bin Hisyam menuturkan; kami pernah bersama Nabi shallallahu 'alaihi wasallam yang saat itu beliau menggandeng tangan Umar bin Khattab, kemudian Umar berujar: \"ya Rasulullah, sungguh engkau lebih aku cintai dari segala-galanya selain diriku sendiri.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak, demi Dzat yang jiwa berada di Tangan-Nya, hingga aku lebih engkau cintai daripada dirimu sendiri.\" Maka Umar berujar; 'Sekarang demi Allah, engkau lebih aku cintai daripada diriku'. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"sekarang (baru benar) wahai Umar.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "157460",
    "last_updated": null
  },
  {
    "indonesianURN": "3061420",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3352",
    "babName": "Bagaimana sumpah nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "6143",
    "hadithText": "Telah menceritakan kepada kami Isma'il mengatakan; telah menceritakan kepadaku Malik dari Ibnu Syihab dari Ubaidullah bin Abdillah bin Utbah bin Mas'ud dari Abu Hurairah dan Zaid bin Khalid keduanya mengabarkannya, bahwa ada dua orang bersengketa dan mengadukan perkaranya kepada Rasulullah Shallallahu'alaihiwasallam. Salah satu dari keduanya berujar; 'putuskanlah antara kami dengan kitabullah! ' lalu laki-laki kedua -dan dia lebih pandai agama daripada laki-laki pertama- menjawab; 'Betul ya Rasulullah, putuskanlah antara kami dengan kitabullah dan izinkan bagiku untuk berbicara.' \"Bicaralah, \" kata Nabi. Lanjutnya; 'sesungguhnya anakku adalah 'asiif (pekerja) orang ini. -Malik menjelaskan bahwa asiif adalah buruh.- Anakku berzina dengan isterinya. Maka orang-orang mengabarkan kepadaku bahwa anakku harus dihukum rajam, aku pun menebusnya dengan seratus ekor unta dan satu hamba sahaya. Lalu aku bertanya para orang alim, dan mereka menjelaskan, bahwa anakku cukup dijilid (dicambuk) seratus kali cambukan dan diasingkan selama satu tahun, dan rajam berlaku bagi isterinya.' Maka Rasulullah Shallallahu'alaihiwasallam bersabda: \"Ketahuilah, demi Allah, saya putuskan perkara kalian berdua dengan kitabullah, kambing dan hamba sahayamu dikembalikan kepadamu, dan anak laki-lakimu dicambuk seratus kali dan diasingkan setahun.\" Kemudian beliau memerintahkan Unais Al Aslami untuk mendatangi isteri laki-laki tersebut, jika ia mengaku telah berzina maka dirajam, dan ternyata perempuan laki-laki tersebut mengakui, maka dia pun merajamnya.</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "157470",
    "last_updated": null
  },
  {
    "indonesianURN": "3061430",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3352",
    "babName": "Bagaimana sumpah nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "6144",
    "hadithText": "Telah menceritakan kepadaku Abdullah bin Muhammad telah menceritakan kepada kami Wahab telah menceritakan kepada kami Syu'bah dari Muhammad bin Abi Ya'qub dari Abdurrahman bin Abi Bakrah dari ayahnya dari Nabi shallallahu 'alaihi wasallam, bersabda: \"Bagaimana pendapat kalian jika Aslam, Ghifar, Muzainah, dan Juhainah lebih baik dari Bani tamim, Amir bin Sho'sho'ah, Ghathafan, dan Asad yang mereka celaka dan rugi?\" Mereka menjawab; 'Baik.\" Nabi lantas bersabda: \"Demi Dzat yang jiwaku di Tangan-Nya, sesungguhnya mereka lebih baik daripada mereka.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "157480",
    "last_updated": null
  },
  {
    "indonesianURN": "3061440",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3352",
    "babName": "Bagaimana sumpah nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "6145",
    "hadithText": "Telah menceritakan kepada kami Abul yaman telah memberitakan kepada kami Syu'aib dari Az Zuhri mengatakan; telah menceritakan kepadaku Urwah dari Abu Humaid As Sa'idi bahwasanya ia mengabarkan kepadanya, bahwa Rasulullah Shallallahu'alaihi wa sallam mempekerjakan karyawan zakat ('amil). Setelah selesai dari kerjanya, 'amil tadi mendatangi Nabi dan berujar; 'Wahai Rasulullah, ini untuk kalian dan ini dihadiahkan untukku'. Lantas Nabi bersabda: \"tidakkah kamu duduk-duduk saja di rumah ayahmu atau ibumu kemudian kamu cermati, apakah kamu memperoleh hadiah ataukah tidak?\" Kemudian Rasulullah Shallallahu'alaihi wa sallam berdiri diwaktu sore setelah berdoa, bersyahadat, dan memuji Allah dengan puji-pujian yang semestinya bagi-Nya, kemudian beliau memulai: \"Amma ba'du. Ada apa gerangan dengan 'amil zakat yang kami pekerjakan, dia mendatangi kami dan berujar; 'Ini dari pekerjaan kalian dan ini hadiah untukku, tidakkah ia duduk-duduk saja di rumah ayahnya atu ibunya lantas ia cermati, apakah ia memperoleh hadiah ataukah tidak? Demi dzat yang jiwa Muhammad di Tangan-Nya, tidaklah salah seorang diantara kalian mengambil harta tanpa haknya, selain pada hari kiamat nanti harta itu ia pikul diatas tengkuknya, dan jika unta, ia akan memikulnya dan mengeluarkan suara unta, dan jika sapi, maka sapi itu dipikulnya dan melenguh, dan jika harta yang ia ambil berupa kambing, maka kambing itu akan mengembik. Sungguh telah kusampaikan.\" Kata Abu Humaid; 'kemudian Rasulullah Shallallahu'alaihiwasallam mengangkat tangannya hingga kami melihat warna putih ketiaknya.' Abu Humaid berkata; 'dan telah mendengar hal itu bersamaku adalah Zaid bin Tsabit, dari Nabi shallallahu 'alaihi wasallam, maka tanyailah dia.'</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "157490",
    "last_updated": null
  },
  {
    "indonesianURN": "3061450",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3352",
    "babName": "Bagaimana sumpah nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "6146",
    "hadithText": "Telah menceritakan kepadaku Ibrahim bin Musa telah memberitakan kepada kami Hisyam yaitu bin Yusuf dari Ma'mar dari Hammam dari Abu Hurairah menuturkan; Abul qasim Shallallahu'alaihi wa sallam bersabda: \"Demi Dzat yang jiwa Muhammad berada di Tangan-Nya, kalaulah kalian tahu yang kutahu, sungguh kalian banyak menangis dan sedikit tertawa.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "157500",
    "last_updated": null
  },
  {
    "indonesianURN": "3061460",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3352",
    "babName": "Bagaimana sumpah nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "6147",
    "hadithText": "Telah menceritakan kepada kami Umar bin Hafsh telah menceritakan kepada kami ayahku telah menceritakan kepada kami Al A'masy dari Ma'rur dari Abu dzar mengatakan, aku menemuinya saat ia dalam lindungan Ka'bah seraya mengatakan; 'Mereka adalah orang yang paling rugi, demi rabb ka'bah, mereka adalah orang yang paling rugi, demi rabb ka'bah.' Aku berkata dalam hati; 'Apa salahku, apakah ia melihat sesuatu beres padaku? apa salahku? ' lantas aku duduk kepadanya dan dia mengatakan; 'saya tak bisa diam! Lalu ia menutupiku sekehendak Allah. Maka aku berkata; 'Siapa mereka yang merugi? Demi menebusmu ayah dan ibuku sebagai tebusannya, ya Rasulullah? ' beliau menjawab; \"yaitu mereka yang berbanyak-banyakan menumpuk kekayaan, kecuali yang mengatakan; yang seperti ini dan seperti ini dan seperti ini.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "17",
    "matchingArabicURN": "157510",
    "last_updated": null
  },
  {
    "indonesianURN": "3061470",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3352",
    "babName": "Bagaimana sumpah nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "6148",
    "hadithText": "Telah menceritakan kepada kami Abul yaman telah memberitakan kepada kami Syu'aib telah menceritakan kepada kami Abu Az Zanad dari Abdurrahman Al A'raj dari Abu Hurairah, Rasulullah Shallallahu'alaihi wa sallam bersabda: \"Sulaiman bin dawud pernah mengatakan; 'Sungguh malam ini aku akan menggilir Sembilan puluh Sembilan isteriku, yang kesemuanya akan melahirkan laki-laki penunggang kuda yang berjihad fi sabilillah.' Salah satu kawannya berujar; 'ucapkan insyaa-allah.' Namun Sulaiman tidak juga mengucapkannya. Akhirnya Sulaiman menggilir mereka semua namun tak satupun pun hamil selain satu isterinya yang melahirkan setengah manusia, demi Dzat yang jiwaku berada di Tangan-Nya, kalaulah ia mengucapkan insyaa-allah, niscaya kesemuanya menjadi prajurit yang berjihad fii sabilillah.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "18",
    "matchingArabicURN": "157520",
    "last_updated": null
  },
  {
    "indonesianURN": "3061480",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3352",
    "babName": "Bagaimana sumpah nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "6149",
    "hadithText": "Telah menceritakan kepada kami Muhammad telah menceritakan kepada kami Abul Ahwash dari Abu Ishaq dari Al Barra` bin 'Azib menuturkan; Nabi shallallahu 'alaihi wasallam diberi hadiah pakaian sutera, orang-orang pun secara bergantian memegangnya, mereka terkagum-kagum dengan keindahan dan kelembutannya, kontan Rasulullah Shallallahu'alaihiwasallam pun bertanya: \"apakah kalian merasa terkagum-kagum terhadapnya?\" 'betul ya Rasulullah' Jawab mereka. Nabi bersabda: \"Demi dzat yang jiwaku berada ditangan-Nya, sungguh sapu tangan Sa'd di surga lebih baik daripadanya.\" Sedang Syu'bah, Israil dari Abu Ishaq tidak mengatakan dengan redaksi; 'Demi dzat yang jiwaku berada di tangan-Nya.'</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "19",
    "matchingArabicURN": "157530",
    "last_updated": null
  },
  {
    "indonesianURN": "3061490",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3352",
    "babName": "Bagaimana sumpah nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "6150",
    "hadithText": "Telah menceritakan kepada kami Yahya bin Bukair telah menceritakan kepada kami Al Laits dari Yunus dari Ibnu Syihab telah menceritakan kepadaku 'Urwah bin Zubair bahwasanya 'Aisyah radliyallahu'anhuma berkata; Hindun binti 'Utbah bin Rabi'ah mengatakan; 'Ya Rasulullah, dahulu tak ada penghuni rumah di muka bumi yang lebih aku sukai utuk dihinakan daripada penghuni rumah-rumahmu -Yahya ragu apakah dengan bentuk jamak atau tunggal- Namun hari ini tak ada satu pun penghuni rumah yang lebih aku sukai untuk dimuliakan, daripada penghuni rumahmu.' Rasulullah Shallallahu'alaihiwasallam menjawab: \"demi Dzat yang jiwa Muhammad berada di tangan-Nya, (mungkin kamu punya masalah yang lain)?\" Hindun meneruskan; 'ya Rasulullah, Abu Sufyan adalah suami yang kikir, apakah aku berdosa jika memberi makan (anak-anakku) dari hartanya (tanpa sepengetahuannya)? ' Nabi menjawab; \"Tidak berdosa, asalkan ma'ruf (sewajarnya).\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "20",
    "matchingArabicURN": "157540",
    "last_updated": null
  },
  {
    "indonesianURN": "3061500",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3352",
    "babName": "Bagaimana sumpah nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "6151",
    "hadithText": "Telah menceritakan kepadaku Ahmad bin Utsman telah menceritakan kepada kami Syuraih bin Maslamah telah menceritakan kepada kami Ibrahim dari Ayahnya dari Abu Ishaq, aku mendengar 'Amru bin Maimun mengatakan; telah menceritakan kepadaku Abdullah bin Mas'ud radliyallahu'anhu, menuturkan; ketika Rasulullah Shallallahu'alaihi wa sallam membungkukkan punggungnya di sebuah kubah yang terbuat dari tanah liat Yaman, beliau berujar kepada sahabat-sahabatnya: \"relakah kalian menjadi seperempat penghuni surga?\" 'ya' Jawab mereka. Lanjut Nabi; \"relakah kalian menjadi sepertiga penghuni surga?\" 'ya' Jawab mereka. Lanjut Nabi: \"Demi Dzat yang jiwaku berada di tangan-Nya, sungguh aku berharap agar kalian menjadi separoh penghuni surga.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "21",
    "matchingArabicURN": "157550",
    "last_updated": null
  },
  {
    "indonesianURN": "3061510",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3352",
    "babName": "Bagaimana sumpah nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "6152",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Maslamah dari Malik dari Abdurrahman bin Abdullah bin Abdurrahman dari ayahnya dari Abu Sa'id, ada seorang laki-laki membaca QUL HUWALLAHU AHAD, ia membacanya secara berulang-ulang. Pagi harinya, laki-laki tadi menemui Rasulullah Shallallahu'alaihiwasallam dan menceritakan kisahnya, seolah-olah si laki-laki tadi menganggap remeh bacaannya. Kontan Rasulullah Shallallahu'alaihiwasallam bersabda: \"Demi Dzat yang jiwaku berada di tangan-NYA, sungguh bacaan itu menyamai sepertiga al qur`an.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "22",
    "matchingArabicURN": "157560",
    "last_updated": null
  },
  {
    "indonesianURN": "3061520",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3352",
    "babName": "Bagaimana sumpah nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "6153",
    "hadithText": "Telah menceritakan kepadaku Ishaq telah mengabarkan kepadaku Habban telah menceritakan kepada kami Hammam telah menceritakan kepada kami Qatadah telah menceritakan kepada kami Anas bin Malik radliyallahu'anhu, bahwa ia mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Sempurnakanlah ruku' dan sujud, demi Dzat yang jiwaku berada di tangan-NYA, sungguh aku bisa melihat kalian dari balik punggungku ketika kalian ruku' dan sujud.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "23",
    "matchingArabicURN": "157570",
    "last_updated": null
  },
  {
    "indonesianURN": "3061530",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3352",
    "babName": "Bagaimana sumpah nabi ShollAllahu 'alaihi wa Salam",
    "hadithNumber": "6154",
    "hadithText": "Telah menceritakan kepada kami Ishaq telah menceritakan kepada kami Wahb bin Jarir telah mengabarkan kepada kami Syu'bah dari Hisyam bin Zaid dari Anas bin Malik, ada seorang wanita Anshar mendatangi Nabi shallallahu 'alaihi wasallam bersama anak-anaknya, lantas Nabi shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada di tangan-NYA, sungguh kalian adalah manusia yang paling kucintai, \" Nabi mengulangi ucapannya tiga kali.</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "24",
    "matchingArabicURN": "157580",
    "last_updated": null
  },
  {
    "indonesianURN": "3061540",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3353",
    "babName": "Jangan kalian bersumpah dengan nama ayah-ayah kalian",
    "hadithNumber": "6155",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Maslamah dari Malik dari Nafi' dari Abdullah bin Umar radliyallahu'anhuma, bahwa Rasulullah Shallallahu'alaihiwasallam menjumpai Umar bin Khattab yang sedang berjalan diatas hewan tunggangannya, dan ia bersumpah dengan nama ayahnya. Maka Rasulullah menegur; \"jangan, tahukah kamu bahwa Allah melarang kalian bersumpah dengan nama ayah-ayah kalian? Barangsiapa yang bersumpah, hendaklah bersumpah dengan nama Allah, atau lebih baik diam.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "25",
    "matchingArabicURN": "157590",
    "last_updated": null
  },
  {
    "indonesianURN": "3061550",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3353",
    "babName": "Jangan kalian bersumpah dengan nama ayah-ayah kalian",
    "hadithNumber": "6156",
    "hadithText": "Telah menceritakan kepada kami Sa'id bin Ufair telah menceritakan kepada kami Ibnu Wahb dari Yunus dari Ibnu Syihab berkata; Salim berkata; Ibnu Umar menuturkan; Umar bin Khattab menuturkan; Rasulullah Shallallahu'alaihiwasallam bersabda kepadaku: \"Allah melarang kalian bersumpah dengan nama bapak-bapak kalian.\" Umar berkata; 'maka demi Allah, aku tak lagi bersumpah dengan nama- nama ayahku secara sengaja, semenjak aku mendengar Nabi shallallahu 'alaihi wasallam.' Mujahid berkomentar mengenai makna atsir sebagaimana kutipan ayat \"Aw atsaarotin min 'ilmin' adalah segala tulisan atau catatan ilmu. Hadits ini diperkuat oleh Uqail, Azzubaidi, Ishaq Al Kalbi, dari Az Zuhri dan Ibnu Uyainah, Ma'mar mengatakan dari Az Zuhri dari Salim dari Ibnu Umar bahwa Nabi shallallahu 'alaihi wasallam mendengar Umar,,, dan seterusnya.</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "26",
    "matchingArabicURN": "157600",
    "last_updated": null
  },
  {
    "indonesianURN": "3061560",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3353",
    "babName": "Jangan kalian bersumpah dengan nama ayah-ayah kalian",
    "hadithNumber": "6157",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Abdul 'Aziz bin Muslim telah menceritakan kepada kami 'Abdullah bin Dinar menuturkan; aku mendengar 'Abdullah bin Umar radliallahu 'anhuma menuturkan; Rasulullah Shallallahu'alaihi wa sallam bersabda: \"Janganlah kalian bersumpah dengan nama bapak-bapak kalian.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "27",
    "matchingArabicURN": "157610",
    "last_updated": null
  },
  {
    "indonesianURN": "3061570",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3353",
    "babName": "Jangan kalian bersumpah dengan nama ayah-ayah kalian",
    "hadithNumber": "6158",
    "hadithText": "Telah menceritakan kepada kami Qutaibah telah menceritakan kepada kami Abdul Wahhab dari Ayyub dari Abu Qilabah dan Al Qasim At Tamimi dari Zahdam menuturkan; antara sekelompok dusun kabilah Jarom dan orang-orang asy'ari terdapat kecintaan dan persaudaraan, ketika itu kami berada pada Abu Musa Al Asy'ari, kemudian didekatkan santapan kepadanya, yang isinya berupa daging ayam. Ketika itu di dekatnya ada seorang laki-laki dari Bani taimullah Ahmar sepertinya dari kalangan mantan budak. Abu Musa kemudian mengundangnya menyantap makanan. Kata Zahdam, ketika itu saya melihatnya menyantap suatu makanan yang aku menganggapnya jijik, sehingga aku bersumpah untuk tidak menyantapnya. Kontan Abu Musa mengatakan; 'Berdirilah engkau, akan saya ceritakan kepadamu tentang hal itu. Dahulu aku pernah mendatangi Rasulullah Shallallahu'alaihiwasallam bersama sekelompok orang-orang asy'ari meminta beliau agar kami diikutsertakan membawa kami. Nabi menjawab: \"Demi Allah, saya tidak bisa membawa kalian, dan saya juga tak punya kendaraan untuk mengangkut kalian.\" Namun selanjutnya Rasulullah Shallallahu'alaihiwasallam mendapatkan rampasan unta dan bertanya kepada kami: \"Mana tadi orang-orang asy'ari?\" Beliau perintahkan agar kami mendapat lima ekor unta yang punggungnya putih. Ketika kami sudah berangkat, kami berkata; 'Apa yang harus kita lakukan terhadap sumpah Rasulullah Shallallahu'alaihiwasallam, beliau bersumpah untuk tidak membawa kita, yang ketika itu memang beliau tak mempunyai kendaraan untuk mengangkut kita, lantas beliau pun mengikutsertakan kita untuk naik kendaraan dan kita pura-pura lupa terhadap sumpah beliau Shallallahu'alaihiwasallam? demi Allah, kalau begini kita tidak akan untung.' Maka kami kembali menemui beliau dan kami utarakan uneg-uneg kami; ' Dahulu kami pernah mendatangi anda agar mengikutsertakan kami naik kendaraan, lantas anda bersumpah tidak akan mengikutsertakan kami yang ketika itu memang anda tak punya kendaraan untuk mengangkut kami! ' Nabi jawaban: \"Bukan sayalah yang mengikusertakan kalian naik kendaraan, namun Allah lah yang menjadikan kalian bisa naik kendaraan. Demi Allah, tidaklah saya melakukan suatu sumpah, lantas saya melihat suatu yang lebih baik, selain kulakukan yang lebih baik, dan kubayar kaffarat sumpahku.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "28",
    "matchingArabicURN": "157620",
    "last_updated": null
  },
  {
    "indonesianURN": "3061580",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3354",
    "babName": "Tidak bersumpah dengan Latta dan uzza, tidak pula dengan nama Thaghut",
    "hadithNumber": "6159",
    "hadithText": "Telah menceritakan kepadaku Abdullah bin Muhammad telah menceritakan kepada kami Hisyam bin Yusuf telah mengabarkan kepada kami Ma'mar dari Az Zuhri dari Humaid bin 'Abdurrahman dari Abu Hurairah radliallahu 'anhu, dari Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah dan dalam sumpahnya menyebut nama berhala Latta, atau Uzza, hendaklah ia ucapkan laa-ilaaha-illallah, dan barangsiapa mengatakan kepada kawannya 'Mari kita berjudi', hendaklah ia bersedekah.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "29",
    "matchingArabicURN": "157630",
    "last_updated": null
  },
  {
    "indonesianURN": "3061590",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3355",
    "babName": "Dihitung bersumpah, sekalipun tidak menyatakan bersumpah",
    "hadithNumber": "6160",
    "hadithText": "Telah menceritakan kepada kami Qutaibah telah menceritakan kepada kami Al Laits dari Nafi' dari Ibnu 'Umar radliyallahu'anhuma, bahwasanya Rasulullah Shallallahu'alaihiwasallam membuat cincin dari bahan emas. Cincin itu sering beliau pakai, dan beliau letakkan mata cincinnya di bagian dalam telapak tangannya. Orang-orang pun menirunya dan membuat cincin, kemudian beliau duduk diatas minbar dan mencopot cincinnya seraya mengatakan: \"sesungguhnya aku selalu memakai cincin ini, dan aku meletakkan mata cincinnya di bagian dalam\" kemudian beliau melemparkannya, sambil berkata: \"Demi Allah, saya tidak akan memakainya selama-lamanya.\" Kontan para sahabat membuang cincin-cincin mereka.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "30",
    "matchingArabicURN": "157640",
    "last_updated": null
  },
  {
    "indonesianURN": "3061600",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3356",
    "babName": "Bersumpah dengan agama selain Islam",
    "hadithNumber": "6161",
    "hadithText": "Telah menceritakan kepada kami Mu'alla bin Asad telah menceritakan kepada kami Wuhaib dari Ayyub dari Abu Qilabah dari Tsabit bin Adh Dhahhak menuturkan; Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah dengan agama selain Islam, maka dia seperti yang dikatakannya, dan barangsiapa membunuh dirinya dengan sesuatu, ia disiksa di neraka jahannam dengan sesuatu yang digunakannya untuk bunuh diri, dan melaknat seorang mukmin bagaikan membunuhnya, dan barangsiapa menuduh seorang mukmin dengan kekafiran, maka dia seperti membunuhnya.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "31",
    "matchingArabicURN": "157650",
    "last_updated": null
  },
  {
    "indonesianURN": "3061610",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3357",
    "babName": "Firman Allah \" Dan mereka bersumpah dengan nama Allah dari kesungguhan sumpahnya\"",
    "hadithNumber": "6162",
    "hadithText": "Telah menceritakan kepada kami Qabishah telah menceritakan kepada kami Sufyan dari Asy'ats dari Mu'awiyah bin Suwaid bin Muqarrin dari Al Barra` dari Nabi shallallahu 'alaihi wasallam -lewat jalur periwayatan lain- dan telah menceritakan kepadaku Muhammad bin Basyar telah menceritakan kepada kami Ghundar telah menceritakan kepada kami Syu'bah dari Asy'ats dari Mu'awiyah bin Suwaid bin Muqarrin dari Al Barra` radliyallahu'anhu mengatakan, Nabi shallallahu 'alaihi wasallam memerintahkan kami untuk menunaikan sumpah.</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "33",
    "matchingArabicURN": "157670",
    "last_updated": null
  },
  {
    "indonesianURN": "3061620",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3357",
    "babName": "Firman Allah \" Dan mereka bersumpah dengan nama Allah dari kesungguhan sumpahnya\"",
    "hadithNumber": "6163",
    "hadithText": "Telah menceritakan kepada kami Hafsh bin Umar telah menceritakan kepada kami Syu'bah Telah mengabarkan kepada kami 'Ashim Al Ahwal aku mendengar Abu 'Utsman menceritakan dari Usamah, bahwa puteri Rasulullah Shallallahu'alaihiwasallam (Zaenab) mengutus utusan untuk menemui Rasulullah, yang ketika itu Rasulullah Shallallahu'alaihiwasallam bersama Usamah bin Zaid, Sa'd, dan Ubai. Sang utusan menyampaikan pesan yang isinya; 'Anak laki-lakiku telah menghadapi saat-saat kematian, maka kunjungilah kami'. Nabi kemudian mengutus seseorang, menyampaikan salam dan mengatakan; \"Milik Allah sematalah segala yang diambil-Nya dan yang diberikan-Nya, dan segala sesuatu disisi-Nya ada ketentuan ajal tersendiri, maka suruhlah dia untuk bersabar dan mengharap pahala.\" Lantas puteri Nabi mengutus utusan untuk kedua kalinya, dan puteri beliau menyertakan sumpah. Maka beliau berdiri dan kami pun berdiri bersamanya. Tatkala beliau sampai (dan beliau) telah duduk, anak laki-laki dari puteri beliau (cucunya) diangkat kepada beliau, dan beliau mendudukkan di pangkuannya, ketika itu cucu beliau nafasnya sudah tersengal-sengal. Kedua mata Rasulullah pun bercucuran. Maka Sa'd bertanya: 'Mengapa mata anda sampai bercucuran?\" Nabi menjawab; \"ini adalah tanda kasih sayang yang Allah letakkan di hati hamba-Nya yang dikehendaki-Nya, hanyasanya Allah menyayangi hamba-Nya yang berhati penyayang.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "34",
    "matchingArabicURN": "157680",
    "last_updated": null
  },
  {
    "indonesianURN": "3061630",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3357",
    "babName": "Firman Allah \" Dan mereka bersumpah dengan nama Allah dari kesungguhan sumpahnya\"",
    "hadithNumber": "6164",
    "hadithText": "Telah menceritakan kepada kami Isma'il menuturkan; telah menceritakan kepadaku Malik dari Ibnu Syihab dari Ibnul Musayyab dari Abu Hurairah, bahwasanya Rasulullah Shallallahu'alaihiwasallam bersabda: \"Seorang muslim yang mendapat kematian ketiga anaknya, tidak akan tersentuh api neraka kecuali sebatas pelaksanaan sumpah Allah.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "35",
    "matchingArabicURN": "157690",
    "last_updated": null
  },
  {
    "indonesianURN": "3061640",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3357",
    "babName": "Firman Allah \" Dan mereka bersumpah dengan nama Allah dari kesungguhan sumpahnya\"",
    "hadithNumber": "6165",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Al Mutsanna telah menceritakan kepadaku Ghundar Telah menceritakan kepada kami Syu'bah dari Ma'bad bin Khalid aku mendengar Haritsah bin Wahb mengatakan; Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"maukah kalian kutunjukkan penghuni surga? Yaitu setiap orang lemah dan tertindas, dan sekiranya ia bersumpah atas nama Allah, niscaya Allah mengabulkannya, dan penghuni neraka adalah setiap orang yang berhati keras dan menentang kebenaran lagi sombong.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "36",
    "matchingArabicURN": "157700",
    "last_updated": null
  },
  {
    "indonesianURN": "3061650",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3358",
    "babName": "Ucapan \"Saya bersaksi atas nama Allah\"",
    "hadithNumber": "6166",
    "hadithText": "Telah menceritakan kepada kami Sa'd bin Hafsh telah menceritakan kepada kami Syaiban dari Manshur dari Ibrahim dari 'Abidah dari 'Abdullah mengatakan, Pernah Nabi shallallahu 'alaihi wasallam ditanya; \"Siapakah manusia yang terbaik?\" Nabi menjawab: \"yaitu generasiku, kemudian generasi sesudah mereka, kemudian generasi sesudah mereka, kemudian akan datang suatu kaum yang kesaksian mereka mendahului sumpahnya, dan sumpahnya mendahului kesaksian mereka.\" Kata Ibrahim; 'dan kawan-kawan kami -ketika itu kami masih kecil-melarang kami bersumpah untuk melaksanakan kesaksian dan janji.'</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "37",
    "matchingArabicURN": "157710",
    "last_updated": null
  },
  {
    "indonesianURN": "3061660",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3359",
    "babName": "Janji Allah Azza wa jalla",
    "hadithNumber": "6167",
    "hadithText": "Telah menceritakan kepadaku Muhammad bin Basyar telah menceritakan kepada kami Ibnu Abi 'Adi dari Syu'bah dari Sulaiman dan Manshur dari Abu Wa`il dari Abdullah radliallahu 'anhu, dari Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah dengan sumpah dusta untuk menguasai harta seorang muslim -atau ia katakan dengan redaksi untuk menguasai harta saudaranya-- ia bertemu Allah sedang Allah dalam keadaan murka kepadanya.\" Kemudian Allah menurunkan ayat yang membenarkannya; 'Sesungguhnya orang-orang yang menukar janji Allah,,, dst (QS. Ali'Imran 77), Sulaiman berkata dalam haditsnya; kemudian Al Asy'ats bin Qais lewat dan berujar; 'Apa yang diceritakan Abdullah kepada kalian? ' Mereka pun menjawabnya dengan suatu jawaban sebagaimana diutarakan Abdullah. Lantas Asy'ats menerangkan; 'Sesungguhnya ayat diatas diturunkan tentang saya dan kawan saya karena suatu sumur yang ada diantara kami.'</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "38",
    "matchingArabicURN": "157720",
    "last_updated": null
  },
  {
    "indonesianURN": "3061670",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3360",
    "babName": "Bersumpah dengan kebesaran Allah, sifat-Nya dan kalimat-Nya",
    "hadithNumber": "6168",
    "hadithText": "Telah menceritakan kepada kami Adam telah menceritakan kepada kami Syaiban telah menceritakan kepada kami Qatadah dari Anas bin Malik menuturkan; Nabi shallallahu 'alaihi wasallam bersabda: \"Jahannam tiada henti menuturkan; 'Masihkah ada tambahan? ' (QS. Qaf 30), sampai Allah rabbul 'izzati meletakkan telapak kaki-Nya disana hingga neraka mengatakan; 'Cukup, cukup demi kemuliaan-Mu, ' hingga sebagian penghuni neraka menghimpit sebagian lainnya.\" Syu'bah meriwayatkannya dari Qatadah.</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "39",
    "matchingArabicURN": "157740",
    "last_updated": null
  },
  {
    "indonesianURN": "3061680",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3361",
    "babName": "Ucapan seseorang \"Demi umur Allah\"",
    "hadithNumber": "6169",
    "hadithText": "Telah menceritakan kepada kami Al Uwaisi telah menceritakan kepada kami Ibrahim dari Shalih dari Ibnu Syihab -lewat jalur periwayatan lain- telah menceritakan kepada kami Hajjaj bin Minhal telah menceritakan kepada kami Abdullah bin Umar an Numairi telah menceritakan kepada kami Yunus menuturkan; pernah kudengar 'Urwah bin Zubair, Sa'id bin Musayyab, Alqomah bin Waqqash dan Ubaidullah bin Abdillah tentang hadits ' Aisyah, isteri Nabi shallallahu 'alaihi wasallam ketika orang-orang yang menyebarkan berita bohong menuduhnya berzina, maka Allah menyatakan berita kesuciannya -dan masing-masing menceritakan kepadaku sekumpulan hadits- yang isinya; maka Nabi shallallahu 'alaihi wasallam berdiri dan meminta Abdullah bin Ubai menyatakan permohonan maaf. Lantas Usaid bin Khudair berdiri dan mengatakan kepada Sa'd bin Ubadah: 'Demi Allah, kami akan membunuhnya.'</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "40",
    "matchingArabicURN": "157750",
    "last_updated": null
  },
  {
    "indonesianURN": "3061690",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3362",
    "babName": "Allah tidak menyiksa sumpah yang kalian lakukan dengan main-main",
    "hadithNumber": "6170",
    "hadithText": "Telah menceritakan kepadaku Muhammad bin Al Mutsanna telah menceritakan kepada kami Yahya dari Hisyam mengabarkan, telah mengabarkan kepadaku Ayahku dari Aisyah radliallahu 'anhuma mengenai firman Allah: 'Allah tidak menghukum kalian karena sumpah kalian yang tak disengaja, ' QS.Albaqarah 225, kata 'Aisyah; ayat tersebut diturunkan tentang ucapan orang yang bersumpah; 'Tidak, demi Allah. Baik, demi Allah.'</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "41",
    "matchingArabicURN": "157760",
    "last_updated": null
  },
  {
    "indonesianURN": "3061700",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3363",
    "babName": "Jika bersumpah karena lupa",
    "hadithNumber": "6171",
    "hadithText": "Telah menceritakan kepada kami Khallad bin Yahya telah menceritakan kepada kami Mis'ar telah menceritakan kepada kami Qatadah telah menceritakan kepada kami Zurarah bin Aufa dari Abu Hurairah yang ia marfu'kan, Rasulullah bersabda: \"Allah memaafkan ummatku dari segala yang dibisikkan dan dikatakan hatinya, selama belum dilakukan atau dibicarakan.'</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "42",
    "matchingArabicURN": "157770",
    "last_updated": null
  },
  {
    "indonesianURN": "3061710",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3363",
    "babName": "Jika bersumpah karena lupa",
    "hadithNumber": "6172",
    "hadithText": "Telah menceritakan kepada kami Utsman bin Al Haitsam atau Muhammad darinya, dari Ibnu Juraij menuturkan; aku mendengar Ibnu Syihab menuturkan; telah menceritakan kepadaku Isa bin Thalhah, bahwasanya Abdullah bin Amru bin 'Ash menceritakan kepadanya, bahwa Nabi shallallahu 'alaihi wasallam ketika berkhutbah di hari raya kurban, seorang lak-laki mendatanginya dan berujar; 'Ya Rasulullah, aku kira (melakukan) seperti ini dan seperti ini (dahulu) sebelum melakukan ini dan ini.' Kemudian yang lainnya berdiri dan berkata; 'ya Rasulullah, aku kira seperti ini dan seperti ini.' (menyebutkan) tiga amalan (pada hari mina). Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Lakukanlah, dan tak mengapa untuk melakukan semua amalan (manasik) di hari itu.' Tidaklah beliau ditanya tentang sesuatu ketika itu, melainkan beliau menjawab: \"lakukanlah, dan tak mengapa.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "43",
    "matchingArabicURN": "157780",
    "last_updated": null
  },
  {
    "indonesianURN": "3061720",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3363",
    "babName": "Jika bersumpah karena lupa",
    "hadithNumber": "6173",
    "hadithText": "Telah menceritakan kepada kami Ahmad bin Yunus telah menceritakan kepada kami Abu Bakar bin 'Iyyasy dari 'Abdul Aziz bin Rufai' dari 'Atho' dari Ibnu 'Abbas radliallahu 'anhuma menuturkan; seorang laki-laki berkata kepada Nabi shallallahu 'alaihi wasallam; 'Saya berziarah sebelum melempar jumrah? ' Nabi menjawab: \"Nggak masalah\", laki-laki lain mengatakan; 'Saya mencukur sebelum melempar jamarat? ' Nabi menjawab: \"Nggak masalah!\" Yang lain mengatakan; 'Saya mencukur sebelum menyembelih? ' Nabi menjawab: \"Nggak masalah!.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "44",
    "matchingArabicURN": "157790",
    "last_updated": null
  },
  {
    "indonesianURN": "3061730",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3363",
    "babName": "Jika bersumpah karena lupa",
    "hadithNumber": "6174",
    "hadithText": "Telah menceritakan kepadaku Ishaq bin Manshur telah menceritakan kepada kami Abu Usamah telah menceritakan kepada kami Ubaidullah bin Umar dari Said bin Abi Sa'id dari Abu Hurairah, ada seorang laki-laki masuk masjid dan shalat, sedang Rasulullah Shallallahu'alaihiwasallam ketika itu berada di pojok masjid. kemudian lelaki tersebut datang menemui Nabi dan memberi salam, tapi beliau berujar: \"kembali dan shalaatlah, (karena) kamu belum melakukan shalat!\" Orang itu mengulangi shalatnya dan mengucapkan salam. Nabi shallallahu 'alaihi wasallam bersabda lagi; \"kembalilah dan lakukan shalat (lagi), sebab engkau belum melakukan shalat!\" Pada kali ketiganya, orang itu berujar; 'ajarilah aku! ' Nabi menjawab: \"Jika kamu hendak melakukan shalat, sempurnakanlah wudhu dan menghadaplah ke kiblat, kemudian bertakbirlah dan bacalah al qur`an yang mudah bagimu, kemudian ruku'lah hingga kamu lakukan ruku'mu dengan tenang, kemudian angkatlah kepalamu hingga engkau berdiri dengan tenang, kemudian sujudlah hingga engkau sujud dengan tenang, kemudian angkatlah hingga engkau betul-betul duduk lurus dan tenang, kemudian sujudlah hingga engkau sujud dengan tenang, kemudian angkatlah hingga engkau berdiri dengan tenang, lakukanlah yang demikian dalam semua shalatmu semuanya.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "45",
    "matchingArabicURN": "157800",
    "last_updated": null
  },
  {
    "indonesianURN": "3061740",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3363",
    "babName": "Jika bersumpah karena lupa",
    "hadithNumber": "6175",
    "hadithText": "Telah menceritakan kepada kami Farwah bin Abil Maghra' telah menceritakan kepada kami Ali bin Mushir dari Hisyam bin 'Urwah dari ayahnya dari 'Aisyah radliallahu 'anhuma menuturkan; Di hari Uhud kaum musyrikin porak-poranda dengan kekalahan yang dapat di lihat dikalangan mereka, maka Iblis berteriak; 'hai hamba-hamba Allah, awas pasukan musuh di belakang kalian, ' maka barisan depan berbalik ke belakang sehingga mereka bertempur sendiri. Khudzaifah bin Yaman lantas mencermati keadaan, tak tahunya ayahnya masih hidup sehingga ia berseru; 'Ayahku, ayahku! ' Lanjut Aisyah; demi Allah, pasukan musyrikin tidaklah lewat hingga mereka berhasil membunuhnya, dan Khudzaifah berkata; 'Kiranya Allah mengampuni engkau, ayah! ' Maka demi Allah, dalam diri Khudzaifah tiada henti terus tertanam bibit-bibit kebaikan hingga ia bertemu Allah.</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "46",
    "matchingArabicURN": "157810",
    "last_updated": null
  },
  {
    "indonesianURN": "3061750",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3363",
    "babName": "Jika bersumpah karena lupa",
    "hadithNumber": "6176",
    "hadithText": "Telah menceritakan kepadaku Yusuf bin Musa telah menceritakan kepada kami Abu Usamah menuturkan; telah menceritakan kepadaku 'Auf dari Khilas dan Muhammad dari Abu Hurairah radliallahu 'anhu menuturkan; Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menyantap makanan karena lupa padahal dia sedang puasa, hendaklah ia sempurnakan puasanya, sebab Allah-lah yang memberinya makanan dan minuman.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "47",
    "matchingArabicURN": "157820",
    "last_updated": null
  },
  {
    "indonesianURN": "3061760",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3363",
    "babName": "Jika bersumpah karena lupa",
    "hadithNumber": "6177",
    "hadithText": "Telah menceritakan kepada kami Adam bin Abu Iyas telah menceritakan kepada kami Ibnu Abi dzi'b dari Az Zuhri dari Al A'raj dari Abdullah bin Buhainah, ia menuturkan; Nabi shallallahu 'alaihi wasallam shalat mengimami kami dan berdiri setelah dua rakaat pertama sebelum duduk, beliau teruskan shalatnya. Selesai beliau mendirikan shalatnya, para sahabat menunggu-nunggu beliau mengucapkan salam, tetapi beliau bertakbir dan sujud sebelum salam, kemudian beliau angkat kepalanya kemudian bertakbir dan bersujud, kemudian beliau mengangkat kepalanya dan mengucapkan salam.</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "48",
    "matchingArabicURN": "157830",
    "last_updated": null
  },
  {
    "indonesianURN": "3061770",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3363",
    "babName": "Jika bersumpah karena lupa",
    "hadithNumber": "6178",
    "hadithText": "Telah menceritakan kepada kami Ishaq bin Ibrahim, ia mendengar Abdul 'Aziz bin Abdushshammad, telah menceritakan kepada kami Manshur dari Ibrahim dari 'Alqomah dari Ibnu mas'ud radliallahu 'anhu, bahwasanya Nabiyullah Shallallahu'alaihiwasallam mengimami para sahabat shalat zhuhur, tetapi beliau menambah atau menguranginya. -Kata Manshur, saya tidak tahu apakah Ibrahim yang lalai atau Alqomah (maksudnya lalai tentang kepastian menambah atau mengurangi shalat).- Kata Ibnu mas'ud; kemudian ditanyakan; 'Wahai Rasulullah, apakah anda meng-qashar shalat ataukah anda memang lupa? ' Nabi bertanya: \"apakah itu?\" Para sahabat menjawab; 'Anda telah melakukan demikian (mengurangi atau menambah shalat).' Maka Nabi melakukan dua sujud bersama mereka, selanjutnya beliau bersabda: \"Kedua sujud ini adalah bagi siapa yang tidak tahu apakah dia menambah shalatnya ataukah ia menguranginya, kemudian dia berusaha mencari yang benar dan menyempurnakan sisanya, kemudian ia sujud dengan dua sujud.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "49",
    "matchingArabicURN": "157840",
    "last_updated": null
  },
  {
    "indonesianURN": "3061780",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3363",
    "babName": "Jika bersumpah karena lupa",
    "hadithNumber": "6179",
    "hadithText": "Telah menceritakan kepada kami Al Humaidi telah menceritakan kepada kami Sufyan telah menceritakan kepada kami Amru bin Dinar telah menceritakan kepadaku Said bin Jubair menuturkan; saya bertanya kepada Ibnu 'Abbas, maka ia menjawab; telah menceritakan kepada kami Ubai bin Ka'b, bahwasanya ia mendengar Rasulullah Shallallahu'alaihi wa sallam bersabda (mengenai firman Allah); 'Janganlah engkau menghukumku karena aku lupa dan janganlah engkau memaksa urusanku yang bagiku terasa sukar' (Alkahfi 73), beliau menafsiri dengan: \"Itulah lupa pertama-tama yang dilakukan Musa.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "50",
    "matchingArabicURN": "157850",
    "last_updated": null
  },
  {
    "indonesianURN": "3061790",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3363",
    "babName": "Jika bersumpah karena lupa",
    "hadithNumber": "6180",
    "hadithText": "Abu Abdullah menuturkan; Muhammad bin Basyar telah menulis kepadaku (yang berbunyi), telah menceritakan kepada kami Mu'adz bin Mu'adz telah menceritakan kepada kami Ibnu 'Aun dari Asy Sya'bi menuturkan; Al Barra` bin Azib berkata ketika itu ia dikunjungi tamu-tamu, maka ia perintahkan keluarganya untuk menyembelih sebelum ia kembali dari (shalat hari raya) dengan tujuan agar tamu-tamunya dapat makan, karenanya mereka sembelih sebelum shalat (hari raya). Kejadian ini terus mereka laporkan kepada Nabi shallallahu 'alaihi wasallam. Maka Nabi memerintahkannya untuk mengulangi sembelihannya. Al Barra` kemudian bertanya; 'Wahai Rasulullah, saya mempunyai kambing yang telah berumur sekitar enam bulan yang banyak susunya, dia lebih baik daripada dua kambing pedaging ! ' Ibnu 'Aun memauqufkan hanya sampai kalimat ini dari hadis Asy Sya'bi, dan dia menceritakan dari Muhammad bin Sirin dengan semisal hadits ini, dan dia memauqufkan sampai di tempat ini. Dan dia katakan; 'aku tidak tahu apakah selainnya mendapat rukhsah atau tidak.' diriwayatkan oleh Ayyub dari Ibnu Sirin dari Anas dari Nabi shallallahu 'alaihi wasallam.</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "51",
    "matchingArabicURN": "157860",
    "last_updated": null
  },
  {
    "indonesianURN": "3061800",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3363",
    "babName": "Jika bersumpah karena lupa",
    "hadithNumber": "6181",
    "hadithText": "Telah menceritakan kepada kami Sulaiman bin Harb telah menceritakan kepada kami Syu'bah dari Al Aswad bin Qais mengatakan; aku mendengar Jundab mengatakan; aku ikut bersama Nabi shallallahu 'alaihi wasallam ketika beliau shalat eid, kemudian beliau berpidato dan mengatakan: \"Barangsiapa telah menyembelih (sebelum shalat ini), hendaklah ia menggantinya, dan barangsiapa yang belum menyembelih, hendaklah menyebut nama Allah.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "52",
    "matchingArabicURN": "157870",
    "last_updated": null
  },
  {
    "indonesianURN": "3061810",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3364",
    "babName": "Sumpah palsu",
    "hadithNumber": "6182",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Muqatil Telah mengabarkan kepada kami An Nadhr telah mengabarkan kepada kami Syu'bah telah menceritakan kepada kami Firas menuturkan; aku mendengar Asy Sya'bi dari Abdullah bin Amru dari Nabi shallallahu 'alaihi wasallam bersabda: \"Dosa besar ialah menyekutukan Allah, durhaka kepada orangtua, membunuh, dan bersumpah palsu.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "53",
    "matchingArabicURN": "157880",
    "last_updated": null
  },
  {
    "indonesianURN": "3061820",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3365",
    "babName": "Firman Allah \"Orang-orang yang membeli sumpah mereka dengan harga yang sedikit\"",
    "hadithNumber": "6183",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Abu 'Awanah dari Al A'masy dari Abu Wa`il dari Abdullah radliallahu 'anhu menuturkan; Rasulullah Shallallahu'alaihi wa sallam bersabda: \"Barangsiapa bersumpah mengada-ada di depan hakim, dengan tujuan untuk memperoleh harta seorang muslim, maka ia berjumpa dengan Allah dan Allah murka kepadanya, \" kemudian Allah menurunkan ayat yang membenarkan hal ini dengan ayat; 'Sesungguhnya orang-orang yang menukar janji Allah dan sumpah mereka dengan harga yang sedikit' (QS. Ali'imran 77) hingga akhir ayat. Maka Al Asy'ats bin Qais masuk dan bertanya; 'Apa yang diceritakan Abu Abdurrahman kepada kalian? ' Mereka menjawab; 'begini dan begini'. Maka Al Asy'ats bin Qais berkata; 'ayat itu diturunkan kepada kami, yang ketika itu saya mempunyai sumur di pekarangan keponakanku, maka kudatangi Rasulullah Shallallahu'alaihi wa sallam dan beliau bersabda: \"Sekarang engkau harus menyertakan bukti kepemiikanmu atau dia melakukan sumpahnya!\" Aku menjawab; 'kalau begitu, dia pasti akan bersumpah Ya Rasulullah! ' Rasulullah Shallallahu'alaihi wa sallam bersabda: \"Barangsiapa bersumpah dengan sumpah dusta (diada-adakan), ia melakukan kejahatan dengan sumpahnya itu dengan tujuan untuk merampas harta seorang muslim, ia akan menjumpai Allah sedang Allah dalam keadaan murka kepadanya.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "54",
    "matchingArabicURN": "157891",
    "last_updated": null
  },
  {
    "indonesianURN": "3061830",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3366",
    "babName": "Sumpah pada yang tak dikuasai, pada kemaksiatan dan saat marah",
    "hadithNumber": "6184",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin A'la` telah menceritakan kepada kami Abu Usamah dari Buraid dari Abu Burdah dari Abu Musa menuturkan; sahabat-shabatku mengutusku menemui Nabi shallallahu 'alaihi wasallam agar aku menanyai beliau mengenai kendaraan untuk mengangkut kami. Tetapi beliau bersabda: \"Demi Allah, saya tidak bisa mengikutsertakan kalian naik kendaraan.\" Ketika itu kutemui beliau dalam keadaan marah. Ketika aku mendatangi beliau di waktu selanjutnya, beliau bersabda: \"Temuilah kawan-kawanmu, dan katakan kepada mereka bahwa Allah atau Rasulullah mempunyai kendaraan untuk mengangkut kalian.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "55",
    "matchingArabicURN": "157910",
    "last_updated": null
  },
  {
    "indonesianURN": "3061840",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3366",
    "babName": "Sumpah pada yang tak dikuasai, pada kemaksiatan dan saat marah",
    "hadithNumber": "6185",
    "hadithText": "Telah menceritakan kepada kami Abdul 'Aziz telah menceritakan kepada kami Ibrahim dari Shalih dari Ibnu Syihab -lewat jalur periwayatan lain- Telah menceritakan kepada kami Al Hajjaj telah menceritakan kepada kami Abdullah bin Umar An Numairi telah menceritakan kepada kami Yunus bin Yazid Al Aili menuturkan; aku mendengar Az Zuhri menuturkan; aku mendengar Urwah bin Zubair dan Sa'id bin Musayyab dan Alqomah bin Waqqash dan Ubaidullah bin Abdullah bin Utbah tentang hadits 'Aisyah isteri Nabi shallallahu 'alaihi wasallam ketika penyebar berita bohong menyebarkan isu bahwa dia berbuat zina, maka Allah menurunkan berita kesuciannya; 'Masing-masing penyebar berita bohong itu menceritakan sekumpulan cerita bohong tentang aku, maka Allah menurunkan ayat; 'Sesungguhnya orang-orang yang menyebarkan berita bohong,,, hingga sepuluh ayat berikutnya (QS. Annur 11-21) yang kesemuanya menjelaskan berita kesucianku. Abu Bakar ash Shiddiq yang sebagai pihak menanggung nafkah Misthah bin Utsatsah karena masih ada hubungan kekerabatan mengatakan: \"Demi Allah, saya tidak akan memberi nafkah lagi kepada Misthah sedikit pun selama-lamanya setelah ia turut serta menyebarkan isu tentang 'Aisyah.\" Maka Allah menurunkan ayat: 'dan janganlah orang-orang yang diberi kelebihan rejeki dan kelapangan diantara kalian untuk menahan pemberiannya kepada kerabat' (QS.Annur 22), lantas Abu Bakar mengatakan; 'Baik demi Allah, sungguh saya mengharap jika Allah mengampuni kesalahanku' lantas Abu Bakar meneruskan kembali pemberian nafkahnya dan berkata; 'Demi Allah, saya tidak akan lagi mencabutnya selama-lamanya.'</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "56",
    "matchingArabicURN": "157920",
    "last_updated": null
  },
  {
    "indonesianURN": "3061850",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3366",
    "babName": "Sumpah pada yang tak dikuasai, pada kemaksiatan dan saat marah",
    "hadithNumber": "6186",
    "hadithText": "Telah menceritakan kepada kami Abu Ma'mar telah menceritakan kepada kami 'Abdul Warits telah menceritakan kepada kami Ayyub dari Al Qasim dari Zahdam menuturkan; kami pernah di dekat Abu Musa Al Asy'ari. Dia menuturkan; selanjutnya kudatangi Rasulullah Shallallahu'alaihi wa sallam bersama sejumlah orang-orang Asy'ari, saya jumpai beliau ketika beliau sedang marah. Kami meminta beliau agar mengikutsertakan kami untuk naik kendaraan. Tetapi beliau bersumpah untuk tidak mengikut sertakan kami naik kendaraan. Kemudian beliau mengatakan: \"Demi Allah, insya Allah tidaklah aku bersumpah dengan suatu sumpah, kemudian kulihat ada sesuatu yang lebih baik daripadanya, selain kulakukan yang lebih baik, dan kubayar kaffarat sumpahku.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "57",
    "matchingArabicURN": "157930",
    "last_updated": null
  },
  {
    "indonesianURN": "3061860",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3367",
    "babName": "Berucap \"Demi Allah, saya tak akan berucap\", lantas ia shalat, membaca alquran,",
    "hadithNumber": "6187",
    "hadithText": "Telah menceritakan kepada kami Abul Yaman telah mengabarkan kepada kami Syu'aib dari Az Zuhri menuturkan; telah mengabarkan kepadaku Sa'id bin Musayyab dari ayahnya berkata; Ketika abu thalib menghadapi wafatnya, Rasulullah Shallallahu'alaihiwasallam mendatanginya dan berujar: \"Ucapkan laa-ilaaha-illallah, kalimat yang dapat aku jadikan sebagai hujjah disisi Allah.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "58",
    "matchingArabicURN": "157940",
    "last_updated": null
  },
  {
    "indonesianURN": "3061870",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3367",
    "babName": "Berucap \"Demi Allah, saya tak akan berucap\", lantas ia shalat, membaca alquran,",
    "hadithNumber": "6188",
    "hadithText": "Telah menceritakan kepada kami Qutaibah bin Sa'id telah menceritakan kepada kami Muhammad bin Fudhail telah menceritakan kepada kami 'Umarah bin Qa'qa' dari Abu Zur'ah dari Abu Hurairah menuturkan; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Ada dua kalimat yang ringan di lisan, berat di timbangan, dan disukai Arrahman, Subhanallah wabihamdihi dan Subhaanallahul 'azhiim.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "59",
    "matchingArabicURN": "157950",
    "last_updated": null
  },
  {
    "indonesianURN": "3061880",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3367",
    "babName": "Berucap \"Demi Allah, saya tak akan berucap\", lantas ia shalat, membaca alquran,",
    "hadithNumber": "6189",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Abdul wahid telah menceritakan kepada kami Al A'masy dari Syaqiq dari Abdullah radliyahu'anhu, menuturkan; Rasulullah Shallallahu'alaihi wa sallam mengucapkan sebuah kalimat -dan sebagian redaksinya aku menambahnya sendiri- \"Barangsiapa meninggal dengan menjadikan tandingan bagi Allah, maka ia dimasukkan ke neraka, --dan redaksi yang kubuat sendiri, yaitu-; barangsiapa yang meninggal dengan tidak menjadikan tandingan bagi Allah, ia dimasukkan surga.'</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "60",
    "matchingArabicURN": "157960",
    "last_updated": null
  },
  {
    "indonesianURN": "3061890",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3368",
    "babName": "Bersumpah untuk tidak menemui isterinya selama sebulan, dan sebulan berjumlah dua puluh sembilan har",
    "hadithNumber": "6190",
    "hadithText": "Telah menceritakan kepada kami 'Abdul 'Aziz bin Abdullah Telah menceritakan kepada kami Sulaiman bin Bilal dari Humaid dari Anas mengatakan; Rasulullah pernah meng-ila' isteri-isterinya, yang ketika itu kaki beliau sedang bengkak-bengkak, beliau tinggal di kamarnya selama dua puluh Sembilan hari. kemudian beliau turun dari kamarnya (setelah dua puluh Sembilan hari berlalu). Maka para sahabat bertanya; 'katanya anda meng-ila` isteri anda selama dua puluh Sembilan hari? ' Nabi shallallahu 'alaihi wasallam menjawab; \"sebulan itu jumlahnya dua puluh Sembilan hari.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "61",
    "matchingArabicURN": "157970",
    "last_updated": null
  },
  {
    "indonesianURN": "3061900",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3369",
    "babName": "Bersumpah tidak akan minum perasan, lantas minum juice atau gula",
    "hadithNumber": "6191",
    "hadithText": "Telah menceritakan kepadaku 'Ali, ia mendengar Abdul 'Aziz bin Abu Hazim berkata; telah mengabarkan kepadaku Ayahku dari Sahl bin Sa'd bahwasanya Abu Usaid seorang sahabat Nabi shallallahu 'alaihi wasallam menjadi pengantin, ia kemudian mengundang Nabi shallallahu 'alaihi wasallam untuk menghadiri (walimah) 'arus. Sang pengantin puteri menjamu para tamu. Maka Sahl bertanya kepada para tamu; 'Tahukah kalian minuman apa yang disuguhkan mempelai puteri itu? ' Sahal menerangkan bahwa minuman yang disuguhkan adalah kurma yang direndam semalam di sebuah periuk dari batu, hingga di pagi harinya disuguhkan kepadanya.</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "62",
    "matchingArabicURN": "157980",
    "last_updated": null
  },
  {
    "indonesianURN": "3061910",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3369",
    "babName": "Bersumpah tidak akan minum perasan, lantas minum juice atau gula",
    "hadithNumber": "6192",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Muqatil telah mengabarkan kepadaku Abdullah Telah mengabarkan kepada kami Isma'il bin Abi Khalid dari Asy Sya'bi dari Ikrimah dari Ibnu Abbas radliallahu 'anhuma dari Saudah isteri Nabi shallallahu 'alaihi wasallam; \"seekor kambing kami mati, kemudian kami menyamak kulitnya, dan kami gunakan untuk geriba minuman hingga geriba itu usang.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "63",
    "matchingArabicURN": "157990",
    "last_updated": null
  },
  {
    "indonesianURN": "3061920",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3370",
    "babName": "Bersumpah untuk tidak berlauk, lantas makan kurma dengan roti dan segala hal yang berlauk",
    "hadithNumber": "6193",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Yusuf telah menceritakan kepada kami Sufyan dari Abdurrahman bin Abbas dari ayahnya dari Aisyah radliallahu 'anha berkata; Keluarga Muhammad Shallallahu'alaihi wa sallam tidak pernah kenyang dengan roti gandum berlauk selama tiga hari berturut-turut hingga bertemu Allah. Sedang Ibnu Katsir menuturkan; telah mengabarkan kepada kami Sufyan telah menceritakan kepada kami Abdurrahman dari ayahnya bahwasanya ia mengatakan kepada 'Aisyah seperti ini.</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "64",
    "matchingArabicURN": "158000",
    "last_updated": null
  },
  {
    "indonesianURN": "3061930",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3370",
    "babName": "Bersumpah untuk tidak berlauk, lantas makan kurma dengan roti dan segala hal yang berlauk",
    "hadithNumber": "6194",
    "hadithText": "Telah menceritakan kepada kami Qutaibah dari Malik dari Ishaq bin Abdullah bin Abi Thalhah, ia mendengar Anas bin Malik menuturkan; Abu Thalhah mengatakan kepada Ummu Sulaim; 'Aku mendengar suara Rasulullah Shallallahu'alaihiwasallam yang sedemikian lirih hingga aku tahu bahwa beliau lapar, apakah engkau mempunyai makanan? ' 'Ya aku punya' Jawabnya. Ummu Sulaim kemudian mengeluarkan beberapa kerat roti gandum, kemudian ia ambil sehelai kain dan ia bungkus roti itu dengan sebagian kainnya, Abu Thalhah mengutusku untuk menemui Rasulullah Shallallahu'alaihiwasallam. Aku bergegas pergi dan kudapati Rasulullah saat itu tengah di masjid bersama para sahabatnya. Aku mendatangi mereka, kemudian Rasulullah Shallallahu'alaihiwasallam bertanya: \"Sepertinya kamu diutus oleh Abu Thalhah?\" 'Benar, Ya Rasulullah' jawabku. Maka Rasulullah Shallallahu'alaihi wa sallam bersabda kepada para sahabat yang bersamanya: \"Berdirilah kalian.\" Mereka kemudian berangkat dan aku juga berjalan ditengah-tengah mereka hingga kudatangi Abu Thalhah dan kuutarakan kepadanya segala peristiwanya. Abu Thalhah berkata; \"ya Ummu Sulaim, Rasulullah Shallallahu'alaihi wa sallam dan para sahabatnya datang kepada kita, padahal kita tak punya makanan untuk menjamu mereka.\" Ummu Sulaim menjawab; 'Allah dan rasul-Nya lebih tahu.' Abu Thalhah keluar untuk menemui Rasulullah Shallallahu'alaihiwasallam, kemudian dia dan Rasulullah Shallallahu'alaihiwasallam masuk ke dalam rumahnya. Rasulullah Shallallahu'alaihiwasallam berkata kepada Ummu Sulaim: \"Bawalah kesini makanan yang kau punyai wahai Ummu Sulaim!\" Ummu Sulaim langsung membawa rotinya, dan Rasulullah memerintahkan kepada Ummu Sulaim agar roti itu dicuil-cuil. Ummu Sulaim kemudian memeras geriba yang berisi minyak samin dan dia gunakan untuk membumbui rotinya. Rasulullah Shallallahu'alaihi wa sallam kemudian membaca doa-doa yang Allah kehendaki untuk beliau ucapkan, kemudian berkata kepada Abu Thalhah: \"Panggil sepuluh orang!\" Abu Thalhah memanggil sepuluh orang, mereka masuk dan menyantap hingga kenyang dan keluar. Kemudian Rasulullah berkata lagi: \"panggil sepuluh orang, \" mereka pun masuk dan menyantap makanan hingga kenyang dan keluar. Kemudian Rasulullah berkata lagi: \"panggil sepuluh orang, \" mereka pun masuk dan menyantap makanan hingga kenyang dan keluar. Semua sahabat akhirnya bisa makan sampai kenyang, padahal jumlah mereka saat itu sebanyak tujuh atau delapan puluh orang.</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "65",
    "matchingArabicURN": "158020",
    "last_updated": null
  },
  {
    "indonesianURN": "3061940",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3371",
    "babName": "Niat dalam sumpah",
    "hadithNumber": "6195",
    "hadithText": "Telah menceritakan kepada kami Qutaibah bin Sa'id telah menceritakan kepada kami Abdul Wahhab menuturkan; aku mendengar Yahya bin Sa'id mengatakan; telah mengabarkan kepadaku Muhammad bin Ibrahim bahwasanya ia mendengar 'Alqomah bin Waqqash Al Laitsi menuturkan; aku mendengar Umar bin khattab radliallahu 'anhu menuturkan; aku mendengar Rasulullah Shallallahu'alaihi wa sallam bersabda: \"Sesungguhnya amalan itu hanyalah tergantung niatnya, dan setiap orang hanya mendapatkan apa yang diniatkannya. Barangsiapa yang (berniat) hijrah kepada Allah dan RasulNya, maka hijrahnya kepada Allah dan RasulNya. Dan barangsiapa (berniat) hijrah karena dunia yang bakal diraihnya atau wanita yang akan dinikahinya, maka hijrahnya kepada apa yang diniatkannya itu.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "66",
    "matchingArabicURN": "158030",
    "last_updated": null
  },
  {
    "indonesianURN": "3061950",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3372",
    "babName": "Jika memberi hadiah hartanya  dengan bahasa nadzar atau taubat",
    "hadithNumber": "6196",
    "hadithText": "Telah menceritakan kepada kami Ahmad bin Shalih telah menceritakan kepada kami Ibnu Wahb telah mengabarkan kepadaku Yunus dari Ibnu Syihab telah mengabarkan kepadaku Abdurrahman bin Abdullah bin ka'b bin Malik dari Abdullah bin Ka'b, ia adalah penuntun Ka'b diantara anak-anaknya ketika ia telah buta, menuturkan; aku mendengar Ka'b bin Malik tentang ceritanya mengenai firman Allah: 'dan atas tiga orang yang tertinggal' (QS. Attaubah; 118) -yang dalam akhir ceritanya ia mengatakan - diantara tanda ketulusan taubatku, aku melepas hartaku untuk kujadikan sebagai sedekah kepada Allah dan Rasul-NYA. Tetapi Nabi shallallahu 'alaihi wasallam bersabda: \"tahan sebagian hartamu, itu lebih baik bagimu.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "67",
    "matchingArabicURN": "158040",
    "last_updated": null
  },
  {
    "indonesianURN": "3061960",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3373",
    "babName": "Jika mengharamkan makanannya",
    "hadithNumber": "6197",
    "hadithText": "Telah menceritakan kepada kami Al Hasan bin Muhammad telah menceritakan kepada kami Al Hajjaj dari Ibnu Juraij menuturkan; 'Atha` berangggapan bahwa dirinya pernah mendengar Ubaid bin Umair mengatakan; aku pernah mendengar 'Aisyah menuturkan; bahwa Nabi shallallahu 'alaihi wasallam tinggal di rumah Zainab binti Jahsy dan meminum madu dirumahnya, maka aku dan Hafshah saling berwasiat bahwa siapa saja diantara kami berdua yang didatangi Nabi shallallahu 'alaihi wasallam, agar kami mengatakan; 'Aku menemukan bau pohon mighfar dimulutmu, apakah engkau telah makan buah mighfar? ' Nabi kemudian menemui salah satu dari keduanya dan dia mengatakan ucapan yang telah disepakati keduanya, namun Nabi justeru menjawab: \"Tidak, bahkan aku minum madu di tempat Zainab binti Jahsy, dan sekali-kali aku tidak akan mengulanginya.\" Maka turunlah ayat yang menegur Nabi; \"Wahai Nabi, mengapa kamu mengharamkan sesuatu yang telah Allah halalkan kepadamu' dan surat, 'jika kalian berdua bertaubat kepada Allah, ' ditujukan kepada Aisyah dan Hafshah. Dan firman-Nya; 'Ingatlah ketika Nabi merahasiakan sebuah pembicaraan kepada sebagian isterinya, ' petikan ayat ini untuk ucapan Nabi yang mengatakan: 'Namun aku minum madu.' Ibrahim bin Musa berkata kepadaku; dari Hisyam dengan tambahan redaksi: \"Saya sekali-kali tak akan mengulanginya selama-lamanya, saya telah bersumpah, maka janganlah kalian kabarkan kepada seorang pun.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "68",
    "matchingArabicURN": "158050",
    "last_updated": null
  },
  {
    "indonesianURN": "3061970",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3374",
    "babName": "Melunasi nadzar dan firman Allah \"Mereka memenuhi nadzar mereka.\"",
    "hadithNumber": "6198",
    "hadithText": "Telah menceritakan kepada kami Yahya bin Shalih telah menceritakan kepada kami Fulaih bin Sulaiman telah menceritakan kepada kami Sa'id bin Al Harits, bahwasanya ia mendengar Ibnu Umar radliallahu 'anhuma berkata; 'Bukankah mereka dilarang dari nadzar? Sebab Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya nadzar tidak bisa menyegerakan sesuatu dan tidak pula bisa menangguhkannya, hanyasanya nadzar dikeluarkan dari orang bakhil.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "69",
    "matchingArabicURN": "158070",
    "last_updated": null
  },
  {
    "indonesianURN": "3061980",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3374",
    "babName": "Melunasi nadzar dan firman Allah \"Mereka memenuhi nadzar mereka.\"",
    "hadithNumber": "6199",
    "hadithText": "Telah menceritakan kepada kami Khallad bin Yahya telah menceritakan kepada kami Sufyan dari Manshur telah mengabarkan kepada kami Abdullah bin Murrah dari Abdullah bin Umar, Nabi shallallahu 'alaihi wasallam melarang nadzar dan bersabda: \"Nadzar tidak bisa menolak sesuatu, hanyasanya ia dikeluarkan dari orang bakhil.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "70",
    "matchingArabicURN": "158080",
    "last_updated": null
  },
  {
    "indonesianURN": "3061990",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3374",
    "babName": "Melunasi nadzar dan firman Allah \"Mereka memenuhi nadzar mereka.\"",
    "hadithNumber": "6200",
    "hadithText": "Telah menceritakan kepada kami Abul Yaman telah mengabarkan kepada kami Syu'aib telah menceritakan kepada kami Abu Az zanad dari Al A'raj dari Abu Hurairah menuturkan; Nabi shallallahu 'alaihi wasallam bersabda: \"Nadzar tidak akan menghantarkan anak adam kepada sesuatu yang tidak ditakdirkan baginya, namun nadzar menghantarkannya kepada takdir yang ditakdirkan baginya, Allah mengeluarkan nadzar dari orang bakhil, sehingga menghantarkannya kepada sesuatu yang belum ia dapatkan sebelumnya.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "71",
    "matchingArabicURN": "158090",
    "last_updated": null
  },
  {
    "indonesianURN": "3062000",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3375",
    "babName": "Dosa bagi yang tidak melunasi nadzar",
    "hadithNumber": "6201",
    "hadithText": "Telah menceritakan kepada kami Musaddad dari Yahya bin Sa'id dari Syu'bah mengatakan, Telah menceritakan kepadaku Abu Jamrah telah menceritakan kepada kami Zahdam bin Mudharrib mengatakan, aku mendengar Imran bin Hushain menceritakan dari Nabi shallallahu 'alaihi wasallam bersabda; \"Sebaik-baik kalian adalah generasiku, kemudian generasi berikutnya, kemudian generasi berikutnya.\" -Imran berkata; 'Aku tidak tahu penyebutan dua atau tiga kali setelah generasi beliau', - \"kemudian datang suatu kaum yang mereka bernadzar namun tidak mereka penuhi, mereka berkhianat dan tidak dapat dipercaya, mereka bersaksi padahal tidak di minta menjadi saksi, dan nampak tanda mereka adalah kegemukan.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "72",
    "matchingArabicURN": "158100",
    "last_updated": null
  },
  {
    "indonesianURN": "3062010",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3376",
    "babName": "Nadzar dalam ketaatan",
    "hadithNumber": "6202",
    "hadithText": "Telah menceritakan kepada kami Abu Nu'aim telah menceritakan kepada kami Malik dari Thalhah bin Abdul Malik dari Al Qasim dari 'Aisyah radliallahu 'anha, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa bernadzar untuk menaati Allah, hendaknya ia menaati-NYA, dan barangsiapa bernadzar untuk bermaksiat kepadaNya, maka janganlah ia perturutkan untuk bermaksiat kepadaNYA.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "73",
    "matchingArabicURN": "158110",
    "last_updated": null
  },
  {
    "indonesianURN": "3062020",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3377",
    "babName": "Semasa jahiliyah bernadzar untuk tidak mengajak bicara",
    "hadithNumber": "6203",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Muqatil Abul Hasan telah mengabarkan kepada kami Abdullah Telah mengabarkan kepada kami 'Ubaidullah bin Umar dari Nafi' dari Ibnu Umar, bahwasanya Umar mengatakan; 'wahai Rasulullah, saya bernadzar semasa jahiliyah untuk beri'tikaf dimasjidil haram! ' Nabi shallallahu 'alaihi wasallam bersabda: \"penuhi nadzarmu!\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "74",
    "matchingArabicURN": "158120",
    "last_updated": null
  },
  {
    "indonesianURN": "3062030",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3378",
    "babName": "Mati dengan meninggalkan nadzar",
    "hadithNumber": "6204",
    "hadithText": "Telah menceritakan kepada kami Abul Yaman Telah mengabarkan kepada kami Syu'aib dari Az Zuhri mengatakan, telah mengabarkan kepadaku Ubaidullah bin Abdullah bin Utbah, bahwasanya Abdullah bin Abbas mengabarkan kepadanya bahwa Sa'd bin Ubadah Al Anshari meminta fatwa kepada Nabi shallallahu 'alaihi wasallam tentang nadzar yang ditanggung ibunya, kemudian ibunya meninggal sebelum memenuhi nadzarnya. Nabi shallallahu 'alaihi wasallam memberinya fatwa agar ia melaksanakan nadzarnya, kemudian hal itu menjadi sunnah.</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "75",
    "matchingArabicURN": "158130",
    "last_updated": null
  },
  {
    "indonesianURN": "3062040",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3378",
    "babName": "Mati dengan meninggalkan nadzar",
    "hadithNumber": "6205",
    "hadithText": "Telah menceritakan kepada kami Adam telah menceritakan kepada kami Syu'bah dari Abu Bisyr mengatakan, aku mendengar Sa'id bin Jubair dari Ibnu 'Abbas radliallahu 'anhuma mengatakan; Seorang laki-laki mendatangi Nabi shallallahu 'alaihi wasallam dan berujar; \"Saudariku bernadzar untuk menunaikan haji, namun terburu meninggal.\" Maka Nabi shallallahu 'alaihi wasallam bertanya: \"Kalaulah dia mempunyai hutang, apakah kamu berkewajiban melunasinya?\" 'iya' jawabnya. Nabi shallallahu 'alaihi wasallam melanjutkan: \"maka Lunasilah (hutang) kepada Allah, karena ia lebih berhak untuk dipenuhi.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "76",
    "matchingArabicURN": "158140",
    "last_updated": null
  },
  {
    "indonesianURN": "3062050",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3379",
    "babName": "Nadzar pada hal-hal yang tak  dimiliki  dan dalam kemaksiatan",
    "hadithNumber": "6206",
    "hadithText": "Telah menceritakan kepada kami Abu 'Ashim dari Malik dari Thalhah bin Abdul Malik dari Al Qasim dari 'Aisyah radliallahu 'anha mengatakan, Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bernadzar untuk menaati Allah, taatilah DIA, dan barangsiapa bernadzar untuk berma'siat kepada-NYA, janganlah berma'siat kepada-NYA.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "77",
    "matchingArabicURN": "158150",
    "last_updated": null
  },
  {
    "indonesianURN": "3062060",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3379",
    "babName": "Nadzar pada hal-hal yang tak  dimiliki  dan dalam kemaksiatan",
    "hadithNumber": "6207",
    "hadithText": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Yahya dari Humaid telah menceritakan kepadaku Tsabit dari Anas dari Nabi shallallahu 'alaihi wasallam bersabda: \"Allah tidak membutuhkan penyiksaan orang ini terhadap dirinya.\" ketika beliau menyaksikan seseorang yang berjalan dengan dipapah diantara kedua anaknya. Al Fazzari mengatakan dari Humaid telah menceritakan kepadaku Tsabit dari Anas.</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "78",
    "matchingArabicURN": "158160",
    "last_updated": null
  },
  {
    "indonesianURN": "3062070",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3379",
    "babName": "Nadzar pada hal-hal yang tak  dimiliki  dan dalam kemaksiatan",
    "hadithNumber": "6208",
    "hadithText": "Telah menceritakan kepada kami Abu 'Ashim dari Ibnu Juraij dari Sulaiman Al Ahwal dari Thawus dari Ibnu 'Abbas bahwasanya Nabi shallallahu 'alaihi wasallam pernah melihat seseorang yang sedang thawaf di ka'bah dengan seutas tali pengikat, maka Nabi memerintahkan untuk memotongnya.</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "79",
    "matchingArabicURN": "158170",
    "last_updated": null
  },
  {
    "indonesianURN": "3062080",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3379",
    "babName": "Nadzar pada hal-hal yang tak  dimiliki  dan dalam kemaksiatan",
    "hadithNumber": "6209",
    "hadithText": "Telah menceritakan kepada kami Ibrahim bin Musa telah mengabarkan kepada kami Hisyam bahwasanya Ibnu Juraij mengabari mereka dengan mengatakan, telah mengabarkan kepadaku Sulaiman bin Al Ahwal, bahwa Thawus mengabarkan kepadanya dari Ibnu 'Abbas radliallahu 'anhuma, Nabi shallallahu 'alaihi wasallam ketika thawaf di ka'bah melewati seseorang yang menuntun seseorang dengan tali di hidungnya, Nabi shallallahu 'alaihi wasallam memotongnya dengan tangannya kemudian menyuruhnya untuk menuntunnya dengan menggandeng tangannya.</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "80",
    "matchingArabicURN": "158180",
    "last_updated": null
  },
  {
    "indonesianURN": "3062090",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3379",
    "babName": "Nadzar pada hal-hal yang tak  dimiliki  dan dalam kemaksiatan",
    "hadithNumber": "6210",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Wuhaib telah menceritakan kepada kami Ayyub dari Ikrimah dari Ibnu 'Abbas mengatakan, ketika Nabi shallallahu 'alaihi wasallam menyampaikan khutbah, tiba-tiba ada seseorang yang berdiri terus, beliau pun bertanya tentang perbuatannya, maka para sahabat menjawab; 'Itu Abu isra'il, telah bernadzar untuk berdiri dan tidak akan duduk, tidak akan berteduh, tidak akan berbicara dan terus berpuasa.' Nabi shallallahu 'alaihi wasallam bersabda: \"Suruhlah dia untuk bicara, berteduh, duduk, dan menyempurnakan puasanya.\" Abdul Wahhab mengatakan, telah menceritakan kepada kami Ayyub dari Ikrimah dari Nabi shallallahu 'alaihi wasallam.</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "81",
    "matchingArabicURN": "158190",
    "last_updated": null
  },
  {
    "indonesianURN": "3062100",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3380",
    "babName": "Nadzar untuk puasa, lantas bertepatan idul fithri atau adz-ha",
    "hadithNumber": "6211",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Abi Bakr Al Muqaddami telah menceritakan kepada kami Fudhail bin Sulaiman telah menceritakan kepada kami Musa bin 'Uqbah telah menceritakan kepada kami Hakim bin Abi Hurrah Al Aslami bahwasanya ia mendengar Abdullah bin umar radliallahu 'anhuma ditanya tentang seseorang yang bernadzar untuk tidak melalui hari selain melakukan puasa, kemudian bertemu dengan hari idul adha dan idul fitri. Ia menjawab dengan mengutip firman Allah; 'sesungguhnya telah ada pada diri Rasulullah sebagai teladan yang baik bagimu' (QS. Ahzab 21), beliau tidak pernah melakukan puasa di hari raya adha dan fitri, dan beliau tidak berpandangan berpuasa di kedua hari itu.'</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "82",
    "matchingArabicURN": "158210",
    "last_updated": null
  },
  {
    "indonesianURN": "3062110",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3380",
    "babName": "Nadzar untuk puasa, lantas bertepatan idul fithri atau adz-ha",
    "hadithNumber": "6212",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Maslamah telah menceritakan kepada kami Yazid bin Zurai' dari Yunus dari Ziyad bin Jubair, dia menuturkan; aku sedang bersama Ibnu Umar, tiba-tiba ada seorang lelaki yang bertanya; 'saya bernadzar untuk berpuasa setiap hari selasa dan rabu selama hidupku, kemudian hari itu bertepatan dengan hari Nahr (eidul adha)? ' maka dia menjawab; 'Allah memerintahkan untuk melaksanakan nadzar, dan kita dilarang untuk berpuasa pada hari nahr.' Dia mengulangi Jawabannya kepada lelaki tersebut dan berkata seperti itu dengan tidak menambahnya.</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "83",
    "matchingArabicURN": "158220",
    "last_updated": null
  },
  {
    "indonesianURN": "3062120",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "63",
    "bookName": "Sumpah dan Nadzar",
    "babNumber": "3381",
    "babName": "Bumi, Kambing, perkebunan, peralatan, apakah dalam kategori nadzar dan sumpah?",
    "hadithNumber": "6213",
    "hadithText": "Telah menceritakan kepada kami Isma'il mengatakan; telah menceritakan kepadaku Malik dari Tsaur bin Zaid ad Daili dari Abul Ghaits maula Ibnu Muthi' dari Abu Hurairah mengatakan: kami berangkat bersama Rasulullah Shallallahu'alaihiwasallam saat perang khaibar. Kami tidak memperoleh ghanimah berupa emas dan perak, hanya kami mendapat harta, pakaian dan perabot. Seorang dari bani dhubaib yang dikenal dengan nama Rifa'ah bin Zaid memberi hadiah Rasulullah Shallallahu'alaihiwasallam berupa seorang pelayan namanya Mid'am. Kemudian Rasulullah Shallallahu'alaihiwasallam mengutus Mid'am ke Wadil qura, hingga ketika ia sampai di Wadil qura, tepatnya ketika Mid'am mengendarai hewan tunggangan Rasulullah Shallallahu'alaihiwasallam, sebatang anak panah nyasar mengenai dirinya hingga terbunuh. Para sahabat kemudian berseru; 'sungguh bahagia, baginya surga! ' langsung Rasulullah Shallallahu'alaihiwasallam menegur dengan bersabda: \"Sekali-kali tidak, demi dzat yang jiwaku berada di tangan-NYA, baju yang diambilnya dari ghanimah yang belum dibagi di hari Khaibar telah menyalakan api baginya.\" Ketika para sahabat mendengar sabda beliau, tiba-tiba seseorang membawa seutas tali atau sepasang tali kepada Nabi shallallahu 'alaihi wasallam, dan Nabi bersabda: \"seutas tali neraka, atau sepasang tali neraka.\"</b>",
    "bookID": "63.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "84",
    "matchingArabicURN": "158230",
    "last_updated": null
  }
]