[
  {
    "indonesianURN": "3062270",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3392",
    "babName": "Firman Allah \"Allah tetapkan untuk laki-laki dua bagian daipada perempuan\"",
    "hadithNumber": "6228",
    "hadithText": "Telah menceritakan kepada kami Qutaibah bin Sa'id telah menceritakan kepada kami Sufyan dari Muhammad bin Al Munkadir, ia mendengar Jabir bin Abdullah radliallahu 'anhuma mengatakan; aku pernah sakit, Rasulullah Shallallahu'alaihiwasallam dan Abu Bakar menjengukku dengan berjalan kaki. Keduanya mendatangiku ketika aku sedang pingsan, maka Rasulullah Shallallahu'alaihi wa sallam berwudhu', dan sisa wudhunya beliau guyurkan kepadaku sehingga aku siuman (sadar). Maka aku bertanya; 'Bagaimana yang harus aku lakukan terhadap hartaku?, bagaimana yang ahrus aku putuskan terhadap hartaku? ' Rasulullah Shallallahu'alaihiwasallam sama sekali tidak menjawab sepatah kata pun hingga turun ayat waris.</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "158400",
    "last_updated": null
  },
  {
    "indonesianURN": "3062280",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3393",
    "babName": "Pengajaran faraidh",
    "hadithNumber": "6229",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Wuhaib telah menceritakan kepada kami Ibnu Thawus dari ayahnya dari Abu Hurairah mengatakan, Rasulullah Shallallahu'alaihiwasallam bersabda: \"Jauhilah prasangka sebab prasangka adalah ucapan yang paling dusta, janganlah kalian mencari-cari kesalahan, janganlah kalian saling memata-matai, janganlah kalian saling marah, janganlah kalian saling membelakangi, dan jadilah hamba-hamba Allah yang bersaudara.\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "158410",
    "last_updated": null
  },
  {
    "indonesianURN": "3062300",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3394",
    "babName": "Sabda nabi ShollAllahu 'alaihi wa Salam; Kami tidak diwarisi, yang kami tinggalkan adalah seekah",
    "hadithNumber": "6231",
    "hadithText": "Telah menceritakan kepada kami Yahya bin Bukair telah menceritakan kepada kami Al Laits dari Uqail dari Ibnu Syihab mengatakan, telah mengabarkan kepadaku Malik bin Aus bin Al Hadatsan dan Muhammad bin Jubair bin Muth'im menyebutkan kepadaku diantara haditsnya; 'maka aku berangkat hingga menemuinya dan bertanya kepadanya, dia menjawab; 'Aku berangkat hingga aku menemui Umar. Umar lantas ditemui oleh pengawal rumahnya dan mengucapkan selamat datang, kemudian ia bertanya; 'Apakah anda berkenan memberi izin untuk Utsman, Abdurrahman, Zubai r, dan Sa'dari ' 'Tentu' jawabnya. Penjaga itu pun mengizinkan mereka. kemudian dia bertanya lagi; 'apakah anda memberi izin kepada Ali dan Abbas ' 'ya' Jawab Umar. Abbas kemudian berkata; 'Wahai amirul mukminin, putuskanlah antara aku dan orang ini! ' Umar menjawab; 'Saya bersumpah kepada kalian dengan nama Allah yang karena- izin-Nya langit dan bumi tegak, bukankah kalian telah tahu bahwa Rasulullah Shallallahu'alaihi wa sallam telah bersabda: \"Kami tidak diwarisian, dan apa yang kami tinggalkan adalah sedekah!\" yang Rasulullah maksudkan adalah beliau sendiri.' Sekumpulan sahabat berkata; 'Nabi pernah mengatakan yang demikian.' Umar kemudian menemui Ali dan Abbas dan bertanya; 'bukankah kalian berdua tahu bahwa Rasulullah Shallallahu'alaihiwasallam telah menyabdakan yang demikian? ' Keduanya menjawab; 'Betul, Beliau telah bersabda sedemikian itu.' Umar berkata; 'sekarang saya akan menceritakan kepada kalian tentang persoalan ini, sesungguhnya Allah telah memberi pemberian special kepada Rasul-Nya Shallallahu'alaihiwasallam tentang harta fai` ini, dengan sesuatu yang tidak diberikan-Nya kepada seorang pun selainnya. Allah berfirman: 'Apa saja yang Allah berikan kepada Rasul-Nya…hingga firman-Nya Sesungguhnya Allah Maha Berkuasa. (QS. Alhasyr 1). Karenanya harta fai` tersebut adalah murni untuk Rasulullah Shallallahu'alaihiwasallam, demi Allah beliau tidak memberikannya secara special untuk kalian dan tidak pula mengutamakannya untuk kalian, sesungguhnya beliau juga telah memberikan harta itu kepada kalian dan meratakannya kepada kalian hingga tersisa dari harta ini, selanjutnya Nabi pergunakan harta itu untuk menafkahi keluarganya selama setahun, beliau mengambil harta sisanya dan beliau salurkan untuk harta Allah. Begitulah Rasulullah Shallallahu'alaihiwasallam memperlakukan harta itu semasa hidupnya. Saya bersumpah kepada kalian atas nama Allah, Bukankah kalian tahu terhadap itu semua? ' Mereka menjawab; 'Iya'. Kemudian Umar mengatakan secara khusus kepada Ali dan Abbas; 'Saya bersumpah kepada kalian berdua atas nama Allah, bukankah kalian berdua tahu itu semua? ' Keduanya menjawab; 'Benar'. Umar melanjutkan; 'Kemudian Allah mewafatkan Nabi-NYA Shallallahu'alaihiwasallam, lantas Abu Bakar berkata; 'Aku adalah wali Rasulullah Shallallahu'alaihiwasallam, ' dan dia memegang harta itu kemudian mengelola sebagaimana Rasulullah Shallallahu'alaihiwasallam mengelola, kemudian Allah mewafatkan Abu Bakar, sehingga aku katakan; 'Aku adalah wali dari walinya Rasulullah Shallallahu'alaihiwasallam, sehingga aku pegang harta itu selama dua tahun dan aku kelola sebagaimana Rasulullah Shallallahu'alaihiwasallam dan Abu Bakar mengelolanya, kemudian kalian berdua mendatangiku sedang ucapan kalian satu, dan perkara kalian berdua sepakat persis, kalian mendatangiku dengan harapan memintaku bagianmu lewat lajur keponakanmu, sedang orang ini memintaku bagian isterinya lewat lajur ayahnya, maka kutegaskan; Jika kalian berkenan, tanah itu akan kuserahkan kepada kalian berdua, sehingga kalian berdua memperoleh keputusan selain itu dariku, demi Allah yang atas seizin-Nya bumi dan langit menjadi tegak, Saya tak akan menetapkan keputusan selain itu hingga kiamat tiba, kalaulah kalian berdua merasa tidak mampu, serahkan padaku, saya akan mengelola harta itu sebagai ganti kalian.'</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "158450",
    "last_updated": null
  },
  {
    "indonesianURN": "3062310",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3394",
    "babName": "Sabda nabi ShollAllahu 'alaihi wa Salam; Kami tidak diwarisi, yang kami tinggalkan adalah seekah",
    "hadithNumber": "6232",
    "hadithText": "Telah menceritakan kepada kami Isma'il mengatakan, telah menceritakan kepadaku Malik dari Abu Az Zanad dari Al A'raj dari Abu Hurairah, bahwasanya Rasulullah Shallallahu'alaihiwasallam bersabda: \"warisanku tak boleh dibagi-bagi dengan diuangkan dinar, apa yang kutinggalkan terkemudian sebagai nafkah isteriku dan untuk mencukupi pegawaiku, itu semua adalah sedekah.\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "158460",
    "last_updated": null
  },
  {
    "indonesianURN": "3062320",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3394",
    "babName": "Sabda nabi ShollAllahu 'alaihi wa Salam; Kami tidak diwarisi, yang kami tinggalkan adalah seekah",
    "hadithNumber": "6233",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Maslamah dari Malik dari Ibnu Syihab dari Urwah dari Aisyah radliallahu 'anha, bahwasanya isteri-isteri Nabi shallallahu 'alaihi wasallam ketika Rasulullah Shallallahu'alaihiwasallam meninggal, mereka ingin mengutus Utsman untuk menemui Abu Bakar meminta warisan mereka, maka Aisyah mengatakan; Bukankah Rasulullah Shallallahu'alaihi wa sallam bersabda: \"Kami tidak diwarisi, dan semua yang kami tinggalkan adalah sedekah?.\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "158470",
    "last_updated": null
  },
  {
    "indonesianURN": "3062330",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3395",
    "babName": "Sabda nabi ShollAllahu 'alaihi wa Salam; siapa meninggalkan harta, maka bagi keluarganya",
    "hadithNumber": "6234",
    "hadithText": "Telah menceritakan kepada kami Abdan telah mengabarkan kepada kami Abdullah telah mengabarkan kepada kami Yunus dari Ibnu Syihab telah mengabarkan kepadaku Abu Salamah dari Abu Hurairah radliallahu 'anhu, dari Nabi shallallahu 'alaihi wasallam bersabda: \"Saya lebih utama menjamin orang-orang mukmin daripada diri mereka sendiri, maka barangsiapa meninggal sedang ia mempunyai hutang dan tidak meninggalkan harta untuk melunasinya, kewajiban kamilah untuk melunasinya, dan barangsiapa meninggalkan harta, maka itu bagi ahli warisnya.\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "158480",
    "last_updated": null
  },
  {
    "indonesianURN": "3062340",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3396",
    "babName": "Warisan anak dari ayah atau ibunya",
    "hadithNumber": "6235",
    "hadithText": "Telah menceritakan kepada kami Musa bin Isma'il telah menceritakan kepada kami Wuhaib telah menceritakan kepada kami Ibnu Thawus dari ayahnya dari Ibnu 'Abbas radliallahu 'anhuma, dari Nabi shallallahu 'alaihi wasallam bersabda: \"Berikanlah bagian fara`idh (warisan yang telah ditetapkan) kepada yang berhak, maka bagian yang tersisa bagi pewaris lelaki yang paling dekat (nasabnya).\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "158490",
    "last_updated": null
  },
  {
    "indonesianURN": "3062350",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3397",
    "babName": "Warisan anak perempuan",
    "hadithNumber": "6236",
    "hadithText": "Telah menceritakan kepada kami Al Humaidi telah menceritakan kepada kami Sufyan Telah menceritakan kepada kami Az Zuhri mengatakan; telah mengabarkan kepadaku Amir bin Sa'd bin Abi Waqqash dari ayahnya mengatakan; Aku pernah sakit parah di Makkah hingga rasanya berada di ujung kematian. Kemudian Rasulullah Shallallahu'alaihiwasallam menjengukku. Maka Saya bertanya; 'Wahai Rasulullah, saya mempunyai harta yang melimpah ruah, dan tak ada yang mewarisiku selain anak perempuanku bagimana kalau aku sedekahkan dua pertiganya? ' Nabi menjawab: \"jangan\". Saya bertanya lagi; 'Bagaimana kalau separoh? ' Nabi menjawab: \"jangan\". Saya tanyakan lagi; 'Bagaimana kalau sepertiganya? ' Nabi menjawab: \"Sepertiga itu banyak, Sesunguhnya jika engkau tinggalkan anakmu dalam keadaan berkecukupan, itu lebih baik bagimu daripada kamu tinggalkan mereka dengan kondisi papa sehingga meminta-minta kepada orang lain, dan sekali-kali tidaklah engkau memberi nafkah, melainkan kamu diberi pahala sampai berupa suapan yang engkau angkat kedalam mulut isterimu.\" Maka saya berkata; 'Wahai Rasulullah, apakah aku tetap tinggal (di Makkah dan meninggalkan) hijrahku? ' Nabi menjawab: \"Sekali-kali kamu tidak akan tertinggal setelahku kemudian kamu beramal shalih dengan mengharap wajah Allah kecuali akan menambah bagimu ketinggian dan derajat, Bisa jadi dengan kamu tetap tinggal (di Makkah) setelahku akan mendatangkan manfaat bagi suatu kaum dan mencelakakan yang lainnya.\" tetapi nasib tragis menimpa Sa'ad bin Khaulah yang menemui ajalnya di Makkah. Rasulullah Shalla Allahu 'alaihi wa sallam sempat memintakan rahmat dan ampunan untuknya. Sufyan mengatakan ' Sa'd bin Khaulah adalah laki-laki dari bani Amir bin Lu`ai.</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "10",
    "matchingArabicURN": "158500",
    "last_updated": null
  },
  {
    "indonesianURN": "3062360",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3397",
    "babName": "Warisan anak perempuan",
    "hadithNumber": "6237",
    "hadithText": "Telah menceritakan kepada kami Mahmud bin Ghailan telah menceritakan kepada kami Abu An Nadhr telah menceritakan kepada kami Abu Mu'awiyah Syaiban dari Asy'ats dari Al Aswad bin Yazid mengatakan; Muadz bin Jabal datang kepada kami di Yaman sebagai pengajar dan pemimpin, kemudian kami bertanya kepadanya mengenai seseorang yang wafat dan meninggalkan anak perempuan dan saudara perempuannya. maka dia memberi anak perempuannya separoh dan saudara perempuannya separoh.</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "158510",
    "last_updated": null
  },
  {
    "indonesianURN": "3062370",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3398",
    "babName": "Warisan cucu laki-laki jika tidak ada anak laki-laki",
    "hadithNumber": "6238",
    "hadithText": "Telah menceritakan kepada kami Muslim bin Ibrahim telah menceritakan kepada kami Wuhaib telah menceritakan kepada kami Ibnu Thawus dari ayahnya dari Ibnu 'Abbas mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berikanlah bagian fara`idh (warisan yang telah ditetapkan) kepada yang berhak, maka bagian yang tersisa bagi pewaris lelaki yang paling dekat (nasabnya).\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "158520",
    "last_updated": null
  },
  {
    "indonesianURN": "3062380",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3399",
    "babName": "Warisan cucu perempuan dari anak laki-laki sekligus ada anak perempuan",
    "hadithNumber": "6239",
    "hadithText": "Telah menceritakan kepada kami Adam telah menceritakan kepada kami Syu'bah telah menceritakan kepada kami Abu Qais aku mendengar Huzail bin Syurahbil mengatakan, Abu Musa pernah ditanya tentang anak perempuan, cucu perempuan dari anak laki-laki dan saudara perempuan, maka dia menjawaB; 'Anak perempuan mendapat separoh, saudara perempuan mendapat separoh, dan datanglah kepada Ibnu Mas'ud, niscaya dia akan sepakat denganku.' Ibnu mas'ud kemudian ditanya dan diberi kabar dengan ucapan Abu Musa, maka ia berujar; 'kalau begitu aku telah sesat dan tidak termasuk orang-orang yang mendapat petunjuk, saya akan memutuskan masalah itu dengan ketetapan yang diputuskan oleh Nabi shallallahu 'alaihi wasallam, anak perempuan mendapat separoh, cucu perempuan dari anak laki-laki mendapat seperenam sebagai pelengkap dari dua pertiga, dan sisanya bagi saudara perempuan.' Maka kami datang kepada Abu Musa dan kami mengabarkan kepadanya dengan ucapan Ibnu mas'ud, maka ia berkata; 'Janganlah kalian bertanya kepadaku selama orang alim ditengah-tengah kalian.'</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "158530",
    "last_updated": null
  },
  {
    "indonesianURN": "3062390",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3400",
    "babName": "Warisan kakek, sekaligus ada ayah dan saudara laki-laki",
    "hadithNumber": "6240",
    "hadithText": "Telah menceritakan kepada kami Sulaiman bin Harb telah menceritakan kepada kami Wuhaib dari Ibnu Thawus dari ayahnya dari Ibnu 'Abbas radliallahu 'anhuma, dari Nabi shallallahu 'alaihi wasallam bersabda: \"Berikanlah bagian fara`idh (warisan yang telah ditetapkan) kepada yang berhak, maka bagian yang tersisa bagi pewaris lelaki yang paling dekat (nasabnya).\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "14",
    "matchingArabicURN": "158540",
    "last_updated": null
  },
  {
    "indonesianURN": "3062400",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3400",
    "babName": "Warisan kakek, sekaligus ada ayah dan saudara laki-laki",
    "hadithNumber": "6241",
    "hadithText": "Telah menceritakan kepada kami Abu Ma'mar telah menceritakan kepada kami Abdul Warits telah menceritakan kepada kami Ayyub dari Ikrimah dari Ibnu 'Abbas mengatakan; yang disabdakan Rasulullah Shallallahu'alaihiwasallam ialah; \"kalaulah aku mengambil seseorang dari umat ini untuk menjadi kekasih niscaya aku mengambilnya, namun persaudaraan Islam lebih utama -atau beliau bersabda: - lebih baik, \" kemudian beliau menempatkannya sebagai ayah atau memutuskannya sebagai ayah.</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "15",
    "matchingArabicURN": "158550",
    "last_updated": null
  },
  {
    "indonesianURN": "3062410",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3401",
    "babName": "Warisan suami sekaligus ada anak  dan lainnya",
    "hadithNumber": "6242",
    "hadithText": "Telah menceritakan kepada kami Muhamad bin Yusuf dari Warqo' dari Ibnu Abi Najih ari 'Atho` dari Ibnu Abbas radliallahu 'anhuma mengatakan; 'dahulu harta untuk anak dan washiyat untuk kedua orang tua, kemudian Allah menghapus hal itu sekehendak-Nya, dan menjadikan bagi anak laki-laki seperti dua bagian anak perempuan, untuk kedua orangtua masing-masing seperenam, dan isteri seperdelapan dan seperempat, dan suami separoh dan seperempat.'</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "16",
    "matchingArabicURN": "158560",
    "last_updated": null
  },
  {
    "indonesianURN": "3062420",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3402",
    "babName": "Warisan isteri dan suami, sekaligus ada anak dan lainnya",
    "hadithNumber": "6243",
    "hadithText": "Telah menceritakan kepada kami Qutaibah telah menceritakan kepada kami Al Laits dari Ibnu Syihab dari Ibnul Musayyab dari Abu Hurairah bahwasanya ia mengatakan; Rasulullah Shallallahu'alaihiwasallam menetapkan tentang janin wanita dari Bani lahyan yang keguguran dengan ghurrah (pembayaran diyat dengan satu budak atau budak perempuan), kemudian wanita yang beliau putuskan membayar ghurrah meninggal, maka Rasulullah Shallallahu'alaihiwasallam memutuskan bahwa warisannya untuk anak laki-lakinya dan suaminya, sedang diyatnya bagi 'ashobahnya.</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "17",
    "matchingArabicURN": "158570",
    "last_updated": null
  },
  {
    "indonesianURN": "3062430",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3403",
    "babName": "Warisan saudara perempuan bersama anak  adalah ashabah",
    "hadithNumber": "6244",
    "hadithText": "Telah menceritakan kepada kami Bisyr bin Khalid telah menceritakan kepada kami Muhammad bin Ja'far dari Syu'bah dari Sulaiman dari Ibrahim dari Al Aswad mengatakan; ' Mu'adz bin Jabal memutuskan bagi kami dimasa Rasulullah Shallallahu'alaihiwasallam untuk anak perempuan mendapat separoh, saudara perempuan mendapat separoh, ' kemudian Sulaiman mengatakan; 'ia memutuskan ditengah-tengah kami' tanpa menyebut di masa Rasulullah Shallallahu'alaihiwasallam.</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "18",
    "matchingArabicURN": "158580",
    "last_updated": null
  },
  {
    "indonesianURN": "3062440",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3403",
    "babName": "Warisan saudara perempuan bersama anak  adalah ashabah",
    "hadithNumber": "6245",
    "hadithText": "Telah menceritakan kepada kami Amru bin 'Abbas telah menceritakan kepada kami Abdurrahman telah menceritakan kepada kami Sufyan dari Abu Qais dari Huzail mengatakan, Abdullah mengatakan; 'Sungguh aku putuskan perkara ini dengan keputusan Nabi shallallahu 'alaihi wasallam, ' atau ia mengatakan; Nabi shallallahu 'alaihi wasallam bersabda: \"anak perempuan mendapat separoh dan cucu perempuan dari anak laki-laki mendapat seperenam dan sisanya untuk saudara perempuan.\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "19",
    "matchingArabicURN": "158590",
    "last_updated": null
  },
  {
    "indonesianURN": "3062450",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3404",
    "babName": "Warisan saudara perempuan dan dan saudara laki-laki",
    "hadithNumber": "6246",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Utsman Telah mengabarkan kepada kami Abdullah Telah mengabarkan kepada kami Syu'bah dari Muhammad bin Al Munkadir mengatakan; aku mendengar Jabir radhiyallhu'anhu mengatakan; Nabi shallallahu 'alaihi wasallam mendatangiku ketika saya sedang sakit, kemudian beliau meminta diambilkan air dan berwudhu, kemudian beliau memerciki saya dengan bekas air wudhunya sehingga saya siuman, maka kutanyakan; 'Wahai Rasulullah, saya mempunyai beberapa saudara perempuan! ' maka turunlah ayat faraidh.</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "20",
    "matchingArabicURN": "158600",
    "last_updated": null
  },
  {
    "indonesianURN": "3062460",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3405",
    "babName": "Mereka meminta fatwa kepadamu tentang kalalah, katakanlah, Allah memfatwakan kepadamu tentang kalala",
    "hadithNumber": "6247",
    "hadithText": "Telah menceritakan kepada kami Ubaidullah bin Musa dari Israil dari Abu Ishaq dari Al Barra` radliallahu 'anhu mengatakan; 'akhir ayat yang diturunkan adalah penutupan surat An Naisa`; 'Mereka memintamu fatwa tentang kalalah, katakanlah bahwa Allah memfatwakan kepada kalian….(QS. Annisa' 176).</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "21",
    "matchingArabicURN": "158610",
    "last_updated": null
  },
  {
    "indonesianURN": "3062470",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3406",
    "babName": "Dua anak laki-laki paman, satunya saudara laki-laki seibu, dan lainnya suami",
    "hadithNumber": "6248",
    "hadithText": "Telah menceritakan kepada kami Mahmud telah mengabarkan kepada kami Ubaidullah dari Israil dari Abu Hushain dari Abu Shalih dari Abu Hurairah radliallahu 'anhu mengatakan; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Saya lebih berhak menanggung urusan orang-orang mukmin daripada mereka sendiri, maka siapa mati dan meninggalkanharta maka hartanya untuk ahliwarisnya yang ashabah, dan barangsiapa meninggalkan hutang atau anak yang terlantar, saya walinya, maka hendaknya memanggil saya untuk menanggung hutangnya dan anak-anaknya.\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "22",
    "matchingArabicURN": "158620",
    "last_updated": null
  },
  {
    "indonesianURN": "3062480",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3406",
    "babName": "Dua anak laki-laki paman, satunya saudara laki-laki seibu, dan lainnya suami",
    "hadithNumber": "6249",
    "hadithText": "Telah menceritakan kepada kami Umayyah bin Bistham telah menceritakan kepada kami Yazid bin Zurai' dari Rauh dari Abdullah bin Thawus dari ayahnya dari Ibnu 'Abbas dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Berikanlah bagian fara`idh (warisan yang telah ditetapkan) kepada yang berhak, maka bagian yang tersisa bagi pewaris lelaki yang paling dekat (nasabnya).\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "23",
    "matchingArabicURN": "158630",
    "last_updated": null
  },
  {
    "indonesianURN": "3062490",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3407",
    "babName": "Dzawil arham",
    "hadithNumber": "6250",
    "hadithText": "telah menceritakan kepadaku Ishaq bin Ibrahim mengatakan, aku berkata kepada Abu Usamah, telah menceritakan kepadamu Idris, telah menceritakan kepada kami Thalhah dari Sa'id bin Jubair dari Ibnu 'Abbas, mengenai ayat: \"WALIKULLIN JA'ALNAA MAWAALIYA (bagi tiap-tiap harta peninggalan dari harta yang ditinggalkan ibu bapak dan karib kerabat, Kami jadikan pewaris-pewarisnya\" (QS. ANnisa'; 33) \"WALLADZIINA 'AAQADAT AIMAANAKUM (Dan jika ada orang-orang yang kamu telah bersumpah setia dengan mereka, maka berilah kepada mereka bagiannya\" (QS. ANnisa; 33) dia berkata; 'Dahulu orang-orang muhajirin ketika datang ke Madinah, orang anshar mewarisi orang muhajirin yang bukan kerabatnya, dengan pertimbangan ukhuwah yang dibangun oleh Nabi shallallahu 'alaihi wasallam diantara mereka, maka tatkala turun ayat: \"WALIKULLIN JA'ALNAA MAWAALIYA (bagi tiap-tiap harta peninggalan dari harta yang ditinggalkan ibu bapak dan karib kerabat, Kami jadikan pewaris-pewarisnya\" (QS. Annisa'; 33), Allah menghapusnya dengan ayat: \"WALLADZIINA 'AAQADAT AIMAANAKUM (Dan jika ada orang-orang yang kamu telah bersumpah setia dengan mereka\" (QS. ANnisa; 33).</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "24",
    "matchingArabicURN": "158640",
    "last_updated": null
  },
  {
    "indonesianURN": "3062500",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3408",
    "babName": "Warisan anak lian",
    "hadithNumber": "6251",
    "hadithText": "Telah menceritakan kepadaku Yahya bin Qoza'ah telah menceritakan kepada kami Malik dari Nafi' dari Ibnu 'Umar radliallahu 'anhuma; ada seorang lelaki meli'an isterinya di zaman Rasulullah Shallallahu'alaihiwasallam dan tidak mengakui anaknya, maka Nabi Shallallahu'alaihiwasallam memisah keduanya dan memasrahkan anak kepada si wanita (ibu bayi).</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "25",
    "matchingArabicURN": "158650",
    "last_updated": null
  },
  {
    "indonesianURN": "3062510",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3409",
    "babName": "Anak adalah milik pemilik ranjang, merdeka atau hamba sahaya",
    "hadithNumber": "6252",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Yusuf Telah mengabarkan kepada kami Malik dari Ibnu Syihab dari Urwah dari Aisyah radliallahu 'anha mengatakan; 'Utbah berpesan kepada saudaranya Sa'd, bahwa 'putra dari hamba sahaya Zam'ah adalah dariku, maka ambilah dia.' Di hari penaklukan Makkah, Sa'd mengambilnya dengan mengatakan; 'Ini adalah putra saudaraku, ia berpesan kepadaku tentangnya.' Maka berdirilah Abd bin Zam'ah seraya mengatakan; '(dia) saudaraku, dan putra dari hamba sahaya ayahku, dilahirkan diatas ranjangnya.' Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Dia bagimu wahai Abd bin Zam'ah, anak bagi pemilik ranjang dan bagi pezinah adalah batu (rajam).\" Kemudian Nabi bersabda kepada Saudah binti Zam'ah: \"hendaklah engkau berhijab darinya, \" beliau melihat kemiripannya dengan 'Utbah, sehingga anak laki-laki itu tak pernah lagi melihat Saudah hingga ia meninggal.</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "26",
    "matchingArabicURN": "158660",
    "last_updated": null
  },
  {
    "indonesianURN": "3062520",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3409",
    "babName": "Anak adalah milik pemilik ranjang, merdeka atau hamba sahaya",
    "hadithNumber": "6253",
    "hadithText": "Telah menceritakan kepada kami Musaddad dari Yahya dari Syu'bah dari Muhamad bin Ziyad bahwasanya ia mendengar Abu Hurairah dari Nabi shallallahu 'alaihi wasallam bersabda: \"Anak adalah bagi pemilik ranjang.\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "27",
    "matchingArabicURN": "158670",
    "last_updated": null
  },
  {
    "indonesianURN": "3062530",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3410",
    "babName": "Wala\" bagi yang memerdekakan dan warisan anak temuan",
    "hadithNumber": "6254",
    "hadithText": "Telah menceritakan kepada kami Hafsh bin Umar telah menceritakan kepada kami Syu'bah dari Al Hakam dari Ibrahim dari Al Aswad dari Aisyah mengatakan; aku membeli Barirah, Nabi shallallahu 'alaihi wasallam bersabda: \"belilah ia, dan wala` milik orang yang memerdekakannya.\" kemudian Barirah diberi hadiah seekor kambing, dan Nabi bersabda: \"Kambing itu baginya sedekah dan bagi kita sebagai hadiah.\" Al Hakam mengatakan; 'Ketika itu suami Barirah orang merdeka.' Ucapan Al Hakam ini mursal, dan Ibnu Abbas mengatakan; 'setahu saya dia budak.'</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "28",
    "matchingArabicURN": "158680",
    "last_updated": null
  },
  {
    "indonesianURN": "3062540",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3410",
    "babName": "Wala\" bagi yang memerdekakan dan warisan anak temuan",
    "hadithNumber": "6255",
    "hadithText": "Telah menceritakan kepada kami Isma'il bin Abdullah mengatakan; telah menceritakan kepadaku Malik dari Nafi' dari Ibnu 'Umar dari Nabi shallallahu 'alaihi wasallam bersabda: \"Wala' menjadi milik orang yang memerdekakan.\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "29",
    "matchingArabicURN": "158690",
    "last_updated": null
  },
  {
    "indonesianURN": "3062550",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3411",
    "babName": "Warisan saibah",
    "hadithNumber": "6256",
    "hadithText": "Telah menceritakan kepada kami Qabishah bin 'Uqbah telah menceritakan kepada kami Sufyan dari Abu Qais dari Huzail dari Abdullah mengatakan; 'Pemeluk Islam tidak sepantasnya melakukan saibah, karena pemeluk jahiliyah melakukan saibah.'</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "30",
    "matchingArabicURN": "158700",
    "last_updated": null
  },
  {
    "indonesianURN": "3062560",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3411",
    "babName": "Warisan saibah",
    "hadithNumber": "6257",
    "hadithText": "Telah menceritakan kepada kami Musa telah menceritakan kepada kami Abu 'Awanah dari Manshur dari Ibrahim dari Al Aswad bahwasanya 'Aisyah radliallahu 'anha membeli Barirah untuk ia merdekakan, namun pemiliknya memberi syarat bahwa wala`nya tetap milik mereka. Maka Aisyah berkata; 'Wahai Rasulullah, saya ingin membeli Barirah untuk saya merdekakan, namun pemiliknya memberi syarat wala`nya tetap milik mereka! ' Maka Nabi bersabda: \"Merdekakanlah dia, sesungguhnya wala` milik orang yang memerdekakan!\" atau beliau bersabda dengan redaksi: \"bagi orang yang membayar harganya.\" Selanjutnya Aisyah membelinya dan memerdekakannya. Kata Aswad; 'Barirah disuruh memilih untuk tetap bersama suaminya atau bercerai, dan ia memilih merdeka dan berkata; 'Kalaulah aku diberi begini-begini, saya tidak ingin tetap bersamanya! ' Al Aswad mengatakan; 'suaminya merdeka.' Ucapan Al Aswad terputus, dan Ucapan Ibnu Abbas; 'menurut saya suaminya budak' adalah lebih sahih.</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "31",
    "matchingArabicURN": "158710",
    "last_updated": null
  },
  {
    "indonesianURN": "3062570",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3412",
    "babName": "Dosa seorang budak yang berlepas diri dari majikannya",
    "hadithNumber": "6258",
    "hadithText": "Telah menceritakan kepada kami Qutaibah bin Sa'id telah menceritakan kepada kami Jarir dari Al A'masy dari Ibrahim At Taimi dari ayahnya mengatakan, Ali radliallahu 'anhu menuturkan; 'Kami tidak mempunyai kitab yang kami baca kecuali kitabullah dan lembaran ini.' ayah At Taimi menerangkan; kemudian Ali mengeluarkannya, yang isinya adalah beberapa benda dari batuan dan gigi unta, yang tertulis: \"Kota Madinah adalah haram (suci), yakni daerah antara 'Air dan Tsaur. Maka barangsiapa yang berbuat kejahatan di dalamnya, atau berniat hendak melakukan kejahatan di dalamnya, niscaya laknat Allah, para Malaikat dan laknat seluruh manusia akan tertimpa kepadanya. Allah tidak akan menerima darinya pada hari kiamat amalan wajib atau pun amalan sunnahnya. Dan barangisapa yang berwali kepada tanpa izin walinya, maka laknat Allah, para Malaikat dan laknat seluruh manusia akan tertimpa kepadanya, tidak akan diterima darinya pada hari kiamat amalan wajib atau pun amalan sunnahnya. Dzimmah kaum muslimin adalah satu, yang mana dzimmah tersebut berlaku bagi orang yang paling rendah diantara mereka. Barangsiapa merusak janji seorang muslim, maka laknat Allah, para Malaikat dan laknat seluruh manusia akan tertimpa kepadanya, tidak akan diterima darinya pada hari kiamat amalan wajib atau pun amalan sunnahnya.</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "32",
    "matchingArabicURN": "158720",
    "last_updated": null
  },
  {
    "indonesianURN": "3062580",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3412",
    "babName": "Dosa seorang budak yang berlepas diri dari majikannya",
    "hadithNumber": "6259",
    "hadithText": "Telah menceritakan kepada kami Abu Nu'aim telah menceritakan kepada kami Sufyan dari Abdullah bin Dinar dari Ibnu Umar radliallahu 'anhuma mengatakan; Nabi shallallahu 'alaihi wasallam melarang jual beli wala` dan juga menghibahkannya.</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "33",
    "matchingArabicURN": "158730",
    "last_updated": null
  },
  {
    "indonesianURN": "3062590",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3413",
    "babName": "Jika seseorang masuk Islam melalui majikannya",
    "hadithNumber": "6260",
    "hadithText": "Telah menceritakan kepada kami Qutaibah bin Sa'id dari Malik dari Nafi' dari Ibnu Umar bahwasanya Aisyah ummul mukminin ingin membeli hamba sahaya untuk dimerdekakan, namun pemiliknya berkata; 'kami menjualnya kepadamu asalkan wala` tetap pada kami\", Maka Aisyah melaporkan kasus ini kepada Rasulullah Shallallahu'alaihi wa sallam dan beliau bersabda: \"Syarat seperti itu tidak menghalangimu, sebab wala' bagi orang yang memerdekakan.\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "34",
    "matchingArabicURN": "158740",
    "last_updated": null
  },
  {
    "indonesianURN": "3062600",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3413",
    "babName": "Jika seseorang masuk Islam melalui majikannya",
    "hadithNumber": "6261",
    "hadithText": "Telah menceritakan kepada kami Muhammad telah mengabarkan kepada kami Jarir dari Manshur dari Ibrahim dari Al Aswad dari Aisyah radliallahu 'anha mengatakan; 'Aku membeli Barirah namun pemiliknya memberi syarat wala`nya tetap dimiliki mereka. Maka hal ini kusampaikan kepada Nabi shallallahu 'alaihi wasallam dan beliau bersabda: \"Merdekakanlah ia, sebab wala` bagi yang menyerahkan perak.\" Kata Aisyah; lalu aku memerdekakannya, kemudian Rasulullah Shallallahu'alaihi wa sallam memanggilnya dan memberinya pilihan untuk tetap bersama suaminya (ataukah tidak). Maka Barirah menjawab: 'Kalaulah suamiku memberiku itu dan itu, aku tidak mau bermalam dengannya, ' dan ia memilih untuk berpisah. Kata Aswa; 'kondisi suaminya merdeka.'</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "35",
    "matchingArabicURN": "158750",
    "last_updated": null
  },
  {
    "indonesianURN": "3062610",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3414",
    "babName": "Wanita mewarisi wala\"",
    "hadithNumber": "6262",
    "hadithText": "Telah menceritakan kepada kami Hafsh bin Umar telah menceritakan kepada kami Hammam dari Nafi' dari Ibnu Umar radliallahu 'anhuma mengatakan; Aisyah ingin membeli Barirah, kemudian dia berkata kepada Nabi shallallahu 'alaihi wasallam; 'Mereka memberi syarat wala`nya tetap milik mereka'. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Belilah ia, hanyasanya wala' bagi yang memerdekakannya.\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "36",
    "matchingArabicURN": "158760",
    "last_updated": null
  },
  {
    "indonesianURN": "3062620",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3414",
    "babName": "Wanita mewarisi wala\"",
    "hadithNumber": "6263",
    "hadithText": "Telah menceritakan kepada kami Ibnu Salam telah mengabarkan kepada kami Waki' dari Sufyan dari Manshur dari Ibrahim dari Al Aswad dari Aisyah mengatakan, Rasulullah Shallallahu'alaihiwasallam bersabda: \"Wala` bagi yang menyerahkan perak (pembeli) dan menjamin kesenangan (mengurus hidupnya).\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "37",
    "matchingArabicURN": "158770",
    "last_updated": null
  },
  {
    "indonesianURN": "3062630",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3415",
    "babName": "Budak suatu kaum adalah bagian mereka, dan anak saudara perempuan kaum adalah bagian mereka",
    "hadithNumber": "6264",
    "hadithText": "Telah menceritakan kepada kami Adam telah menceritakan kepada kami Syu'bah telah menceritakan kepada kami Mu'awiyah bin Qurrah dan Qatadah dari Anas bin Malik radliallahu 'anhu, dari Nabi Shallallahu'alaihi wa sallam bersabda: \"Maula suatu kaum adalah bagian diri mereka.\" atau sebagaimana beliau sabdakan.</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "38",
    "matchingArabicURN": "158780",
    "last_updated": null
  },
  {
    "indonesianURN": "3062640",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3415",
    "babName": "Budak suatu kaum adalah bagian mereka, dan anak saudara perempuan kaum adalah bagian mereka",
    "hadithNumber": "6265",
    "hadithText": "Telah menceritakan kepada kami Abul Walid telah menceritakan kepada kami Syu'bah dari Qatadah dari Anas dari Nabi shallallahu 'alaihi wasallam bersabda: \"anak saudari suatu kaum adalah bagian mereka\" atau \"dari kalangan mereka.\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "39",
    "matchingArabicURN": "158790",
    "last_updated": null
  },
  {
    "indonesianURN": "3062650",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3416",
    "babName": "Warisan tawanan",
    "hadithNumber": "6266",
    "hadithText": "Telah menceritakan kepada kami Abul Walid telah menceritakan kepada kami Syu'bah dari 'Adi dari Abu Hazim dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam Shallallahu'alaihiwasallam bersabda: \"Barangsiapa meninggalkan harta, maka bagi ahli warisnya, dan barangsiapa meninggalkan tanggungan, maka kami yang menjaminnya.\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "40",
    "matchingArabicURN": "158800",
    "last_updated": null
  },
  {
    "indonesianURN": "3062660",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3417",
    "babName": "Muslim tidak mewarisi orang kafir, dan sebaliknya",
    "hadithNumber": "6267",
    "hadithText": "Telah menceritakan kepada kami Abu 'Ashim dari Ibnu Juraij dari Ibnu Syihab dari Ali bin Husain dari Amru bin Utsman dari Usamah bin Zaid radliallahu 'anhuma, Nabi shallallahu 'alaihi wasallam bersabda: \"Orang muslim tidak mewarisi orang kafir, dan orang Kafir tidak mewarisi orang muslim.\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "41",
    "matchingArabicURN": "158810",
    "last_updated": null
  },
  {
    "indonesianURN": "3062670",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3418",
    "babName": "Mengaku saudara dan anak saudara",
    "hadithNumber": "6268",
    "hadithText": "Telah menceritakan kepada kami Qutaibah bin Sa'id telah menceritakan kepada kami Al Laits dari Ibnu Syihab dari Urwah dari 'Aisyah radliallahu 'anha mengatakan; Sa'd bin Abu Waqqash bersengketa dengan Abd bin Zam'ah tentang anak laki-laki. Sa'd mengatakan; 'Ya Rasulullah, (dia adalah) anak saudaraku 'Utbah bin Abi Waqash, dia berpesan kepadaku bahwa dia adalah anaknya, lihatlah kemiripannya! ' Sedang 'Abd bin Zam'ah berkata; 'anak ini adalah saudaraku Wahai Rasulullah, ia dilahirkan di atas kasur ayahku dari hamba sahayanya! ' Rasulullah Shallallahu'alaihi wa sallam mencermati kemiripannya dan melihat kemiripan yang terang dengan 'Utbah, namun beliau kemudian bersabda: \"Anak laki-laki ini untukmu ya Abd bin Zam'ah, anak bagi pemilik ranjang dan bagi pezinah adalah batu, dan berhijablah engkau dari dia wahai Saudah binti Zam'ah.\" 'Aisyah berkata; maka anak laki-laki itu tak pernah melihat Saudah selama-lamanya.</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "42",
    "matchingArabicURN": "158820",
    "last_updated": null
  },
  {
    "indonesianURN": "3062680",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3419",
    "babName": "Menasabkan diri bukan kepada ayahnya",
    "hadithNumber": "6269",
    "hadithText": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Khalid yaitu Ibnu Abdullah, telah menceritakan kepada kami Khalid dari Abu Utsman dari Sa'd radliallahu 'anhu mengatakan, aku menengar Nabi Shallallahu'alaihiwasallam bersabda; \"Barangsiapa menasabkan diri kepada selain ayahnya padahal ia tahu bukan ayahnya maka surga haram baginya.\" Maka aku sampaikan hadits ini kepada Abu Bakrah dan ia berkata; 'Aku mendengarnya dengan kedua telingaku ini dan hatiku juga mencermati betul dari Rasulullah Shallallahu'alaihiwasallam.'</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "43",
    "matchingArabicURN": "158831",
    "last_updated": null
  },
  {
    "indonesianURN": "3062690",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3419",
    "babName": "Menasabkan diri bukan kepada ayahnya",
    "hadithNumber": "6270",
    "hadithText": "Telah menceritakan kepada kami Ashbagh bin Al Faraj telah menceritakan kepada kami Ibnu Wahb telah mengabarkan kepadaku Amru dari Ja'far bin Rabi'ah dari Irak dari Abu Hurairah radliallahu 'anhu, dari Nabi Shallallahu'alaihiwasallam bersabda; \"Janganlah kalian membenci ayah-ayah kalian, sebab siapa saja yang membenci ayahnya adalah kekufuran.\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "44",
    "matchingArabicURN": "158850",
    "last_updated": null
  },
  {
    "indonesianURN": "3062700",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3420",
    "babName": "Jika seorang wanita menganggap anak",
    "hadithNumber": "6271",
    "hadithText": "Telah menceritakan kepada kami Abul Yaman Telah mengabarkan kepada kami Syu'aib mengatakan; telah menceritakan kepada kami Abu Az Zanad dari Abdurrahman dari Abu Hurairah radliallahu 'anhu, bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dahulu ada dua wanita bersama kedua anaknya. Seekor serigala datang dan memangsa salah satu dari kedua anak tersebut. Wanita pertama mengatakan; 'Serigala itu memangsa anakmu'. Wanita kedua mengatakan; 'Justeru serigala itu memangsa anakmu, bukan anakku.' Kedua wanita itu terus mengadukan perkaranya kepada Dawud 'alaihissalam, dan Dawud memutuskan bahwa bayi yang masih adalah milik wanita yang tua. Kemudian keduanya menemui Sulaiman alaihissalam dan menceritakan kisahnya. Sulaiman mengatakan; 'beri aku pisau, bayi ini akan kubelah menjadi dua, satu untukmu dan satu untukmu! ' Wanita yang muda berkata; 'jangan kau lakukan, kiranya Allah merahmatimu, bayi ini miliknya.' Maka Sulaiman memberikan bayi itu kepada wanita yang muda.\" Abu Hurairah mengatakan; 'Demi Allah, saya tak pernah mendengar istilah pisau sama sekali selain hari itu, sebab istilah yang sering kami pakai adalah 'golok'.'</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "45",
    "matchingArabicURN": "158860",
    "last_updated": null
  },
  {
    "indonesianURN": "3062710",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3421",
    "babName": "Ahli silsilah keturunan",
    "hadithNumber": "6272",
    "hadithText": "Telah menceritakan kepada kami Qutaibah bin Sa'id telah menceritakan kepada kami Al Laits dari Ibnu Syihab dari 'Urwah dari Aisyah radliallahu 'anha mengatakan; Rasulullah Shallallahu'alaihiwasallam menemui kami dengan keceriaan wajahnya yang bersinar, lantas beliau bersabda: \"Tidakkah tadi engkau lihat, bahwa Mujazzaz memandang Zaid bin haritsah dan Usamah bin Zaid?\" beliau bersabda: \"Sesungguhnya telapak kaki-telapak kaki ini merupakan bagian satu dengan yang lainnya.\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "46",
    "matchingArabicURN": "158870",
    "last_updated": null
  },
  {
    "indonesianURN": "3062720",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3421",
    "babName": "Ahli silsilah keturunan",
    "hadithNumber": "6273",
    "hadithText": "Telah menceritakan kepada kami Qutaibah bin Sa'id telah menceritakan kepada kami Sufyan dari Az Zuhri dari Urwah dari Aisyah mengatakan; Rasulullah Shallallahu'alaihi wa sallam suatu hari menemui kami dengan ceria, lantas beliau berujar: \"Wahai Aisyah, tidakkah engkau lihat Mujazzaz Al Madlaji menemuiku lantas ia memandang Usamah bin Zaid dan Zaid yang sedang berselimut, tertutup kedua kepalanya, dan terlihat telapak kaki keduanya?\" Lantas beliau bersabda: \"sesungguhnya telapak kaki-telapak kaki merupakan bagian satu dengan yang lainnya.\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "47",
    "matchingArabicURN": "158880",
    "last_updated": null
  },
  {
    "indonesianURN": "3062291",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3394",
    "babName": "Sabda nabi ShollAllahu 'alaihi wa Salam; Kami tidak diwarisi, yang kami tinggalkan adalah seekah",
    "hadithNumber": "6230",
    "hadithText": "Telah menceritakan kepada kami Abdullah bin Muhammad telah menceritakan kepada kami Hisyam telah mengabarkan kepada kami Ma'mar dari Az Zuhri dari 'Urwah dari 'Aisyah bahwasanya Fathimah dan Abbas alaihimassalam mendatangi Abu Bakar untuk memperoleh warisan keduanya dari Rasulullah Shallallahu'alaihiwasallam, ketika itu keduanya meminta tanah bagiannya di Fadak, dan bagiannya di Khaibar. Maka Abu Bakar menjawab; 'Aku pernah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Kami tidak diwarisi dan semua yang kami tinggalkan adalah sedekah, dan hanyasanya keluarga Muhammad dari harta ini.\" Lanjut Abu Bakar; 'Demi Allah, tidaklah aku tinggalkan sebuah urusan yang kulihat Rsulullah Shallallahu'alaihiwasallam melaksanakannya, selain aku juga melaksanakan seperti yang dilaksanakannya.' Kata 'Urwah, semenjak itu Fathimah terus menjauhi Abu Bakar dan tidak pernah mengajaknya bicara hingga ia menjemput ajalnya.</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "158421",
    "last_updated": null
  },
  {
    "indonesianURN": "3062292",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "65",
    "bookName": "Fara`idl",
    "babNumber": "3394",
    "babName": "Sabda nabi ShollAllahu 'alaihi wa Salam; Kami tidak diwarisi, yang kami tinggalkan adalah seekah",
    "hadithNumber": "6230",
    "hadithText": "Telah menceritakan kepada kami Isma'il bin Abban telah menceritakan kepada kami Ibnul Mubarak dari Yunus dari Az Zuhri dari Urwah dari Aisyah bahwasanya Nabi shallallahu 'alaihi wasallam bersabda: \"kami tidak di warisi dan harta yang kami tinggalkan sebagai sedekah.\"</b>",
    "bookID": "65.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "158440",
    "last_updated": null
  }
]