[
  {
    "indonesianURN": "3064260",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "69",
    "bookName": "keterpaksaan",
    "babNumber": "3506",
    "babName": "QS. Annahl 106",
    "hadithNumber": "6427",
    "hadithText": "Telah menceritakan kepada kami Yahya bin Bukair telah menceritakan kepada kami Al Laits dari Khalid bin Yazid dari Sa'id bin Abi Hilal dari Hilal bin Usamah, bahwasanya Abu Salamah bin Abdurrahman mengabarkan kepadanya dari Abu Hurairah, bahwasanya Nabi shallallahu 'alaihi wasallam dalam shalatnya berdoa: \"Ya Allah, selamatkanlah 'Ayyasy bin Abi rabi'ah, Salamah bin Hisyam, Walid bin Al Walid, Ya Allah selamatkanlah orang-orang lemah dari kalangan orang-orang mukmin, ya Allah, kokohkanlah penyengsaraanmu terhadap Mudhar, dan kirimkanlah musim paceklik kepada mereka, sebagaimana paceklik yang menimpa Yusuf.\"</b>",
    "bookID": "69.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "1",
    "matchingArabicURN": "160570",
    "last_updated": null
  },
  {
    "indonesianURN": "3064270",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "69",
    "bookName": "keterpaksaan",
    "babNumber": "3507",
    "babName": "Memilih dipukuli, dibunuh dan untuk penghinaan kekufuran",
    "hadithNumber": "6428",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Abdullah bin Hausyab Ath Tha`ifi telah menceritakan kepada kami Abdul Wahhab telah menceritakan kepada kami Ayyub dari Abu Qilabah dari Anas radliallahu 'anhu mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada tiga hal yang jika seseorang melaksanakannya, ia mendapat kemanisan iman, Allah dan rasul-NYA lebih ia cintai daripada selain keduanya, ia mencintai seseorang dengan tiada dorongan selain karena Allah, dan benci kembali kepada kekafiran sebagaimana kebenciannya untuk dilempar ke neraka.\"</b>",
    "bookID": "69.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "2",
    "matchingArabicURN": "160580",
    "last_updated": null
  },
  {
    "indonesianURN": "3064280",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "69",
    "bookName": "keterpaksaan",
    "babNumber": "3507",
    "babName": "Memilih dipukuli, dibunuh dan untuk penghinaan kekufuran",
    "hadithNumber": "6429",
    "hadithText": "Telah menceritakan kepada kami Sa'id bin Sulaiman telah menceritakan kepada kami Abbad dari Isma'il aku mendengar Qais aku mendengar Sa'id bin Zaid mengatakan; aku pernah bermimpi bahwa Umar adalah peneguhku terhadap Islam, dan sekiranya gunung Uhud runtuh karena perlakuan kalian terhadap Utsman, niscaya gunung itu pun runtuh.'</b>",
    "bookID": "69.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "3",
    "matchingArabicURN": "160590",
    "last_updated": null
  },
  {
    "indonesianURN": "3064290",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "69",
    "bookName": "keterpaksaan",
    "babNumber": "3507",
    "babName": "Memilih dipukuli, dibunuh dan untuk penghinaan kekufuran",
    "hadithNumber": "6430",
    "hadithText": "Telah menceritakan kepada kami Musaddad telah menceritakan kepada kami Yahya dari Isma'il telah menceritakan kepada kami Qais dari Khabbab bin Al Arat mengatakan, kami pernah mengeluhkan penderitaan kepada Rasulullah Shallallahu'alaihiwasallam yang ketika itu beliau beralaskan kain panjangnya di naungan ka'bah. Maka kami mengadu; 'Tidakkah engkau meminta pertolongan untuk kami? Tidakkah engkau berdoa untuk kami? ' maka beliau bersabda; \"Sungguh sebelum kalian ada orang yang diringkus kemudian digalikan lubang baginya dan ia ditimbun disana, lantas didatangkan gergaji dan diletakkan di kepalanya, sehingga kepalanya terbelah menjadi dua, dan ada yang disisir dengan sisir besi sehingga memisahkan tulang dan dagingnya namun semua siksaan itu tidak memalingkannya dari agamanya, demi Allah, perkara ini akan sempurna sehingga seorang pengendara bisa berjalan dari Shan'a hingga Hadramaut, dan ia tidak khawatir selain kepada Allah dan srigala yang akan menerkam kambingnya, namun kalian ini orang yang suka tergesa-gesa.\"</b>",
    "bookID": "69.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "4",
    "matchingArabicURN": "160600",
    "last_updated": null
  },
  {
    "indonesianURN": "3064300",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "69",
    "bookName": "keterpaksaan",
    "babNumber": "3508",
    "babName": "Jual beli pemaksaan",
    "hadithNumber": "6431",
    "hadithText": "Telah menceritakan kepada kami Abdul Aziz bin Abdullah telah menceritakan kepada kami Al Laits dari Sa'id Al Maqburi dari ayahnya dari Abu Hurairah radliallahu 'anhu; ketika kami di masjid, tiba-tiba Rasulullah shallallahu 'alaihi wasallam menemui kami dan berujar: \"Ayo kita pergi ke kaum yahudi, \" maka kami berangkat bersama beliau, hingga kami tiba di Baitil Midras, Nabi shallallahu 'alaihi wasallam berdiri dan menyeru mereka; \"Wahai sekalian kaum yahudi, masuklah ke dalam Islam, maka kalian akan selamat.\" 'Telah engkau sampaikan wahai Abul Qasim' Sambut mereka.\"Itulah yang kuinginkan sebenarnya\" Kata Nabi. Nabi mengulang ajakannya dua kali dan mereka memberi jawaban sama; 'Telah engkau sampaikan wahai Abul qasim.' Nabi mengajak mereka untuk kali ketiga, dan berujar kepada mereka: \"Ketahuilah, bahwasanya bumi ini adalah milik Allah dan rasul-NYA, dan saya ingin mengusir kalian, maka siapa diantara kalian yang mendapatkan sesuatu dengan hartanya, juallah, kalaulah tidak, ketahuilah bumi hanyalah milik Allah dan rasul-NYA.\"</b>",
    "bookID": "69.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "5",
    "matchingArabicURN": "160610",
    "last_updated": null
  },
  {
    "indonesianURN": "3064310",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "69",
    "bookName": "keterpaksaan",
    "babNumber": "3509",
    "babName": "Dilarang nikah dnegan paksaan",
    "hadithNumber": "6432",
    "hadithText": "Telah menceritakan kepada kami Yahya bin Qaza'ah telah menceritakan kepada kami Malik dari 'Abdurrahman bin Al Qasim dari ayahnya dari 'Abdurrahman dan Mujamma', dua anak Yazid bin Jariyah Al Anshari, dari Khansa' binti Khidzam Al Anshariyah; bahwa ayahnya mengawinkannya -ketika itu ia janda-dengan lak-laki yang tidak disukainya, kemudian dia menemui Nabi shallallahu 'alaihi wasallam dan beliau membatalkan pernikahannya.</b>",
    "bookID": "69.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "6",
    "matchingArabicURN": "160620",
    "last_updated": null
  },
  {
    "indonesianURN": "3064320",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "69",
    "bookName": "keterpaksaan",
    "babNumber": "3509",
    "babName": "Dilarang nikah dnegan paksaan",
    "hadithNumber": "6433",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Yusuf telah menceritakan kepada kami Sufyan dari Ibnu Juraij dari Ibnu Abi Mulaikah dari Abu Amru alias Dzakwan, dari Aisyah radliallahu 'anhuma mengatakan, saya berkata; 'ya Rasulullah, apakah wanita dimintai izin pada kemaluan mereka? ' Nabi menjawab: \"iya.\" Saya bertanya; 'sungguh gadis merasa malu lantas ia memilih diam jika dimintai persetujuannya.' Nabi shallallahu 'alaihi wasallam menjawab; \"jika ia diam, itulah tanda persetujuannya.\"</b>",
    "bookID": "69.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "7",
    "matchingArabicURN": "160630",
    "last_updated": null
  },
  {
    "indonesianURN": "3064330",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "69",
    "bookName": "keterpaksaan",
    "babNumber": "3510",
    "babName": "Jika seseorang karena terpaksa lantas memberi budak atau menjualnya, maka sedemikian terlarang",
    "hadithNumber": "6434",
    "hadithText": "Telah menceritakan kepada kami Abu Nu'man telah menceritakan kepada kami Hammad bin Zaid dari Amru bin Dinar dari Jabir radliallahu 'anhu, ada seorang laki-laki anshar menjanjikan kemerdekaan budaknya (mudabbar) padahal ia tak punya harta selainnya. Berita ini sampai kepada Rasulullah shallallahu 'alaihi wasallam, maka beliau bertanya: \"Siapa mau membelinya dariku?\" Selanjutnya budak itu dibeli oleh Nu'aim bin Najjam seharga delapan ratus dirham. Kata Amru bin dinar, lalu kudengar Jabir mengatakan; 'budak qibthi yang meninggal di tahun pertama.'</b>",
    "bookID": "69.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "8",
    "matchingArabicURN": "160640",
    "last_updated": null
  },
  {
    "indonesianURN": "3064340",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "69",
    "bookName": "keterpaksaan",
    "babNumber": "3511",
    "babName": "Istilah Karhan atau kurhan maknanya sama, pemaksaan",
    "hadithNumber": "6435",
    "hadithText": "Telah menceritakan kepada kami Husain bin Manshur telah menceritakan kepada kami Asbath bin Muhammad telah menceritakan kepada kami Asy Syaibani Sulaiman bin fairuz dari Ikrimah dari Ibnu 'Abbas, Asy Syaibani mengatakan, dan telah menceritakan kepadaku 'Atho' Abul hasan As suwa`i dan setahuku dia tidak menyebutnya selain dari Ibnu 'Abbas radliallahu 'anhuma; 'Hai orang-orang yang beriman, tidak dihalalkan bagi kalian menguasai wanita secara paksa (QS.Annisa'; 19), dia berkata mengenai ayat ini; Dahulu jika seseorang meninggal, maka wali si laki-laki yang meninggal lah yang paling berhak terhadap isterinya, jika berkenan mereka kawini, atau mereka kawinkan dengan orang lain, atau mereka biarkan terkatung-katung, merekalah yang paling berhak terhadapnya daripada keluarga wanita itu sendiri, sehingga turunlah ayat ini yang menyelesaikan masalah itu.</b>",
    "bookID": "69.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "9",
    "matchingArabicURN": "160650",
    "last_updated": null
  },
  {
    "indonesianURN": "3064350",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "69",
    "bookName": "keterpaksaan",
    "babNumber": "3512",
    "babName": "Jika wanita dipaksa berzina, maka tak ada hukuman",
    "hadithNumber": "6436",
    "hadithText": "Telah menceritakan kepada kami Abul Yaman telah menceritakan kepada kami Syu'aib telah menceritakan kepada kami Abu Az Zanad dari Al A'raj dari Abu Hurairah mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ibrahim berhijrah bersama Sarah, kemudian mereka memasuki suatu desa yang dipimpin oleh seorang raja atau diktator. Raja mengutus seorang ajudan untuk menemui Ibrahim; 'Panggil Ibrahim untuk menghadapku bersama isterinya', lantas sang ajudan membawa isterinya kepada sang raja. Ketika raja berdiri menghadap Sarah, Sarah lantas berwudhu dan shalat dan memanjatkan doa; 'Ya Allah, jika aku beriman terhadap-Mu dan rasul-Mu, maka janganlah Engkau kuasakan seorang kafir kepada kami', ketika itu pula kaki sang raja terbenam ke dalam bumi hingga meronta-ronta dengan kakinya.\"</b>",
    "bookID": "69.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "11",
    "matchingArabicURN": "160670",
    "last_updated": null
  },
  {
    "indonesianURN": "3064360",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "69",
    "bookName": "keterpaksaan",
    "babNumber": "3513",
    "babName": "Seseorang bersumpah 'Ini saudaraku' padahal bohong, karena takut pembunuhan",
    "hadithNumber": "6437",
    "hadithText": "Telah menceritakan kepada kami Yahya bin Bukair telah menceritakan kepada kami Al Laits dari Uqail dari Ibnu Syihab, bahwa Salim mengabarinya, bahwasanya Abdullah bin Umar radliallahu 'anhuma mengabarinya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang muslim adalah saudara muslim lainnya, tidak menzhaliminya dan tidak menyerahkannya kepada musuh, barangsiapa yang memenuhi kebutuhan saudaranya, maka Allah akan memenuhi kebutuhannya.\"</b>",
    "bookID": "69.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "12",
    "matchingArabicURN": "160680",
    "last_updated": null
  },
  {
    "indonesianURN": "3064370",
    "collection": "bukhari",
    "volumeNumber": "1",
    "bookNumber": "69",
    "bookName": "keterpaksaan",
    "babNumber": "3513",
    "babName": "Seseorang bersumpah 'Ini saudaraku' padahal bohong, karena takut pembunuhan",
    "hadithNumber": "6438",
    "hadithText": "Telah menceritakan kepada kami Muhammad bin Abdurrahim telah menceritakan kepada kami Sa'id bin Sulaiman telah menceritakan kepada kami Husyaim Telah mengabarkan kepada kami Ubaidullah bin Abi Bakr bin Anas dari Anas radliallahu 'anhu mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"'Tolonglah saudaramu baik ia zhalim atau dizhalimi.\" Ada seorang laki-laki bertanya; 'ya Rasulullah, saya maklum jika ia dizhalimi, namun bagaimana saya menolong padahal ia zhalim? ' Nabi menjawab; \"engkau mencegahnya atau menahannya dari kezhaliman, itulah cara menolongnya.\"</b>",
    "bookID": "69.0",
    "grade": "",
    "comments": "",
    "ourHadithNumber": "13",
    "matchingArabicURN": "160690",
    "last_updated": null
  }
]